[
    {
        "title": "Apple can no longer force developers to use in-app purchasing, judge rules in Epic Games case",
        "score": 3008,
        "url": "https://www.reddit.com/r/investing/comments/plo6gd/apple_can_no_longer_force_developers_to_use_inapp/",
        "content": "https://www.cnbc.com/2021/09/10/epic-games-v-apple-judge-reaches-decision-.html\n\nKEY POINTS\n\nJudge Yvonne Gonzalez Rogers handed down a decision in a closely-watched trial between Apple and Epic Games on Friday.\n\nRogers issued an injunction that said that Apple will no longer be allowed to prohibit developers from providing links or other communications that direct users away from Apple in-app purchasing.\n\nRogers said that Apple was not a monopolist and “success is not illegal.”",
        "created_utc": 1631290451.0,
        "subreddit_name": "investing",
        "comments": 483
    },
    {
        "title": "Democrats Propose 2% Tax On Stock Buybacks To Offset Their $3.5 Trillion Budget Plan",
        "score": 3974,
        "url": "https://www.reddit.com/r/stocks/comments/plrvw1/democrats_propose_2_tax_on_stock_buybacks_to/",
        "content": "The proposal, called the Stock Buyback Accountability Act, would levy a 2% excise tax on the amount corporations spend to buy back their own stock—a common practice that returns funds to shareholders without generally requiring taxes. \n\nIn recent decades, cash-rich companies have used buybacks to reward stockholders and share-incented employees. Apple (ticker: APPL) spent over $400 billion on buybacks in the last 10 years, while Microsoft (MSFT) spent nearly $130 billion. Since 2017, annual spending on buybacks by companies in the S&P 500 index totaled $650 billion each year, on average, according to an Aug. 6 report by J.P. Morgan quant analyst Dubravko Lakos-Bujas. Some 20% to 30% of those buybacks were funded with debt—the rest with corporate cash.\n\nBrown and Wyden said the 2% excise tax would make corporations think twice about allocating capital to buybacks, instead of hiring or capital investment. Spending by the S&P 500 companies on buybacks rose 11% from this year’s March to June quarters, said J.P. Morgan’s Lakos-Bujas. Capital expenditures rose 6%. Spending on dividends slipped 3%.\n\nhttps://www.forbes.com/sites/jonathanponciano/2021/09/10/a-2-tax-on-stock-buybacks-is-being-proposed-by-democratic-senators-to-offset-their-35-trillion-budget-plan/?sh=289dd3c07270",
        "created_utc": 1631302120.0,
        "subreddit_name": "stocks",
        "comments": 802
    },
    {
        "title": "EPIC decision is OUT! Apple is not a monopolist, YGR finds, but it's anti-steering provisions are illegal.",
        "score": 4779,
        "url": "https://twitter.com/leah_nylen/status/1436347857188053004?s=20",
        "content": "",
        "created_utc": 1631287370.0,
        "subreddit_name": "apple",
        "comments": 1620
    }
]