[
    {
        "title": "Anybody else investing mostly in companies whose products/services they personally use and love?",
        "score": 67,
        "url": "https://www.reddit.com/r/investing/comments/1fsoqet/anybody_else_investing_mostly_in_companies_whose/",
        "content": "I think mainly Peter Lynch was the one who among other great advice suggested that people should invest in companies whose products/services you or your family and friends use and love. According to his books Lynch often found investment ideas in everyday life. He encouraged investors to observe the products and services they use and consider investing in the companies behind them. That seemed like a great advice to me 20 years ago when I started investing and I haven’t regretted it since. Here are the companies I invested in following this advice and still hold:\n\nApple, Amazon, Disney, Google, Meta, Microsoft, Netflix, Nike, Uber, Mastercard, Nintendo\n\nNow I’m thinking about Reddit lol. However, I’m not very excited about the prospects of it becoming profitable. Maybe a small position just to watch and see what happens in the future?\n\nHowever, would be really interesting to know if some of you have practiced this advice as well and how has this advice served you in the past and which companies have you invested in? Thanks!",
        "created_utc": 1727675985.0,
        "subreddit_name": "investing",
        "comments": 69
    },
    {
        "title": "Apple quietly deletes nearly a hundred VPNs that allowed Russians to get around censorship",
        "score": 5213,
        "url": "https://english.elpais.com/international/2024-09-30/apple-quietly-deletes-nearly-a-hundred-vpns-that-allowed-russians-to-get-around-censorship.html",
        "content": "",
        "created_utc": 1727697519.0,
        "subreddit_name": "technology",
        "comments": 251
    },
    {
        "title": "How to use iPhone Emergency SOS via satellite ",
        "score": 683,
        "url": "https://9to5mac.com/2024/09/30/use-iphone-emergency-sos-via-satellite/",
        "content": "",
        "created_utc": 1727716732.0,
        "subreddit_name": "apple",
        "comments": 72
    },
    {
        "title": "What to Expect From an Apple Event in October: iPad Mini 7, Redesigned Mac Mini, and More",
        "score": 616,
        "url": "https://www.macrumors.com/2024/09/27/apple-event-october-2024-preview/",
        "content": "",
        "created_utc": 1727659291.0,
        "subreddit_name": "apple",
        "comments": 133
    },
    {
        "title": "Today is my birthday and all I wanted was to have a good day in the market 😭.  First profitable month! 🥳",
        "score": 285,
        "url": "https://i.redd.it/66ffntexyyrd1.jpeg",
        "content": "This is Stonk Journal, it’s free. You enter your trades manually.\n\nThis is my 10th month trading. This is my first month making more than I lost!\n\nI trade spy 0DTE options and my risk is 5 with 1:4RR.\n\nStill trying to master my psychology, see ya guys next month with less loss! \n\n",
        "created_utc": 1727712039.0,
        "subreddit_name": "DayTrading",
        "comments": 43
    },
    {
        "title": "AAPL still good?",
        "score": 12,
        "url": "https://www.reddit.com/r/AAPL/comments/1fsuyoo/aapl_still_good/",
        "content": "Hi everyone, I’m a beginner and just starting to look into long-term investing. I’ve been thinking about investing in Apple (AAPL), but I’ve seen some news and opinions saying that Apple might be past its peak or that it’s \"done.\" However, I still feel like Apple could be a solid long-term investment.\n\nSo, I just want to hear some of AAPL watchers' opinions too :) Thanks",
        "created_utc": 1727701263.0,
        "subreddit_name": "AAPL",
        "comments": 43
    }
]