[
    {
        "title": "Why you shouldn’t use Robinhood",
        "score": 7432,
        "url": "https://www.reddit.com/r/stocks/comments/m7id8j/why_you_shouldnt_use_robinhood/",
        "content": "I’ve seen a ton of posts from newer investors on what brokerages to use, and I want to be clear on why you shouldn’t use RH:\n\nWho is their customer and what is their product?\n\nRH would say the customer is you, the retail investor... but don’t customers give money for services?  Oh, right, they make money from order flow... that means their real customer is Citadel.\n\nWhat does that make retail investors?  The product.  Just like FB and others, you are essentially the product that is being pawned around, except in this case, you have your own dollars at stake.\n\nIs this necessarily bad?  Depends.  But if you are not their customer, you are likely not getting the attention you deserve as an investor.  The sleek look and ease to use is just to make the product more lucrative for their actual clients.\n\nAlso, it’s a tech company, not a financial services company.  Not inherently a bad thing, but a company who’s core competency is software development, and not equities trading, I’d think twice.\n\nIRA?  Sorry.  I haven’t looked into why specifically, but it likely doesn’t generate the same money as a brokerage account.  If you were actually RH’s customer, why wouldn’t they offer you one of the best and most trusted retirement vehicles in this country?\n\nCustomer Service - never used it, but again, it’s a tech company... when have you ever got on the phone with google?\n\nLeadership - the congressional hearings were pathetic... what is core to leadership?  Seeking responsibility for your actions.  This ceo needs to hire someone else to be the point man, he isn’t ready for the big leagues.\n\nMany more points, but I’m getting angry just typing this.  Let’s keep brewing the hate.",
        "created_utc": 1616039228.0,
        "subreddit_name": "stocks",
        "comments": 1210
    },
    {
        "title": "Apple CEO Tim Cook 'can't wait' for employees to return to Apple Park",
        "score": 4264,
        "url": "https://appleinsider.com/articles/21/03/18/apple-ceo-tim-cook-cant-wait-for-employees-to-return-to-apple-park",
        "content": "",
        "created_utc": 1616096605.0,
        "subreddit_name": "apple",
        "comments": 591
    },
    {
        "title": "Bloomberg: Apple (AAPL) To Announce New iPads in April",
        "score": 23,
        "url": "https://www.bloomberg.com/news/articles/2021-03-17/apple-nears-launch-of-new-ipads-after-stay-at-home-sales-boost",
        "content": "",
        "created_utc": 1616028761.0,
        "subreddit_name": "AAPL",
        "comments": 8
    },
    {
        "title": "LOAD UP HERE",
        "score": 13,
        "url": "https://www.reddit.com/r/AAPL/comments/m7yvlw/load_up_here/",
        "content": "120.... this is a great price right here. Ignore the noise. Stimulus = Apple products & services \n\nIt’s free money with low risk down from here. Keep some aside if it hits the 118ish area.",
        "created_utc": 1616096245.0,
        "subreddit_name": "AAPL",
        "comments": 21
    },
    {
        "title": "Why does AAPL continue to underperform the major indexes?",
        "score": 10,
        "url": "https://www.reddit.com/r/AAPL/comments/m7u3hh/why_does_aapl_continue_to_underperform_the_major/",
        "content": "Just what the title asks. Is it a bearish sign (because AAPL is below average in the market), or a bullish sign (because AAPL is due for a recovery period in which it beats the market)?",
        "created_utc": 1616083463.0,
        "subreddit_name": "AAPL",
        "comments": 14
    }
]