[
    {
        "title": "r/Stocks Daily Discussion & Fundamentals Friday Nov 15, 2024",
        "score": 20,
        "url": "https://www.reddit.com/r/stocks/comments/1grtfyq/rstocks_daily_discussion_fundamentals_friday_nov/",
        "content": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.\n\nExpect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nBut growth stocks don't rely so much on EPS or revenue as long as they beat some other metric like subscriber count:  Going from 1 million to 10 million subscribers means more revenue in the future.\n\nValue stocks do rely on earnings reports, investors look for wall street expectations to be beaten on both EPS & revenue.  You'll also find value stocks pay dividends, but never invest in a company solely for its dividend.\n\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia page](https://www.investopedia.com/fundamental-analysis-4689757/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp) and read [their PDF on the topic.](http://i.investopedia.com/inv/pdf/tutorials/fundamentalanalysis_intro.pdf)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1731666609.0,
        "subreddit_name": "stocks",
        "comments": 453
    },
    {
        "title": "SOXX and Nvidia",
        "score": 14,
        "url": "https://www.reddit.com/r/stocks/comments/1grl78h/soxx_and_nvidia/",
        "content": "The semiconductor market has been taking a beating lately. Down 3% over 6 months and 9% this month even with the Trump rally. This used to be a really aggressive sector. What's going on? Have people completely lost faith in AI? What are we expecting with the big Nvidia earnings next week? Any hope semis will make a comeback in the near future?",
        "created_utc": 1731634945.0,
        "subreddit_name": "stocks",
        "comments": 40
    },
    {
        "title": "💊 $HIMS Stock - Can It Compete with Amazon's “Move” into Boner Pills? 💊",
        "score": 175,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1grqbx7/hims_stock_can_it_compete_with_amazons_move_into/",
        "content": "Overview:  \n$HIMS has been delivering impressive financial growth, even as Amazon attempts its way into the healthcare space with its One Medical acquisition. Amazon officially acquired One Medical on February 22, 2023, and in November 2023, it started offering discounted memberships to Amazon Prime customers. Despite Amazon, $HIMS has continued to thrive over the past year, showing resilience in the face of increased competition. The recent price dip presents a buying opportunity for investors.\n\n$HIMS has also raised its full-year 2024 revenue guidance to a range of $1.460 billion to $1.465 billion and its adjusted EBITDA guidance to between $173 million and $178 million.\n\nQuarterly Financial Highlights (YoY for Q3 2024):\n\n* Revenue: $401.56M (+77.13%)\n* Net Income: $75.59M (+1098.92%) – HIMS is profitable.\n* Diluted EPS: 0.32 (+900%) – Significant earnings growth.\n* Net Profit Margin: 18.82% (+663.47%) – Margin improvements show operational efficiency.\n* Operating Income: $22.37M (+361.56%)\n* Net Change in Cash: $36.22M (+588.11%)\n* Over 2 million customers (+44%) with increasing revenue per customer of $67 (+24%)\n\n[$Hims subscriber count increase and revenue increase](https://preview.redd.it/q4jyciaqf01e1.png?width=1208&format=png&auto=webp&s=a431a83bbdfd6a1db9330f643bbb2fdfb23accf7)\n\nAmazon - Why It Matters for $HIMS:\n\n1. Amazon’s Reach and Pricing Power: With Amazon now offering discounted One Medical memberships to Prime members, its reach and pricing power could potentially attract customers quickly, posing a challenge to $HIMS’s growth.\n2. Enhanced Services for Prime Members: Amazon’s ability to bundle healthcare with Prime adds convenience for its vast user base, appealing to those who value integrated services.\n3. Increased Competition: Amazon’s formal “entry” into telehealth means $HIMS and similar companies will need to differentiate themselves more strongly to retain market share.\n\nThe Bull Case for $HIMS Despite Amazon:\n\n* Strong Financial Growth: $HIMS has shown impressive year-over-year growth in both revenue and profitability, with a loyal customer base and solid fundamentals.\n* Niche Focus: HIMS focuses on personal health and wellness, including hair loss and sexual health treatments—areas that aren't the primary focus of One Medical. This specialization could help $HIMS create a loyal customer segment.\n* Early Mover Advantage: HIMS has a longer-standing presence in digital health and a well-established platform, giving it an edge in areas Amazon may not emphasize.\n* Privacy and Discretion: Many customers prefer a separate, private platform for personal wellness products. HIMS offers a level of discretion Amazon can’t match, which could be important for products like ED treatments. Also, Amazon’s ad-driven model might make some users uncomfortable if sensitive purchases are targeted by advertisers.\n\nRisks:\n\n* Amazon’s Potential to Undercut Prices: Amazon’s pricing power and ability to offer discounts through Prime could put pressure on $HIMS to stay competitive on price.\n* Brand Loyalty Shift: Amazon’s backing of One Medical and integration with Prime could entice some of $HIMS's customers to switch, especially those already invested in the Amazon ecosystem.\n\nTL;DR:  \n$HIMS is on a strong growth path, with impressive financials and a niche focus in the wellness and telehealth market. Amazon's acquisition of One Medical over a year ago and recent push into the space does increase competition, but $HIMS has proven resilient over the past year against Amazon and continues to improve its metrics. With a clear strategy and focus on privacy and niche offerings, $HIMS may have the staying power to thrive alongside Amazon's “release” into the space. The recent price drop could be an opportunity to buy.\n\nPositions:\n\n1500 shares & 10 calls @$20 1/16/26\n\nThis is my first DD, plz be gentle with this regard",
        "created_utc": 1731652555.0,
        "subreddit_name": "wallstreetbets",
        "comments": 87
    },
    {
        "title": "RDDT - Just getting started",
        "score": 96,
        "url": "https://i.redd.it/l59b7byp451e1.jpeg",
        "content": "RDDT - 10k shares yolo\n\nThesis:\n\nPros:\n-DAU growth surging. Google realizes their search sucks and is sending droves of people to Reddit. \n\n-Ad revenue growing strongly. They are finally figuring out how to monetize the site after 2 decades.\n\n-Subreddits have very specific niches and are pure gold to advertisers. Want to advertise to NJ moms that enjoy eating grilled lobsters while wearing fluorescent green thongs? There’s probably a subreddit with 20,000 members floating around.\n\n-Licensing reams of data to LLM/AI companies. This can be thought of a very high margin annuity as data can go stale and needs to keep pouring in.\n\n-AI is efficiently translating all the English content to other languages, which will cause an explosion of growth internationally.  \n\n-Low hosting and operating costs as mainly text-based. \n\n-User generated content means not spending billions on creating content like $nflx.\n\n-CFO is solid and actually gives a shit about GAAP numbers and not adjusted EBIDTA BS.\n\n-SBC is something they don’t want to go bonkers on like SNAP. They are very cognizant of dilution. \n\n-Probably the best place online for brands to connect with customers and to also gauges brand temperature. Very authentic human interactions and discussions due to the huge amount of users and the downvoting system which gets rid of bot replies and pushes good content to the top. \n\n-Massive moat / barrier to entry. How can it be replicated? Would be extremely difficult and costly.\n\n-Can really start to get a piece of the global advertising pie if they can fix their search function.\n\nCons\n-Google can stop promoting Reddit in search results, which would limit user growth.\n\n-Users that come in from Google aren’t logged in, thus generate less revenue from ads.\n\n-Once they capture the low hanging fruit from running relevant ads, what is the growth strategy that gets them to a much higher valuation ($100 billion+)?\n",
        "created_utc": 1731709261.0,
        "subreddit_name": "wallstreetbets",
        "comments": 99
    },
    {
        "title": "US Uranium miners",
        "score": 42,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gryxdj/us_uranium_miners/",
        "content": "Bull thesis for uranium miners\n\nAI datacenters need a fuck ton of energy. Microsoft, amazon, google and lots of other companies are making deals for for the construction of small modular reactors that provide 15-100mw of power for datacenters. Microsoft if even restarting a whole nuclear power plant. Also orange coin needs a fuck ton of energy.\n\nRussia just banned uranium exports to the US. Countries will be scrambling for new suppliers, and US miners can jump in to fill this gap. Tarifs could boost domestic uranium suppliers. Orange man loves nuclear.",
        "created_utc": 1731684675.0,
        "subreddit_name": "wallstreetbets",
        "comments": 35
    },
    {
        "title": "Artificial intelligence boom continues to drive Wall Street as well as the semiconductor industry, with NVIDIA set to report Q3 earnings nex",
        "score": 34,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gs4jfs/artificial_intelligence_boom_continues_to_drive/",
        "content": "Nvidia ( NVDA ) will report its third-quarter earnings after the close of trading next Wednesday, providing Wall Street with the latest and best look at the strength of artificial intelligence trading.\n\n\n\nNvidia is the world's largest publicly traded company by market capitalisation, and its shares continue to soar through 2024 thanks to the explosive growth of artificial intelligence in tech and beyond. As of Friday, Nvidia shares were up 189% year to date, easily outpacing any of the company's chip rivals. shares of Nvidia's closest competitor, AMD, are down nearly 8% year to date, while shares of Intel, which is facing a tough turnaround, have plunged 51%\n\n\n\n[https://finance.yahoo.com/news/nvidia-to-report-q3-earnings-wednesday-as-ai-fever-continues-to-power-wall-street-185800624.html](https://finance.yahoo.com/news/nvidia-to-report-q3-earnings-wednesday-as-ai-fever-continues-to-power-wall-street-185800624.html)",
        "created_utc": 1731698980.0,
        "subreddit_name": "wallstreetbets",
        "comments": 38
    },
    {
        "title": "Biotricity Achieves Improved Margins and Efficiencies, and Year-Over-Year Sales Growth for Second Quarter of Fiscal Year 2025",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gs2p22/biotricity_achieves_improved_margins_and/",
        "content": "Biotricity's BTCY  provides products to cardiologists and electrophysiologists on heartbeat monitoring. Recently they announced expanding into AI technology for remote patient care.\n\n**Q2-FY25 Financial Highlights**\n\n* Revenue increased by 13% YOY to $3.3 million in Q2 FY25\n* Gross profit percentage was 75.3% for the three months ended September 30, 2024, as compared to 69% in the corresponding prior year quarter. This increase in gross margin was primarily attributed to improved margins on technology fees and gained efficiencies in using AI in data processing. Going forward the Company anticipates continued strong performance in overall blended gross margins.\n* Net loss decreased 57% YOY to $1.65 million, or $0.073 per share, from a net loss $3.88 million, or $0.446 per share, in Q2-FY24\n\n[Biotricity Achieves Improved Margins and Efficiencies, and Year-Over-Year Sales Growth for Second Quarter of Fiscal Year 2025](https://finance.yahoo.com/news/biotricity-achieves-improved-margins-efficiencies-131500366.html)",
        "created_utc": 1731694264.0,
        "subreddit_name": "investing",
        "comments": 0
    },
    {
        "title": "Has anyone used something like NotebookLM to analyze companies?",
        "score": 1,
        "url": "https://www.reddit.com/r/investing/comments/1grmu7m/has_anyone_used_something_like_notebooklm_to/",
        "content": "I used to be in research and can’t help but think this would make the job almost effortless. Feed it the backlog of your research groups publications, add all press releases for your coverage universe, add new PR’s as they release and your latest estimates then ask Notebook to write three pages based on the newest information.\n\nOr ask it for value recommendations based on financial records and live trading data.\n\nSo research/traders/buyside, anybody outsourced your jobs to AI yet? Whats your experience been like ?",
        "created_utc": 1731640083.0,
        "subreddit_name": "investing",
        "comments": 3
    },
    {
        "title": "Amazon Accelerates Q3 Growth with AWS and Holiday Sales Potential",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gs0l03/amazon_accelerates_q3_growth_with_aws_and_holiday/",
        "content": "# Summary\n\n* **Buy Recommendation:** Amazon's strong growth, AWS dominance, and robust holiday outlook make it attractive.\n* **AWS Key Driver:** AWS contributes 60% of Amazon’s Q3 2024 operating income, insulating it from e-commerce volatility.\n* **Profit Impact:** AWS’s high margins boost Amazon’s overall profitability and market value.\n* **Earnings Beat:** Q3 exceeded Wall Street estimates, boosting investor confidence.\n* Retail Growth: North American and international eCommerce sales rose, improving margins and profitability.\n* **Q4 Outlook:** The holiday season and AWS are expected to drive strong revenue growth.\n* Inflation Benefit: Falling inflation boosts consumer spending power, aiding Amazon’s revenue.\n* **Long-Term Expansion:** AWS, Prime, and global reach position Amazon for sustained growth.\n\n# Introduction: Setting the Stage\n\nAmazon’s growth trajectory is very strong, driven by its diversified business model, innovations, and a focus on long-term growth. The company’s performance in recent quarters shows its resilience even with challenges. An important factor in all of this is Amazon’s success in Amazon Web Services (AWS). In Q3 2024, AWS generated $10 billion in operating income, which is 60% of Amazon’s total operating income. This shows the role that AWS plays in Amazon’s growth and financial success, strengthening the company’s valuation and protecting it from the general volatility in e-commerce. AWS’s high-margin business model has allowed Amazon to expand profit while also maintaining growth, further making the company a dominant player in cloud computing. AWS continues to outperform expectations as Amazon’s e-commerce is steadily growing. The company’s outlook remains strong, providing confidence in its growth potential.\n\n**AWS Segment Overview and Profit Growth**\n\nAWS has significantly impacted Amazon’s growth and valuation by transforming the company’s business model and driving profitability beyond its core e-commerce operations. As Amazon’s cloud computing arm, AWS has consistently contributed a major share of Amazon’s operating income, thanks to its high margins relative to the low-margin retail business. In 2023, AWS generated over $80 billion in revenue, representing about 16%-18% of Amazon's total revenue and underscoring its role as a key financial driver. This reliable revenue stream not only offsets the volatile nature of retail but has also contributed to Amazon’s robust valuation by positioning it as a dominant player in the rapidly expanding cloud computing market. AWS’s growth is further supported by strategic partnerships with major clients like T-Mobile, Toyota, and Epic Games, which highlight its adaptability across industries—from enhancing 5G infrastructure and automotive technologies to providing advanced computing for game development. These contracts not only bolster AWS’s revenue but also reinforce Amazon’s brand as a tech innovator, driving investor confidence and contributing to Amazon’s overall market value. AWS has become a major factor in Amazon's financial success, having a huge impact on the company’s profits. In Q3 2024, for instance, AWS generated $10.4 billion in operating income—a 50% increase from the previous year. AWS makes up 60% of the company’s total operating income and has an operating margin of 38%. These statistics show how AWS operates and uses its large scale to keep costs low. \n\n**Q3 Earnings Results and Beating Estimates**\n\nAmazon’s retail division experienced notable growth in Q3, with North American sales rising 9% year-over-year (YoY) to $95.5 billion and international sales increasing 12% YoY to $35.9 billion, outperforming the previous quarter’s growth rates of 9% and 7%, respectively. This growth reflects sustained consumer demand, particularly in Prime subscriptions and eCommerce, alongside a steady increase in third-party marketplace sales. In North America, 2023 revenue grew by 7.9% YoY, from $315 billion in 2022 to $340 billion, with operating profit rising 22.2% from $18 billion to $22 billion, driven by enhanced logistics networks, higher cost-efficiency, and high-margin services like Prime. Operating margins in North America improved significantly, reaching 5.9%, showcasing Amazon’s ability to leverage its infrastructure for increased profitability. Meanwhile, international sales grew more moderately by 5.0% YoY, from $140 billion in 2022 to $147 billion in 2023, as economic conditions and logistics costs across diverse markets tempered growth. While international operating profit rose slightly from $5 billion to $5.2 billion, margins remained constrained by global expansion costs and currency fluctuations, though they turned positive in Q3, reaching 3.6%, up from a negative 0.3% last year. Amazon’s logistics optimization, such as regional fulfillment centers, has played a key role in reducing shipping costs and enhancing delivery speed, benefiting profitability in both segments. To address slower international profit growth, Amazon may need to focus on automation, cost-effective delivery, and leveraging AWS to strengthen its margins further.\n\n**Forecast for Q4 and Beyond**\n\nAmazon is poised for strong Q4 growth, driven by robust consumer spending and increased holiday season sales. Net sales are expected to grow significantly, with projections ranging from $181.5 billion to $188.5 billion, marking a 7% to 11% increase over the previous year. This reflects the company’s ability to leverage seasonal demand and capitalize on strategic promotions, including discounts and exclusive deals. Compared to two years ago, when net sales stood at $149.2 billion, this quarter’s projected performance highlights a substantial growth trajectory, supported by the ongoing expansion of e-commerce and enhanced logistics capabilities. Additionally, operating income is anticipated to rise in tandem with sales, underscoring the profitability of holiday-driven demand. In the last quarter of the 2024 year, Amazon’s performance, specifically its growth, will likely be due to its top-performing areas, AWS and Amazon Prime. AWS provides large amounts of profit from its cloud computing technology, services that are only expected to improve Amazon’s standing as many companies are beginning to utilize it as they expand into more modern cloud services. Additionally, Prime’s investments in more warehouses and improved delivery systems, both contributing to faster product delivery, directly contributes to the projected growth of Amazon as a whole. Adaptations to Prime’s entertainment and streaming content have begun to be based on regional preferences, increasing subscriptions and therefore company revenue. In the long term, Amazon’s growth internationally will be a big factor in its overall success. By expanding Prime benefits in regions like Asia, Latin America, and Europe, Amazon is adjusting its services to fit local needs, including faster delivery, special shopping events, and more region-specific streaming content. While there are some challenges, like high delivery costs and currency changes, Amazon’s focus on building efficient delivery systems and offering local content for Prime members is setting it up to win over more customers globally. These efforts should help Amazon grow steadily and strengthen its presence worldwide in the years to come.\n\n**Impact of Falling Inflation on Amazon**\n\nAs inflation rates continue to fall, Amazon stands to benefit from increased consumer spending power, especially in discretionary categories such as electronics and household goods. Lower inflation means that consumers’ purchasing power is less eroded by price increases, encouraging more frequent and larger purchases. This shift can translate into stronger revenue growth for Amazon, particularly as the holiday season approaches, when spending naturally spikes. The added spending capacity from a lower inflation environment could help Amazon meet or exceed its Q4 projections and reinforce its market position. The Consumer Price Index (CPI) slowed to 3.7% in September 2024, down from 9.1% in 2022, while the Personal Consumption Expenditures (PCE) Price Index also eased to 3.5% in August. This has led to increased consumer spending, with personal consumption expenditures growing 3.2% annually in Q2 2024. Retail sales rose 4.4% in August, driven by demand for higher-ticket items. With more disposable income, consumers are likely to spend more on non-essential goods, positioning Amazon to benefit from this shift, particularly as the holiday season approaches.\n\n**Seasonal Boost from Holiday Sales**\n\nAmazon’s season of growth and income is during late Q4 or the holiday season in lay man’s terms. In the United States, retail business generally sees an incredible boost, due to the consumerist culture of holiday season in America. Amazon and other stores like Ebay, Best Buy, and more have embraced this by giving out solid deals on common items gifted during the holidays. Electronics, toys, and clothing are the most common discounted items during this season, with that making up the majority of items on sale during this period. American retailers have caught up to this, creating masterful promotions informing consumers about the deals on popular products going on during the holidays. Amazon is one of the leaders in this section, with the festive decor lining the site, to the well-placed advertisements, to even the special packaging. The most important day of this part of Q4, is Black Friday. Black Friday, for those who don’t know, is a holiday in America which is on the day after Thanksgiving. Black Friday is seen as a holiday at the shops, where numerous stores will bring heavy discounts on a large variety of items. Black Friday is important to consumers, due to its prime location near the beginning on the chaotic run to Christmas and other early winter holidays. Amazon has mostly focused on Cyber Monday, a day on the Monday after thanksgiving week oriented to online shopping, but as the in-store culture of Black Friday goes down Amazon has been promoting Black Friday more heavily. This is a critical time for the Washington State based company as Black Friday only flourishes when the economy is booming, and with many Americans having issues monetarily companies will need to bring out more lucrative offers and advertising to win over customers. Last year, Amazon was able to bring in almost $10 Billion from Black Friday alone, making investors very cheerful during the holiday season. This year, if Amazon is able to recreate it’s smart advertising based in holiday cheer, solid deals, and build hype, they will easily move past the challenges being faced by American citizens.\n\n**Conclusion**\n\n# Amazon's projected temple of growth and profitability domonstrates that the company is armed with strategies that will enable it come out bigger and better in the end. E-commerce growth strengthened by logistics, together with personalization of shopping, cuts into the consumer's loyalty and market share. It is also noted that Amazon Web Services (AWS) is a profit center all its own due to its very high margins and strong market demands for cloud services.The article continues with the growth of Amazon's ad business, collecting targeted consumer data at low cost, as other income streams eg: Prime subscriptions and services for third-party sellers. All these bring about large amounts of cash and help retain customers. Global expansion to those lesser-explored geographical markets would eventually provide Amazon an opportunity for long-term growth by entering customers neeing U.S. and European saturation. Sustainability initiatives will resonate with the consumers' eco-responsible inclinations, which will help build brand loyalty and reduce costs over time.Not the least of which, innovation is part of the great Amazon EQ; investments made on innovation are always on AI, automation, and some machine learning processes to enable efficiency and open the door for other opportunities while fortifying the competition.\n\n  \n\n\n**TLDR**: Amazon is known for being an outstanding leader in e-commerce, and cloud computing which has been displayed through its recent profit growth and Q3 earnings. With these factors, Amazon is positioned to continue its growth in Q4 as it leverages holiday sales and AWS offerings making it a good buying opportunity.",
        "created_utc": 1731688968.0,
        "subreddit_name": "investing",
        "comments": 3
    },
    {
        "title": "Naive question: Intel 18A--what could go wrong?",
        "score": 10,
        "url": "https://www.reddit.com/r/stocks/comments/1grrx4w/naive_question_intel_18awhat_could_go_wrong/",
        "content": "\\[Disclosure: not invested in Intel yet but thinking about doing so\\]\n\nOk, we know Intel messed up and whatever but what I do not get (so please challenge my train of thoughts):\n\n* Intel got newest machines from ASML last year\n* They use them for 18A\n* Like TSMC does for AMD, Apple, etc.\n* Lunar Lake is a combo of Intel's design skills and TSMC's/ASML's fab skills\n* But with low margins because of latter\n* However, Lunar Lake turned out pretty good, so Intel's design skills are def there\n* And with 18A, Intel will have everything in-house\n\nSo, what could go wrong? Maybe Intel need quite some time to catch up and have the same fab capacity based on ASML machines but we will get there at some point.\n\nThe competition? AMD will have (long-term!) lower margins b/c of TSMC (also slower time-to-market, lower quantities), Qualcomm has lower compat and needs still to resort issues with ARM, Nvidia while capable will need some time and will have a good offer but they won't have a fab either and will face compat issues like Qualcomm. Not saying that these are dealbreakers but yeah...\n\nWhat does speak against Intel: org is too messed to get it ever restructured and/or reorg too expensive, running out of money (but gov money), time, building fabs needs years, zero EUV experience, low yields for years\n\nEdit: Intel has a lower market cap than AMD despite AMD just having design in-house, they have more assets in the GPU department but it is insignificant compared to something like Nvidia and if we talk about IGPUs Intel seem to be on par\n\nEdit2: Would at least a new CEO just give us a bump, so we could leave again with some short-term gains?\n\nEdit3: typos\n\nSo, is buying Intel really a risk with its dirt-cheap pricing right now? Is it really \"dirt-cheap\"?",
        "created_utc": 1731659549.0,
        "subreddit_name": "stocks",
        "comments": 47
    },
    {
        "title": "New Apple security feature reboots iPhones after 3 days, researchers confirm ",
        "score": 3321,
        "url": "https://techcrunch.com/2024/11/14/new-apple-security-feature-reboots-iphones-after-3-days-researchers-confirm/",
        "content": "",
        "created_utc": 1731634204.0,
        "subreddit_name": "apple",
        "comments": 311
    },
    {
        "title": "Apple quietly gave the M4 MacBook Pro a quantum dot display",
        "score": 2259,
        "url": "https://9to5mac.com/2024/11/15/apple-quietly-gave-the-m4-macbook-pro-a-quantum-dot-display/",
        "content": "",
        "created_utc": 1731699128.0,
        "subreddit_name": "apple",
        "comments": 229
    },
    {
        "title": "Apple Smells Blood in the Water",
        "score": 963,
        "url": "https://petapixel.com/2024/11/14/apple-smells-blood-in-the-water/",
        "content": "",
        "created_utc": 1731628859.0,
        "subreddit_name": "apple",
        "comments": 307
    },
    {
        "title": "Apple Adds iPhone XS Max and More to Vintage/Obsolete Product Lists",
        "score": 480,
        "url": "https://www.macrumors.com/2024/11/15/apple-adds-two-iphone-models-to-vintage-list/",
        "content": "",
        "created_utc": 1731689876.0,
        "subreddit_name": "apple",
        "comments": 43
    },
    {
        "title": "[MobileTechReview] M4 Pro 14\" MacBook Pro Review",
        "score": 214,
        "url": "https://youtu.be/-zxJBLNEj7w?si=RM9mHsY2kEZ6r_p2",
        "content": "",
        "created_utc": 1731646436.0,
        "subreddit_name": "apple",
        "comments": 60
    },
    {
        "title": "Apple Removes Another RFE/RL App At Request Of Russian Regulator",
        "score": 206,
        "url": "https://www.rferl.org/a/apple-removes-podcasts-independent-russia-rferl-radio-free-europe/33203321.html",
        "content": "",
        "created_utc": 1731696576.0,
        "subreddit_name": "apple",
        "comments": 47
    },
    {
        "title": "Apple’s fiscal 2024 in charts",
        "score": 173,
        "url": "https://sixcolors.com/post/2024/11/apples-fiscal-2024-in-charts/",
        "content": "",
        "created_utc": 1731629128.0,
        "subreddit_name": "apple",
        "comments": 25
    },
    {
        "title": "Apple Vision Pro Launches in Two More Countries",
        "score": 149,
        "url": "https://www.macrumors.com/2024/11/15/vision-pro-launches-in-two-more-countries/",
        "content": "",
        "created_utc": 1731659399.0,
        "subreddit_name": "apple",
        "comments": 30
    },
    {
        "title": "Apple Faces Epic Games-Style China Lawsuit Over App Store Practices",
        "score": 139,
        "url": "https://www.macrumors.com/2024/11/12/apple-china-lawsuit-antitrust-app-store/",
        "content": "",
        "created_utc": 1731660501.0,
        "subreddit_name": "apple",
        "comments": 35
    },
    {
        "title": "Apple Intelligence is for the Stupid Ones",
        "score": 22,
        "url": "https://www.youtube.com/watch?v=D0V554NyXWM",
        "content": "",
        "created_utc": 1731689085.0,
        "subreddit_name": "apple",
        "comments": 35
    },
    {
        "title": "Daily Advice Thread - November 15, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/apple/comments/1grtv18/daily_advice_thread_november_15_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1731668432.0,
        "subreddit_name": "apple",
        "comments": 69
    },
    {
        "title": "Russian government forces Apple to remove more independent news apps",
        "score": 200,
        "url": "https://9to5mac.com/2024/11/15/app-store-russia/",
        "content": "",
        "created_utc": 1731693070.0,
        "subreddit_name": "technology",
        "comments": 17
    },
    {
        "title": "Researcher demonstrates Apple iOS 18 security feature rebooting an iPhone after 72 hours of incativity | See the feature in action",
        "score": 199,
        "url": "https://www.techspot.com/news/105586-apple-ios-18-security-feature-reboots-iphones-after.html",
        "content": "",
        "created_utc": 1731677659.0,
        "subreddit_name": "technology",
        "comments": 59
    },
    {
        "title": "Monster exploded in my backpack onto my computer. ",
        "score": 757,
        "url": "https://i.redd.it/i4iclxsm421e1.jpeg",
        "content": "Hi everyone!\nBasically I had a monster in my backpack and it exploded i guess(?) and got all over my laptop. I opened it this morning and this is what the screen looks like. Is there anything I can do or am I just waiting for it to break bc of damage, atp? Any help/advice is appreciated, i’m a college student so this sucks extra hard lmao thanks yall. ",
        "created_utc": 1731672912.0,
        "subreddit_name": "mac",
        "comments": 167
    },
    {
        "title": "Just got myself a studio display, I understand why its $1500",
        "score": 716,
        "url": "https://www.reddit.com/r/mac/comments/1grj6g7/just_got_myself_a_studio_display_i_understand_why/",
        "content": "I was looking for an external display that could match the one on my macbook pro. As of now I had a generic 1440p ultra-wide monitor from Samsung which I used whenever I had to seriously multi-task (which is most of the time), but it'd be so exhausting staring at it for more than an hour at a time, I'd find myself bending over closer to the monitor to really be able to focus on some text. I didn't feel that issue with my macbook even though the screen is so much smaller. \n\nJust brought back to my office the studio display and besides the lack of HDR, I'm blown, its hard to describe how its just so much more easy on the eyes, everything from dense text to complex figures in scientific publications. I'm in a PhD program so I'm spending maybe 10-12 hours a day looking at my monitor consistently, so I thought if $1500 can make my life easier for at least the next 5-7 years (how long I expect this to last) and I can afford it without becoming homeless, then why not. I've so far spent only an hour using it and it feels absolutely worth it. ",
        "created_utc": 1731628936.0,
        "subreddit_name": "mac",
        "comments": 383
    },
    {
        "title": "The 8 core iMac does NOT come with a Touch ID keyboard!",
        "score": 288,
        "url": "https://i.redd.it/eaxmxzv68z0e1.jpeg",
        "content": "Yes I know they’re being upfront about it, but this is still something you would have to take into consideration. You have to upgrade to Touch ID and numeric keypad but you cannot update to just Touch ID.\n\nAlso for some reason the Apple Store website does not offer Final Cut Pro with the pink iMac with 10 cores if you select 256GB. I don’t know why as the other colors do of that same type, and other pink configurations can bundle it. It offers Logic Pro so it must be an oversight.",
        "created_utc": 1731637786.0,
        "subreddit_name": "mac",
        "comments": 58
    },
    {
        "title": "I'm sorry everyone, but I love the Magic Mouse",
        "score": 134,
        "url": "https://www.reddit.com/r/mac/comments/1gs4kps/im_sorry_everyone_but_i_love_the_magic_mouse/",
        "content": "I understand the concerns about the charging port and ergonomics. I’ve heard these criticisms before. I used an MX Master 3 for a long time and decided to give the Magic Mouse another try. And wow, I’m really enjoying the gestures and smooth scrolling it provides on macOS. Working in creative apps, I don’t even have to think about scrolling in any direction, which is a huge improvement compared to other mice.\n\nOn the other hand, I’ve tried using a Magic Trackpad, but it actually ended up cramping my wrist after a while. I also found that I was much slower using it than with a mouse. The Magic Mouse actually just works for me. Now, I do wish it was larger and taller because it definitely is too flat but I still find it very comfortable to use.",
        "created_utc": 1731699072.0,
        "subreddit_name": "mac",
        "comments": 81
    },
    {
        "title": "Family photograph",
        "score": 122,
        "url": "https://i.redd.it/34dwl6lhb51e1.jpeg",
        "content": "Shot on iPhone 14 Pro Max using Apple Watch Series 6 “Camera Remote”. Unfortunately, the G3 on the floor is a parts machine (no bezel at all, just the loose assembly of parts in the case), the Pizza Box performa is only a case (maybe I’ll put an old Mac mini in there), and the 2020 Intel MacBook Air no longer powers on for no apparent reason. \n\nHow many Macs do you have?",
        "created_utc": 1731711537.0,
        "subreddit_name": "mac",
        "comments": 8
    },
    {
        "title": "Found this old page on Apple's website talking about the old unibody MacBook Pro design",
        "score": 117,
        "url": "https://www.apple.com/uk/macbookpro/design.html",
        "content": "",
        "created_utc": 1731698068.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "Remote management ",
        "score": 70,
        "url": "https://i.redd.it/xxk9tivso21e1.jpeg",
        "content": "I just got a Mac book pro 2019 of refurbed.com. It came with all the original packaging and official Apple refurbished sign. Cool. Now I wanted to start it but the remote management won’t go away. How can I get into my new laptop?",
        "created_utc": 1731679694.0,
        "subreddit_name": "mac",
        "comments": 66
    },
    {
        "title": "Got this iMac (mid 2007) for £5 today. ",
        "score": 56,
        "url": "https://i.redd.it/rmbckwajl41e1.jpeg",
        "content": "Sorry for horrible photo but got this iMac with the mouse and keyboard for £5 today! What a score! This is gonna be a glorified CD and DVD player in the corner of my room most likely but I could not miss out on this.",
        "created_utc": 1731702810.0,
        "subreddit_name": "mac",
        "comments": 17
    },
    {
        "title": "Games for Apple Silicon? ",
        "score": 52,
        "url": "https://i.redd.it/saghsnm9311e1.jpeg",
        "content": "Heya everyone! \nSo, I just got my hands on a base model M2 Mac Mini. \nMy question is, how is games for the Apple Silicon platform? Normal Steam library works for it? Any weird hiccups that can happen, like bad optimization or code for architecture? \nI've seen some games in the App store for M1 and above, but I really don't wanna fork up 60 dollars and above for one game just on this architecture... \nI've heard of Rosetta, is that any good? \nKinda new to the whole \"gaming on Apple Silicon\" thing, hence why I'm curious to know your insights 🤠",
        "created_utc": 1731660345.0,
        "subreddit_name": "mac",
        "comments": 72
    },
    {
        "title": "What is this?",
        "score": 24,
        "url": "https://i.redd.it/q2z2guryi21e1.jpeg",
        "content": "Every time I boot up I get this and then it restarts.\n\nBefore this happened I was trying to boot up in safe mode (I think) and now I can’t get back to my login page.\n\nMacBook Pro 2012",
        "created_utc": 1731677733.0,
        "subreddit_name": "mac",
        "comments": 40
    },
    {
        "title": "This is why I love Apple: 5 devices, universal control, shared files and resources!",
        "score": 17,
        "url": "https://www.reddit.com/r/mac/comments/1grpo6v/this_is_why_i_love_apple_5_devices_universal/",
        "content": "So even I was impressed about how well many apple devices connect together.\n\nI have currently connected and used 3 Macs and 2 iPads with a single keyboard and mouse.\n\nSo the main system is my Mac Studio M2 Ultra. This is connected to a monitor and also via USB-C to lightning connected to my gen 1 12.9 iPad Pro for sidecar with Apple Pencil gen1 . Located under the screen so I can use as touch screen with the pencil as well.\n\nThen there is my MacBook Pro M3 Max. I have connected this to the Studio with a Thunderbolt-4 bridge, and also connected with my M1 iPad Pro 12.9 via USB-C with sidecar to also use as a second screen and touch input with the Apple Pencil gen2.\n\nThe aim of the thunderbolt bridge is to share inputs and outputs for codes between them. The M2 Ultra runs the initial mathematical part of my models solving the multidimensional diff equations, using all of the GPU power (and about 150GB of VRAM haha). Then transfers the outputs to my M3 Max. This runs the ML on the outputs when each batch is finished (mix of both CPU and GPU loads). I have the codes on the MacBook screens and plots on the iPad screens to see some of the results and the progress in real time.\n\nEverything is controlled by a single Magic Keyboard and Magic Mouse.\n\nAnd a tiny cherry on top is my little M2 Air I just got which I can use when I am not here to remote in and control the entire thing. I use two different Remote Desktop apps so I can remote into both machines at the same time and have control of the entire thing!\n\nI had my doubts about how well this would work, but even I am impressed with how well it went!  \nWith this setup I have in total 16+24 CPU cores, 40+76 GPU cores, 64+192GB of unified memory between the M3 Max and the M2 Ultra. This setup is a BEAST !\n\nAnd everything took like 5 minutes to setup. Basically almost plug and play!!\n\nhttps://preview.redd.it/so6nu5w2801e1.png?width=1766&format=png&auto=webp&s=4f7e733d79192cbf6975f60f72123457a2616f5a",
        "created_utc": 1731649972.0,
        "subreddit_name": "mac",
        "comments": 8
    },
    {
        "title": "How to map the Command key to a \"Windows\" keyboard",
        "score": 12,
        "url": "https://www.reddit.com/r/mac/comments/1grm69h/how_to_map_the_command_key_to_a_windows_keyboard/",
        "content": "Hi all! I was looking for this question before to buy a windows mechanical keyboard, specifically I got the HyperX Alloy Origins Core, but I didn't find information about it. \n\nSo here is my contribution to the community (*disclaimer, I'm using a macOS* ***Sequoia 15.1***):\n\n1. Connect your keyboard via wire or bluetooth\n2. Go to System Settings\n3. Clic on Keyboard\n4. Clic on Keyboard Shortcuts\n5. Clic on Modifier Keys\n6. Select your keyboard\n7. Change the Option Key to Command and Command key to Option\n8. Clic on Done and all is set!\n9. Enjoy!\n\nHope this information is useful to some of you (:\n\nhttps://preview.redd.it/nkcg21gw7z0e1.png?width=1444&format=png&auto=webp&s=ddb65f9a612dade3c751619c230770d6536fb220",
        "created_utc": 1731637978.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Anyone know what MacBook this is? It looks so cute!!!",
        "score": 6,
        "url": "https://i.redd.it/1hlv7nr7g31e1.jpeg",
        "content": "",
        "created_utc": 1731688915.0,
        "subreddit_name": "mac",
        "comments": 32
    },
    {
        "title": "Macbook Air M3 backlight bleed",
        "score": 9,
        "url": "https://www.reddit.com/gallery/1grj4ls",
        "content": "Hello, I just purchased a macbook air M3 last month and I’ve noticed backlight uniformity issues specially around the top right corner. Is this normal? Please suggest. Thank you!",
        "created_utc": 1731628804.0,
        "subreddit_name": "mac",
        "comments": 10
    },
    {
        "title": "M4 Mac mini 40% slower than 3 year old M1 Pro ? ",
        "score": 4,
        "url": "https://www.reddit.com/r/mac/comments/1grpt3p/m4_mac_mini_40_slower_than_3_year_old_m1_pro/",
        "content": "So I have  M1 Pro MacBook Pro (16GB Memory and 1TB SSD)  and I just picked up a brand new base M4 Mac Mini (16GB Memory and 256GB SSD)  mainly to  render videos using Davinci Resolve. \n\nBased on everything I have seen. The newer M4 chip should be faster or similar in performance than 3 year old M1 Pro Chip. But in my real world use case its performing terribly on the new M4 Mac mini. Note I have updates software on both MacBook Pro and MacMini to macOS Sequoia 15.1.   \nReference: [https://nanoreview.net/en/cpu-compare/apple-m4-vs-apple-m1-pro](https://nanoreview.net/en/cpu-compare/apple-m4-vs-apple-m1-pro) \n\n**These are the video rendering results** \n\nI am getting using Davinci Resolve 19.1 on both machines:   \n\n**M1 Pro Mac Pro** Rendered in: 8:58 | 8:55  - I did 2 tests  \n\n**New M4 Mac Mini** base model Rendered in: 12:28  | 12:34 again did 2 tests...\n\nAny idea as to why is this happening ? I was expecting similar or better results from the M4 Mac mini. But new Mac M4 Mini is 40% slower. The multi-core Geekbench scores on M4 chip were definitely higher than M1 Pro. ",
        "created_utc": 1731650498.0,
        "subreddit_name": "mac",
        "comments": 61
    },
    {
        "title": "How salvageable is my water damaged MacBook Pro M1 2021 Screen? ",
        "score": 6,
        "url": "https://i.redd.it/ri9riejt531e1.jpeg",
        "content": "",
        "created_utc": 1731685444.0,
        "subreddit_name": "mac",
        "comments": 8
    },
    {
        "title": "M4 pro (12c) with 24gb vs intel windows 32gb ram",
        "score": 5,
        "url": "https://www.reddit.com/r/mac/comments/1grth2p/m4_pro_12c_with_24gb_vs_intel_windows_32gb_ram/",
        "content": "I’m a software developer and I’m currently using a windows machine with 16gb which is pretty much always at 90%+ usage with the work I do ( i dont have unused tabs open so there isnt much I can do to reduce the usage) I experience stutters with this setup.\n\nI want to move to a macbook but anything above the 24gb m4 pro is out of my budget, but there are cheaper 32gb windows laptops out there.\n\nIf i went for the 24gb ram mac would it be as good if not better than the windows 32gb machines ( i hear mac is meant to be better with handling ram) or is it just better to have more ram regardless of the OS and processor.\n\nI use: docker, intelijj idea ultimate, vs code, microsoft teams, microsoft edge and outlook + vpn and sometimes pgadmin + postman + putty for sshing to a server",
        "created_utc": 1731666735.0,
        "subreddit_name": "mac",
        "comments": 35
    },
    {
        "title": "Mac mini m4 setup. AMA",
        "score": 4,
        "url": "https://i.redd.it/w9oifvwpd41e1.jpeg",
        "content": "Mac mini m4 bought it recently.\nLogitech wave keys keyboard. \nApple magic mouse (lightening port) thinking of buying the touch pad.\nLg wqhd 32 inch. \nLg hd 22inch ig.\nJBL tune 760nc. \nMivi fort s48 soundbarand subwoofer.\nXbox series s 512gb.",
        "created_utc": 1731700182.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "How does memory bandwidth affect performance?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gs83n2/how_does_memory_bandwidth_affect_performance/",
        "content": "I'm looking to buy a mac mini with the m4 pro or mac studio with m2 ultra. In this [comparison](https://nanoreview.net/en/cpu-compare/apple-m4-pro-14-cores-vs-apple-m2-ultra), the m4 wins in single-core and multi-core performance, however, the m2 ultra has \"Around 527 GB/s (193%) higher theoretical memory bandwidth\".\n\nI'm going to be using my mac for video editing on premiere and music production in ableton. How does memory bandwidth affect these applications and which mac would be best suited for me?",
        "created_utc": 1731708415.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Mac mini + display or iMac for student? (New to desktops)",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gs5odk/mac_mini_display_or_imac_for_student_new_to/",
        "content": "Hi everyone! I’m hoping for some advice/guidance. I (27F) am a FT student and work as an administrative coordinator PT, and I really want to upgrade my desk setup. I currently do all my work in my 2020 MacBook Pro, which I want to upgrade, and iPad Pro. I would like to add a desktop monitor, and have never had one before. I am having a hard time deciding between a Mac Mini + Monitor (Studio Display or other), or the newest iMac. \n\nI like that with the Mac mini + display, I won’t have the replace the monitor when it’s time to replace the Mac, but I do need access to a webcam so I’m not sure if the iMac would be better since it seems more streamlined?\n\nThanks in advance for your suggestions!",
        "created_utc": 1731701994.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "m4 vs m4 pro macbook pro 14 inch ",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gs9tpb/m4_vs_m4_pro_macbook_pro_14_inch/",
        "content": "Why does apple even sell a 14 inch MacBook pro with a non pro or max processor? Is it really worth saving the $500 and not getting the m4pro and just getting the m4?",
        "created_utc": 1731713191.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Best docks to connect 2 MBP to a single 1440p monitor with HDR.",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gs7r0u/best_docks_to_connect_2_mbp_to_a_single_1440p/",
        "content": "Hello, I'm currently using two 2 MBP, each connected directly to a 1440p monitor—one via Type-C and the other via DisplayPort. Both with HDR at 120Hz. However, 90% of the time, the monitor takes several minutes to wake up and display the signal. I can hear the sounds from macOS, indicating that is active, but the monitor does show NO SIGNAL.\n\nI often have to unplug and replug the cable or turn the monitor on and off multiple times to get a signal. Sometimes the monitor wakes up instantly, but there are occasions when macOS wakes up without the HDR settings, which seem to disappear. In those cases, I also have to unplug and plug the cable again to restore the HDR settings. I already tried all the solution found online, like tweaking power management and prevent monitor to turn off when go to sleep\n\nI'm looking for a solution, possibly a macOS-specific dock that may fix this issue, and that properly supports for 1440p at 120Hz with HDR. Are there any effective solutions available in 2024? I also read that the issue might be caused by the 1440p resolution not officially supported by Macos, but I can't find any confirmation online.",
        "created_utc": 1731707489.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Webcams for Mac (Mini)",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gs5qo7/webcams_for_mac_mini/",
        "content": "Hello everyone, I'm a lifelong MacBook user who has just recently purchased a Mac Mini. The device is incredible and it really improved and simplified my setup. One thing I'm still unsure about though is which webcam to go for and I was hoping someone would have Mac-specific recommendations.\n\nIn particular, I'm looking to use it primarily for professional meetings over Zoom and I would love one which has good camera quality and focus to allow for proper background blurring (or substitution). Ideally, it would also have a good microphone. Are you aware of one which is well integrated with macOS? What's your experience?\n\nAlso, when I used my MacBook's camera I noticed macOS has some builtin features for the camera through the top menu bar such as portrait mode and studio light. Would third-party cameras (e.g. Logitech) support this OS-level features?\n\nThanks!",
        "created_utc": 1731702169.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "I am not able to write numbers and its corresponding special characters on my Macbook Pro 13-inch, M1, 2020",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gs4d0n/i_am_not_able_to_write_numbers_and_its/",
        "content": "Not able to write numbers from the keyboard and its corresponding shift keys.  If I constantly hit my numbers on my keyboard very fastly then numbers are getting written but only when I write very very quickly. Still, no special characters are getting written. I checked, and the shift key is working fine because I can write letters in capitals but not shift + numbers. Only keys from 1-0 on my keyboard are troubling me for a few days. Does anyone have any idea about it?",
        "created_utc": 1731698514.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Any not too expensive Docking Station / Hub to Macbook Air M2",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gs2ze2/any_not_too_expensive_docking_station_hub_to/",
        "content": "Hey guys! \n\nI do not really know what I need, I always used my windows desktop and my macbook as my laptop. I'm leaving my windows desktop and buying a docking station to when I need to work from home. \n\n  \nI just need to put a mic (USB), Monitor DisplayPort 165Hz (if possible the 165 Hz + dual monitor with the in built mac screen better :) )\n\n  \nKeyboard and Mouse are BT (Logitech).\n\n  \nWhat mid-level docking /hub device would you recommend me? I would expend up to 200€. \n\nI am really lost in this subject, any help is welcome. ",
        "created_utc": 1731694991.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Received macbook air m2 i didn't order",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gs1s53/received_macbook_air_m2_i_didnt_order/",
        "content": "Has anyone else had this happen to them? Not sure what to do. Is it some kind of scam?\n\n  \nYesterday i received a brand new Macbook Air M2 which i never ordered. It looks legit as the return address is an apple warehouse distribution center. When i look up the serial number on apple, it says purchase date January 1985 with expired warranty coverage.\n\nI don't know who sent it. I checked all my credit cards and there and no pending charges.\n\nIt's the exact same model i bought almost 2 years ago so my best guess is that somehow something triggered apple to send me a duplicate order from back then? I can't think of any other explanation. \n\nI'm thinking i'll just sell it locally to make some money but I am very confused about why this happened.",
        "created_utc": 1731691986.0,
        "subreddit_name": "mac",
        "comments": 12
    },
    {
        "title": "How does this work even when my Mac is off?",
        "score": 2,
        "url": "https://i.redd.it/ppaplry6j31e1.jpeg",
        "content": "My M4 Mac mini was not turned, was not in sleep, or even connected to power. How did I get this Mac Mini left behind notification even then? How did my iPhone know? How does it work? Is there a battery inside that is keeping this logic on at all times? If yes, then do I need to worry about the battery going dead some time in the future? Please enlighten me if you know. ",
        "created_utc": 1731689915.0,
        "subreddit_name": "mac",
        "comments": 12
    },
    {
        "title": "Is the pro vs air difference that big? ",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1grwdc9/is_the_pro_vs_air_difference_that_big/",
        "content": "Hi all, \n\nLooking to replace my Mac book pro with the first M1 chip (purchased in 2020). My son spilled an entire xl dunkin coffee and there was no saving it. RIP. \n\nConsidering switching to an air since the newer chips are likely to be an improvement no matter what, but wanted to ask the experts. \n\nI think the pro might be excessive for my use cases. I’m generally running slack/discord/spotify, fellow, zoom, software for coding (very minor, only html), and occasionally a VM for a company I contract with (Amazon workspaces). Everything else is browser based. \n\nThat should all be doable with an air, right? I’m currently trying to cut it with a chrome book and an iPad for what I can’t run on chrome and it’s clunky at best and unusable at worst so it’s not a reasonable or sustainable set up. And if I can save money going with the air, I’ll put that money toward other wfh improvements like a standing desk. \n\n(Also taking reccs for a toddler proof coffee cup 🥲) ",
        "created_utc": 1731677407.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "MB Air M3 - Monitor and drives disconnecting - anyone else?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1grsprr/mb_air_m3_monitor_and_drives_disconnecting_anyone/",
        "content": "I recently got a MacBook Air M3 (less than two months old), and it's been working great overall. However, I've run into an issue in my office setup: I connect an external monitor and a USB-C hub (external drives and Time Machine backups attached).\n\nThe problem is that while I'm typing, I occasionally bump into the connected cables with my left hand. This didn't happen as much with my previous MacBook Air M1 because the usb ports were further back towards the hinge. Now, with the added MagSafe connector shifting the USB-C ports forward, the connections are easier to brush against.\n\nWhen this happens, my external monitor sometimes flickers as if it's being disconnected, and my drives occasionally get disconnected too. Has anyone else encountered this problem? Do I need to look into replacing the cables?",
        "created_utc": 1731663230.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Consecutive MacBook Pro repairs and still a lemon?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1grqkr5/consecutive_macbook_pro_repairs_and_still_a_lemon/",
        "content": "picked up my MacBook Pro from repair yesterday. it would be the 3rd repair done on it. \n\nThe initial issue was the battery / charging issue where it wouldn’t charge randomly. Halfway through they called me and say that the logic board needs to be replaced as  something minor failed. however they need 5 days to get it in so I requested to collect it back since they have already changed the top case and battery and I needed a working mac. The minor issue wasn’t critical for me. \n\nFast forward back home, I realised the speakers are spoilt too after repair! so I gotta repair that too now and it wasn’t even related to the minor issue they mentioned. I’m slightly annoyed that they didn’t really test it as it was obvious if you just played an audio. Nevertheless I dropped it off when they informed the logic board was in and informed them the speakers had issues too. They were apologetic about it and told me they will replace it too. yay no more issues I thought. I was wrong! \n\nAfter picking up and using it. The display started showing lots of lines. At this point I’m beyond annoyed because why is every repair leading to the need for another repair?\n\nJust called Apple Support and was told to head down to the store ASAP before my AppleCare+ ends. I’m gonna do that but this is so infuriating that I’ve had to go to the store multiple times in a span of 3 weeks. It’s appalling that this is the standard. If I pick up the product and find another issue, I might have to be a Karen and ask for the manager because what is happening?!\n\nhas anyone had such an experience or am I just unlucky?",
        "created_utc": 1731653608.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "The new Mac Mini is great — now do the iPhone SE / Give us a decent 500 Dollars iPhone already, Apple.",
        "score": 2356,
        "url": "https://www.theverge.com/2024/11/15/24296505/apple-iphone-se-rumors-mac-mini",
        "content": "",
        "created_utc": 1731693466.0,
        "subreddit_name": "gadgets",
        "comments": 269
    },
    {
        "title": "Source: Google is working on the Pixel Tablet 2 along with a keyboard",
        "score": 66,
        "url": "https://www.androidauthority.com/pixel-tablet-2-keyboard-3500081/",
        "content": "",
        "created_utc": 1731693562.0,
        "subreddit_name": "gadgets",
        "comments": 8
    },
    {
        "title": "Apple secretly included quantum dot tech in the M4 MacBook Pro's display",
        "score": 4,
        "url": "https://www.engadget.com/computing/laptops/apple-secretly-included-quantum-dot-tech-in-the-m4-macbook-pros-display-173424130.html",
        "content": "",
        "created_utc": 1731692844.0,
        "subreddit_name": "gadgets",
        "comments": 5
    },
    {
        "title": "Dear diary, today I was a 🌈🐻",
        "score": 157,
        "url": "https://www.reddit.com/gallery/1gs0udp",
        "content": "Must add context:\n-I bought 50 contracts QQQ $500p 11/15 at 9:31 am EST for $0.61 premium\n-I sold 50 contracts QQQ $500p 11/15 at 11:06 am EST for $2.56 premium\n-Total in: $3,051.50\n-Total out: $12,898.50\n",
        "created_utc": 1731689631.0,
        "subreddit_name": "wallstreetbets",
        "comments": 44
    }
]