[
    {
        "title": "r/Stocks Daily Discussion & Fundamentals Friday Nov 15, 2024",
        "score": 20,
        "url": "https://www.reddit.com/r/stocks/comments/1grtfyq/rstocks_daily_discussion_fundamentals_friday_nov/",
        "content": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.\n\nExpect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nBut growth stocks don't rely so much on EPS or revenue as long as they beat some other metric like subscriber count:  Going from 1 million to 10 million subscribers means more revenue in the future.\n\nValue stocks do rely on earnings reports, investors look for wall street expectations to be beaten on both EPS & revenue.  You'll also find value stocks pay dividends, but never invest in a company solely for its dividend.\n\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia page](https://www.investopedia.com/fundamental-analysis-4689757/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp) and read [their PDF on the topic.](http://i.investopedia.com/inv/pdf/tutorials/fundamentalanalysis_intro.pdf)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1731666609.0,
        "subreddit_name": "stocks",
        "comments": 453
    },
    {
        "title": "SOXX and Nvidia",
        "score": 14,
        "url": "https://www.reddit.com/r/stocks/comments/1grl78h/soxx_and_nvidia/",
        "content": "The semiconductor market has been taking a beating lately. Down 3% over 6 months and 9% this month even with the Trump rally. This used to be a really aggressive sector. What's going on? Have people completely lost faith in AI? What are we expecting with the big Nvidia earnings next week? Any hope semis will make a comeback in the near future?",
        "created_utc": 1731634945.0,
        "subreddit_name": "stocks",
        "comments": 40
    },
    {
        "title": "💊 $HIMS Stock - Can It Compete with Amazon's “Move” into Boner Pills? 💊",
        "score": 175,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1grqbx7/hims_stock_can_it_compete_with_amazons_move_into/",
        "content": "Overview:  \n$HIMS has been delivering impressive financial growth, even as Amazon attempts its way into the healthcare space with its One Medical acquisition. Amazon officially acquired One Medical on February 22, 2023, and in November 2023, it started offering discounted memberships to Amazon Prime customers. Despite Amazon, $HIMS has continued to thrive over the past year, showing resilience in the face of increased competition. The recent price dip presents a buying opportunity for investors.\n\n$HIMS has also raised its full-year 2024 revenue guidance to a range of $1.460 billion to $1.465 billion and its adjusted EBITDA guidance to between $173 million and $178 million.\n\nQuarterly Financial Highlights (YoY for Q3 2024):\n\n* Revenue: $401.56M (+77.13%)\n* Net Income: $75.59M (+1098.92%) – HIMS is profitable.\n* Diluted EPS: 0.32 (+900%) – Significant earnings growth.\n* Net Profit Margin: 18.82% (+663.47%) – Margin improvements show operational efficiency.\n* Operating Income: $22.37M (+361.56%)\n* Net Change in Cash: $36.22M (+588.11%)\n* Over 2 million customers (+44%) with increasing revenue per customer of $67 (+24%)\n\n[$Hims subscriber count increase and revenue increase](https://preview.redd.it/q4jyciaqf01e1.png?width=1208&format=png&auto=webp&s=a431a83bbdfd6a1db9330f643bbb2fdfb23accf7)\n\nAmazon - Why It Matters for $HIMS:\n\n1. Amazon’s Reach and Pricing Power: With Amazon now offering discounted One Medical memberships to Prime members, its reach and pricing power could potentially attract customers quickly, posing a challenge to $HIMS’s growth.\n2. Enhanced Services for Prime Members: Amazon’s ability to bundle healthcare with Prime adds convenience for its vast user base, appealing to those who value integrated services.\n3. Increased Competition: Amazon’s formal “entry” into telehealth means $HIMS and similar companies will need to differentiate themselves more strongly to retain market share.\n\nThe Bull Case for $HIMS Despite Amazon:\n\n* Strong Financial Growth: $HIMS has shown impressive year-over-year growth in both revenue and profitability, with a loyal customer base and solid fundamentals.\n* Niche Focus: HIMS focuses on personal health and wellness, including hair loss and sexual health treatments—areas that aren't the primary focus of One Medical. This specialization could help $HIMS create a loyal customer segment.\n* Early Mover Advantage: HIMS has a longer-standing presence in digital health and a well-established platform, giving it an edge in areas Amazon may not emphasize.\n* Privacy and Discretion: Many customers prefer a separate, private platform for personal wellness products. HIMS offers a level of discretion Amazon can’t match, which could be important for products like ED treatments. Also, Amazon’s ad-driven model might make some users uncomfortable if sensitive purchases are targeted by advertisers.\n\nRisks:\n\n* Amazon’s Potential to Undercut Prices: Amazon’s pricing power and ability to offer discounts through Prime could put pressure on $HIMS to stay competitive on price.\n* Brand Loyalty Shift: Amazon’s backing of One Medical and integration with Prime could entice some of $HIMS's customers to switch, especially those already invested in the Amazon ecosystem.\n\nTL;DR:  \n$HIMS is on a strong growth path, with impressive financials and a niche focus in the wellness and telehealth market. Amazon's acquisition of One Medical over a year ago and recent push into the space does increase competition, but $HIMS has proven resilient over the past year against Amazon and continues to improve its metrics. With a clear strategy and focus on privacy and niche offerings, $HIMS may have the staying power to thrive alongside Amazon's “release” into the space. The recent price drop could be an opportunity to buy.\n\nPositions:\n\n1500 shares & 10 calls @$20 1/16/26\n\nThis is my first DD, plz be gentle with this regard",
        "created_utc": 1731652555.0,
        "subreddit_name": "wallstreetbets",
        "comments": 87
    },
    {
        "title": "RDDT - Just getting started",
        "score": 96,
        "url": "https://i.redd.it/l59b7byp451e1.jpeg",
        "content": "RDDT - 10k shares yolo\n\nThesis:\n\nPros:\n-DAU growth surging. Google realizes their search sucks and is sending droves of people to Reddit. \n\n-Ad revenue growing strongly. They are finally figuring out how to monetize the site after 2 decades.\n\n-Subreddits have very specific niches and are pure gold to advertisers. Want to advertise to NJ moms that enjoy eating grilled lobsters while wearing fluorescent green thongs? There’s probably a subreddit with 20,000 members floating around.\n\n-Licensing reams of data to LLM/AI companies. This can be thought of a very high margin annuity as data can go stale and needs to keep pouring in.\n\n-AI is efficiently translating all the English content to other languages, which will cause an explosion of growth internationally.  \n\n-Low hosting and operating costs as mainly text-based. \n\n-User generated content means not spending billions on creating content like $nflx.\n\n-CFO is solid and actually gives a shit about GAAP numbers and not adjusted EBIDTA BS.\n\n-SBC is something they don’t want to go bonkers on like SNAP. They are very cognizant of dilution. \n\n-Probably the best place online for brands to connect with customers and to also gauges brand temperature. Very authentic human interactions and discussions due to the huge amount of users and the downvoting system which gets rid of bot replies and pushes good content to the top. \n\n-Massive moat / barrier to entry. How can it be replicated? Would be extremely difficult and costly.\n\n-Can really start to get a piece of the global advertising pie if they can fix their search function.\n\nCons\n-Google can stop promoting Reddit in search results, which would limit user growth.\n\n-Users that come in from Google aren’t logged in, thus generate less revenue from ads.\n\n-Once they capture the low hanging fruit from running relevant ads, what is the growth strategy that gets them to a much higher valuation ($100 billion+)?\n",
        "created_utc": 1731709261.0,
        "subreddit_name": "wallstreetbets",
        "comments": 99
    },
    {
        "title": "US Uranium miners",
        "score": 42,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gryxdj/us_uranium_miners/",
        "content": "Bull thesis for uranium miners\n\nAI datacenters need a fuck ton of energy. Microsoft, amazon, google and lots of other companies are making deals for for the construction of small modular reactors that provide 15-100mw of power for datacenters. Microsoft if even restarting a whole nuclear power plant. Also orange coin needs a fuck ton of energy.\n\nRussia just banned uranium exports to the US. Countries will be scrambling for new suppliers, and US miners can jump in to fill this gap. Tarifs could boost domestic uranium suppliers. Orange man loves nuclear.",
        "created_utc": 1731684675.0,
        "subreddit_name": "wallstreetbets",
        "comments": 35
    },
    {
        "title": "Artificial intelligence boom continues to drive Wall Street as well as the semiconductor industry, with NVIDIA set to report Q3 earnings nex",
        "score": 34,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gs4jfs/artificial_intelligence_boom_continues_to_drive/",
        "content": "Nvidia ( NVDA ) will report its third-quarter earnings after the close of trading next Wednesday, providing Wall Street with the latest and best look at the strength of artificial intelligence trading.\n\n\n\nNvidia is the world's largest publicly traded company by market capitalisation, and its shares continue to soar through 2024 thanks to the explosive growth of artificial intelligence in tech and beyond. As of Friday, Nvidia shares were up 189% year to date, easily outpacing any of the company's chip rivals. shares of Nvidia's closest competitor, AMD, are down nearly 8% year to date, while shares of Intel, which is facing a tough turnaround, have plunged 51%\n\n\n\n[https://finance.yahoo.com/news/nvidia-to-report-q3-earnings-wednesday-as-ai-fever-continues-to-power-wall-street-185800624.html](https://finance.yahoo.com/news/nvidia-to-report-q3-earnings-wednesday-as-ai-fever-continues-to-power-wall-street-185800624.html)",
        "created_utc": 1731698980.0,
        "subreddit_name": "wallstreetbets",
        "comments": 38
    },
    {
        "title": "Biotricity Achieves Improved Margins and Efficiencies, and Year-Over-Year Sales Growth for Second Quarter of Fiscal Year 2025",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gs2p22/biotricity_achieves_improved_margins_and/",
        "content": "Biotricity's BTCY  provides products to cardiologists and electrophysiologists on heartbeat monitoring. Recently they announced expanding into AI technology for remote patient care.\n\n**Q2-FY25 Financial Highlights**\n\n* Revenue increased by 13% YOY to $3.3 million in Q2 FY25\n* Gross profit percentage was 75.3% for the three months ended September 30, 2024, as compared to 69% in the corresponding prior year quarter. This increase in gross margin was primarily attributed to improved margins on technology fees and gained efficiencies in using AI in data processing. Going forward the Company anticipates continued strong performance in overall blended gross margins.\n* Net loss decreased 57% YOY to $1.65 million, or $0.073 per share, from a net loss $3.88 million, or $0.446 per share, in Q2-FY24\n\n[Biotricity Achieves Improved Margins and Efficiencies, and Year-Over-Year Sales Growth for Second Quarter of Fiscal Year 2025](https://finance.yahoo.com/news/biotricity-achieves-improved-margins-efficiencies-131500366.html)",
        "created_utc": 1731694264.0,
        "subreddit_name": "investing",
        "comments": 0
    },
    {
        "title": "Has anyone used something like NotebookLM to analyze companies?",
        "score": 1,
        "url": "https://www.reddit.com/r/investing/comments/1grmu7m/has_anyone_used_something_like_notebooklm_to/",
        "content": "I used to be in research and can’t help but think this would make the job almost effortless. Feed it the backlog of your research groups publications, add all press releases for your coverage universe, add new PR’s as they release and your latest estimates then ask Notebook to write three pages based on the newest information.\n\nOr ask it for value recommendations based on financial records and live trading data.\n\nSo research/traders/buyside, anybody outsourced your jobs to AI yet? Whats your experience been like ?",
        "created_utc": 1731640083.0,
        "subreddit_name": "investing",
        "comments": 3
    },
    {
        "title": "Amazon Accelerates Q3 Growth with AWS and Holiday Sales Potential",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gs0l03/amazon_accelerates_q3_growth_with_aws_and_holiday/",
        "content": "# Summary\n\n* **Buy Recommendation:** Amazon's strong growth, AWS dominance, and robust holiday outlook make it attractive.\n* **AWS Key Driver:** AWS contributes 60% of Amazon’s Q3 2024 operating income, insulating it from e-commerce volatility.\n* **Profit Impact:** AWS’s high margins boost Amazon’s overall profitability and market value.\n* **Earnings Beat:** Q3 exceeded Wall Street estimates, boosting investor confidence.\n* Retail Growth: North American and international eCommerce sales rose, improving margins and profitability.\n* **Q4 Outlook:** The holiday season and AWS are expected to drive strong revenue growth.\n* Inflation Benefit: Falling inflation boosts consumer spending power, aiding Amazon’s revenue.\n* **Long-Term Expansion:** AWS, Prime, and global reach position Amazon for sustained growth.\n\n# Introduction: Setting the Stage\n\nAmazon’s growth trajectory is very strong, driven by its diversified business model, innovations, and a focus on long-term growth. The company’s performance in recent quarters shows its resilience even with challenges. An important factor in all of this is Amazon’s success in Amazon Web Services (AWS). In Q3 2024, AWS generated $10 billion in operating income, which is 60% of Amazon’s total operating income. This shows the role that AWS plays in Amazon’s growth and financial success, strengthening the company’s valuation and protecting it from the general volatility in e-commerce. AWS’s high-margin business model has allowed Amazon to expand profit while also maintaining growth, further making the company a dominant player in cloud computing. AWS continues to outperform expectations as Amazon’s e-commerce is steadily growing. The company’s outlook remains strong, providing confidence in its growth potential.\n\n**AWS Segment Overview and Profit Growth**\n\nAWS has significantly impacted Amazon’s growth and valuation by transforming the company’s business model and driving profitability beyond its core e-commerce operations. As Amazon’s cloud computing arm, AWS has consistently contributed a major share of Amazon’s operating income, thanks to its high margins relative to the low-margin retail business. In 2023, AWS generated over $80 billion in revenue, representing about 16%-18% of Amazon's total revenue and underscoring its role as a key financial driver. This reliable revenue stream not only offsets the volatile nature of retail but has also contributed to Amazon’s robust valuation by positioning it as a dominant player in the rapidly expanding cloud computing market. AWS’s growth is further supported by strategic partnerships with major clients like T-Mobile, Toyota, and Epic Games, which highlight its adaptability across industries—from enhancing 5G infrastructure and automotive technologies to providing advanced computing for game development. These contracts not only bolster AWS’s revenue but also reinforce Amazon’s brand as a tech innovator, driving investor confidence and contributing to Amazon’s overall market value. AWS has become a major factor in Amazon's financial success, having a huge impact on the company’s profits. In Q3 2024, for instance, AWS generated $10.4 billion in operating income—a 50% increase from the previous year. AWS makes up 60% of the company’s total operating income and has an operating margin of 38%. These statistics show how AWS operates and uses its large scale to keep costs low. \n\n**Q3 Earnings Results and Beating Estimates**\n\nAmazon’s retail division experienced notable growth in Q3, with North American sales rising 9% year-over-year (YoY) to $95.5 billion and international sales increasing 12% YoY to $35.9 billion, outperforming the previous quarter’s growth rates of 9% and 7%, respectively. This growth reflects sustained consumer demand, particularly in Prime subscriptions and eCommerce, alongside a steady increase in third-party marketplace sales. In North America, 2023 revenue grew by 7.9% YoY, from $315 billion in 2022 to $340 billion, with operating profit rising 22.2% from $18 billion to $22 billion, driven by enhanced logistics networks, higher cost-efficiency, and high-margin services like Prime. Operating margins in North America improved significantly, reaching 5.9%, showcasing Amazon’s ability to leverage its infrastructure for increased profitability. Meanwhile, international sales grew more moderately by 5.0% YoY, from $140 billion in 2022 to $147 billion in 2023, as economic conditions and logistics costs across diverse markets tempered growth. While international operating profit rose slightly from $5 billion to $5.2 billion, margins remained constrained by global expansion costs and currency fluctuations, though they turned positive in Q3, reaching 3.6%, up from a negative 0.3% last year. Amazon’s logistics optimization, such as regional fulfillment centers, has played a key role in reducing shipping costs and enhancing delivery speed, benefiting profitability in both segments. To address slower international profit growth, Amazon may need to focus on automation, cost-effective delivery, and leveraging AWS to strengthen its margins further.\n\n**Forecast for Q4 and Beyond**\n\nAmazon is poised for strong Q4 growth, driven by robust consumer spending and increased holiday season sales. Net sales are expected to grow significantly, with projections ranging from $181.5 billion to $188.5 billion, marking a 7% to 11% increase over the previous year. This reflects the company’s ability to leverage seasonal demand and capitalize on strategic promotions, including discounts and exclusive deals. Compared to two years ago, when net sales stood at $149.2 billion, this quarter’s projected performance highlights a substantial growth trajectory, supported by the ongoing expansion of e-commerce and enhanced logistics capabilities. Additionally, operating income is anticipated to rise in tandem with sales, underscoring the profitability of holiday-driven demand. In the last quarter of the 2024 year, Amazon’s performance, specifically its growth, will likely be due to its top-performing areas, AWS and Amazon Prime. AWS provides large amounts of profit from its cloud computing technology, services that are only expected to improve Amazon’s standing as many companies are beginning to utilize it as they expand into more modern cloud services. Additionally, Prime’s investments in more warehouses and improved delivery systems, both contributing to faster product delivery, directly contributes to the projected growth of Amazon as a whole. Adaptations to Prime’s entertainment and streaming content have begun to be based on regional preferences, increasing subscriptions and therefore company revenue. In the long term, Amazon’s growth internationally will be a big factor in its overall success. By expanding Prime benefits in regions like Asia, Latin America, and Europe, Amazon is adjusting its services to fit local needs, including faster delivery, special shopping events, and more region-specific streaming content. While there are some challenges, like high delivery costs and currency changes, Amazon’s focus on building efficient delivery systems and offering local content for Prime members is setting it up to win over more customers globally. These efforts should help Amazon grow steadily and strengthen its presence worldwide in the years to come.\n\n**Impact of Falling Inflation on Amazon**\n\nAs inflation rates continue to fall, Amazon stands to benefit from increased consumer spending power, especially in discretionary categories such as electronics and household goods. Lower inflation means that consumers’ purchasing power is less eroded by price increases, encouraging more frequent and larger purchases. This shift can translate into stronger revenue growth for Amazon, particularly as the holiday season approaches, when spending naturally spikes. The added spending capacity from a lower inflation environment could help Amazon meet or exceed its Q4 projections and reinforce its market position. The Consumer Price Index (CPI) slowed to 3.7% in September 2024, down from 9.1% in 2022, while the Personal Consumption Expenditures (PCE) Price Index also eased to 3.5% in August. This has led to increased consumer spending, with personal consumption expenditures growing 3.2% annually in Q2 2024. Retail sales rose 4.4% in August, driven by demand for higher-ticket items. With more disposable income, consumers are likely to spend more on non-essential goods, positioning Amazon to benefit from this shift, particularly as the holiday season approaches.\n\n**Seasonal Boost from Holiday Sales**\n\nAmazon’s season of growth and income is during late Q4 or the holiday season in lay man’s terms. In the United States, retail business generally sees an incredible boost, due to the consumerist culture of holiday season in America. Amazon and other stores like Ebay, Best Buy, and more have embraced this by giving out solid deals on common items gifted during the holidays. Electronics, toys, and clothing are the most common discounted items during this season, with that making up the majority of items on sale during this period. American retailers have caught up to this, creating masterful promotions informing consumers about the deals on popular products going on during the holidays. Amazon is one of the leaders in this section, with the festive decor lining the site, to the well-placed advertisements, to even the special packaging. The most important day of this part of Q4, is Black Friday. Black Friday, for those who don’t know, is a holiday in America which is on the day after Thanksgiving. Black Friday is seen as a holiday at the shops, where numerous stores will bring heavy discounts on a large variety of items. Black Friday is important to consumers, due to its prime location near the beginning on the chaotic run to Christmas and other early winter holidays. Amazon has mostly focused on Cyber Monday, a day on the Monday after thanksgiving week oriented to online shopping, but as the in-store culture of Black Friday goes down Amazon has been promoting Black Friday more heavily. This is a critical time for the Washington State based company as Black Friday only flourishes when the economy is booming, and with many Americans having issues monetarily companies will need to bring out more lucrative offers and advertising to win over customers. Last year, Amazon was able to bring in almost $10 Billion from Black Friday alone, making investors very cheerful during the holiday season. This year, if Amazon is able to recreate it’s smart advertising based in holiday cheer, solid deals, and build hype, they will easily move past the challenges being faced by American citizens.\n\n**Conclusion**\n\n# Amazon's projected temple of growth and profitability domonstrates that the company is armed with strategies that will enable it come out bigger and better in the end. E-commerce growth strengthened by logistics, together with personalization of shopping, cuts into the consumer's loyalty and market share. It is also noted that Amazon Web Services (AWS) is a profit center all its own due to its very high margins and strong market demands for cloud services.The article continues with the growth of Amazon's ad business, collecting targeted consumer data at low cost, as other income streams eg: Prime subscriptions and services for third-party sellers. All these bring about large amounts of cash and help retain customers. Global expansion to those lesser-explored geographical markets would eventually provide Amazon an opportunity for long-term growth by entering customers neeing U.S. and European saturation. Sustainability initiatives will resonate with the consumers' eco-responsible inclinations, which will help build brand loyalty and reduce costs over time.Not the least of which, innovation is part of the great Amazon EQ; investments made on innovation are always on AI, automation, and some machine learning processes to enable efficiency and open the door for other opportunities while fortifying the competition.\n\n  \n\n\n**TLDR**: Amazon is known for being an outstanding leader in e-commerce, and cloud computing which has been displayed through its recent profit growth and Q3 earnings. With these factors, Amazon is positioned to continue its growth in Q4 as it leverages holiday sales and AWS offerings making it a good buying opportunity.",
        "created_utc": 1731688968.0,
        "subreddit_name": "investing",
        "comments": 3
    },
    {
        "title": "Naive question: Intel 18A--what could go wrong?",
        "score": 10,
        "url": "https://www.reddit.com/r/stocks/comments/1grrx4w/naive_question_intel_18awhat_could_go_wrong/",
        "content": "\\[Disclosure: not invested in Intel yet but thinking about doing so\\]\n\nOk, we know Intel messed up and whatever but what I do not get (so please challenge my train of thoughts):\n\n* Intel got newest machines from ASML last year\n* They use them for 18A\n* Like TSMC does for AMD, Apple, etc.\n* Lunar Lake is a combo of Intel's design skills and TSMC's/ASML's fab skills\n* But with low margins because of latter\n* However, Lunar Lake turned out pretty good, so Intel's design skills are def there\n* And with 18A, Intel will have everything in-house\n\nSo, what could go wrong? Maybe Intel need quite some time to catch up and have the same fab capacity based on ASML machines but we will get there at some point.\n\nThe competition? AMD will have (long-term!) lower margins b/c of TSMC (also slower time-to-market, lower quantities), Qualcomm has lower compat and needs still to resort issues with ARM, Nvidia while capable will need some time and will have a good offer but they won't have a fab either and will face compat issues like Qualcomm. Not saying that these are dealbreakers but yeah...\n\nWhat does speak against Intel: org is too messed to get it ever restructured and/or reorg too expensive, running out of money (but gov money), time, building fabs needs years, zero EUV experience, low yields for years\n\nEdit: Intel has a lower market cap than AMD despite AMD just having design in-house, they have more assets in the GPU department but it is insignificant compared to something like Nvidia and if we talk about IGPUs Intel seem to be on par\n\nEdit2: Would at least a new CEO just give us a bump, so we could leave again with some short-term gains?\n\nEdit3: typos\n\nSo, is buying Intel really a risk with its dirt-cheap pricing right now? Is it really \"dirt-cheap\"?",
        "created_utc": 1731659549.0,
        "subreddit_name": "stocks",
        "comments": 47
    }
]