[
    {
        "title": "Elon Musk sells 19.5 million Tesla shares worth almost $4 billion",
        "score": 2385,
        "url": "https://www.reddit.com/r/stocks/comments/yq5y61/elon_musk_sells_195_million_tesla_shares_worth/",
        "content": "Source: https://techcrunch.com/2022/11/08/elon-musk-sells-19-5-million-tesla-shares-worth-almost-4-billion/  \n  \nTesla CEO Elon Musk is selling millions of Tesla shares again. The celebrity executive disposed of 19.5 million shares Tuesday, which is worth about $3.95 billion, according to three filings with the U.S. Securities and Exchange Commission.\n\nMusk did not take to Twitter to explain why he sold shares, but it’s possible the money will go towards his $44 billion deal to buy the social media platform, which went through last month.\n\nIn April, Musk also sold around 9.6 million shares of Tesla stock, which at the time was worth $8.5 billion. Those shares were sold at around $885.42. Since then, Tesla has issued a three-for-one stock split, bringing the cost of each share down.\n\nMusk sold shares Tuesday at an average price of $202.56 each.\n\nTesla is currently trading at $191.30 after hours.\n\n-----------\n\n$TSLA TESLA UPDATED INSIDER BUYING / SELLING OVER THE LAST YEAR  \n  \nBuy Transactions: 0  \nBuy amount: 0  \nSell Transactions: 1455  \nSell amount: $35,974,783,779\n  \nSource: https://twitter.com/gurgavin/status/1590159021499379712",
        "created_utc": 1667960590.0,
        "subreddit_name": "stocks",
        "comments": 352
    },
    {
        "title": "META to layoff 11,000 employees and freeze hiring with immediate effect",
        "score": 3590,
        "url": "https://www.reddit.com/r/stocks/comments/yqfstl/meta_to_layoff_11000_employees_and_freeze_hiring/",
        "content": "In a letter to Meta employees, CEO Mark Zuckerberg stated that\n\n“Today I’m sharing some of the most difficult changes we’ve made in Meta’s history. I’ve decided to reduce the size of our team by about 13% and let more than 11,000 of our talented employees go. We are also taking a number of additional steps to become a leaner and more efficient company by cutting discretionary spending and extending our hiring freeze through Q1, I want to take accountability for these decisions and for how we got here. I know this is tough for everyone, and I’m especially sorry to those impacted.\"\n\nThe company also stated that the company would now become “leaner and more efficient” by cutting spending and staff, and shift more resources to “a smaller number of high-priority3 growth areas,” including ads, AI, and the metaverse.\n\nThe company currently employs around 87,000 individuals in contrast meta had 35,587 in 2018, 44,942 in 2019, 58,604 in 2020, and 71,970 in 2021. The company maintained an increase of at least 20% in the workforce annually.\n\nStock is up 4% in pre market",
        "created_utc": 1667992168.0,
        "subreddit_name": "stocks",
        "comments": 625
    }
]