[
    {
        "title": "Morning Update for Thursday, 02/11/21",
        "score": 315,
        "url": "https://www.reddit.com/r/Daytrading/comments/lhl29h/morning_update_for_thursday_021121/",
        "content": "Good morning everyone!\n\n**Large Cap Watchlist (over $10)**\n\n* Gapping UP: MARA, RIOT, MVIS, DMTK, ACIU, GEVO, MESO, MNPR, MOGO\n* Gapping DOWN: TLRY, CGC, APHA, CLVR, NNOX, \n\n**Small Cap Watchlist (under $10)**\n\n1. IGC: Gapping up on momentum from yesterday (cannabis-related). Showing some weakness after a big premarket spike, but I'll be keeping an eye on it (spike reached high of 4.74). I'll probably lose interest if it can't hold support over 3.70-3.75.\n2. SNDL: Gapping up on the marijuana momentum. Just be aware this is extremely high float, so it will see (relatively) slow fluctuations. Premarket resistance is around 4.87. This has been running for a few days now, so just make sure you don't chase trades, be patient. And yes, now it is showing weakness in the premarket like some other marijuana stocks.\n3. CRBP: Gapping up but couldn't find a catalyst. Seeing some strength in premarket on good volume, I'll be keeping a close eye.\n4. GRNQ: Gapping up on news of investing in crypto-focused fund. Decent volume, but want to see better price action in the premarket. I'll be keeping an eye on this one. \n5. AKER: Gapping up but couldn't find a catalyst. Was showing weakness earlier in premarket, but it's showing some strength now. Extremely low float, so be careful trading this one, could see some high volatility.\n6. ENVB: Gapping up on momentum from past few days. Seeing good price action on decent volume in the premarket. Support around 5.38.\n7. TMBR: Gapping up on momentum from yesterday. Good volume and decent price action in premarket, but I'll be watching to see if it can get back above the 2.60 area. Very low float here as well, so be cautious of volatility and use proper risk management. \n8. RCMT: Leading gapper up on momentum from yesterday. Good volume in premarket, but also showing some weakness in the price action. I'll want to see more strength near market open. Premarket resistance around 7.74-7.77.\n\nOverall market looking like it will open in the green again this morning. I'll be watching for choppiness again on SPY, but I'll cautiously be optimistic for the near-term, and we could see pushes towards ATH. Marijuana stocks were up big in premarket and after-hours trading from the day before, but they are currently selling off in premarket. Crypto-related plays such as MARA and RIOT are seeing strength in the premarket, and I'll be watching them closely.\n\n*There are a lot of pharma/therapeutics small cap stocks that are gapping up today, just be patient and don't force trades. Nothing wrong with just watching for 15 minutes after opening bell.*\n\nIf you made some good trades yesterday, congratulations. Today is a new day, and it's important to realize trades can and will go against you, and you need to stay disciplined. Don't chase trades. Don't be afraid to run the screener again a few times as the morning goes on. Nothing wrong with taking some time to learn more about trading and the market. Also, don't be afraid to take profits on a trade; the stock is not going to run up infinitely, I promise.\n\nAlways remember to have a plan when you enter a trade, use proper risk management, and make sure you size appropriately for your account. Happy trading everyone :)",
        "created_utc": 1613051525.0,
        "subreddit_name": "Daytrading",
        "comments": 123
    }
]