[
    {
        "title": "‘Apple is going to war’: US lawsuit adds to iPhone maker’s antitrust woes",
        "score": 808,
        "url": "https://www.reddit.com/r/stocks/comments/1bm1o1p/apple_is_going_to_war_us_lawsuit_adds_to_iphone/",
        "content": "A famed Apple advertising campaign exhorted customers to “think different”. In a sweeping antitrust lawsuit the US on Thursday alleged that the iPhone maker had betrayed that slogan, locking millions of its users into a powerful monopoly that has made it one of the most valuable companies in the world.  \n\n\nThe long-awaited lawsuit is a watershed moment for Apple. For years it was one of the few Big Tech companies to avoid major antitrust action by the US. Now it is under intense scrutiny from regulators in two of its key markets, the US and the EU. Its responses have indicated it is steeling itself for an existential battle.  \n\n\nApple said the US case “threatens who we are and the principles that set Apple products apart in fiercely competitive markets”. A loss would set a “dangerous precedent” by allowing the government to influence how technology markets developed, it added.  \n\n\nThe new US lawsuit is broad and detailed, painting a picture of a company that has spent years knowingly heading off competitive threats to its ecosystem, be it on the App Store, in messaging with rival Android phones, on its “tap to pay” service, or in the smartwatch market.  \n\n\nArticle without the paywall here: [https://www.archivebuttons.com/articles?article=https://www.ft.com/content/b1c7913f-cec2-47ea-9566-f65953c875fe](https://www.archivebuttons.com/articles?article=https://www.ft.com/content/b1c7913f-cec2-47ea-9566-f65953c875fe)\n\n&#x200B;",
        "created_utc": 1711224789.0,
        "subreddit_name": "stocks",
        "comments": 315
    },
    {
        "title": "Wedbush raise Google price target to $175",
        "score": 310,
        "url": "https://www.reddit.com/r/stocks/comments/1blixir/wedbush_raise_google_price_target_to_175/",
        "content": "https://www.thestreet.com/technology/analyst-unveils-google-stock-price-target-after-apple-rumors\n\n> While Google is a search engine Goliath, the performance of the stock of its parent, Alphabet, has trailed that of its large-cap technology peers because of concern that artificial intelligence will reshape the search market.\n\n> According to Similarweb, over the past six months, the market shares of ChatGPT and Microsoft search and AI chatbot have inched up 0.32% to 0.14% to 1.84% and 1.44%, respectively. \n    \n> Meanwhile, Google’s market share outside China has remained at nearly 92%.\n\n> Last quarter, Alphabet's $86.3 billion of revenue outpaced Wall Street estimates by more than $1 billion, while its $1.64 a share of earnings beat forecasts by 4 cents.\n\n> Alphabet's  (GOOG)  year-over-year revenue growth over the past four quarters is 3%, 7%, 11%, and 13% and its earnings-per-share growth has changed by -11%, 17%, 42%, and 42%. \n\n> Importantly, revenue at Google's Search & Other business segment increased 12.7% year-over-year to $48 billion and YouTube ads jumped 15.6% to $9.2 billion.\n\n> Over the past five years, Alphabet's shares have boasted an average price-to-earnings multiple of 22. Currently, it's about 19. \n\n> Wedbush upped its stock price target to $175 from $160, adding Alphabet to its \"best ideas list.\"",
        "created_utc": 1711165730.0,
        "subreddit_name": "stocks",
        "comments": 87
    },
    {
        "title": "If you were to invest in the mag 7, how would you split the money?",
        "score": 221,
        "url": "https://www.reddit.com/r/stocks/comments/1blsq4o/if_you_were_to_invest_in_the_mag_7_how_would_you/",
        "content": "Minus tsla.\n\nThere's market cap weighting(no need rebalance)\n\nGoogle 1.879T (14.2%).  \nAmazon 1.86T (14%).  \nApple 2.66T (20%).  \nMeta 1.30T (9.8%).  \nMicrosoft 3.19T (24.1%).  \nNvidia 2.36T (17.8%).  \n\nEqual weight, \n\nand I was thinking a third method, to base off which grew more in the past two years, or to base off what I feel has good potential(e.g. Msft)\n\nAnyways, how would you do it? \n\n\n",
        "created_utc": 1711202093.0,
        "subreddit_name": "stocks",
        "comments": 376
    },
    {
        "title": "iPhone’s emergency satellite features lead authorities to group of stranded hikers for 24-hour rescue operation",
        "score": 2399,
        "url": "https://9to5mac.com/2024/03/22/emergency-sos-satellite-iphone-rescue-oregon/",
        "content": "This is great.  Glad they were found. ",
        "created_utc": 1711164291.0,
        "subreddit_name": "apple",
        "comments": 221
    }
]