[
    {
        "title": "People aren’t fully realizing the economic impact of the Chinese Corona Virus",
        "score": 1528,
        "url": "https://www.reddit.com/r/investing/comments/eusz3g/people_arent_fully_realizing_the_economic_impact/",
        "content": "**Disclamer**: This isn’t a fear mongering post about the virus itself. To put it into perspective the Swine Flu epidemic of 2009 has over 110k confirmed cases and close to 4000 deaths in the US alone yet many people don’t even remember that. But that’s for a different discussion in a different sub.\n\nI’m currently in Shanghai now, from my observation people in the West are not spending enough time talking about how devastating this virus has been to the Chinese economy and its certain global ramifications.\n\nLet’s take the city of Shanghai for example. It’s not one of the more heavily impacted cities, it’s not quarantined and people can mostly come and go freely. Many businesses are still open, from restaurants to malls.\n\nHowever for the first time ever I saw an Apple store with more employees than customers, and an open Starbucks with absolutely zero customers inside. The streets on a Saturday afternoon were about as empty as it would be at midnight on a regular weekday. All of this is happening during what’s supposed to be the  busiest week for consumer spendings in China.\n\nThe worst part is this doesn’t seem like it will change any time soon. Shanghai just announced that they will extend the CNY holidays by another week and people will like remain fearful for the coming weeks, if not months if we don’t see a dramatic turnaround of the virus situation.\n\nWhat this means is that any Western company that relies significantly on China for revenue would see their first quarter earning absolutely *crushed*, especially considering their forecasts were done with the assumption of this quarter being the best quarter of the year. For example I’m foreseeing Apple miss their Greater China’s revenue by as much as 50% this quarter, and it would be even worse for companies like GM, Ford and the airlines. I’m not sure if it’s widely known, but China is GM’s largest market by revenue and Ford’s 2nd largest.\n\nFurther more this will impact the global manufacturing and supply chain significantly. I don’t know enough to model out a detailed scenario but my gut feeling tells me a prolonged manufacturing shutdown across major Chinese cities would be more than a little disruptive in that regard.\n\nI’m discounting the impact of the virus if it were spread to other countries in any significant numbers, but even considering the situation in China alone it’s extremely worrying.\n\nOne final point is due to the significantly reduced traveling, China’s energy demand for this quarter would also be drastically reduced. It will likely impact global energy/oil prices and cause even further ripple effects.\n\n**Edit**: for people tell me how CNY in Shanghai should make the city a ghost town... Yes a few million migrant workers (流动人口), leave town during this time, but there are still ~~10M~~ 15M local residents left. For them this is a week of shopping, 串门(visiting friends), taking their kids to places since it’s also winter break, etc. I grew up in this city and no, people don’t just spend a whole week of national holidays at home.\n\nBut yes... some businesses would be closed until 初四, and it may impact local expats’ favorite bars and clubs...\n\n**Edit 2**: Some people are missing the point. No I’m not saying the 2% drop we had so far is “The Dip”, that’s just normal fluctuation. No I’m not saying you should sell everything because unless the world is ending (in which case you wouldn’t worry about your stocks), the market will bounce back. Hell it bounces back after 2008 stronger than ever. But at this point nobody knows just exactly how bad the damage would be and how long it would last, so it *will* be rocky in the short to medium term. No you don’t have to react but you also shouldn’t be surprised if the market does.\n\n**Edit 3**: Jesus Christ people before you tell me how people tend to stay home and do nothing for Chinese New Year, I've spent 20+ CNY here as a local and that's just wrong. Last year people spent [$150B USD](https://www.bloomberg.com/news/articles/2019-02-10/china-lunar-new-year-holiday-retail-catering-sales-up-8-5-cctv) during CNY in consumer spendings. Chinese movie box office during the six days of CNY in 2019 [reached $860M USD](https://variety.com/2019/film/news/piracy-wandering-earth-chinese-new-year-1203138142/), which is probably more than any weekly box office number from the U.S. in all the history of Hollywood, but this year all movie theaters are closed due to the virus. The list goes on an on.",
        "created_utc": 1580153461.0,
        "subreddit_name": "investing",
        "comments": 610
    }
]