[
    {
        "title": "Do you get the urge to gamble (with stocks) and how you deal with it. ",
        "score": 90,
        "url": "https://www.reddit.com/r/investing/comments/1fyl2h9/do_you_get_the_urge_to_gamble_with_stocks_and_how/",
        "content": "So in a few accounts I have accumulated 100k+ over the years with the usual advise of S&P 500 index funds - set it and forget. But every few months I get the urge to sell a part of it and gamble in individual stocks. I did that with Tesla in 2018 (yes it was kind of a gamble then) and that paid off, a few others paid off too but then some didn’t pay off. Overall, am I beating the market? - I am not sure with rollovers from one job to the next that don’t keep track of previous account gains. But I am not loosing either with the strategy. How do you keep this urge/itch away? Just keeping it in S&P 500 is so boring. \n\nEDIT: based on comments I want to add that I do gamble in casinos table games but not more than $500-$1000 a year. It’s fun but I have the thinking that I will loose that 100%. The high from stocks which is 1k-10k gain in a short time is at another level. I don’t bet on penny stocks. These are mostly blue chip like when APPLE or AMAZON or CHIPOTLE does down, I would buy it and then sell in 1-6 months or just sit on it until it goes up. Sometimes stocks like NEO never go up. I also only SELL options. ",
        "created_utc": 1728341446.0,
        "subreddit_name": "investing",
        "comments": 112
    },
    {
        "title": "'Serious' Apple Intelligence performance won't arrive until 2026+",
        "score": 3455,
        "url": "https://9to5mac.com/2024/10/07/serious-apple-intelligence-performance-wont-arrive-until-2026-or-2027-says-analyst/",
        "content": "",
        "created_utc": 1728312503.0,
        "subreddit_name": "apple",
        "comments": 558
    },
    {
        "title": "Apple Silicon iMacs appear to suffer from screen deterioration after two years — flood of user complaints hit Apple Community forums. ",
        "score": 1247,
        "url": "https://www.tomshardware.com/software/macos/apple-silicon-imacs-appear-to-suffer-from-screen-deterioration-after-two-years-flood-of-user-complaints-hit-apple-community-forums",
        "content": "",
        "created_utc": 1728291733.0,
        "subreddit_name": "apple",
        "comments": 161
    },
    {
        "title": "Apple may not be making a Smart Ring right now after all",
        "score": 939,
        "url": "https://appleinsider.com/articles/24/10/07/apple-may-not-be-making-a-smart-ring-right-now-after-all",
        "content": "",
        "created_utc": 1728301291.0,
        "subreddit_name": "apple",
        "comments": 201
    },
    {
        "title": "iPhone 16 Pro Max Becomes the Longest Lasting Phone Buff Battery Test Ever",
        "score": 681,
        "url": "https://youtube.com/watch?v=pd4EntoR5xI",
        "content": "",
        "created_utc": 1728267651.0,
        "subreddit_name": "apple",
        "comments": 120
    }
]