[
    {
        "title": "China lockdown areas showing no new covid cases",
        "score": 12,
        "url": "https://www.reddit.com/r/AAPL/comments/unauxm/china_lockdown_areas_showing_no_new_covid_cases/",
        "content": "Now, hopefully, China will remove the restrictions.  This is the problem Tim Cook was talking about costing Apple 4-8 billion this quarter.  During the lockdowns Apple plants have been mostly functional inside hermetically sealed factory campuses with dorms, with government assistance, but workers have started losing their minds.   Plus no one in China can go Apple stores until the lockdowns end. \n\nWe have a real massive correction going on now, even without Putin, but almost all the stuffing has been knocked out of the market.  Some weaker former meme stocks may go out of business, but this major stress test is evolutionary.  The weak are weeded out and the strong shall survive and become stronger, and when though AAPL has suffered a 15% drop, that is somewhat merciful and can be easily recouped fast once the stormclouds clear. Looking to the 4th quarter of this year to get back on track. \n\nBloomberg experts are now saying that the sentiment about where the bottom will turn out to be has us close to it now, but not quite there.  They said a 20% correction would likely signal a bottom and we are 3-4% away from that now. But of course not alls tocks or sectors are in the same boats here,.\n\nI am no technical expert but 155 now 152 has been holding and if 150 is breached the 145 level should hold.  The huge Apple buybacks also provide foundational support and rocket fuel into rallies.  I know picking bottoms is just luck, but if you pick the right stocks at a peak negative time, you will likely do great in the medium term.\n\nI made an 80% profit on AAPL in six months 2008 buying at the pits of the crash. That is an example. I know many dont have any cash to invest are afraid to go on margin, but there is a tremendous amount of cash on the sidelines now and US blue chip stocks are the safest places to invest, so given all that, Putin permitting (a huge caveat) this is a great time to buy the very best stocks at large discounts",
        "created_utc": 1652278573.0,
        "subreddit_name": "AAPL",
        "comments": 3
    }
]