[
    {
        "title": "Why would breaking up google increase shareholder value?",
        "score": 96,
        "url": "https://www.reddit.com/r/stocks/comments/1glxnvw/why_would_breaking_up_google_increase_shareholder/",
        "content": "I’m seeing people comment that breaking up alphabet would increase shareholder value, and don’t understand why that’s the case. Doesn’t the business benefit from its massive scale, and synergies between its departments? Wouldn’t those go away to some extent if it’s split up? How can something that seems bad for the business lead to an increase in shareholder value?",
        "created_utc": 1731004822.0,
        "subreddit_name": "stocks",
        "comments": 69
    },
    {
        "title": "Pinterest stock plunges following weak Q4 revenue guidance",
        "score": 69,
        "url": "https://www.reddit.com/r/stocks/comments/1gm1jo6/pinterest_stock_plunges_following_weak_q4_revenue/",
        "content": "Pinterest shares plunged 15% Thursday after the social media company provided soft guidance for its fourth-quarter revenue despite it beating the top and bottom lines with its third-quarter earnings.\n\nHere’s how the company performed, according to LSEG:\n\n* **Revenue**: $898 million vs. $896 million expected\n* **Earnings per share:** 40 cents adjusted vs. 34 cents expected\n\nThe company said that fourth-quarter revenue will be between the range of $1.125 million to $1.145 million. The midpoint of the fourth-quarter guidance, $1.135 million, trailed analyst estimates of $1.143 million.\n\nSales in Pinterest’s third-quarter rose 18% from $763.2 million a year ago.\n\nPinterest said it had 537 million global monthly active users in the third quarter, topping analyst estimates of 532.6 million.  \n\nThe company’s net income grew a whopping 354% year over year to $30.56 million. Its total cost and expenses for the quarter were $904 million, up 17% compared with $768 million the previous year.\n\nPinterest’s latest quarterly earnings follows the recent U.S. presidential election earlier in the week in addition to multiple earnings reports from other tech companies with online advertising businesses.\n\nLast week, Amazon said its ads business grew 19% year over year to $14.3 billion in the third quarter, and Meta said its third-quarter sales rose 19% year over year to $40.59 billion. However, Meta shares dropped slightly on weaker-than-expected user numbers and warned of a significant acceleration in its infrastructure expenses in 2025.\n\nAlphabet said during its third-quarter earnings last week that advertising sales in the period grew 10% year over year to $65.85 billion while its YouTube video unit reported ad revenue of $8.92 billion, up 12% from the previous year.\n\nMicrosoft said last week that its search and news advertising revenue jumped 18% year over year as part of its latest earnings report, but the company does not reveal that unit’s specific quarterly sales numbers.\n\nReddit and Snap also reported their most recent quarterly earnings last week. Reddit said that sales in its third quarter soared 68% to $348.4 million from the prior year while Snap’s third-quarter revenue grew 15% year over year to $1.37 billion.\n\nSource: [https://www.cnbc.com/2024/11/07/pinterest-pins-q3-earnings-report-2024.html](https://www.cnbc.com/2024/11/07/pinterest-pins-q3-earnings-report-2024.html)",
        "created_utc": 1731014579.0,
        "subreddit_name": "stocks",
        "comments": 16
    },
    {
        "title": "Two questions about GOOG *vis a vis* GOOGL",
        "score": 13,
        "url": "https://www.reddit.com/r/stocks/comments/1gm2ov1/two_questions_about_goog_vis_a_vis_googl/",
        "content": "First, is there a legal/technical/business reason why the shares are split this way (voting and non-voting) in the first place?  This feels ridiculous, but I am often profoundly ignorant when it comes to stocks, so someone will probably point out why it's a good idea/required/a sacrifice to the gods/etc.\n\nSecondly, I am at a loss as to why there is *ever* a significant gap between the two ... let alone one in favor of the non-voting shares.  The only two reasons I can think of is laziness and/or confusion.  It's like having two gas stations right next to each other sharing the same driveway, they should either be exactly the same price-per-gallon or so close that by the time you finish driving up to the cheaper option, the more expensive one has already moved its price downwards.",
        "created_utc": 1731017513.0,
        "subreddit_name": "stocks",
        "comments": 10
    }
]