[
    {
        "title": "My 3rd Quarter Results Apple Notes",
        "score": 8,
        "url": "https://www.reddit.com/r/AAPL/comments/p9fv1p/my_3rd_quarter_results_apple_notes/",
        "content": "Apple 3rd Quarter Results Notes - \n\n\nApple is an eco-system company with products and services intertwined into a fruitful symbiotic relationship.\n\n\n7/28/2021\n\nAstounding revenue and earnings growth of 36% and 101%, respectively, in fiscal Q3. Beat revenue consensus by more than $8 billion and Apple had not provided explicit guidance for the quarter.\n\n\nSpecifically, for fiscal 3Q21 (calendar 2Q21), Apple posted revenue of $81.4 billion, which was up 37% year-over-year. Revenue far exceeded the consensus forecast of $73.3 billion. GAAP earnings totaled $1.30 per diluted share, up 100% from $0.65 a year earlier. GAAP EPS was $0.34 above the consensus call of $1.01.\n\n\nShares were down -1.2% after the quarterly report, after having dipped another -1.5% on earnings day itself.\n\n\n_________________________________________________\nArgus\n\nContinued broad-based momentum; reiterating BUY Apple meaningfully topped fiscal 3Q21 consensus expectations, including beating the revenue consensus by more than $8 billion. \n\n\nApple posted June-quarter sales records in multiple product categories and regions, while posting all-time high revenue in services. We look for the coming second-generation 5G iPhone launch, tentatively called iPhone 13, to feature new M2 chips replacing 'Bionic' (A series) chips as iPhone's central processor.\n\n\nAAPL has had a quiet and market-lagging start to the calendar year. In our view, the relative underperformance reflects sector rotation, not any misfires in Apple's leadership franchises. We therefore regard the underperformance as an opportunity to establish or dollar-average into positions in AAPL. We are reiterating our BUY rating and 12-month target price of $165.\n\n\n__________________________________________________\nCanaccord Genuity Adjusts Apple's Price Target to $185 from $175, Keeps Buy Rating\n__________________________________________________\n\n\nOppenheimer Adjusts Apple PT to $165 From $160, Maintains Outperform Rating\t\n\nOppenheimer increased its price target on Apple (AAPL) to $165 from $160 on impressive sales momentum across hardware categories, with iPhone growing 50% y/y, while Mac and iPad 16% and 12%, respectively.\n\nThe brokerage said it believes the company will show stronger resistance to competition with its expanding hardware and software ecosystem. It expects the company's significant leadership in accessories such as Apple Watch and AirPods to provide incremental sales growth, deeper moat for core iOS devices, upside for software and network service sales.\n\n\"At the current stage of smartphone competition, we see little risk of share loss and view shifts in iPhone replacement cycle immaterial,\" said the brokerage, noting that longer term it sees tremendous value in the Apple ecosystem and its ability to monetize its user base.\n___________________________________________________\n\n\nApple's Stellar Q3 Raises Q4 Bar Despite Expected $4 Billion Hit From Supply Shortages, Says Goldman Sachs\t\n\nApple's (AAPL) strong fiscal Q3 results could have been stronger if not for the substantial supply constraints the consumer technology giant faced during the period, Goldman Sachs said in a reasearch note.\n\nThe iPhone maker late Tuesday reported fiscal Q3 earnings of $1.30 per diluted share, up from $0.65 a year ago and ahead of the average analyst EPS estimate of $1.01 in a Capital IQ survey. Revenue surged to $81.4 billion from $59.7 billion a year earlier. Analysts expected $73.5 billion.\n\nWhile Apple said chip supply shortages crimped Q3 revenue by less than the company's projection of $3 billion to $4 billion, it expects a bigger hit to fiscal Q4 revenue.\n\nGoldman said chip shortages could reduce Q4 revenue by $4 billion.\n\nThe iPhone's fiscal Q3 revenue of $40 billion outpaced Goldman analysts' estimate as the line continues to be the main driver of Apple's revenue, fueled by growth in unit volume as well as average selling prices, the firm said. As a result, Goldman analysts raised their Q4 iPhone revenue estimate by 22%, projecting 71% year-over-year growth.\n\nGrowth in Apple's wearables, home and accessories segment are also very robust at 36% year-over-year, likely benefiting from the reopening of Apple stores, the firm said.\n\nGoldman raised its forecasts for fiscal 2021 to 2023, now projecting Apple's fiscal Q4 revenue at $89.3 billion, from $83.1 billion previously. Consensus compiled by Capital IQ calls for revenue of $84.1 billion.\n\nGoldman raised its projection for Apple's fiscal Q4 per-share earnings to $1.32 from $1.12 previously. Consensus compiled by Capital IQ calls for Q4 adjusted earnings of $1.21 a share.\n\nApple shares were slightly higher in after-hours trade Wednesday after losing 1.2% in the regular session.\n_________________________________________________\n\n\nDeutsche Bank Adjusts Apple PT to $175 From $165, Maintains Buy Rating\t\n\nDeutsche Bank increased its price target on Apple (AAPL) to $175 from $165 following Q3 beat and raised Q4 outlook.\n\nAccording to the brokerage the company's revenue growth of 36% y/y in Q3 was driven mainly by iPhone (revenue growth of 50% y/y), but the performance across other products was healthy too, with all product segments growing revenue in the double-digits.\n\nThe brokerage said that it is also encouraged to see the company continuing to see strong demand in emerging markets, particularly in China, and this remains a meaningful opportunity for future share gains.\n\n___________________________________________________\nAnd the upgrades continue across the board\n___________________________________________________\n\n\nAdditional fiscal 3Q21 detail\n\nRegionally, fears of a weak showing in Greater China revenue proved unfounded as revenue from the region rose 58% annually. All other regions posted revenue growth in the 29%-34% range, including the Americas at 44% of sales, the largest region.\n\niPhone generated revenue of $39.6 billion representing 49% of total revenue which was a record for any June quarter and up 50%\nyear-over-year; notably, iPhone sales were about $4 billion above consensus. \n\nSince 2016, the 2Q-to-3Q sequential trend in iPhone has been an average 20% decline. But for the preceding two years of FY19 and FY20, the decline has been a more moderate 12% and just 9% in FY20. Fiscal 3Q21 iPhone revenue declined 17% from 2Q21, the first full quarter of 5G iPhones. \n\nAppears iPhone is strongest in the U.S., where it has chased away many other premium and mid-tier Android smartphones. The next largest revenue category, Services, posted all-time record revenue of $17.49 billion which represented 21% of total revenue; Services revenue\nwas up 33% annually and 3% sequentially. A key driver for services is the base of installed Apple devices, which once again hit a new all-time record.\n\nApple has more than 700 million paid subscriptions across all its platforms, which is four-times the number of paid subscriptions four years ago.\n\nWearables, Home & Accessories (WH&A) surprisingly moved into the number 3 revenue category in fiscal 3Q21, ahead of Mac and iPad. WH&A revenue of $8.78 billion. Growth was aided by new products including Apple TV 4K and Air Tags.\n\nMac revenue, 10% of total revenue was up 16% annually and down 10% sequentially. We believe the M1 chip has and will reinvigorate Mac sales going forward, particularly with the new macOS dubbed 'Monterey.' Like other products that are semiconductor-dependent, Mac faced supply constraints, yet still set a June-quarter revenue record.\n\niPad revenue, 9% of total revenue was up 12% annually and down a less than seasonal 6% sequentially. We believe putting the M1 chip\nin the new iPad Pro has stimulated interest in this product in time for the resurgence in enterprise IT spending. \n\nIn addition to a 7% increase in its quarterly dividend and a $90 billion increase in its share repurchase authorization announced in April 2021, Apple committed to $430 billion in U.S investments over a five-year period while adding 20,000 new U.S. jobs. It has also accelerated debt retirement.\n\n\nCash & short and long term investments were $193.6 billion at the end of fiscal 3Q21. \n\nCash was $191.8 billion at the end of FY20\nCash was $205.9 billion at the end of FY19\nCash was $237.1 billion at the end of FY18\nCash was $277.0 billion at the end of FY17\nCash was $237.6 billion at the end of FY16\n\nDebt was $121.8 billion at the end of fiscal 3Q21\n\nDebt was $112.4 billion at the end of FY20\n\nDebt was $108.1 billion at the end of FY19\n\nDebt was $114.5 billion at the close of FY18\n\nDebt was $115.7 billion at the end of FY17\n\nDebt was  $87.0 billion at the end of FY16 \n\nIn recent years, Apple has levered up in anticipation of more aggressive capital allocation.\n\n\nFor the first nine months of fiscal 2021, cash flow from operations was $83.8 billion vs. $60.1 billion in the year-earlier nine-month period.\n\n\nCash flow from operations was $80.7 billion in FY20 \n\nCash flow from operations was $69.4 billion in FY19\n\nCash flow from operations was $77.9 billion in FY18\n\nCash flow from operations was $69.4 billion in FY17",
        "created_utc": 1629650570.0,
        "subreddit_name": "AAPL",
        "comments": 0
    }
]