[
    {
        "title": "Part 4: After 4 Years Day Trading; 2 Years Full Time. Here's Some More Advice",
        "score": 478,
        "url": "https://www.reddit.com/r/Daytrading/comments/pw7op3/part_4_after_4_years_day_trading_2_years_full/",
        "content": " \n\nEvery 180 days I make another post to [thread it back to the original](https://www.reddit.com/r/Daytrading/comments/fw82ow/after_2_years_of_daytrading_7_months_full_time/) before it's archived. I do this to prevent a bunch of small posts every few days about trivial subjects.\n\n[Part 1](https://www.reddit.com/r/Daytrading/comments/fw82ow/after_2_years_of_daytrading_7_months_full_time/) (Same link as 'thread it back to the original.)\n\n[Part 2](https://www.reddit.com/r/Daytrading/comments/j3zlqi/my_1_year_anniversary_of_full_time_day_trading_3/)\n\n[Part 3](https://www.reddit.com/r/Daytrading/comments/mh0nfp/part_3_my_full_time_trading_career_1_year_since_i/)\n\n**This is Part 4,** and I'll go over life outside of trading. The previous 3 talked mostly about trading and the outline of my style is written in them. If you're just scrolling and want to know what it managing money when you're income is completely trading. Then so be it. Mind you this is my experience as a single, male, mid-20's, no debt (anymore), minimalist, full-time trader living in Texas.\n\n**TL;DR** \\- Full time trading has its pros and cons. The pros are obvious. The cons are what people don't talk about. The true cost of doing this as your source of income has the propensity to invite an extraordinary amount of stress. Trading is easy (very easy), it's the lifestyle that's not for the faint of heart because bills add up... And trading isn't gambling because statistics and risk management.\n\nHere's what I'll go over in this post:\n\n1. **The real cost of being full time** \\- *The main one I want to tackle because like I've said in the past, \"Risk management as a trader is 24/7.\" I touched up on this in Part 1 but I really want to break every single expense down and compare it to profits. Think about cost of living and what you're really giving up for this career such as health benefits, matching 401k, easy work, a consistent paycheck, and \\*job security\\*. This one will also answer the, \"****How much do I need to do this business full time?****\" Question.* ***It depends on your expenses.***\n2. **Psychology** \\- *Briefly. It's a simple subject/debate. Quick paragraph because that's really all there is to \"Psychology of trading\"*\n\nI thought about writing this in a, **\"Letter to myself 2 years ago\"** to potentially allow readers to read it vicariously like a letter to yourself written from yourself 2 years in the future but perhaps another time as a random post down the line.\n\nThere was consideration doing an **AMA** but [read The Wiki](https://www.reddit.com/r/Daytrading/wiki/getting-started-daytrading) if you want my patterns. *(I'm a mod here, I wouldn't mod a subreddit that suggests bad material. Everything to start you out is there. It's fantastic info)*. There's also a few videos on my Twitter from last year.\n\n**Before I begin:** Trading unfortunately has the propensity to attract gamblers. The entry barrier is so low you could start trading against the pros off a few apps on your phone. Allow that to digest before putting any risk out there. Yes, most lose. But redo that statistic with ONLY people that have a proven business plan backed by statistics then redact those who didn't follow the plan. If you have that with clear cut granular rules.. Fear is the only thing that will stop you from making this a healthy and respectable source of income. I would bet that the success rate would go north of 80%.\n\n***So we begin:***\n\n1) The Real Cost of Trading Full Time:\n\n**A)** I assume you know exactly what your expenses are *but for the sake of granularity.. let's tackle the meat of everyday people:*\n\n* **Mortgage (PITI) / Rent**\n* **Taxes on your house Home/Renters Insurance**\n* **Health Insurance -**\n* **Car Note (P&I only)**\n* **Car Insurance**\n* **Car Preventative Maintenance (Oil, Transmission Fluid, Servicing, Registration/Inspection)**\n* **Gas**\n* **Utilities**\n* **Wifi**\n* **CellPhone Bill**\n* **Groceries**\n* **And don't dare forget about your retirement or kid's 529 savings plan. Just because you trade stocks doesn't mean you don't need to invest. I do it. And yes it feels weird shorting NVDA for a day trade when that's my heaviest allocation since 2018.**\n* (We'll get to the biggest bamboozlement of them all in a while...Income taxes)\n\nNow add some ancillary things in there like: Gym membership, haircut, night out with S/O, gifts for family and friends birthdays, Christmas/Hanukah gifts, and other services but we'll just calculate the necessities then play around with the numbers a bit:\n\nFor visuals: [https://imgur.com/a/2LMW8QI](https://imgur.com/a/2LMW8QI)\n\n&#x200B;\n\nThese are absolute necessities not including ancillary expenses for homeowners. Of course if you're renting by yourself, with friends, or living at home, adjust for yourself. This isn't including the income taxes you'll pay at the end of the year.\n\n**So the grand total monthly expenses based on averages I found on Google based off of NerdWallet... $5,253. (Google it if you want. The article is from April 29th, 2021). Some consider savings and retirement to not be expenses but I'm not writing this to grasp at straws over trivial debates. This argument is, \"There's money that cannot be spent.. it's an expense to yourself\".**\n\nI'll take that number from above and round it to $5,000. That's way above mine given have the Texas Blue Title to my truck *(Chevy Runs Deep)*, rent my home, don't have health insurance.. [Got some controversial replies on that one](https://www.reddit.com/r/Daytrading/comments/ou2iws/full_time_traders_what_do_you_do_for_insurance/h70o062?utm_source=share&utm_medium=web2x&context=3) but hey, that's my risk. God Blessed me and I don't take it for granted.\n\nSo I'll tell you my monthly expenses although I feel its a little intrusive but I'm sure nobody I personally know reads my posts anyways. Just under $4,000/mo are my expenses for my necessities. Mind you... Single, Texas, Male, Minimalist, I loathe spending money, and I can have fun seeing if I can do more pushups than I did yesterday and throwing the baseball with my neighbor at the fields.\n\nLet's compare on a monthly basis. (When I say life of a trader isn't luxurious rather it is, \"Comfortable\", I mean it whole-heartedly.)\n\n**AVG Monthly Expenses (USA)**\n\n[https://imgur.com/a/sPnQMcX](https://imgur.com/a/sPnQMcX)\n\n**AVG Monthly Expenses (Me)**\n\n[https://imgur.com/a/1FeQhUi](https://imgur.com/a/1FeQhUi)\n\nAverage American Monthly Expenses. Of course this all varies from state to state. This could potentially be biased since I'm from Texas but it seemed decent to me. \\*\\*\\*\\*GRAND TOTAL:\\*\\*\\*\\* $5,085.\n\nNow we're starting to see the cutbacks I made to make a living from trading myself... No health insurance, I don't drive anything crazy, no matching in my retirement plan from my 9-5, I barely drive anywhere, cheap liability (don't give me a ticket) car insurance. \\*\\*\\*\\*GRAND TOTAL:\\*\\*\\*\\* $3,550 of necessities.\n\nHere's the psychology of all those numbers from above...\n\nI assume you know [what an R is](https://www.thebalance.com/risk-to-reward-ratio-1031350)...\n\nSo let's take the $5,000 number from earlier. Your monthly expenses that is. And we're talking theoretical backtesting. \\*\\*\\*\\*\\*\\*\\*NOT INCLUDING SLIPPAGE OR COMMISSIONS.\\*\\*\\*\\*\\*\\*\\*\n\n1. **At $500 risk.** You would need to make 10R per month **(EASY)** *(0.38R/day Avg. OR 1.9R/week)*\n2. **At $400 risk.** You would need to make 12.5R per month **(EASY)** *(0.59R/day Avg. OR 2.97R/week)*\n3. **At $250 risk.** You would need to make 20R per month **(Doable. Not guaranteed)** *(0.95R/day Avg. OR 4.76R/week)*\n4. **At $100 risk.** You would need to make 50R per month **(Not happening)** This is the risk amount I did when I resigned from my 9-5. Mind you I did personal training on the side.\n\n**I can make 10R in a month easily. It's happened in a day before**. [But can you also handle potentially losing $500? Or being up 1.8R then having the trade come back and stopping you out?](https://twitter.com/CJT2013/status/1366742864055664641) I can with $500 risk. Could I do that in 2019? **Absolutely not**. I'd have a blood pressure so high due to materializing my trades with what COULD happen and what bills that COULD have been paid as soon as the trade filled. Now in 2021? I do it almost everyday when my edge is shown but that's with years of statistics backing me. Have a look at my spreadsheet stats. I've had the same EV, Sharpe Ratio, Win Rate, key metrics, etc. for years.\n\n<spreadsheet stats>: [https://imgur.com/a/6AFzQVV](https://imgur.com/a/6AFzQVV)\n\nThis is what helps my \"Psychology\" and \"Headspace\" going into trades. This isn't something that can just be handed to you. It's years (months for some) of filling everything out then slicing and dicing data to make it work. \"It\" being your style of trading. It may not be the most profitable but it's something that you can manage mentally. It's years of, \"Why did I take that trade? What was I thinking? I don't want to even fill it out. I won't do it again.\" Fill out every trade and things will distill down into a strategy that's YOURS.\n\nI've built these over the years and they tell me the biggest run ups and drawdowns in a theoretical trading account. I know there will be months I make 5R after slippage and some months I make 35R... There will be days I'm up $2,750 in 5 minutes and other days I'm down $1,750 in less than 10 minutes... **There are ALSO DAYS that turn into WEEKS that I don't even touch an order ticket to put on a trade because you don't make money putting on trades. You make money in this business by putting large sums of calculated risk on high EV trades.**\n\n**Equity Curve Simulator I built:**\n\n[https://imgur.com/a/BBAyvuG](https://imgur.com/a/BBAyvuG)\n\n&#x200B;\n\nVisualize your data. It helps make things seem more real resulting in you honoring your business plan. If you're a man of your word, prove it by following your rules from your mouth.\n\nI've gone over how to handle losses before. It's simple, it's an expense just like Mark Douglas says.\n\n**Let's drop the pessimistic scarcity mindset and forget how you handle losses. How do you handle profits?**\n\nAre you responsible with them? There's this thing called, **\"Reversion to the mean\".** And we can utter the words, \"Oh yeah I know there will be losses and good weeks\" But do you sulk over 2 measly trades that ALMOST hit target but stopped you out? Do these 2 or 5 or 10 trades change how you trade forever? It shouldn't but I see it on here all the time people pouting over such a small sample size of trades looking for advice. You do realize there will be times you get smacked around then the market goes quiet for a few weeks leaving you making zero deals for a while from time to time. Do you really care about those 2R or 5R or is it the money that was attached to it? That's the loss side of things. The profiting side of things is different. People start to get cocky. I make more R than my theoretical testing occasionally because of missing trades (rarely). Does that mean I'm better than my backtesting? (You'll never beat your backtesting. It's impossible UNLESS you just so happen \"miss\" every losing trade your backtesting would have picked up).\n\nWith your extra profits/good weeks do you increase risk and or buy things you don't need? *\"I made $2,750 this week. I'll cover your golf game/buy your lunch\" <--Don't be this guy. (Not speaking from experience either srs)*\n\n•There will be weeks you make 13R\n\n•There will be weeks you lose 5R\n\n•There will be weeks you reach your limit down R\n\n•There will be times after you hit your limit down that there are no deals/trades to be made for WEEKS. Plural. Not just 1 week. Sometimes 2 and rarely 3 weeks. Almost an entire month of no trades.\n\n•There will be times where it seems like the market is handing you free money left and right to where you start to feel bad for people on the other side of your trades.\n\nTrading isn't a rose garden of free money, it will feel like that from time to time. It will also feel like an absolute money pit. But Central Limit Theorem / The Law of Large Numbers does its magic:\n\nActual vs Theory Performance & Growth-\n\n[https://imgur.com/a/Px4PGaT](https://imgur.com/a/Px4PGaT)\n\nPeople have the propensity to look at their performance through a microscope rather than taking a step back to look at the big picture. That's why it amazes me how people use such a small sample size of data (20 - 100 trades) then put large sums of risk on it. Only to pout about later INEVITABLE results. They complain over 2 trades. You will have tough weeks. Businesses do go through hard times and times of euphoria. Think of how people who rent beach houses in the winter vs summer.\n\nThe above picture is looking at the big picture. So let's zoom in to the first 5 months:\n\n[https://imgur.com/a/EHILbyq](https://imgur.com/a/EHILbyq)\n\n&#x200B;\n\nHow are you reacting when, \"The market is beating my performance. I'd have done better if I just put my money in the market or sold CC's. I'm only up $19,000 in 5 months when I should be up more than $30,000. I broke rules. I took more risk than I should have. I'll stop while I'm ahead\". How do you react in the other 23 hours in the day after trades result in losses day after day?\n\nThis is the magic/beauty of Central Limit Theorem / The Law of Large Numbers:\n\n[https://imgur.com/a/HYO51fu](https://imgur.com/a/HYO51fu)\n\n[https://imgur.com/a/GD1j79L](https://imgur.com/a/GD1j79L)\n\nI always say only 2 things can happen in a trade (hence its so EASY). Profit or loss. Heads or tails. This image is of 10 trials with 2 results. Think of the 10 trials like the 10 different times you start trading you strategy live. You might start with a hot streak or a streak of donations to Wall Street. Think of the 2 results as profit or loss. IN THE END. It all averages out, don't be pathetic and pout over 2 or 10 trades resulting in a less than desirable sum\n\n**So how do YOU decide how much you want to risk? Is it...**\n\n1. How much you want to make in a month divided by an R per month goal? NO.. The market doesn't know you. You can't force R's to happen. They come to you. There are entire 5 trading day weeks that I don't touch an order ticket. It's not everyday you make a deal.\n2. How much you think you can mentally handle? Not the best idea but it's a better idea.\n3. A cocktail of metrics such as how much buying power you have, Risk of Ruin, EV, and Sharpe Ratio. *(Notice how I don't care for Win-Rate? Win-Rate only tells/asks you 1 thing, \"Can you handle being right or wrong this percentage of the time?\")*\n\nIf I had to make a rule of thumb for somebody who wants to decide if they are ready to trade full time. It would have to be reverse engineered:\n\n**You need to find what your EV is and I'll show an example from a micro sample size of 10**\n\nYou really do require a large sum of data. I mean it when I say, \"1,000 trades minimum or a full year of backtesting\" (Full year because the market does shift but in the end does not effect a day trader's performance... in MY experience in the long run). Those who get a random 20 or 50 or even 100 and think they're ready to go up against professionals who have electricity bills higher than your yearly income because their computers are running algos and statistics 24/7...you'll learn fast.\n\n[https://imgur.com/a/ivfOxTo](https://imgur.com/a/ivfOxTo):\n\n6 trades that resulted in +2R. 4 trades that resulted in -1R. Average of all = 0.8.. \"Expected\" is just how statisticians say, \"Average\". What this is saying is you can EXPECT 80¢ for every dollar you risk on the amount of trades you're testing. This is why when I lose a trade OR profit on a trade. I don't think, \"Wow I made $958 after slippage.\" or \"Wow I lost $582 after slippage\". When I see my edge, I think to myself, \"Ok there's <EV> right there. I see income on every trade if it gets filled. Losing trades don't bother me. I have contingency plans... And don't ever say, \"I won that trade\". Businesses that sell <something> don't say, \"Oh cool we won\". You don't \"Win\" when you're assuming a risk. Trading isn't a game that you play.\n\n**2) Find how many trades on average you have. Let's say weeks 1-4. You have 20 trades on the first week, 1 on the second week, 0 on the third week, and 7 on the last week. (I'm using a micro-size sample here again. You really need A LOT more)**\n\n[https://imgur.com/a/PWYSqsH](https://imgur.com/a/PWYSqsH)\n\nI can EXPECT 7 trades per week (ETW). IF I can expect 7 trades per week and each trade will result in 80¢ for every dollar I risk... Is this enough to cover my expenses AND TAXES SO THE GOVERNMENT CAN WASTE IT ON CRAP THAT DOESN'T HELP THE PEOPLE WHO PAY THEM.. and a little more so I can have a life outside of home. 7 trades per week \\* $100 risk \\* 0.8 per trade = Gross Income of $560\n\nMaybe $560 (before taxes) is enough for you to survive. I don't know you or your personal finances, that's your business. For most.. it's not. So let's increase it to $250. For the sake of simplicity we know 250 ÷ 100 = 2.5. So $560 \\* 2.5 = $1,400 EXPECTED (not guaranteed) per week.. GROSS income. You'll have to determine how much you need to set aside for taxes when you have that year of data that tells you what you can EXPECT to make that year. This seems more like it... I like this.\n\n**3) Does your account size and margin parameters allow for this?:**\n\n&#x200B;\n\nLet's say you have $37,500 in your account that has 4:1 leverage which allows for $150,000 in DayTrading Buying Power...and you're risking $250 a trade... Risk ÷ StopSize = Shares/Contracts to buy --> Shares to buy \\* Price = Capital\n\n**Now let's visualize the data:**\n\n[https://imgur.com/a/FFEsLK3](https://imgur.com/a/FFEsLK3)\n\nThe 2nd position wouldn't have been able to be made. If you're running into buying power issues in your backtesting, either reduce your risk or find what's causing this. Perhaps it's the type of style you're trading or a certain pattern that has an inclination to exhaust buying power due to tight StopSizes (Tight StopSizes incur lots of slippage).\n\nNow most would say, \"Oh well I'll run into that if that ever happens. It's only 1 trade\". That's 100% wrong. Your goal is to be 100% efficient and copy your backtesting to a T. Trust me, it will happen, you will miss trades due to complacency when you haven't made a trade in over a week and you're a little rusty. So again in conclusion to the buying power metric, adjust accordingly.\n\n4) Risk of Ruin. Is it under 1%?\n\nThis is all discretionary. Me personally I want my RoR to be south of 0.25% but I've read many places that 1% is good. Probably just people repeating what everyone else says but that's just my opinion. How do you calculate it? There's a bunch of ways. [There](https://www.myfxbook.com/forex-calculators/risk-of-ruin-calculator) are a bunch of [different websites](https://2ndskiesforex.com/risk-of-ruin-calculator/) that do a pretty good job that tell it all for you. But if you want it for your spreadsheets so you can visualize it and see how it matures over time:\n\n[RoR formula.](https://imgur.com/a/95P9gy7)\n\nSo there it is! In conclusion. You take how much you need. Find your EV, see how many trades on average you get per day, week, month, quarter, etc., then see what's stopping you then assume that calculated risk by seeing what the odds of you failing are. That's the meat of it at least. There are a bunch others such as:\n\n•**Can you take that many trades and not miss any?** (It isn't smart to be firing off 30 trades a day. I know there are those who do it but like I've written before.. decision fatigue gets real. There's also a bunch of different ways to trade so I digress. Billions of dollars are exchanged between hands on NVDA on a daily basis. I might see 1 small edge on a 1' chart on 1 day out of the last 21 trading day month. Everyone sees fit trades all over the charts)\n\n•**Do you have an SOP for how you'll identify and enter your trades based on statistics?** For example I only allow for 10% of my R to be slipped on the entry because on average I get slipped on my stop outs 0.07R. So a losing trade could lose me 1.17R meanwhile the profiting trades achieve 1.9-1.99R depending on how bad I was filled according to my order tickets parameters.\n\nTake what info you got from your research and just pull the trigger. The market is liquid. A $50,000 position shouldn't faze you if you sized your position accordingly and set your StopLoss. Trading is a business. Take the leap if you're considering it. Just remember all the things you forfeit being independent from the normal job life. The market isn't going anywhere so you do have time and the time will never feel right.\n\n2) Psychology - ( 2 paragraphs is really all it is)\n\nAlthough I can summarize that subject in 4-5 sentences: \"Read a few trading books. Put the ideas on a spreadsheet and see the results. Now trust it, write a business plan, follow it, and trade it live if you like the backtest results.\" How much psychology does one need when:\n\n1. Price is Up or Down\n2. P/L is Green or Red\n3. Result is Profit or Loss\n4. A ticker is Showing Edge or No Edge\n5. It's Heads or Tails.\n\n**But here's the answer to your psychology of trading questions... You are crippling yourself when you trade money you CANNOT AFFORD to lose.** You're uncomfortable risking money you can't afford to lose and now want some tumblr quote to help you sleep better at night. We all become Steve Cohen/Paul Tudor Jones when it says, \"Simulated Paper Trading\" or when the screen has an orange trim around the perimeter. Trade live when you're risking money you couldn't care less about... Because that's how it should be.... *But make sure you can respect it at the same time <- That's an important one (srs). Anybody can hit dingers in a batting cage, shoot 3's at an LA Fitness, or hit their 5iron 200+ yards at a driving range.. but when it becomes real, people fold.* Done with that subject but I'm sure in 48 hours there will be a psychology post. If you want to improve this subreddit, just reply to those questions, \"Trade with money you can afford to lose and not lose sleep over\".\n\n**All done. So I'll leave it with this:**\n\nThink of my timeline from my first day as a full time trader. September 2019.\n\n•That drawdown I had just 1 month in. No more cushion 9-5 income, no benefits, and the drawdowns happen. Just have a safety net and a StopLoss to start looking for a job if your account/savings go below a predetermined number.\n\n•When you've got politicians proposing a 0.2% Financial Transaction Tax on all stock trades. Doesn't sound like much to the average Joe but it would have destroyed any trading business. [Take this trade](https://twitter.com/CJT2013/status/1339254005223071746) for example if that FTT was put into effect:\n\n**DISH** \\- $33.30/share by 800 shares = $26,500 trade IN and \\~$26,500 OUT | $53,000 moved.\n\n**TDOC** \\- $186.00/share by 158 shares = $30,000 trade IN and \\~$30,000 OUT | $60,000 moved.\n\n**SQ** \\- $223.25/share by 220 shares = $49,000 trade IN and \\~$49,000 OUT | $98,000 moved.\n\nThat was a net slippage day meaning I hit break even losing 2R on 2 trades and gained 2R on 1 trade.. 0R but slippage caused me to lose roughly $100.. Now add that FTT... $211,000 \\* 0.002 = $422 with a 0.2% FTT. Politicians would have ended this business for me and I love what trading life has afforded me.. time.\n\n•When March 2020 happened and the world shut down (Which put me in a position to start this thread). I couldn't train in a gym anymore for extra cash. There goes a source of income for me. I learned fast needless to say. You never know what's going to happen tomorrow. Me personally I leave it to God because it's in His hands. That's what helps take off the edge for me so whatever works for you, let it do its thing. There's lots of uncertainty in this business (as with any business) so either take the leap or not, just do it right. Following a written plan and honoring it day after day feels like a marathon but you learn to trust it.\n\nUntil March 2022! *(I've got some more time in this business for me.)*\n\n\\-CJT2013",
        "created_utc": 1632709025.0,
        "subreddit_name": "Daytrading",
        "comments": 47
    }
]