[
    {
        "title": "Why did aapl explode today?",
        "score": 13,
        "url": "https://www.reddit.com/r/AAPL/comments/penw49/why_did_aapl_explode_today/",
        "content": " I have been on the road and don’t see too many stories that would explain why it’s greatly out performing the market.  Not complaining, but curious!",
        "created_utc": 1630347722.0,
        "subreddit_name": "AAPL",
        "comments": 7
    },
    {
        "title": "Couldn't figure out why Musk was talking shit about $AAPL a few months back...",
        "score": 9,
        "url": "https://www.reddit.com/r/AAPL/comments/pemeil/couldnt_figure_out_why_musk_was_talking_shit/",
        "content": "Makes perfect sense now - sour grapes over losing out on LEO support.",
        "created_utc": 1630343328.0,
        "subreddit_name": "AAPL",
        "comments": 1
    },
    {
        "title": "AAPL Dark Cloud",
        "score": 5,
        "url": "https://twitter.com/champagnapapi_/status/1432444878189998082?s=21",
        "content": "",
        "created_utc": 1630366668.0,
        "subreddit_name": "AAPL",
        "comments": 6
    },
    {
        "title": "Globalstar Shares Soar on Rumors of iPhone 13 Satellite Calling Linkup",
        "score": 5,
        "url": "https://www.reddit.com/r/AAPL/comments/peoz9s/globalstar_shares_soar_on_rumors_of_iphone_13/",
        "content": "Globalstar (GSAT) shares jumped more than 42% Monday morning after reports named the mobile satellite services provider as a \"likely partner\" for Apple's (AAPL) new iPhone 13, which is expected to support satellite calling.\n\nThe iPhone 13 will use Qualcomm's (QCOM) X60 baseband chip to connect to low earth orbit satellites, Apple Insider reported Sunday, citing a research note by Ming-Chi Kuo, analyst for Hong Kong-based TF International Securities.\n\n\"There are many potential scenarios for Apple's business model cooperation with Globalstar,\" Apple Insider quoted from the research note. \"The simplest scenario is that if the user's operator has already teamed with Globalstar, the user can directly use Globalstar's satellite communication service on the iPhone 13 through the operator's service.\"",
        "created_utc": 1630350911.0,
        "subreddit_name": "AAPL",
        "comments": 2
    },
    {
        "title": "Apple Acquires Primephonic; Will Launch Dedicated Classical Music App in 2022",
        "score": 3,
        "url": "https://www.reddit.com/r/AAPL/comments/peoyg4/apple_acquires_primephonic_will_launch_dedicated/",
        "content": "Apple (AAPL) said Monday it has acquired classical music streaming service Primephonic for an undisclosed sum.\n\nThe company said Primephonic is now closed to new subscribers and will be taken offline, starting Sept. 7.\n\nApple said its Apple Music service will combine Primephonic's classical user interface with added features in a dedicated classical music app planned for launch in 2022.\n\nApple's shares are up 3% in afternoon trading. Earlier on Monday, it was reported the company's new iPhone 13 is expected to support satellite calling",
        "created_utc": 1630350843.0,
        "subreddit_name": "AAPL",
        "comments": 1
    },
    {
        "title": "AAPLE new phone",
        "score": 0,
        "url": "https://www.reddit.com/r/AAPL/comments/peapwa/aaple_new_phone/",
        "content": "Will Apple stock go up in September?",
        "created_utc": 1630296798.0,
        "subreddit_name": "AAPL",
        "comments": 5
    }
]