[
    {
        "title": "Barrons: Berkshire Hathaway Stock Is Behind the S&P over the past year + 5, 10, & 20 Years",
        "score": 376,
        "url": "https://www.reddit.com/r/stocks/comments/18q43qj/barrons_berkshire_hathaway_stock_is_behind_the_sp/",
        "content": "Berkshire Hathaway stock is having a disappointing finish to 2023, putting Warren Buffett’s conglomerate behind the S&P 500 over the past 10 years.\n\nThe Class A shares have lagged behind the S&P 500 by about nine percentage points during the current quarter and now are up about 16% in 2023. That compares with a roughly 26% total return for the index. \n\nThe shares are up an annualized 12% in the last 10 years, slightly behind the 12.2% yearly total return, including dividends, for the index. Berkshire also is behind the S&P 500 over the past five years with a 13.4% annualized return, compared with 16.4% for the index., according to Bloomberg calculations.\n\nBerkshire’s Class A shares were up 0.3% Friday to $542,600 while the Class B stock was 0.1% higher at $356.47.\n\nThe stock is roughly even with the index over the past 20 years with a 9.8% annualized return. That is despite dramatic growth in the company’s operating profits and Buffett’s coup in buying Apple stock, which is showing a nearly $150 billion gain for Berkshire. \n\nBerkshire stock’s lagging performance shows how difficult it is for even an investor of Buffett’s stature to beat an index driven by powerful megacap tech stocks, especially given Berkshire’s huge size. Its asset base is about $1 trillion.\n\nIt isn’t clear why the stock is lagging behind the market lately. The company is finishing what likely will be a record year for profits. After-tax operating earnings could rise more than 25% to nearly $40 billion in 2023. \n\nBerkshire’s big property and casualty insurance business is humming as Geico, the auto insurance unit, undergoes a profit turnaround. Berkshire’s $350 billion equity portfolio is topping the market this year led by Apple, which has gained 55% this year to about $194 a share. Apple accounts for nearly half the portfolio.\n\nThe Burlington Northern Santa Fe railroad, another of Berkshire’s key businesses, is more valuable this quarter thanks to the rally in shares of its chief rival, Union Pacific could be worth $150 billion, in line with Union Pacific, while all of Berkshire is now valued at about $775 billion.\n\nBerkshire also is benefiting from the sharp rise in short-term interest rates since early 2022. The company is sitting on more than $150 billion in cash that is mostly invested in U.S. Treasury bills yielding above 5%.\n\nIt could be that investors anticipate lower earnings on the cash next year, reasoning that the Federal Reserve may well cut short-term rates.\n\nThere also could be concern about Buffet’s age. He turned 93 in August, writing last month that he feels “good” but saying he is fully aware he is “playing in extra innings.” The fact that Berkshire could soon lose the leader that built the company over nearly 60 years was highlighted by the recent death of Berkshire Vice Chairman Charlie Munger at 99. \n\nBarron’s recently named Berkshire as a top stock for 2024 based on what looks like a reasonable valuation at 20 times projected 2024 earnings. The company is valued at 1.4 times our estimate of year-end 2023 book value of about $390,000 per class A share.\n\nBuffett may not have many years left at the helm but he seems as sharp and engaged as ever. He could still find the elephant-size acquisition totaling $50 billion or more that he has long sought.\n\nWhile he said last year that Berkshire has no interest in owning Occidental Petroleum  , Buffett could change his mind. Berkshire continues to add to its stake and now owns about 28% of the energy company. Occidental is valued at more than $50 billion, meaning Berkshire could well snap it up.\n\nhttps://www.barrons.com/articles/berkshire-hathaway-stock-warren-buffett-underperform-f9539619",
        "created_utc": 1703452686.0,
        "subreddit_name": "stocks",
        "comments": 103
    }
]