[
    {
        "title": "Next Miracle AVGO",
        "score": 203,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gr95bp/next_miracle_avgo/",
        "content": "From today's stock price pattern AVGO, almost reached its support level of 167, but I think this is an opportunity, from the graphics of the first two dips we can easily see that it did not fall below the support level, but to reach the support level quickly rebound at a time to break through to new highs!\n\nhttps://preview.redd.it/m5m9g1n7cw0e1.jpg?width=1189&format=pjpg&auto=webp&s=d1cab5fc95d5086d053f15991624bf0b2ede4588\n\nWith NVDA's earnings report about to be released, the market will usher in a new wave of AI, and this time I think he's in the same situation AVGO is about to rebound to 186 or break out to new highs again",
        "created_utc": 1731602834.0,
        "subreddit_name": "wallstreetbets",
        "comments": 137
    },
    {
        "title": "OpenAI, Google and Anthropic Are Struggling to Build More Advanced AI",
        "score": 129,
        "url": "https://www.bloomberg.com/news/articles/2024-11-13/openai-google-and-anthropic-are-struggling-to-build-more-advanced-ai",
        "content": "",
        "created_utc": 1731545049.0,
        "subreddit_name": "wallstreetbets",
        "comments": 81
    },
    {
        "title": "South Korea's \"Value Up\" program, and why Korean stocks will boom over the next decade.",
        "score": 122,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1grc49j/south_koreas_value_up_program_and_why_korean/",
        "content": "Korean stocks have long been undervalued, referred to as the \"Korean discount\". This is in part due to concerns over North Korea, low dividend payouts/buybacks relative to earnings, difficulty for retail investors to access Korean markets(other than ETFs),governance concerns of \"Chaebol\"(family controlled companies), foreign exchange rate risk, and most recently, tariffs.\n\nThe Korean market has grown increasingly cheaper recently, down 42% from its peak 3 years ago. Right now Korea's stock market is trading below book value(0.96x), compared to the US, which is trading at 4.8x book value.\n\nEarlier this year, South Korea unveiled a voluntary program called \"Value Up\", aimed to address this undervaluation. In addition to a lot of voluntary improvements in disclosures modeled after programs that pushes Japan's market to new highs, the program offers tax credits equal to 5% of the increases in buybacks/dividends. **The government is literally paying companies to buy back their stock**. Meanwhile in the US we tax stock buybacks. \n\nIn addition to these tax incentives to juice stock prices, South Korea has also cut corporate tax rates, cancelled a capital gains tax, and cut inheritance taxes.\n\nThere are some insanely cheap stocks in Korea, some examples:\n\n- SK Hynix, for example, is trading at 8.45x forward earnings. And they're growing very fast due to AI and the need for high speed memory for GPUs/AI chips. You will not find a growing company with AI customers in the US trading below 10x earnings.\n\n- Samsung, the largest company in Korea, is trading at 9x forward earnings. This is despite substantial growth over the past decade. While they do face struggles in their foundry business with their 3 nm process, they are a very diversified business, and still very profitable despite their challenges. If their next process fares better, there is tremendous upside. In comparison, TSMC trades at 23.38x forward earnings, Intel 28.01x.\n\n- Hyundai trades at 2.75x forward earnings, Kia 3.62X. Car companies usually trade at low PE during boom periods due to being cyclical and capital intensive, but to compare, GM has a forward P/E of 5.13, Ford 6.33, Tesla 99.14. So even after adjusting for industry, Korean auto companies are very cheap.\n\nWhen you combine cheap stocks with governments subsidizing dividends/buybacks, high returns seem very probable over the long term.\n\nWith the US market's P/E ratio hitting record highs despite rising bond yields, the Korean market seems like a really strong opportunity for investors concerned with valuations and looking to diversify\n\nPositions: I'm buying a lot of the etf EWY because I can't buy individual securities. I looked at FLKR because it supposedly had a lower Expense ratio, but it has somehow consistently underperformed EWY and has less liquidity, so I went with EWY.",
        "created_utc": 1731610275.0,
        "subreddit_name": "wallstreetbets",
        "comments": 94
    },
    {
        "title": "If you can't surpass them, become an ally! NVIDIA is leading the chip industry",
        "score": 87,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gr60dq/if_you_cant_surpass_them_become_an_ally_nvidia_is/",
        "content": "Recently I have been concerned about the dramatic changes in the chip industry, particularly the impact of the explosion in demand for artificial intelligence (AI) chips.25 years ago, Intel represented tech companies in the Dow Jones, and today, NVIDIA's shares have soared seven-fold, taking Intel's place as the new blue-chip stock. This shows that the industry's focus has shifted from traditional needs to AI applications.\n\nThere are three main challenges in the industry. First, most chip companies are lagging behind NVIDIA in designing and producing AI chips, with longer lead times as standards improve. Second, Intel is lagging behind TSMC and SK Hynix due to manufacturing delays and underinvestment, especially in the high-end chip market where TSMC's share is even 62%. Finally, high-end AI chips have much higher profit margins than traditional chips, which exacerbates the trend of “winner-take-all”, such as TSMC and SK Hynix's profits and share price have risen sharply, while Samsung and Intel look weak due to poor profits.\n\nI think in today's AI world dominated by Nvidia, global chipmakers may have no choice but to join Nvidia's supply chain if they can't catch up technologically.",
        "created_utc": 1731594598.0,
        "subreddit_name": "wallstreetbets",
        "comments": 39
    },
    {
        "title": "What other public companies might be at risk due to the rise of AI like ChatGPT?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gr4v2t/what_other_public_companies_might_be_at_risk_due/",
        "content": "After seeing Chegg's recent earnings report, it’s clear that AI advancements, like ChatGPT, can seriously disrupt certain businesses. I'm wondering what other public companies might face similar challenges or might be worth a short/put position due to the growing influence of AI.\n\nAre there companies you believe could see declines because of these advancements? For example, any businesses heavily dependent on customer service, educational content, or even basic SaaS tools that might be disrupted by free or low-cost AI alternatives? I'd love to hear thoughts on sectors or specific tickers to watch as potential downside plays.",
        "created_utc": 1731591232.0,
        "subreddit_name": "investing",
        "comments": 16
    },
    {
        "title": "Phone network employs AI \"grandmother\" to waste scammers' time with meandering conversations | Scambaiting, Abe Simpson-style",
        "score": 7528,
        "url": "https://www.techspot.com/news/105571-phone-network-employs-ai-grandmother-waste-scammers-time.html",
        "content": "",
        "created_utc": 1731586203.0,
        "subreddit_name": "technology",
        "comments": 159
    },
    {
        "title": "Apple’s Machine Learning Research can now detect Heart Murmurs with 95% accuracy",
        "score": 1598,
        "url": "https://www.myhealthyapple.com/apples-machine-learning-research-can-now-detect-heart-murmurs-with-95-accuracy/",
        "content": "",
        "created_utc": 1731552568.0,
        "subreddit_name": "apple",
        "comments": 104
    },
    {
        "title": "Apple faces UK 'iCloud monopoly' compensation claim worth $3.8 billion ",
        "score": 965,
        "url": "https://techcrunch.com/2024/11/13/apple-faces-uk-icloud-monopoly-compensation-claim-worth-3-8-billion/",
        "content": "",
        "created_utc": 1731556942.0,
        "subreddit_name": "apple",
        "comments": 449
    },
    {
        "title": "ChatGPT for macOS now works with third-party apps, including Apple’s Xcode",
        "score": 918,
        "url": "https://9to5mac.com/2024/11/14/chatgtp-macos-third-party-apps/?extended-comments=1",
        "content": "",
        "created_utc": 1731611152.0,
        "subreddit_name": "apple",
        "comments": 109
    },
    {
        "title": "Resident Evil 2 Coming to iPhone, iPad, and Mac on December 10",
        "score": 396,
        "url": "https://www.macrumors.com/2024/11/14/resident-evil-2-iphone-ipad-mac-dec-10/",
        "content": "",
        "created_utc": 1731591952.0,
        "subreddit_name": "apple",
        "comments": 90
    },
    {
        "title": "Google Releases Standalone Gemini AI App for iPhone",
        "score": 388,
        "url": "https://www.macrumors.com/2024/11/14/google-releases-gemini-ai-app-iphone/",
        "content": "",
        "created_utc": 1731583194.0,
        "subreddit_name": "apple",
        "comments": 97
    },
    {
        "title": "Logic Pro for Mac and iPad updated with Quantec Room Simulator",
        "score": 197,
        "url": "https://9to5mac.com/2024/11/13/apple-logic-pro-quantec-room/",
        "content": "",
        "created_utc": 1731546051.0,
        "subreddit_name": "apple",
        "comments": 7
    },
    {
        "title": "Final Cut Pro 11: Apple Shares List of All New Features and Bug Fixes",
        "score": 163,
        "url": "https://www.macrumors.com/2024/11/14/final-cut-pro-11-release-notes/",
        "content": "",
        "created_utc": 1731613854.0,
        "subreddit_name": "apple",
        "comments": 13
    },
    {
        "title": "Daily Advice Thread - November 14, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/apple/comments/1gr2avy/daily_advice_thread_november_14_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1731582029.0,
        "subreddit_name": "apple",
        "comments": 30
    },
    {
        "title": "Bluesky Hits Top of Apple App Store as Users Seek X Alternative",
        "score": 4342,
        "url": "https://www.thewrap.com/bluesky-social-users-increase-x-elon-musk-twitter/",
        "content": "",
        "created_utc": 1731605361.0,
        "subreddit_name": "technology",
        "comments": 192
    },
    {
        "title": "FBI raids home and seizes phone of Polymarket founder | Technology",
        "score": 3048,
        "url": "https://www.theguardian.com/technology/2024/nov/13/fbi-raid-polymarket-founder-trump-election",
        "content": "",
        "created_utc": 1731546456.0,
        "subreddit_name": "technology",
        "comments": 234
    },
    {
        "title": "Apple accused of trapping and ripping off 40m iCloud customers",
        "score": 1069,
        "url": "https://www.bbc.co.uk/news/articles/c20g50ny53eo",
        "content": "",
        "created_utc": 1731549635.0,
        "subreddit_name": "technology",
        "comments": 201
    },
    {
        "title": "Apple facing near-£3bn UK lawsuit over cloud storage ‘monopoly’",
        "score": 63,
        "url": "https://www.theguardian.com/technology/2024/nov/14/apple-facing-near-3bn-uk-lawsuit-cloud-storage-competition-law",
        "content": "",
        "created_utc": 1731565398.0,
        "subreddit_name": "technology",
        "comments": 12
    },
    {
        "title": "Apple vs Market SSD prices: How the gap grew from 3x to 12-24x",
        "score": 2036,
        "url": "https://i.redd.it/huqqjqhveu0e1.png",
        "content": "",
        "created_utc": 1731579564.0,
        "subreddit_name": "mac",
        "comments": 277
    },
    {
        "title": "Stolen MacBook Pro M1 ",
        "score": 607,
        "url": "https://www.reddit.com/gallery/1gqxj6m",
        "content": "Title, while I was at the gym yesterday, someone used a repeater to snatch my keyfob signal get in my car and take my laptop. I was able to do all these things but I’m concerned because it says location services off my find my is on? I’m not able to find the location even though I was able to successfully lock the computer. Any tips on what I can do? I have friends in high levels of the local PD and will be going to through the cameras in the local establishments to try and catch these assholes. My whole academic life is on that thing and I didn’t get to back everything up in the past 3 months.",
        "created_utc": 1731561147.0,
        "subreddit_name": "mac",
        "comments": 108
    },
    {
        "title": "MacBook Air M1 Swap Usage | How much RAM do I need? ",
        "score": 40,
        "url": "https://i.redd.it/wsnknxvivv0e1.png",
        "content": "",
        "created_utc": 1731597243.0,
        "subreddit_name": "mac",
        "comments": 37
    },
    {
        "title": "Upgrade my Mac",
        "score": 21,
        "url": "https://i.redd.it/0pohcipmrw0e1.jpeg",
        "content": "Hey there. Have a semi old MacBook Pro that's 6 years old - I do a lot of video editing and have noticed specifically in the last 6 months how slow it's moving. Is there any (preferably... affordable of course) upgrades I can add to the computer to make it run faster? Thank you in advance! ",
        "created_utc": 1731608003.0,
        "subreddit_name": "mac",
        "comments": 21
    },
    {
        "title": "Telegram Icon from Launchpad keep showing on my desktop",
        "score": 16,
        "url": "https://i.redd.it/296j9lbesr0e1.png",
        "content": "",
        "created_utc": 1731547772.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Does apple care cover little cracks on the screen",
        "score": 15,
        "url": "https://i.redd.it/nton8a8tnw0e1.jpeg",
        "content": "",
        "created_utc": 1731606719.0,
        "subreddit_name": "mac",
        "comments": 21
    },
    {
        "title": "Apple, please allow us to mirror our iPhones with hotspot. ",
        "score": 10,
        "url": "https://i.redd.it/tsjqqy36vw0e1.png",
        "content": "",
        "created_utc": 1731609247.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "First ever mac ",
        "score": 10,
        "url": "https://www.reddit.com/r/mac/comments/1grcigd/first_ever_mac/",
        "content": "Hello everyone, just wanted to say I got my first ever Mac and this device is so good! It's so much better than my Windows laptop in terms of battery life but not as well as advertised. I decided to get the M2 Macbook air. ",
        "created_utc": 1731611278.0,
        "subreddit_name": "mac",
        "comments": 8
    },
    {
        "title": "Mac wrongly saying iPhone has low batterie while tethering",
        "score": 4,
        "url": "https://www.reddit.com/gallery/1gqz7zy",
        "content": "Since a few weeks when tethering my Mac propose to disconnect from my iPhone cause of low battery but it’s not the case. Starting to be annoying.\n\nIs it a known issue ? Do anyone knows how to fix this ?",
        "created_utc": 1731567803.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "Samsung T7 SSD",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1grh3rx/samsung_t7_ssd/",
        "content": "Hi all,\n\nRecently got the above SSD drive. Have gone to format it to APFS, selected the \"view all\" option and tried to format the parent folder as guides have suggested but APFS still isn't showing as an option.\n\nHave formatted as Mac OS Extended to see if that would then let it be formatted as APFS but no avail.\n\niMac 24\" M1 2021, Sequoia 15.0.1\n\nAny ideas?",
        "created_utc": 1731623194.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "M2452 Apple USB Keyboard Repair",
        "score": 3,
        "url": "https://i.redd.it/r3icpdvtlw0e1.jpeg",
        "content": "Keyboard has a working, but mushy, Right Arrow key.   Plucked the keycap. Looks like the silicone nipple was torn (hopefully before I plucked that keycap).\n\nIf I chose to go down the rabbit hole, how can I fix this? ",
        "created_utc": 1731606053.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "siri only works while connected to AirPods ",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1grgvk3/siri_only_works_while_connected_to_airpods/",
        "content": "a few weeks ago my MacBook Air 2015 gave up on me and I was left with no laptop as I need one for collage work on office and internet browsing/streaming I purchased a MacBook Air 2018 from eBay for a reasonable price as it had a new battery and Phonecheck certification so far it works great and is quite the upgrade anyway to the issue at hand everything works fine on it except siri only works with AirPods connected ive tried resetting the smc and all of the obvious steps including checking the screen time settings ive tried running \"tccutil reset Microphone\" and it didn't work the microphone in the Mac works fine I have used teams and FaceTime with no issue so its obviously a bug or something with the system right anything else I can try or any advise? running 14.7.1 latest for my Mac\n\nhttps://preview.redd.it/m15r0fe3zx0e1.png?width=2880&format=png&auto=webp&s=1d3d8b62cdd9773059eccb6da289ec73ac973b82\n\nhttps://preview.redd.it/vco9rez1zx0e1.png?width=2880&format=png&auto=webp&s=e3894a841dcf9e2e10485616fcc12ee391c412a6\n\nhttps://preview.redd.it/yocfovy0zx0e1.png?width=2880&format=png&auto=webp&s=01abc214768a34e85c71c6d2d90d97385b50e59c\n\n",
        "created_utc": 1731622574.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "I need to use an Xbox controller as a Mouse",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1grgmoc/i_need_to_use_an_xbox_controller_as_a_mouse/",
        "content": "I am an computer repair technician and I have a 93 year old client with Parkinson\\`s, they complained to me that they have problems using the mouse on their iMac. We tried to use voice control but it did not go well. I then decided that I wanted to build an accessible mouse that allowed said user to use buttons to move the mouse, as well as perform other functions. I am not handy enough to build a specialty device and program it on my own, so I decided to go with an Xbox Adaptive controller instead. \n\nhere are my main desires\n\nI want to use the xbox D-Pad buttons to move the mouse \n\nI want to use the left and right bumpers as the mouse buttons\n\nI want to use the face buttons to activate shortcuts. (im pretty sure i know how to do this)\n\nthe big thing is I need to use the D-pad to control the mouse. ",
        "created_utc": 1731621914.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Does anyone have a recommended docking station for a MacBook Pro?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gre2fr/does_anyone_have_a_recommended_docking_station/",
        "content": "Hi, I've been looking for a docking station for my MacBook Pro (M4 Max, 2024), and I'm trying to find out which dock I should buy. I have been looking around, but all I could find is quite pricey, and some meet all my requirements but don't mention anything about being supported on Mac/macOS. My screen I'm trying to connect to is the Samsung 49\" Odyssey OLED G9 G93SC.\n\nMy requirements for the docking station are:\n\n1. The dock has to have Thunderbolt and DisplayPort ports.\n2. The dock has to support the resolution 5120x1440 or higher at 120 or 240Hz and HDR if possible.\n3. The dock must be fully compatible with Mac/macOS and operate reliably.\n4. The dock has to be reasonably priced. However, I would appreciate any recommendations regardless of price.\n\nSo, please, if you have a docking station that meets all these requirements and has worked every day since you bought it with little to no problems at all, please write them in the comments section.\n\nThanks!",
        "created_utc": 1731615245.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Want a hub to use another screen as my main display. Which one ?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1grdh8z/want_a_hub_to_use_another_screen_as_my_main/",
        "content": "Hi !  \nI'm planning on buying an Odyssey G6 32\" G65B to replace my old FHD screen, mainly for my PC setup via Display port.  \nI also have an M3 MacBook Air that I want to connect to it via HDMI that I'm using for music production.  \nSo first question : will it support 240Hz @ 2K or will it be 144Hz (since it's 2.1). \nSecond question : Which dock/hub do you recommend, I'm planning on keeping the Mac lid shut and I'd need at least 1 USB-C/TB + 2 USB-A. The more low-key it is the better. I had my eyes on the Satechi Dual Dock Stand. Would this work ? The NVME enclosure is a plus for me but idk if the HDMI is good for 2K with max refresh rate (says 4K@60Hz).  \nThank you!",
        "created_utc": 1731613737.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Which used intel MacBook to buy?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1grcccl/which_used_intel_macbook_to_buy/",
        "content": "Hi all! For reasons, I want to buy an intel MacBook Pro. Wondering which model to buy. Use case is: Daily driver for work / school + occasional light gaming. I intend to dual boot with windows 10. I know I’m probably looking at something in the 2012-2019 range, but interested in other opinions before I grab something. I’ve been scouting on back market, but want to make sense of them. Also, for reference, right now I have the 2017 i5 MacBook Pro that got me through undergrad and I’m *not* happy with it anymore (it has major keyboard and screen issues, and it’s pretty underpowered).",
        "created_utc": 1731610857.0,
        "subreddit_name": "mac",
        "comments": 27
    },
    {
        "title": "Please help: need to know how best to purchase an iMac ONLY for one task",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gr9dva/please_help_need_to_know_how_best_to_purchase_an/",
        "content": "Hi guys, I am trying to finish work on a book I've been writing, but have been procrastinating for YEARS on this and am sick of it. I have 20% of it left to write, and someone suggested buying a computer for very cheap and using it as a workstation (rather than my laptop), not connecting it to the Internet so that I don't get distracted during my writing.\n\nAs a result, I'd like to get an old iMac and pay as little for it as possible (since I'll literally be using Word only and nothing else). I know eBay and FB Marketplace, but does anyone know any resellers that sell safe equipment such as the above that I can be confident purchasing from? It would literally be for using Word and nothing else, so HD space and RAM and all that is not important.\n\nThanks very much for your help in advance.",
        "created_utc": 1731603455.0,
        "subreddit_name": "mac",
        "comments": 7
    },
    {
        "title": "Mac Mini + PC Shared Peripherals ",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gqrunc/mac_mini_pc_shared_peripherals/",
        "content": "Hi everyone! \n\n  \nI recently got a mac mini as I've never really had a personal computer and the price was just too hard to say no. My current set up is as follows: an Aorus 42 inch monitor, an Iquinix bluetooth mechanical keyboard, & a logitech G508 mouse. \n\n  \nNormally, I use the work pc as a desktop computer where I close the lid and connect everything via bluetooth. My struggle is that I don't have a good way to switch between the Mac Mini & my work laptop while keeping the same bluetooth mouse & kb. Because the Mac Mini isn't a laptop, if the bluetooth doesn't work I have to grab a cable and directly connect which is a huge pain. \n\n  \nIs there a good way to connect my kb & mouse to the Aorus monitor directly? That way no matter the input device (my work PC or the Mac Mini) I can still use it with the same bluetooth device? Is the best way to just have two keyboards and two mice for each dedicated input? \n\n  \nAny advice is greatly appreciated! ",
        "created_utc": 1731543303.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "AirPods Pro hacked using Faraday cage and microwave as a jammer to fool geofencing — enthusiast activates hearing aids feature in AirPods Pro in geoblocked India",
        "score": 61,
        "url": "https://www.tomshardware.com/peripherals/wearable-tech/airpods-pro-hacked-using-faraday-cage-and-microwave-as-a-jammer-to-fool-geofencing-enthusiast-activates-hearing-aids-feature-in-airpods-pro-in-geoblocked-india",
        "content": "",
        "created_utc": 1731575283.0,
        "subreddit_name": "gadgets",
        "comments": 7
    },
    {
        "title": "Dynabook Unveils Its Lightest-Ever 13.3-inch Premium-Performance Business Laptop with a Metal Chassis - the Portégé X30L-M",
        "score": 52,
        "url": "https://markets.ft.com/data/announce/detail?dockey=600-202410151130PR_NEWS_USPRX____LA30875-1",
        "content": "",
        "created_utc": 1731624280.0,
        "subreddit_name": "gadgets",
        "comments": 14
    },
    {
        "title": "Apple Accused of Trapping 40 Million UK Customers Into iCloud Service",
        "score": 204,
        "url": "https://www.macrumors.com/2024/11/14/apple-uk-lawsuit-trapping-icloud-customers/",
        "content": "",
        "created_utc": 1731582176.0,
        "subreddit_name": "technews",
        "comments": 61
    },
    {
        "title": "New Google Pixel AI feature analyzes phone conversations for scams",
        "score": 8,
        "url": "https://www.bleepingcomputer.com/news/google/new-google-pixel-ai-feature-analyzes-phone-conversations-for-scams/",
        "content": "",
        "created_utc": 1731557293.0,
        "subreddit_name": "technews",
        "comments": 2
    },
    {
        "title": "r/Stocks Daily Discussion & Options Trading Thursday - Nov 14, 2024",
        "score": 18,
        "url": "https://www.reddit.com/r/stocks/comments/1gr1w6a/rstocks_daily_discussion_options_trading_thursday/",
        "content": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nRequired info to start understanding options:\n\n* [Call option Investopedia video](https://www.investopedia.com/terms/c/calloption.asp) basically a call option allows you to buy 100 shares of a stock at a certain price (strike price), but without the obligation to buy\n* [Put option Investopedia video](https://www.investopedia.com/terms/p/putoption.asp) a put option allows you to sell 100 shares of a stock at a certain price (strike price), but without the obligation to sell\n* Writing options switches the obligation to you and you'll be forced to buy someone else's shares (writing puts) or sell your shares (writing calls)\n\nSee the following word cloud and click through for the wiki:\n\n[Call option - Put option - Exercising an option - Strike price - ITM - OTM - ATM - Long options - Short options - Combo - Debit - Credit or Premium - Covered call - Naked - Debit call spread - Credit call spread - Strangle - Iron condor - Vertical debit spreads - Iron Fly](https://www.reddit.com/r/stocks/wiki/options-themed-post)\n\nIf you have a basic question, for example \"what is delta,\" then google \"investopedia delta\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1731580210.0,
        "subreddit_name": "stocks",
        "comments": 326
    },
    {
        "title": "Distribution of your assets between cash/stocks while the market is overvalued?",
        "score": 3,
        "url": "https://www.reddit.com/r/stocks/comments/1gqyebb/distribution_of_your_assets_between_cashstocks/",
        "content": "It’s pretty clear that the market has hit insane valuations, and has already been discussed to death. My question is: have you all started to trim your stock positions for more cash to hedge risk of a market downturn, or will you continue to stay at the previous distribution you had prior to this years rally? For example, if you were 70% stock 30% cash/bonds prior to the bull market, have you adjusted your ratios in response to the current valuation (ex to 40% stock 60% cash) or stick with 70%/30%?\n\nMy personal strategy was extremely aggressive during the previous bear market (100% of my networth minus 10k for emergencies was in QQQ). I started trimming this after the valuations got higher and I am sitting around 70% stocks/30% cash currently. I am intending to push this to 50% stocks if the market rallies more",
        "created_utc": 1731564328.0,
        "subreddit_name": "stocks",
        "comments": 68
    },
    {
        "title": "SPY gains. They call me agent 007",
        "score": 88,
        "url": "https://www.reddit.com/gallery/1grcop7",
        "content": "Mostly spy 0dte puts and some calls that boned me.",
        "created_utc": 1731611716.0,
        "subreddit_name": "wallstreetbets",
        "comments": 94
    },
    {
        "title": "PLTR to Move from NYSE to NASDAQ: Could QQQ Addition Spark a Rally?",
        "score": 39,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1grfucj/pltr_to_move_from_nyse_to_nasdaq_could_qqq/",
        "content": "**Palantir Technologies Inc.** on **November 14, 2024 filed an 8k** detailing the company's decision to transfer its stock listing from the **New York Stock Exchange (NYSE)** to the **Nasdaq Global Select Market (Nasdaq)**. This move will officially take place after market close on **November 25, 2024**, with trading on Nasdaq beginning on **November 26, 2024** under the same ticker symbol, **PLTR**.\n\n# Key Highlights:\n\n1. **Transfer of Listing**: Palantir notified the NYSE of its voluntary decision to move its Class A Common Stock listing to Nasdaq. This change is part of the company’s strategic move, potentially allowing it to meet eligibility requirements for inclusion in the **Nasdaq-100 Index**, a move that could increase visibility and attract new investors.\n2. **Regulation FD Disclosure**: Alongside this notice, Palantir has issued a press release (Exhibit 99.1) informing the public of the transfer and addressing forward-looking statements related to its Nasdaq listing, potential index eligibility, and other speculative benefits.\n3. **Forward-Looking Statements**: Palantir outlined expectations about the Nasdaq listing, but also noted that these statements involve risks and uncertainties that could affect actual outcomes.\n\nThis transition to Nasdaq could indeed position **PLTR** for potential inclusion in tech-focused indexes like the **Nasdaq-100 (QQQ)**, which may increase trading volume and attract more institutional investors. As of November 14, 2024, institutional investors hold approximately 45.65% of Palantir Technologies Inc. (PLTR) stock[.](https://imgur.com/a/zrjFxK0)\n\nPLTR SEC Filing - [https://d18rn0p25nwr6d.cloudfront.net/CIK-0001321655/c3c0bd39-8665-49b6-a7d0-778157844a56.pdf](https://d18rn0p25nwr6d.cloudfront.net/CIK-0001321655/c3c0bd39-8665-49b6-a7d0-778157844a56.pdf)",
        "created_utc": 1731619854.0,
        "subreddit_name": "wallstreetbets",
        "comments": 41
    },
    {
        "title": "Husband/Wife - all in on VOO vs. VTI or? ",
        "score": 25,
        "url": "https://www.reddit.com/r/investing/comments/1grdzoi/husbandwife_all_in_on_voo_vs_vti_or/",
        "content": "Husband and I swapped out of our current positions.\n\n$200k Rollover IRA for him (fidelity) \n\n\n$180k Brokerage account for me (vanguard)\n\nI have another 150k in QQQ, SPY, VUG, VXF, and APPL. (Have held these for over 10 years and based on my previous posts some suggest I shouldn’t sell out of these to switch bc of taxes/fees)  (vanguard) \n\nWe don’t have any other investment accounts for now and our goals are a different convo. We’re just starting to reposition our funds based on me stalking this subreddit along with bogleheads, FIRE, etc.\n\nQuestion is: \n\n1.) Should we put all of it in VOO and VTI? (He wants VOO, I want VTI.) We are thinking yes, but is there a reason we shouldn’t? We want to leave it for 15 years. \n\n2.) Also, should we do it now? Like today, this week?\n\n3.) Should we do it all at once, bulk buy? \n\nThanks!\n\nTLDR: Should we lump sum invest $200k in VOO and $180k in VTI and leave for min. 15 years? \n\n",
        "created_utc": 1731615043.0,
        "subreddit_name": "investing",
        "comments": 73
    }
]