[
    {
        "title": "Next Miracle AVGO",
        "score": 203,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gr95bp/next_miracle_avgo/",
        "content": "From today's stock price pattern AVGO, almost reached its support level of 167, but I think this is an opportunity, from the graphics of the first two dips we can easily see that it did not fall below the support level, but to reach the support level quickly rebound at a time to break through to new highs!\n\nhttps://preview.redd.it/m5m9g1n7cw0e1.jpg?width=1189&format=pjpg&auto=webp&s=d1cab5fc95d5086d053f15991624bf0b2ede4588\n\nWith NVDA's earnings report about to be released, the market will usher in a new wave of AI, and this time I think he's in the same situation AVGO is about to rebound to 186 or break out to new highs again",
        "created_utc": 1731602834.0,
        "subreddit_name": "wallstreetbets",
        "comments": 137
    },
    {
        "title": "OpenAI, Google and Anthropic Are Struggling to Build More Advanced AI",
        "score": 129,
        "url": "https://www.bloomberg.com/news/articles/2024-11-13/openai-google-and-anthropic-are-struggling-to-build-more-advanced-ai",
        "content": "",
        "created_utc": 1731545049.0,
        "subreddit_name": "wallstreetbets",
        "comments": 81
    },
    {
        "title": "South Korea's \"Value Up\" program, and why Korean stocks will boom over the next decade.",
        "score": 122,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1grc49j/south_koreas_value_up_program_and_why_korean/",
        "content": "Korean stocks have long been undervalued, referred to as the \"Korean discount\". This is in part due to concerns over North Korea, low dividend payouts/buybacks relative to earnings, difficulty for retail investors to access Korean markets(other than ETFs),governance concerns of \"Chaebol\"(family controlled companies), foreign exchange rate risk, and most recently, tariffs.\n\nThe Korean market has grown increasingly cheaper recently, down 42% from its peak 3 years ago. Right now Korea's stock market is trading below book value(0.96x), compared to the US, which is trading at 4.8x book value.\n\nEarlier this year, South Korea unveiled a voluntary program called \"Value Up\", aimed to address this undervaluation. In addition to a lot of voluntary improvements in disclosures modeled after programs that pushes Japan's market to new highs, the program offers tax credits equal to 5% of the increases in buybacks/dividends. **The government is literally paying companies to buy back their stock**. Meanwhile in the US we tax stock buybacks. \n\nIn addition to these tax incentives to juice stock prices, South Korea has also cut corporate tax rates, cancelled a capital gains tax, and cut inheritance taxes.\n\nThere are some insanely cheap stocks in Korea, some examples:\n\n- SK Hynix, for example, is trading at 8.45x forward earnings. And they're growing very fast due to AI and the need for high speed memory for GPUs/AI chips. You will not find a growing company with AI customers in the US trading below 10x earnings.\n\n- Samsung, the largest company in Korea, is trading at 9x forward earnings. This is despite substantial growth over the past decade. While they do face struggles in their foundry business with their 3 nm process, they are a very diversified business, and still very profitable despite their challenges. If their next process fares better, there is tremendous upside. In comparison, TSMC trades at 23.38x forward earnings, Intel 28.01x.\n\n- Hyundai trades at 2.75x forward earnings, Kia 3.62X. Car companies usually trade at low PE during boom periods due to being cyclical and capital intensive, but to compare, GM has a forward P/E of 5.13, Ford 6.33, Tesla 99.14. So even after adjusting for industry, Korean auto companies are very cheap.\n\nWhen you combine cheap stocks with governments subsidizing dividends/buybacks, high returns seem very probable over the long term.\n\nWith the US market's P/E ratio hitting record highs despite rising bond yields, the Korean market seems like a really strong opportunity for investors concerned with valuations and looking to diversify\n\nPositions: I'm buying a lot of the etf EWY because I can't buy individual securities. I looked at FLKR because it supposedly had a lower Expense ratio, but it has somehow consistently underperformed EWY and has less liquidity, so I went with EWY.",
        "created_utc": 1731610275.0,
        "subreddit_name": "wallstreetbets",
        "comments": 94
    },
    {
        "title": "If you can't surpass them, become an ally! NVIDIA is leading the chip industry",
        "score": 87,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gr60dq/if_you_cant_surpass_them_become_an_ally_nvidia_is/",
        "content": "Recently I have been concerned about the dramatic changes in the chip industry, particularly the impact of the explosion in demand for artificial intelligence (AI) chips.25 years ago, Intel represented tech companies in the Dow Jones, and today, NVIDIA's shares have soared seven-fold, taking Intel's place as the new blue-chip stock. This shows that the industry's focus has shifted from traditional needs to AI applications.\n\nThere are three main challenges in the industry. First, most chip companies are lagging behind NVIDIA in designing and producing AI chips, with longer lead times as standards improve. Second, Intel is lagging behind TSMC and SK Hynix due to manufacturing delays and underinvestment, especially in the high-end chip market where TSMC's share is even 62%. Finally, high-end AI chips have much higher profit margins than traditional chips, which exacerbates the trend of “winner-take-all”, such as TSMC and SK Hynix's profits and share price have risen sharply, while Samsung and Intel look weak due to poor profits.\n\nI think in today's AI world dominated by Nvidia, global chipmakers may have no choice but to join Nvidia's supply chain if they can't catch up technologically.",
        "created_utc": 1731594598.0,
        "subreddit_name": "wallstreetbets",
        "comments": 39
    },
    {
        "title": "What other public companies might be at risk due to the rise of AI like ChatGPT?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gr4v2t/what_other_public_companies_might_be_at_risk_due/",
        "content": "After seeing Chegg's recent earnings report, it’s clear that AI advancements, like ChatGPT, can seriously disrupt certain businesses. I'm wondering what other public companies might face similar challenges or might be worth a short/put position due to the growing influence of AI.\n\nAre there companies you believe could see declines because of these advancements? For example, any businesses heavily dependent on customer service, educational content, or even basic SaaS tools that might be disrupted by free or low-cost AI alternatives? I'd love to hear thoughts on sectors or specific tickers to watch as potential downside plays.",
        "created_utc": 1731591232.0,
        "subreddit_name": "investing",
        "comments": 16
    },
    {
        "title": "Phone network employs AI \"grandmother\" to waste scammers' time with meandering conversations | Scambaiting, Abe Simpson-style",
        "score": 7528,
        "url": "https://www.techspot.com/news/105571-phone-network-employs-ai-grandmother-waste-scammers-time.html",
        "content": "",
        "created_utc": 1731586203.0,
        "subreddit_name": "technology",
        "comments": 159
    },
    {
        "title": "Apple’s Machine Learning Research can now detect Heart Murmurs with 95% accuracy",
        "score": 1598,
        "url": "https://www.myhealthyapple.com/apples-machine-learning-research-can-now-detect-heart-murmurs-with-95-accuracy/",
        "content": "",
        "created_utc": 1731552568.0,
        "subreddit_name": "apple",
        "comments": 104
    },
    {
        "title": "Apple faces UK 'iCloud monopoly' compensation claim worth $3.8 billion ",
        "score": 965,
        "url": "https://techcrunch.com/2024/11/13/apple-faces-uk-icloud-monopoly-compensation-claim-worth-3-8-billion/",
        "content": "",
        "created_utc": 1731556942.0,
        "subreddit_name": "apple",
        "comments": 449
    },
    {
        "title": "ChatGPT for macOS now works with third-party apps, including Apple’s Xcode",
        "score": 918,
        "url": "https://9to5mac.com/2024/11/14/chatgtp-macos-third-party-apps/?extended-comments=1",
        "content": "",
        "created_utc": 1731611152.0,
        "subreddit_name": "apple",
        "comments": 109
    },
    {
        "title": "Resident Evil 2 Coming to iPhone, iPad, and Mac on December 10",
        "score": 396,
        "url": "https://www.macrumors.com/2024/11/14/resident-evil-2-iphone-ipad-mac-dec-10/",
        "content": "",
        "created_utc": 1731591952.0,
        "subreddit_name": "apple",
        "comments": 90
    },
    {
        "title": "Google Releases Standalone Gemini AI App for iPhone",
        "score": 388,
        "url": "https://www.macrumors.com/2024/11/14/google-releases-gemini-ai-app-iphone/",
        "content": "",
        "created_utc": 1731583194.0,
        "subreddit_name": "apple",
        "comments": 97
    },
    {
        "title": "Logic Pro for Mac and iPad updated with Quantec Room Simulator",
        "score": 197,
        "url": "https://9to5mac.com/2024/11/13/apple-logic-pro-quantec-room/",
        "content": "",
        "created_utc": 1731546051.0,
        "subreddit_name": "apple",
        "comments": 7
    },
    {
        "title": "Final Cut Pro 11: Apple Shares List of All New Features and Bug Fixes",
        "score": 163,
        "url": "https://www.macrumors.com/2024/11/14/final-cut-pro-11-release-notes/",
        "content": "",
        "created_utc": 1731613854.0,
        "subreddit_name": "apple",
        "comments": 13
    },
    {
        "title": "Daily Advice Thread - November 14, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/apple/comments/1gr2avy/daily_advice_thread_november_14_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1731582029.0,
        "subreddit_name": "apple",
        "comments": 30
    }
]