[
    {
        "title": "Everything Siri Will Be Able to Do In iOS 18 - Apple Insider",
        "score": 1015,
        "url": "https://appleinsider.com/articles/24/06/08/siri-is-reborn-in-ios-18----everything-apples-voice-assistant-will-be-able-to-do",
        "content": "",
        "created_utc": 1717855230.0,
        "subreddit_name": "apple",
        "comments": 359
    },
    {
        "title": "M3 MacBook Airs now available in the US Apple Refurbished Store",
        "score": 663,
        "url": "https://9to5mac.com/2024/06/07/refurbished-m3-macbook-air/",
        "content": "",
        "created_utc": 1717856007.0,
        "subreddit_name": "apple",
        "comments": 99
    },
    {
        "title": "OG NVDA owners know the feeling",
        "score": 7361,
        "url": "https://i.redd.it/wns0dvwxtd5d1.jpeg",
        "content": "",
        "created_utc": 1717867540.0,
        "subreddit_name": "wallstreetbets",
        "comments": 367
    },
    {
        "title": "14 things I'd tell myself if I could start my trading career over...",
        "score": 2376,
        "url": "https://www.reddit.com/r/Daytrading/comments/1db0fbp/14_things_id_tell_myself_if_i_could_start_my/",
        "content": "Note: Reddit isn't allowing me to add paragraphs. Had to game the app a bit.\n\nIf I could go back and start my entire journey again, this is what I'd say...\n\nBut first, please note: These are the things I would do. What you do might and probably will be totally different, and you can still probably be just as, if not more profitable than me or anyone else. \n\nThe only strategy that works is the one that you can make work for you, consistently whilst minimising losses.\n\nSo, here goes. \n\nHere's what I'd want to tell the younger me.\n\nOne. Focus on building towards prop firms. You can get larger capital to work with and make significant financial gains faster (and easier) than building a $500 account.\n\n-\n\nTwo. Learn 1 strategy. Master said strategy. Stop listening to 50 different people about what's working for them.\n\n-\n\nThree. Following that, do not jump to multiple strategies, hoping there's \"something new\" or \"better.\" I'm an anxious person, so I always think, \"What if?\" There should be no what if in this business. You have rules, you have 1 strategy, focus on, and improve upon that. \n\n-\n\nFour. Take profits at your first target. Yes, that sounds dumb because why wouldn't you take profits at your first target? Ask yourself, have you always taken your profits at Target 1? Didn't think so. Greed is the killer. Take. Your. Profit. It's genuinely free money.\n\n-\n\nFive. When you set a stop loss, understand that it's called a stop loss because it is designed to further stop your loss. Therefore, moving it FURTHER down/up against your trade is the definition of idiocy. The only direction a stop loss should move is towards your profit target. Read it again. \n\nSix. After winning your trade, leave your machine. Do not trade on your phone. Switch it off. You won. You beat the odds. Now fuck off and do it again tomorrow.\n\nSeven. Do not trade more than twice in a day. That means either 1 win and you're out. Or 1 loss, with the opportunity to attempt a 2nd trade. If you lose the 2nd time, it's done. If you win the 2nd time, it's done. Fuck off, do it tomorrow. \n\n-\n\n\nEight. Feeling tired? Stressed? Wife or husband irritating you? OK. No trading today. Go get your head straight, come back later. Markets don't go anywhere. Your money does though.\n\n-\n\nNine. You are retail. Whilst you may understand market makers, institutions and what not, you are still retail. Use that information to your advantage. Where would a retailer put their stop loss? Again, where would a retailer put their stop loss? If they put their stop loss at that price, should you? The answer is no, you duck.\n\n-\n\nTen. Understand liquidity and you'll be able to master price action. This follows the above. Please go study liquidity, and how to identify it. This is not hard, and will put you ahead of 50% of traders out there.\n\n-\n\nEleven. The foundation of success for you, sir, will be learning market structure, supply & demand, and understanding fair value gap entries. Don't do anything else. Learn these things. Everything else is noise. Forget indicators. You are the indicator. \n\n-\n\nTwelve. Risk management is the difference between looking like a genius, and looking like a heroin addict because you don't know what the fuck you're doing. Please do not gamble money. Set appropriate risk, and stick to it every time. You don't need to make all your profit in 1 day. You need to preserve your capital for 365 days. Focus on keeping your money, profit will follow. \n\n-\n\nThirteen. Don't set entries automatically, i.e., don't use buy or sell orders for entry. The only auto orders I want you to use are for taking profit or a stop loss. For entry, you will only market in to price action. You are not a psychic. Therefore, you cannot easily predict what 1 candle is going to do when price comes to an entry. Exercise patience, watch price action, and only enter manually when price action says you should. If you're setting auto entries, smart people are going to nuke the shit out of your stop loss. All that bull about setting orders and going to bed, or going for a run and letting the order play out? \"Make money in your sleep\"... Yeah, good luck with that son.\n\n-\n\nFourteen. Then the holy grail... Ready? Psychology. It's boring. It isn't sexy. But it will make you financially free. If you can gain control of your emotions, build simple mechanical habits, and eliminate your basic intrinsic need to feel safe (this is basically impossible, but do your best, and develop this as much as you can - it will make you better than 95% of other traders)\n\nGood luck, young one.\n\nIf you enjoyed the read, let me know, and I can share my little free newsletter I write for fun 😁 \n\nCheers.",
        "created_utc": 1717844678.0,
        "subreddit_name": "DayTrading",
        "comments": 386
    }
]