[
    {
        "title": "Elon Musk’s support for Trump pushes a corporate customer away from Tesla ",
        "score": 3525,
        "url": "https://www.reddit.com/r/stocks/comments/1eluzkf/elon_musks_support_for_trump_pushes_a_corporate/",
        "content": "European drugstore giant Rossmann announced Tuesday it will no longer buy Tesla’s electric vehicles for its fleet, effective immediately, citing CEO Elon Musk’s pro-Trump political support.\n\nRossmann, based in Germany, said in a statement that its decision was “based on the incompatibility between the statements of Tesla CEO Elon Musk and the values ​​that Tesla represents with its products.”\n\n“Elon Musk makes no secret of his support for Donald Trump,” Raoul Rossmann, a spokesperson for the company, said in a statement. “Trump has repeatedly described climate change as a hoax - this attitude is in stark contrast to Tesla’s mission to contribute to environmental protection through the production of electric cars.”\n\nWhile Rossmann only purchases about 180 electric vehicles a year — and only had 38 Teslas in its fleet according to Bloomberg — the company’s decision to cut all Tesla EV purchases shows that Musk’s political decisions have begun to impact the automaker well beyond the U.S.\n\nMusk formally endorsed Trump last month, and said he was contributing funds to a pro-Trump group he helped create called America PAC. Musk is also slated to interview the former president, Trump announced on Tuesday.\n\nDuring a debate with President Biden in June, former President Trump dodged questions about what he would do, if anything, to combat climate change. And Trump has called climate change a “hoax.” He has also promised to withdraw the U.S. from the Paris Climate agreement, as he did during his presidency, if he is re-elected in November.\n\nAccording to ongoing research by Morning Consult, Republicans in the U.S. began to view Musk more favorably following his leveraged buyout of Twitter (now known as X) in late 2022. However, this has not driven an increase in Republican’s “purchasing consideration” of electric vehicles here. According to Pew Research, Musk’s reputation with left-leaning voters has declined even though they are far more likely to purchase an EV.\n\nRossman’s decision follows a recent survey that found a deterioration in Tesla’s brand, attributed partly to Musk’s “antics” and “political rants.” While Tesla’s revenue increased 2% during the second quarter, automotive revenue dropped 7% to $19.9 billion from $21.27 billion in the same quarter a year ago.\n\nTesla opened a factory in 2022 in Brandenburg, Germany (outside of Berlin) and employs thousands in the country. At the end of 2023, the drugstore chain Rossmann reported that it had more than 4,700 stores and more than 60,000 employees with about half in Germany.\n\nTesla has faced protests by environmental activists in Germany who took issue with the company’s plans to cut down part of a forest and to use water for manufacturing in Brandenburg. Musk lashed out at protesters there, saying on X in March they’re “either the dumbest eco-terrorists on Earth or they’re puppets of those who don’t have good environmental goals.”\n\nTesla, Musk and representatives for Rossmann did not respond to requests for further details on Thursday morning.\n\nSource: https://www.cnbc.com/2024/08/06/elon-musks-trump-support-pushes-a-corporate-customer-away-from-tesla.html",
        "created_utc": 1722982672.0,
        "subreddit_name": "stocks",
        "comments": 191
    },
    {
        "title": "What options does Tim Cook have?",
        "score": 300,
        "url": "https://www.reddit.com/r/stocks/comments/1eldre4/what_options_does_tim_cook_have/",
        "content": "It is looking like the US DOJ no longer thinks it is OK for Google to pay Apple to be the default search engine on iOS, MacOS, etc.\n\nThe most likely resolution will be that the first time you turn on your iPhone you are given a screen with the different search engines in a random list.\n\nYou then choose your search engine.  Free to change later but likely most will not.  This will be basically you choosing your default search engine.\n\nObviously this would be very bad for Apple.  Today, Apple sells the access to their customers and Google has been reported to pay Apple over $15 billion per year.  Some estimate over $20 billion.\n\nI believe this is going to be the toughest decision yet needed to be made by Tim Cook.   He could have Apple try to create their own search engine and then sell advertising with the new Apple search engine to try to replace the lost revenue.\n\nThen Apple would be one of the search engine options when you first turn on your iPhone and the hope would be people would choose the Apple option over the Google option.\n\nWhat other options does Tim Cook have to replace the Google money?",
        "created_utc": 1722938197.0,
        "subreddit_name": "stocks",
        "comments": 243
    },
    {
        "title": "What should Apple do to replace the money they get from Google?",
        "score": 61,
        "url": "https://www.reddit.com/r/investing/comments/1ele0gw/what_should_apple_do_to_replace_the_money_they/",
        "content": "It is looking like the US DOJ no longer thinks it is OK for Google to pay Apple to be the default search engine on iOS, MacOS, etc.\n\nThe most likely resolution will be that the first time you turn on your iPhone you are given a screen with the different search engines in a random list.\n\nYou then choose your search engine.  Free to change later but likely most will not.  This will be basically you choosing your default search engine.\n\nObviously this would be very bad for Apple.  Today, Apple sells the access to their customers and Google has been reported to pay Apple over $15 billion per year.  Some estimate over $20 billion.\n\nI believe this is going to be the toughest decision yet needed to be made by Tim Cook.   He could have Apple try to create their own search engine and then sell advertising with the new Apple search engine to try to replace the lost revenue.\n\nThen Apple would be one of the search engine options when you first turn on your iPhone and the hope would be people would choose the Apple option over the Google option.\n\nWhat other options does Tim Cook have to replace the Google money?",
        "created_utc": 1722939103.0,
        "subreddit_name": "investing",
        "comments": 75
    },
    {
        "title": "Apple Stops Signing iOS 17.5.1, Downgrading No Longer an Option",
        "score": 1054,
        "url": "https://www.macrumors.com/2024/08/06/apple-stops-signing-ios-17-5-1/",
        "content": "",
        "created_utc": 1722950879.0,
        "subreddit_name": "apple",
        "comments": 86
    },
    {
        "title": "The rumored iPhone 17 Slim could instead be called the iPhone 17 Air",
        "score": 846,
        "url": "https://www.techradar.com/phones/iphone/the-rumored-iphone-17-slim-could-instead-be-called-the-iphone-17-air",
        "content": "",
        "created_utc": 1722939912.0,
        "subreddit_name": "apple",
        "comments": 303
    },
    {
        "title": "9 Audio-Related Upgrades to Look Forward to in iOS 18",
        "score": 651,
        "url": "https://www.headphonesty.com/2024/08/audio-upgrades-look-forward-ios-18/",
        "content": "",
        "created_utc": 1722957812.0,
        "subreddit_name": "apple",
        "comments": 178
    },
    {
        "title": "20k+ Day Today - Earnings Play and Short Explained",
        "score": 90,
        "url": "https://www.reddit.com/r/Daytrading/comments/1eloql0/20k_day_today_earnings_play_and_short_explained/",
        "content": "First not a brag. If you look at my Net ROI. That's the % I made relative to my account for each trade. I was trading from 3 accounts today. My biggest % return was in premarket when I played NVDL. 6.22%. Hopefully this sheds some light into the process. I loved stuff like this when I was getting my sea legs. (I'm no guru. just trying to make that cheese ya know).   \n  \nPlayed Uber in premarket and bought it on the open sell off. Reason being is Uber oversold on the daily and at Jan 24 levels. Door Dash just had great earnings and is seeing nice upward move. Listened to Uber earnings call and doesn't seem like they are affected by the recession. Very good call. Plus we had this mini crash and I expected a nice recovery today like yesterday, so I was willing to hold this as a swing trade if needed. Stocks can always go lower and anything can happen but with all of these stacked in my favor the risk was worth it. Picked up some NVDL when NVDA hit $100 in premarket.\n\nhttps://preview.redd.it/s5lua21a03hd1.jpg?width=1231&format=pjpg&auto=webp&s=b0164daf590225012451f76a1cd827deb1da5b0e\n\nMy META short. Well one of them. My classic reversal trade. So butter so creamy and it's fat free. Thanks Anna Coulling.\n\nhttps://preview.redd.it/1co0dy7423hd1.jpg?width=932&format=pjpg&auto=webp&s=9923e3cc782db4f612a489eb2e44472cefb3cb7a\n\nHere's one of the Uber plays. I played this from two different accounts. My one account I sized in on the way down once we were down I went full size in other account. I saw price slowing down and I saw support at the $60 level on Bookmap.\n\nhttps://preview.redd.it/8y6zkjsv23hd1.jpg?width=953&format=pjpg&auto=webp&s=3a363a38fce0715d647de9b825884e83bf47b4fb\n\nOk one more bonus one. This is another short on META. I shorted META 3 times today. So I saw this on 5 min and 15 min was showing Bearish RSI divergence. Look how price continues to go higher while RSI continues to exhaust and go lower. It was turning over at least a little bit. I don't need a big move down just a little move or a retracement to make my money.\n\nhttps://preview.redd.it/uaze944e53hd1.jpg?width=2133&format=pjpg&auto=webp&s=afd7054107994866a4db5f0aeb338e0c7a5e0daf",
        "created_utc": 1722967638.0,
        "subreddit_name": "DayTrading",
        "comments": 21
    },
    {
        "title": "Apple Inc. [AAPL] reports $21.4 billion quarterly net profit.",
        "score": 4,
        "url": "https://www.reddit.com/r/AAPL/comments/1elvgef/apple_inc_aapl_reports_214_billion_quarterly_net/",
        "content": "Apple Inc. \\[AAPL\\] reports $21.4 billion quarterly net profit.  \n[https://candorium.com/news/20240806162700362/apple-inc-aapl-reports-dollar214-billion-quarterly-net-profit](https://candorium.com/news/20240806162700362/apple-inc-aapl-reports-dollar214-billion-quarterly-net-profit)",
        "created_utc": 1722983864.0,
        "subreddit_name": "AAPL",
        "comments": 1
    },
    {
        "title": "iPhone Driver's License Support Coming Soon to California",
        "score": 4,
        "url": "https://www.macrumors.com/2024/08/05/iphone-drivers-license-support-coming-california/",
        "content": "",
        "created_utc": 1722950118.0,
        "subreddit_name": "AAPL",
        "comments": 0
    }
]