[
    {
        "title": "Intel shares pop 12% on earnings beat, uplifting guidance",
        "score": 522,
        "url": "https://www.reddit.com/r/stocks/comments/1ggnzbb/intel_shares_pop_12_on_earnings_beat_uplifting/",
        "content": "Intel shares jumped 12% in extended trading on Thursday after the chipmaker reported better-than-expected revenue and issued quarterly guidance that topped expectations.\n\nHere’s how the company did in comparison with LSEG consensus:\n\n* **Earnings per share:** Loss of 46 cents adjusted\n* **Revenue:** $13.28 billion vs. $13.02 billion expected\n\nIntel’s revenue declined 6% year over year in the quarter, which ended on Sept. 28, according to a statement. The company registered a net loss of $16.99 billion, or $3.88 per share, compared with net earnings of $310 million, or 7 cents per share, in the same quarter a year ago.\n\nAs part of its cost reduction plan, Intel recognized $2.8 billion in restructuring charges during the quarter. There were also $15.9 billion in impairment charges.\n\nIntel has been mired in an extended slump due to market share losses in its core businesses and an inability to crack artificial intelligence. CEO Pat Gelsinger revealed plans during the quarter to turn the company’s foundry business into an independent subsidiary, a move that would enable outside funding options.\n\nCNBC reported that Intel had engaged advisors to defend itself against activist investors. In late September, news surfaced that Qualcomm reached out to Intel about a possible takeover.\n\nThe Client Computing Group that sells PC chips recorded $7.33 billion in revenue, down about 7% from a year earlier and below the $7.39 billion consensus among analysts surveyed by StreetAccount.\n\nRevenue from the Data Center and AI segment came to $3.35 billion, which was up about 9% and more than the $3.17 billion consensus from StreetAccount.\n\nIntel called for fiscal third-quarter adjusted earnings of 12 cents per share and revenue between $13.3 billion and $14.3 billion. Analysts had expected 8 cents in adjusted earnings per share and $13.66 billion in revenue.\n\nDuring the quarter, Intel announced the launch of Xeon 6 server processors and Gaudi artificial intelligence accelerators.\n\nAs of Thursday’s close, Intel shares were down about 57% in 2024, while the S&P 500 index had gained 20%.\n\nSource: [https://www.cnbc.com/2024/10/31/intel-intc-q3-earnings-report-2024.html](https://www.cnbc.com/2024/10/31/intel-intc-q3-earnings-report-2024.html)",
        "created_utc": 1730405816.0,
        "subreddit_name": "stocks",
        "comments": 192
    },
    {
        "title": "Alphabet Deserves A Better Valuation",
        "score": 334,
        "url": "https://www.reddit.com/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/",
        "content": "**I had recommended Alphabet (GOOG)** [**as a great long-term buy at $150**](https://www.reddit.com/r/stocks/comments/1anr3id/alphabet_goog_150_looks_like_an_excellent_long/), several months ago.\n\nLast evening, Google knocked it out of the park with really stellar results. I bought more shares this morning, and am reiterating a Buy.\n\nI believe analysts’ consensus earnings could be a little conservative and Google should continue to beat estimates with better growth and operating margins.\n\nGoogle's earnings quality is better than several tech giants for the following reasons.\n\n* It has a near monopoly in Search\n* Market leadership in media with YouTube.\n* A strong first-mover advantage with Waymo.\n* A fast-growing Google Cloud business, third only to and catching up with Azure and AWS.\n\n**Its earnings and growth are sustainable, thus it deserves a better valuation and multiple.**\n\nLet's take a closer look at Q3 earnings.\n\nQ3 GAAP EPS came in at $2.12 per share, beating expectations of $1.85 per share $0.27, or 14% - **This was a substantial beat.**\n\nRevenue of $88.3Bn (+14.9% Y/Y) beat by $2.05B or 3%.\n\nConsolidated Alphabet revenues in Q3 2024 increased 15%, or 16% in constant currency, YoY to $88.3Bn reflecting strong momentum across the business.\n\nGoogle Services revenues increased 13% to $76.5 billion, led by strength across Google Search & other, Google subscriptions, platforms, and YouTube ads.\n\n**Total operating income increased 34% and operating margin percent jumped a huge 4.5% to 32%.**\n\nGoogle Cloud revenues grew a whopping 35% to $11.4Bn led by accelerated growth in Google Cloud Platform (GCP) across AI Infrastructure, Generative AI Solutions, and core GCP products, **with record operating margins of 17%** as the cost per AI query decreased by 90% over the past 18 months.\n\nCloud titans Amazon (AWS) and Microsoft (Azure) have commanded huge valuations for their cloud computing businesses; with Google Cloud growing at 35%, it should continue to narrow the gap over the next 5 years. Also importantly, AWS and Azure have operating margins over 30%, and should Google continue to scale and leverage their existing fixed costs, they can reach the same margins. I also believe as they get better at AI, they should be able to charge more.\n\nBased on consensus analysts’ estimates Alphabet’s EPS should grow to $11.60 in 2027 from $5.80 in 2023 - that’s an annual growth rate of 18%. Comparatively, Apple‘s estimated EPS growth through FY2027 is slower at 14%, and it sports a P/E of 33 compared to Google’s 22. Alphabet’s P/E is closer to the S&P 500’s P/E of 21!\n\nI believe this is too low, and there is a lot of potential for its stock to appreciate on the lower valuation.\n\nBesides the strong EPS, a lot of Google’s expenses are noncash depreciation and amortization and their cash flow margins are strong. They generated operating cash of $31Bn on $88Bn last quarter, or a 35% cash flow margin.\n\nThe antitrust regulation will remain a possible negative on Alphabet, but the final decision is still years away as Alphabet vigorously appeals the decision.\n\n**I recommend Alphabet as a buy at $176**",
        "created_utc": 1730394807.0,
        "subreddit_name": "stocks",
        "comments": 165
    },
    {
        "title": "Amazon Announces Q3 FY24 Earnings: Beats in Retails, Meets in AWS, Strong Guidance",
        "score": 313,
        "url": "https://www.reddit.com/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/",
        "content": "Amazon Earnings: https://www.businesswire.com/news/home/20241030305950/en/Amazon.com-Announces-Third-Quarter-Results\n\nSEATTLE--(BUSINESS WIRE)--Amazon.com, Inc. (NASDAQ:AMZN) today announced financial results for its third quarter ended September 30, 2024.\n\nNet sales increased 11% to $158.9 billion in the third quarter, compared with $143.1 billion in third quarter 2023. \n\nExcluding the $0.2 billion unfavorable impact from year-over-year changes in foreign exchange rates throughout the quarter, net sales increased 11% compared with third quarter 2023.\n\nNorth America segment sales increased 9% year-over-year to $95.5 billion.\n\nInternational segment sales increased 12% year-over-year to $35.9 billion.\n\nAWS segment sales increased 19% year-over-year to $27.5 billion.\n\nOperating income increased to $17.4 billion in the third quarter, compared with $11.2 billion in third quarter 2023.\n\nNorth America segment operating income was $5.7 billion, compared with operating income of $4.3 billion in third quarter 2023.\n\nInternational segment operating income was $1.3 billion, compared with an operating loss of $0.1 billion in third quarter 2023.\n\nAWS segment operating income was $10.4 billion, compared with operating income of $7.0 billion in third quarter 2023.\n\nNet income increased to $15.3 billion in the third quarter, or $1.43 per diluted share, compared with $9.9 billion, or $0.94 per diluted share, in third quarter 2023.\n\nOperating cash flow increased 57% to $112.7 billion for the trailing twelve months, compared with $71.7 billion for the trailing twelve months ended September 30, 2023.\n\nFree cash flow increased to $47.7 billion for the trailing twelve months, compared with $21.4 billion for the trailing twelve months ended September 30, 2023.\n\nFree cash flow less principal repayments of finance leases and financing obligations increased to $44.9 billion for the trailing twelve months, compared with $15.9 billion for the trailing twelve months ended September 30, 2023.\n\nFree cash flow less equipment finance leases and principal repayments of all other finance leases and financing obligations increased to $46.1 billion for the trailing twelve months, compared with $20.2 billion for the trailing twelve months ended September 30, 2023.",
        "created_utc": 1730405185.0,
        "subreddit_name": "stocks",
        "comments": 72
    },
    {
        "title": "Apple Q4 FY24 Earnings: Meets Targets, Record Install Base, Slight Misses on Services, China",
        "score": 141,
        "url": "https://www.reddit.com/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/",
        "content": "Apple Earnings: https://investor.apple.com/investor-relations/default.aspx\n\nCUPERTINO, Calif.--(BUSINESS WIRE)--Apple® today announced financial results for its fiscal 2024 fourth quarter ended September 28, 2024. The Company posted quarterly revenue of $94.9 billion, up 6 percent year over year, and quarterly diluted earnings per share of $0.97. Diluted earnings per share was $1.64,1 up 12 percent year over year when excluding the one-time charge recognized during the fourth quarter of 2024 related to the impact of the reversal of the European General Court’s State Aid decision.\n\n“Today Apple is reporting a new September quarter revenue record of $94.9 billion, up 6 percent from a year ago,” said Tim Cook, Apple’s CEO. “During the quarter, we were excited to announce our best products yet, with the all-new iPhone 16 lineup, Apple Watch Series 10, AirPods 4, and remarkable features for hearing health and sleep apnea detection. And this week, we released our first set of features for Apple Intelligence, which sets a new standard for privacy in AI and supercharges our lineup heading into the holiday season.”\n\n“Our record business performance during the September quarter drove nearly $27 billion in operating cash flow, allowing us to return over $29 billion to our shareholders,” said Luca Maestri, Apple’s CFO. “We are very pleased that our active installed base of devices reached a new all-time high across all products and all geographic segments, thanks to our high levels of customer satisfaction and loyalty.”\n\nApple’s board of directors has declared a cash dividend of $0.25 per share of the Company’s common stock. The dividend is payable on November 14, 2024 to shareholders of record as of the close of business on November 11, 2024.\n\nApple will provide live streaming of its Q4 2024 financial results conference call beginning at 2:00 p.m. PT on October 31, 2024 at apple.com/investor/earnings-call. The webcast will be available for replay for approximately two weeks thereafter.",
        "created_utc": 1730406782.0,
        "subreddit_name": "stocks",
        "comments": 88
    },
    {
        "title": "What Should I Buy Today When It's Mostly Red?",
        "score": 67,
        "url": "https://www.reddit.com/r/stocks/comments/1ggh1h4/what_should_i_buy_today_when_its_mostly_red/",
        "content": "Is Warren Buffet shopping today? What's on your to buy or DCA list when the market turns red?\n\nAdvice and recommendations are welcome.\n\nI'm actually looking possibly at PLTR or NVDA but ideas are all welcome for the next red day.",
        "created_utc": 1730387974.0,
        "subreddit_name": "stocks",
        "comments": 216
    },
    {
        "title": "Dropbox - The outsider with a sticky product",
        "score": 6,
        "url": "https://www.reddit.com/r/stocks/comments/1gg24n1/dropbox_the_outsider_with_a_sticky_product/",
        "content": "**1.0 Introduction**\n\nBack in 2017, two MIT students (Drew Houston and Arash Ferdowsi) secured funding from seed accelerator Y Combinator, for what would become Dropbox, one of the first companies to offer **cloud storage and file syncing**.\n\nIt had a first-mover advantage, that combined with a simple user-friendly interface, and a freemium model, allowed the company to grow from **1 million** registered users back in April 2009, to over **700 million** in 2021. Although this sounds impressive, I’ll argue this is *a pointless metric*, but I’ll get back to that.\n\nThe freemium model attracted many users to test out their product and access a limited amount of storage for free. If they need more storage, then they can opt for various paid plans (Dropbox Plus, Dropbox Business).\n\n\n\n**2.0 An incredibly sticky product**\n\nA crucial property to take into account is the **stickiness** of the product**.**\n\n***The perceived risk and effort involved in transferring large volumes of data often outweigh the potential savings of switching services.***\n\nCloud storage platforms hold critical, often irreplaceable, data that users depend on for continuity and productivity. The migration process can seem risky—not just for the potential of data loss or corruption, but also for the disruption it could cause to established workflows and collaborative setups.\n\nMoreover, the time cost of planning, executing, and verifying a migration is significant for larger organizations.\n\n***Even if a competitor offers a cheaper option, the combined weight of time, complexity, and the fear of potential issues can make the cost savings feel secondary.***\n\nFor many users, the existing service might offer just enough value or reliability to make the switch feel unnecessary, reinforcing Dropbox's and similar platforms' stickiness.\n\n\n\n**3.0 The pointless metric & what actually matters.**\n\nIt is not unusual for companies to have some sort of storytelling element in their disclosures, press releases, or earnings reports. The purpose of these elements is nothing else but to create excitement, even if it is pointless.\n\nYou’ll notice, Dropbox chose **registered**, instead of **active**. Given that their base model is free, once someone becomes a user, that person remains a user **forever!** So the number of registered users will always go up.\n\nHowever, if we take a look at the paid subscribers, historically, that is **\\~2.5%** of the registered users. **So, 97.5% of all registered users are freeloaders** ***(including myself)*** **and add no value to the company.**\n\nDon’t get me wrong, having over 18 million paid subscribers is impressive. It is important to focus on this number and acknowledge that the growth days are behind.\n\nThe competition is fierce, ranging from Google and Amazon to Microsoft and Apple. What surprised me was that during the pandemic, there was ***no growth acceleration.***\n\n\n\n**4.0 The past acquisitions**\n\nThe company has engaged in numerous acquisitions:\n\n* **July 2012, TapEngage** \\- *a startup that enables advertisers and publishers to collaborate on tablet-optimized advertising.*\n* **December 2012, Audiogalaxy** \\- *a startup allowing users to store their music files and playlists in the cloud and then stream them to any device.*\n* **December 2012, Snapjoy** \\- *a company allowing users to \"aggregate, archive and view all of their digital photos from their cameras, phones and popular apps.*\n* **July 2013, Endorse** \\- *a mobile coupon startup.*\n* **April 2014, Loom** \\- *a photo-sharing company which would be shut down and integrated with the then-recently announced Carouse*\n* **April 2014, Hackpad** \\- *a document-sharing startup*\n* **May 2014, Bubbli -** *a startup that has built some innovative ways of incorporating 3D technology into 2D views, and packaging it in a mobile app.*\n* **January 2015, CloudOn** \\- *a company that provided mobile applications for document editing and creation.*\n* **January 2019, HelloSign** \\- *e-signature company* ***(largest acquisition $230m).***\n* **March 2021, DocSend** \\- *secure document sharing and analytics product.*\n* **October 2021, Command E** \\- universal search company\n* **November 2022, Boxcryptor** \\- *end-to-end zero-knowledge encryption for cloud storage services*\n* **December 2022, FormSwift** \\- *form management platform*\n\n\n\nThere have been many studies that acquisitions (on average) tend to destroy shareholders’ value. If you agree with that, then Dropbox should be avoided like the plague given their past activity.\n\n\n\n**5.0 The financials**\n\nIf you look at the financials, this is impressive, especially given the fact that they’re competing with Google, Amazon, Microsoft, and Apple.\n\nThe revenue grew from $845m back in 2016 to $2.5 billion in the last twelve months.\n\nThe operating margin improved from **-23%** (-$194m) to **+26%** ($670m).\n\nA lot of focus (especially from the management) goes to FCF and there’s a reason for that. Every company that has high stock-based compensation would like to focus on the free cash flow, as SBC is a non-cash expense.\n\nFrom 2018 (when the company became public) until H1-2024, the company generated **$3.9 billion** in free cash flow. This might sound impressive, given its market cap is $8.5 billion, however, it incurred **$2.3 billion** in stock-based compensation.\n\nSo, where did the $3.9 billion go to? **Share buybacks.** The number of shares outstanding is down \\~20% since becoming a public company.\n\nBased on their capital allocation over the last 5 years, it seems as if their capital allocation strategy has changed from **acquiring more companies** to **returning capital to the shareholders via buybacks**.\n\n  \n**6.0 The valuation**\n\nHow does one value a company of this kind?\n\nIt has a sticky product that generates relatively stable cash flow that is returned to the shareholders via buybacks. I’ll argue that it has a lot of similarities with a bond and a **dividend discount model** is an appropriate model to value a company of this kind.\n\nExcept, instead of using the dividend, I’ll use **free cash flow** **- SBC.**\n\nInputs:\n\nFree cash flow - SBC of $450m.\n\nGrowth in perpetuity of 4%.\n\nDiscount rate of 8%.\n\nAdjusting for cash/debt\n\nThe value of the company is $8.8 billion ($27/share), which isn't that far off from today's share price of $26/share.\n\n  \n**7.0 My thoughts**\n\nA company with a sticky product that has stable financial performance is expected to be less volatile than the average company out there. This is indeed the case, and the stock price beta is 0.6. Beta is a measure of risk that compares the volatility of the share price vs. an index (in this case, the S&P500). However, low risk goes hand in hand with low return. Therefore, expecting \\~8% long-term yield seems fair.\n\nI don’t find this an attractive opportunity, at this price point. However, *if the share price decreases to $20*, then the answer would be different.\n\nThe only scenario where I see a significant upside is if Dropbox is being acquired by a giant, such as Salesforce.\n\nI hope you enjoyed this post, feel free to share your thoughts.",
        "created_utc": 1730335247.0,
        "subreddit_name": "stocks",
        "comments": 5
    },
    {
        "title": "RDDT - pump & dump territory? ",
        "score": 2,
        "url": "https://www.reddit.com/r/stocks/comments/1ggfqip/rddt_pump_dump_territory/",
        "content": "I posted about reddit stock a few weeks ago with a general mindset while it was in the 70s its potentially undervalued, but since their earnings report 2 days ago this went from 84 to current 120s and rising. \n\nWhile I believe longer term it's possible for them to grow more into the valuation wallstreet is pumping on the ticker, it's up 45% in a day and a half.\n\nIts the nature of the beast sometimes for a stock to uncontrollably run up. It's rare a stock stays up that high. Only exception to the rule is something like tsla stock.\n\nIs anyone buying post earnings in the triple digits? If so, what's your target or are you just chasing/fomoing into this ticker?",
        "created_utc": 1730384603.0,
        "subreddit_name": "stocks",
        "comments": 49
    },
    {
        "title": "$UBER is positioned extremely well for the future",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1ggehhq/uber_is_positioned_extremely_well_for_the_future/",
        "content": "At the time of writing this post, UBER is down 7% in premarket, which is a big overreaction, after their earnings report. I suspect the cause of the drop is the miss on Bookings, which is not significant in my opinion.\n\nKey factors:\n\n- EPS of $1.20, beating expectations of $0.41\n\n- Revenue of $11.2B, beating expectations of $11B\n\n- Total Gross Bookings of $41B, missing expectations of $43B\n\nUBER had a record quarter, for the first time it generated an all time high GAAP operating profits of more than $1B.\n\nIn the conference call the CEO and CFO reiterated that they have a very high standard for doing M&A, so the Expedia deal is not set in stone, rather just a rumor.\n\nThey've also stated they are looking to reduce share count in 2025, meaning doing share buybacks, which will in turn drive higher share price.\n\nBut what I want to talk mostly about is the AV section.\n\n**AV**\n\nThe AV (Autonomous vehicle or self driving cars) is a hot topic right now, especially after Teslas event. Despite Tesla being clearly very far behind actual FSD, Waymo is doing AV, and doing it good. They are partenered with UBER and the AV fleet actually had the highest rated score on the platform (as mentioned by their CEO in the earnings call). Beside Waymo, they are partenered with 14 AV companies, including Aurora which they also have a big stake in. AV is coming, maybe not now, maybe not next year, but it is inevitably coming. And all these AV, especially the smaller ones, need a platform to operate their fleet. Do you build it from the ground up or join UBER who has 25 million rides a day already?\n\nThey are also partnered with BYD for the electrification of their fleet. Guess what is BYD also working on? Yeah, thats right, AVs. And judging BYD/China success on doing EVs, I think thats a pretty good chance they will also succeed on the AV side. And since they are already partenered, where do you think BYDs AV fleet will be used? In UBER.\n\nI think the company is positioned greatly for the future, its profitable after multiple years of negative EPS, it has a clear plan moving forward about their free cash flow, including reducing $2B out of their debt by the end of the year. \n\nDisclaimer, I do have a position in UBER.",
        "created_utc": 1730381197.0,
        "subreddit_name": "stocks",
        "comments": 16
    },
    {
        "title": "Today is the 5th Anniversary of the \"Guh!\" Heard Round the World",
        "score": 1744,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1ggp583/today_is_the_5th_anniversary_of_the_guh_heard/",
        "content": "It's fitting that AAPL reports earnings today, as exactly five years ago, we witnessed WSB Hall of Famer and \"King of the Autists\", CTN -- a.k.a. ControlTheNarrative -- graciously live-streaming the moment where his soul left his body, as he bet against AAPL earnings leveraged to the hilt with borrowed money, thanks to the \"infinite money glitch\" he discovered on Robinhood, getting epically margin called, and subsequently changing Robinhood's policies in the process.\n\nEnjoy re-living the moment here:  \n[https://www.reddit.com/r/wallstreetbets/comments/kkc8ev/just\\_in\\_case\\_yall\\_forgot\\_this\\_video\\_exists/](https://www.reddit.com/r/wallstreetbets/comments/kkc8ev/just_in_case_yall_forgot_this_video_exists/)\n\nHappy Halloween!\n\nEdit: an acronym correction.",
        "created_utc": 1730408936.0,
        "subreddit_name": "wallstreetbets",
        "comments": 108
    },
    {
        "title": "The S&P 500 And The Nasdaq Composite With Losses Of 1.9% and 2.8%, respectively,Could Be Headed For A Small Correction.",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1ggp3pm/the_sp_500_and_the_nasdaq_composite_with_losses/",
        "content": "The S&P 500 and the Nasdaq Composite were in a free fall today losing 1.9% and 2.8% respectively, - a rout as traders and investors turned their noses up at Meta and Microsoft’s earnings. Even Google has given up its 5% gain from yesterday. Matching the drop, the VIX closed at 23.16, and the 10-year Treasury Yield closed about the same at 4.29%. \n\nShould Apple and Amazon disappoint post-market today, I think a correction could be on. The main bullish factor countering a volatile election week, a VIX over 23 and high yields of 4.3% is strong earnings, especially from the M-7. Clearly, that doesn’t seem to be happening.\n\nMeta  - Initially, it seemed like a perfunctory one percent drop on a small beat and in-line guidance, but it’s gone a lot further as Meta is down 4% to 570.\n\n**Why the rout?** Analysts and investors panned high Capex plans of $40Bn and costly high-risk bets such as Meta’s Reality Labs unit, (the developer of augmented and virtual reality technologies), which logged a staggering operating loss of $4.4 billion \n\nMicrosoft - (down 6% to $408) is getting clobbered for a different reason. Even as Azure grew 34%, the pace wasn’t enough, and guidance of 31% to 32% in constant currency was lower than expected. However, this is due to supply chain constraints as President Amy Hood noted that the 1 or 2-point deceleration Microsoft has guided is mainly due to some supply pushouts, in terms of AI supply coming online that the company counted on. (Read, not as many Blackwells/Hoppers as they would have liked)\n\n\"We expect consumption growth to be stable compared to Q1, and we expect to add more sequential dollars to Azure than any other quarter in history,\" Hood added.\n\nThe indomitable Dan Ives of Wedbush remains as bullish as ever…\n\n\"We actually disagree with this initial take as the new Azure reporting standards have moved Street numbers all around and a slight deceleration is totally expected by many investors with some supply constraints and reacceleration in 2H25, and we would be strong buyers of MSFT on any weakness this morning,\" Wedbush analysts, led by Daniel Ives, said in a note.",
        "created_utc": 1730408821.0,
        "subreddit_name": "stocks",
        "comments": 14
    },
    {
        "title": "Palantir, growth is written in the stars. CEO Alex may want to integrate the Big Bear constellation",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1ggar84/palantir_growth_is_written_in_the_stars_ceo_alex/",
        "content": "Palantir has been one of the top-performing AI software stocks this year with a 156% YTD return, thanks to accelerating revenue growth and strong business momentum from its Artificial Intelligence Platform (AIP) released last year.\n\nAIP sets Palantir apart from the rest of the SaaS universe, driving visible AI-related growth and acceleration in multiple different metrics – at this time, other leading AI favorites such as Snowflake or MongoDB can’t say the same. Outside of the cloud hyperscalers, Palantir is one of the rare few that sees AI drive both real returns for its business and real value for its customers due to AIP.\n\nAIP has driven tremendous growth for Palantir’s business since its release, with primary impacts arising in the commercial segment. A clear inflection point in Palantir’s growth is visible following AIP’s release, while other ‘AI’ cloud peers can’t say the same about AI-driven growth.\n\n1. 83% YoY growth in US commercial customers to 295 and 98% YoY growth in US commercial deals closed to 123.\n2. 103% YoY growth in US commercial remaining deal value and 152% YoY growth in US commercial total contract value\n\n===================================\n\n* Recently Palantir CEO gave an interview on Real Time by Bill Maher, clearly Karb is obsessed with defense\n   * Please look up (link not allowed)\n      * This interview made me think about Big Bear Ai recent contract and the existing partnership between the two companies. Big Bear breaking into the defense sphere recently puts them on the map, and more such contracts are expected, No to mention the numerous airports and boat terminals that adopt BBAI technology.\n\n====================================\n\n* BigBear.ai (NYSE: BBAI) has been awarded a **five-year, $165.15 million sole source prime contract** by the U.S. Army for Global Force Information Management (GFIM) Production Services. This contract builds on BigBear.ai's ongoing work since 2021 to transform 15 legacy systems into an enterprise-wide intelligent automation platform, supporting the Army's vision for data-centric force management. The primary objective is to deliver a **dynamic, integrated, and interoperable transactional global force structure and employment data system** for the force management community. Upon completion, GFIM-OE will enable senior leaders and combatant commanders to make data-driven force structure decisions more quickly and with greater confidence, ensuring the Army is properly manned, equipped, trained, and resourced.\n   * Five-year contract duration provides stable revenue stream\n   * Sole source prime contractor status for the project\n   * Continuation and expansion of existing partnership with the Army\n   * Opportunity to contribute to critical military force management systems\n\n===========================================\n\n* BBAI being connected to Palantir, I like. Especially because Palantir CEO is obsessed with defense. (See Bill Maher Real Time Interview)\n   * [https://bigbear.ai/newsroom/bigbear-ai-and-palantir-announce-strategic-partnership-combining-ai-powered-products-with-next-generation-operating-platform/](https://bigbear.ai/newsroom/bigbear-ai-and-palantir-announce-strategic-partnership-combining-ai-powered-products-with-next-generation-operating-platform/)\n* BBAI CEO is previous secretary of Homeland Security (founder of Pangiam).\n   * [https://ir.bigbear.ai/news-events/press-releases/detail/75/bigbear-ai-completes-pangiam-acquisition-establishes](https://ir.bigbear.ai/news-events/press-releases/detail/75/bigbear-ai-completes-pangiam-acquisition-establishes)\n* BBAI recently picked up a Heathrow contract.\n   * [https://ir.bigbear.ai/news-events/press-releases/detail/85/bigbear-ai-and-heathrow-collaborate-to-bring-advanced](https://ir.bigbear.ai/news-events/press-releases/detail/85/bigbear-ai-and-heathrow-collaborate-to-bring-advanced)",
        "created_utc": 1730368329.0,
        "subreddit_name": "stocks",
        "comments": 13
    },
    {
        "title": "Super Micro’s $50 billion stock collapse underscores risk of AI hype",
        "score": 897,
        "url": "https://www.cnbc.com/2024/10/31/super-micros-50-billion-stock-collapse-underscores-risk-of-ai-hype.html",
        "content": "",
        "created_utc": 1730376765.0,
        "subreddit_name": "wallstreetbets",
        "comments": 166
    },
    {
        "title": "$AMZN will CRUSH earnings. Buying all the shares I can",
        "score": 636,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1ggm74t/amzn_will_crush_earnings_buying_all_the_shares_i/",
        "content": "\nAmazon the greatest company in the world. Delivery infrastructure is insane. FedEx and UPS can barely even hire drivers right now. Amazon stole USPS business right from the grubby little hands of FedEx. AWS is top notch. Half of Americans have a prime subscription. New storefront dropping that will compete with Temu prices, at a fraction of the shipping speed. Growing streaming catalog, Thursday Night Football, audiobook and ereader market segmented, exceptional customer service. Bezos keeps his customers happy. He will keep his stockholders happy. He may make his drivers piss in water bottles, but they get paid weekly and at a decent wage, so it’s no worries. Amazon should be the most valuable company in the world. \n\nPOSITION\n500 shares @ 186.36\n\nNo options, cus the only OPTION is to buy this company and see it hit 230 by EOY. ",
        "created_utc": 1730401248.0,
        "subreddit_name": "wallstreetbets",
        "comments": 169
    },
    {
        "title": "The noose around SMCI's neck -- $1.5B convertible debt that may need to be paid back now",
        "score": 51,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1ggj3so/the_noose_around_smcis_neck_15b_convertible_debt/",
        "content": "For those worrying about SMCI fraud, SEC and DoJ investigations, and possible NASDAQ delisting, the biggest problem is their $1.5 billion convertible notes from February when the stock was at $97.50 and if the holders come calling for their money back. They have been bleeding cash (see below) and they probably no longer have $1.5 billion in their bank accounts anymore.\n\n[https:\\/\\/s204.q4cdn.com\\/707617056\\/files\\/doc\\_financials\\/2024\\/q4\\/Earnings-Deck-Q4FY24-V5-w-2-of-2-at-end.pdf](https://preview.redd.it/m0e0wpire4yd1.png?width=2514&format=png&auto=webp&s=47a2e8faaf9f971a162bbe0e1e716960c738f983)\n\nSupermicro Announces Pricing of Private Offering of $1.5 Billion of Convertible Senior Notes Due 2029\n\nFebruary 23, 2024\n\nSAN JOSE, Calif.--(BUSINESS WIRE)-- Super Micro Computer, Inc. (NASDAQ: SMCI) (“Supermicro” or the “Company”), a Total IT Solution Manufacturer for AI, Cloud, Storage, and 5G/Edge, today announced the pricing of $1.5 billion aggregate principal amount of convertible senior notes due 2029 (the “Convertible Notes”). The Convertible Notes are being offered and sold to “qualified institutional buyers” pursuant to Rule 144A under the Securities Act of 1933, as amended (the “Securities Act”). The Company also granted a 13-day option to the initial purchasers to purchase up to an additional $225.0 million aggregate principal amount of the Convertible Notes.\n\nThe Convertible Notes will be senior, unsecured obligations of the Company. The Convertible Notes will not bear regular interest, and the principal amount of the Convertible Notes will not accrete. **The Convertible Notes have an initial conversion rate of 0.7455 shares of the Company's common stock per $1,000 principal amount of Convertible Notes (which is equivalent to an initial conversion price of approximately $1,341.38 per share of the Company’s common stock, representing an initial conversion premium of approximately 37.5% above the closing price of $975.52 per share of the Company’s common stock on February 22, 2024)**. The conversion rate and conversion price will be subject to adjustment upon the occurrence of certain events.\n\nThe Convertible Notes will be redeemable, in whole or in part (subject to certain limitations), for cash at the Company’s option at any time, and from time to time, on or after March 1, 2027 and on or before the 20th scheduled trading day immediately before the maturity date, but only if the last reported sale price per share of the Company’s common stock exceeds 130% of the conversion price for a specified period of time. The redemption price will be equal to the principal amount of the notes to be redeemed, plus accrued and unpaid special and additional interest, if any, to, but excluding, the redemption date.\n\n**Holders of the Convertible Notes will have the right to require the Company to repurchase all or a portion of their Convertible Notes upon the occurrence of a fundamental change (as defined in the indenture governing the Convertible Notes) at a cash repurchase price of 100% of their principal amount plus any accrued and unpaid special and additional interest**, if any, to, but excluding the applicable repurchase date. The Convertible Notes will mature on March 1, 2029, unless earlier redeemed, repurchased or converted in accordance with their terms prior to such date. Prior to the close of business on the business day immediately preceding September 1, 2028, the Convertible Notes will be convertible only upon the satisfaction of certain conditions and during certain periods, and on and after September 1, 2028, at any time prior to the close of business on the second scheduled trading day immediately preceding the maturity date, the Convertible Notes will be convertible regardless of these conditions. The Company will settle conversions by paying or delivering, as applicable, cash, shares of the Company’s common stock or a combination of cash and shares of the Company’s common stock at the Company’s election. The Company expects to close the offering on February 27, 2024, subject to the satisfaction of various customary closing conditions.\n\n[https://ir.supermicro.com/news/news-details/2024/Supermicro-Announces-Pricing-of-Private-Offering-of-1.5-Billion-of-Convertible-Senior-Notes-Due-2029/default.aspx](https://ir.supermicro.com/news/news-details/2024/Supermicro-Announces-Pricing-of-Private-Offering-of-1.5-Billion-of-Convertible-Senior-Notes-Due-2029/default.aspx)\n\n[As of last quarter, SMCI had $1.67B in cash and were cash flow negative in 3 consecutive quarters!](https://preview.redd.it/nm512jp3d4yd1.png?width=2324&format=png&auto=webp&s=9a43e6580775499be8ddb527fa6a8398e856f44e)",
        "created_utc": 1730393266.0,
        "subreddit_name": "wallstreetbets",
        "comments": 37
    },
    {
        "title": "Redditor \"invested\" in 24 years of PlayStation Plus",
        "score": 744,
        "url": "https://www.reddit.com/r/investing/comments/1ggbiqe/redditor_invested_in_24_years_of_playstation_plus/",
        "content": "Came across this quite fun [analysis](https://pixelbrawlgames.com/blog/playstation-plus-vs-sp500.html) about a [Redditor](https://www.reddit.com/r/PlayStationPlus/comments/1gbag2i/lads_i_did_it_subscribed_to_ps_plus_until_2048/) who \"invested\" in 24 years of PlayStation Plus subscription . The guy literally paid $2,000 to secure his gaming until 2048!\n\nDidn't check the math, but they ran the numbers comparing his \"investment\" against putting that money in the S&P 500 instead: \n\n- If Sony keeps raising prices like they have been (7%/year), PS Plus would cost $812/year in 2048\n- Total cost over 24 years would be $8,947\n- Our guy effectively \"saved\" $6,828\n- BUT... that same money in the S&P (after paying for PS Plus yearly) would net about **$13,008**\n\nObviously, the market wins on paper. Make me wonder what else could have been taken into account?",
        "created_utc": 1730371544.0,
        "subreddit_name": "investing",
        "comments": 125
    },
    {
        "title": "Palantir CEO and CTO seem very focused on Defense  ",
        "score": 2,
        "url": "https://www.reddit.com/r/investing/comments/1ggiky0/palantir_ceo_and_cto_seem_very_focused_on_defense/",
        "content": "Palantir has been one of the top-performing AI software stocks this year with a 156% YTD return, thanks to accelerating revenue growth and strong business momentum from its Artificial Intelligence Platform (AIP) released last year.\n\nAIP sets Palantir apart from the rest of the SaaS universe, driving visible AI-related growth and acceleration in multiple different metrics – at this time, other leading AI favorites such as Snowflake or MongoDB can’t say the same. Outside of the cloud hyperscalers, Palantir is one of the rare few that sees AI drive both real returns for its business and real value for its customers due to AIP.\n\nAIP has driven tremendous growth for Palantir’s business since its release, with primary impacts arising in the commercial segment. A clear inflection point in Palantir’s growth is visible following AIP’s release, while other ‘AI’ cloud peers can’t say the same about AI-driven growth.\n\n1. 83% YoY growth in US commercial customers to 295 and 98% YoY growth in US commercial deals closed to 123.\n2. 103% YoY growth in US commercial remaining deal value and 152% YoY growth in US commercial total contract value\n\n===================================\n\n* Recently Palantir CEO gave an interview on Real Time by Bill Maher, clearly Karb is obsessed with defense \\* This interview made me think about Big Bear Ai recent contract and the existing partnership between the two companies. Big Bear breaking into the defense sphere recently puts them on the map, and more such contracts are expected, No to mention the numerous airports and boat terminals that adopt BBAI technology.\n* CTO  (as PR'ed today)\n   * [https://www.18theses.com/](https://www.18theses.com/)\n\n====================================\n\nThis leads me to BBAI.  A small player that recently stepped into the big player arena. \n\n* BigBear.ai (NYSE: BBAI) has been awarded a **five-year, $165.15 million sole source prime contract** by the U.S. Army for Global Force Information Management (GFIM) Production Services. This contract builds on BigBear.ai's ongoing work since 2021 to transform 15 legacy systems into an enterprise-wide intelligent automation platform, supporting the Army's vision for data-centric force management. The primary objective is to deliver a **dynamic, integrated, and interoperable transactional global force structure and employment data system** for the force management community. Upon completion, GFIM-OE will enable senior leaders and combatant commanders to make data-driven force structure decisions more quickly and with greater confidence, ensuring the Army is properly manned, equipped, trained, and resourced.\n   * Five-year contract duration provides stable revenue stream\n   * Sole source prime contractor status for the project\n   * Continuation and expansion of existing partnership with the Army\n   * Opportunity to contribute to critical military force management systems\n\n===========================================\n\n* BBAI being connected to Palantir, I like. Especially because Palantir CEO is obsessed with defense. (See Bill Maher Real Time Interview)\n   * [https://bigbear.ai/newsroom/bigbear-ai-and-palantir-announce-strategic-partnership-combining-ai-powered-products-with-next-generation-operating-platform/](https://bigbear.ai/newsroom/bigbear-ai-and-palantir-announce-strategic-partnership-combining-ai-powered-products-with-next-generation-operating-platform/)\n* BBAI CEO is previous secretary of Homeland Security (founder of Pangiam).\n   * [https://ir.bigbear.ai/news-events/press-releases/detail/75/bigbear-ai-completes-pangiam-acquisition-establishes](https://ir.bigbear.ai/news-events/press-releases/detail/75/bigbear-ai-completes-pangiam-acquisition-establishes)\n* BBAI recently picked up a Heathrow contract.\n   * [https://ir.bigbear.ai/news-events/press-releases/detail/85/bigbear-ai-and-heathrow-collaborate-to-bring-advanced](https://ir.bigbear.ai/news-events/press-releases/detail/85/bigbear-ai-and-heathrow-collaborate-to-bring-advanced)",
        "created_utc": 1730391910.0,
        "subreddit_name": "investing",
        "comments": 8
    },
    {
        "title": "ENVX: why I like the stock",
        "score": 12,
        "url": "https://www.reddit.com/r/stocks/comments/1ggjwxd/envx_why_i_like_the_stock/",
        "content": "ENVX and why it will moon\n\nENVX (Enovix) is an advanced lithium-ion silicon battery manufacturer, and is a first mover with it's battery. They already have 2 smartphone OEMs lined up for 2025, and they just finished their fab2 in Malaysia. They have a patent to protect their proprietary process behind their silicon batteries. They are the first to use 100% active silicon batteries in the consumer market. Competitors cannot just spin up a fab easily.\n\nThey are positioned to ramp up production in 2025 with profits coming in early 2026.\n\nThey recently raised $100m via stockholder dilution, out of their 168m total outstanding shares. This is roughly only 6% dilution. As of today, their share price has dropped 19%. The $100m dilution along with $200m cash on hand, allows them to survive for 6 more quarters at a minimum, assuming they still continue to burn $50m in cash per quarter, without *any* efficiency gains. That positions that well for the beginning of 2026 play. More partnerships, more customers, lower CAPEX, different segments of customers, will all drive the price up. \n\nNext-gen batteries and EVs and component manufacturers are a long-term play\n\nI believe ENVX is currently underpriced. As of current price $8.45, my EOY price target is $12, and by end of next year, I see $18 at a minimum.",
        "created_utc": 1730395379.0,
        "subreddit_name": "stocks",
        "comments": 21
    },
    {
        "title": "Peloton up 20% as it names Apple Fitness+ founder as new CEO alongside Q1 earnings",
        "score": 504,
        "url": "https://finance.yahoo.com/video/peloton-stock-pops-names-ceo-135549623.html",
        "content": "",
        "created_utc": 1730386374.0,
        "subreddit_name": "wallstreetbets",
        "comments": 56
    },
    {
        "title": "Brokerage refusing to update my cost basis after it was received",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1ggemby/brokerage_refusing_to_update_my_cost_basis_after/",
        "content": "Hi - I made an in-kind transfer equities transfer from Etrade to Robinhood in 2022. (Please don't roast me for the choice of Robinhood - long story but it was the right decision at the time for certain reasons, e.g. access to margin at a really low rate, interest on sweep etc.)\n\nEquities were purchased between 2018 and 2021, then transferred in 2022. \n\nI now sold some of the equities made in that in-kind transfer - and Robinhood sent me a 1099 form with those equities as uncovered lots with a $0 cost basis.\n\nI spent several weeks back and forth between Etrade and Robinhood, trying to ensure that the cost basis transfer was made. It took a lot, but in the end I got confirmation from Robinhood that they have received the cost basis from Etrade.\n\nThe cost basis was sent/received in August of this year.\n\nHowever, all Robinhood say they are able to provide me in terms of a proper cost basis (after receiving it from Etrade) is an Excel CSV export (assume what they received from Etrade). They say I must now take this export to a tax professional to submit my own cost basis along with my uncovered securities 1099.\n\nI know the easy answer is \"this is the treatment you get with a joke of a broker like Robinhood\" - which may very well be the case.\n\nBut my understanding is that the receiving brokerage of an in-kind transfer is legally obligated to receive and update the cost basis from the sending brokerage. This is not really a discretionary element.\n\nRobinhood refuse to send me an updated 1099, and say its an industry standard that individuals have to self-report the cost basis on uncovered lots. However, these are only \"uncovered lots\" because Robinhood is not fulfilling their obligation of updating the cost basis they have confirmed that they have received.\n\nSpecific questions:  \n\\- Does anyone know if I can go after them from a legal obligation standpoint on this? I have tried everything in terms of tantrums and explanations over email/phone  \n\\- In what format could I demand an updated cost basis from Robinhood? Is it an updated 1099 or some other document?  \n\\- Will I have the same problem as I continue to sell off equities from this in-kind transfer for future tax years? Where Robinhood will never include the cost basis and have them as uncovered lots in my 1099s?\n\nThanks so much for your help and self-restraing in crucifying me for choosing Robinhood.",
        "created_utc": 1730381577.0,
        "subreddit_name": "investing",
        "comments": 18
    },
    {
        "title": "Apple Reports 4Q 2024 Results: $14.7B Profit on $94.9B Revenue",
        "score": 1645,
        "url": "https://www.macrumors.com/2024/10/31/apple-4q-2024-earnings/",
        "content": "",
        "created_utc": 1730407604.0,
        "subreddit_name": "apple",
        "comments": 268
    },
    {
        "title": "Unlike iPhone 16 Models, Apple's M4 Macs Lack Wi-Fi 7 Support",
        "score": 1080,
        "url": "https://www.macrumors.com/2024/10/30/m4-mac-models-no-wi-fi-7/",
        "content": "",
        "created_utc": 1730340285.0,
        "subreddit_name": "apple",
        "comments": 315
    },
    {
        "title": "iPhone Users Updating to iOS 18.1 Twice as Fast as iOS 17.1 Following Apple Intelligence Launch",
        "score": 783,
        "url": "https://www.macrumors.com/2024/10/31/ios-18-1-adoption-exceeds-ios-17-1/",
        "content": "",
        "created_utc": 1730416728.0,
        "subreddit_name": "apple",
        "comments": 122
    },
    {
        "title": "Kuo: iPhone 17 to Feature Apple-Designed Wi-Fi 7 Chip",
        "score": 779,
        "url": "https://www.macrumors.com/2024/10/31/kuo-iphone-17-apple-wi-fi-7-chip/",
        "content": "",
        "created_utc": 1730389068.0,
        "subreddit_name": "apple",
        "comments": 135
    },
    {
        "title": "Apple's New USB-C Accessories Require macOS Sequoia, Don't Work Properly With macOS 15.2 Beta",
        "score": 523,
        "url": "https://www.macrumors.com/2024/10/31/apple-usb-c-accessories-macos-sequoia/",
        "content": "",
        "created_utc": 1730408405.0,
        "subreddit_name": "apple",
        "comments": 166
    },
    {
        "title": "Apple’s M4, M4 Pro, and M4 Max compared to past generations, and to each other",
        "score": 237,
        "url": "https://arstechnica.com/apple/2024/10/apples-m4-m4-pro-and-m4-max-compared-to-past-generations-and-to-each-other/",
        "content": "",
        "created_utc": 1730337294.0,
        "subreddit_name": "apple",
        "comments": 43
    },
    {
        "title": "What is your opinion about the Apple Intelligence?",
        "score": 192,
        "url": "https://www.reddit.com/r/apple/comments/1ggqv9l/what_is_your_opinion_about_the_apple_intelligence/",
        "content": "What is your guys opinion about the Apple Intelligence?",
        "created_utc": 1730413732.0,
        "subreddit_name": "apple",
        "comments": 475
    },
    {
        "title": "Apple Announces Vision Pro Launching in Two More Countries Next Month",
        "score": 117,
        "url": "https://www.macrumors.com/2024/10/30/vision-pro-coming-to-two-more-countries/",
        "content": "",
        "created_utc": 1730337092.0,
        "subreddit_name": "apple",
        "comments": 25
    },
    {
        "title": "M4 MacBook Pro vs M3: What do the latest laptops deliver?",
        "score": 100,
        "url": "https://9to5mac.com/2024/10/30/m4-macbook-pro-vs-m3-comparison/",
        "content": "",
        "created_utc": 1730371926.0,
        "subreddit_name": "apple",
        "comments": 48
    },
    {
        "title": "Apple intelligence gets weird while summarizing notifications about different topics from same app",
        "score": 88,
        "url": "https://www.reddit.com/r/apple/comments/1ggffv2/apple_intelligence_gets_weird_while_summarizing/",
        "content": "It summarized two different notifications, one about Maria from Silent Hill and one post about EMG and a disease as:  EMG in an hour, afraid ; wondering about attraction to Maria",
        "created_utc": 1730383813.0,
        "subreddit_name": "apple",
        "comments": 64
    },
    {
        "title": "Months after China and Japan, Apple Vision Pro set for release in Korea in November",
        "score": 68,
        "url": "https://koreajoongangdaily.joins.com/news/2024-10-31/business/tech/Months-after-China-and-Japan-Apple-Vision-Pro-set-for-release-in-Korea-in-November/2167763",
        "content": "",
        "created_utc": 1730345565.0,
        "subreddit_name": "apple",
        "comments": 7
    },
    {
        "title": "Daily Advice Thread - October 31, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/apple/comments/1ggav49/daily_advice_thread_october_31_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1730368835.0,
        "subreddit_name": "apple",
        "comments": 57
    },
    {
        "title": "How to use Apple’s AirPods Pro 2 as a hearing aid",
        "score": 0,
        "url": "https://www.engadget.com/audio/headphones/how-to-use-apples-airpods-pro-2-as-a-hearing-aid-173049967.html",
        "content": "",
        "created_utc": 1730400145.0,
        "subreddit_name": "apple",
        "comments": 4
    },
    {
        "title": "Apple Intelligence Summarizes... Itself!",
        "score": 0,
        "url": "https://www.reddit.com/r/apple/comments/1gg25cq/apple_intelligence_summarizes_itself/",
        "content": "So, my first test of Apple Intelligence on MacBook was with Pages. I used the privacy statement about apple intelligence, and formatted it for conciseness. It came back with:\n\n    Apple Intelligence, a generative AI system, aids with daily tasks. It helps rewrite emails, proofread notes, summarize missed messages, create memories in Photos, and generate images. Apple Intelligence delivers personalized intelligence without collecting personal data.\n    \n    To provide a customized experience, Apple Intelligence uses device information, including calendar events and frequently used apps, to identify the necessary data for generative models. Apple Intelligence runs models on-device to complete tasks without data leaving the device, like email summaries. However, for complex tasks, Apple Intelligence sends requests to Private Cloud Compute, a server-based intelligence system that handles more demanding requests while protecting privacy.\n    \n    When you initiate an Apple Intelligence task, your device analyzes if it can complete it locally. If not, Apple Intelligence uses Private Cloud Compute to send only relevant data to Apple silicon servers for processing. The data is not stored or accessible to Apple and is processed only to fulfill your request, after which it’s securely returned to your device. Apple collects limited information about requests, such as size, features used, and completion time, but not content or returned results. This data doesn’t identify you or link to your Apple Account or other data from other Apple services.\n    \n    To see how your data is processed, go to Settings > Privacy & Security > Apple Intelligence Report, turn on Record Apple Intelligence Activity, and export a file after requests.\n\nBut it was even more cool to see the \"friendly\" re-write:\n\n    Apple Intelligence is a suite of AI models that make your daily tasks a breeze. It can help you rewrite or proofread your emails and notes, summarize your missed messages, create custom memories in Photos, generate images, and more. The best part? Apple Intelligence doesn’t collect your personal data to provide personalized intelligence.\n    \n    To give you a tailored experience, Apple Intelligence uses info on your device, like your upcoming calendar events and frequently used apps. It figures out what data it needs from your device to help you out without storing that data on Apple’s servers.\n    \n    When possible, Apple Intelligence models run entirely on your device, so you can complete tasks without your data leaving your device. For instance, when Apple Intelligence gives you preview summaries of your emails, messages, and notifications, these summaries are generated by on-device models. But there are times when Apple Intelligence needs a model that requires more power than your device can provide. In those cases, Apple Intelligence sends your request to Private Cloud Compute. Private Cloud Compute is a server-based intelligence system that can handle more complex requests while keeping your privacy safe. For example, when you use Writing Tools to proofread or edit an email, your device might send the email to Private Cloud Compute for a server-based model to do the proofreading or editing.\n    \n    When you start an Apple Intelligence task, your device’s built-in model checks if it can handle the task on your device. If not, Apple Intelligence uses Private Cloud Compute to send only the data needed for your request to Apple silicon servers. The data stays on Apple’s servers and isn’t shared with anyone else. It’s only used to process your request, and then it’s sent back to your device securely. Apple doesn’t keep it or use it for anything else. When your device sends a request to Private Cloud Compute, Apple only collects some basic info about the request, like how big it is and how long it takes. This info doesn’t include any details about what you asked for or what the answer was. It’s not linked to your Apple Account or any other data Apple might have from your other Apple services.\n    \n    You can turn on transparency logging for Apple Intelligence on your device to see how your data is processed. Just go to Settings > Privacy & Security > Apple Intelligence Report and turn on Record Apple Intelligence Activity. After you make a request, you can also save a copy of the data that was processed.\n\nThis certainly is an introspective moment! Like asking Siri about Siri when Siri was new.",
        "created_utc": 1730335303.0,
        "subreddit_name": "apple",
        "comments": 3
    },
    {
        "title": "Apple, I'm not ready to move on from USB-A yet - so why the heck does the new M4 Mac mini only have USB-C ports?",
        "score": 0,
        "url": "https://www.techradar.com/computing/macs/apple-im-not-ready-to-move-on-from-usb-a-yet-so-why-the-heck-does-the-new-m4-mac-mini-only-have-usb-c-ports",
        "content": "",
        "created_utc": 1730342416.0,
        "subreddit_name": "apple",
        "comments": 73
    },
    {
        "title": "I had never pre-ordered an Apple product until today. In fact, I usually buy used. But this one got me",
        "score": 1159,
        "url": "https://i.redd.it/znpebbhn54yd1.jpeg",
        "content": "Yes, I could get more selling my M1 mini, but it’s not worth the hassle to me. ",
        "created_utc": 1730389923.0,
        "subreddit_name": "mac",
        "comments": 227
    },
    {
        "title": "Polishing cloth for your Mac, now with Apple Intelligence ",
        "score": 598,
        "url": "https://i.redd.it/a6fhqytqh5yd1.jpeg",
        "content": "",
        "created_utc": 1730406097.0,
        "subreddit_name": "mac",
        "comments": 29
    },
    {
        "title": "Does anyone else not give a shit about Apple intelligence? ",
        "score": 191,
        "url": "https://www.reddit.com/r/mac/comments/1gglwvy/does_anyone_else_not_give_a_shit_about_apple/",
        "content": "I like AI, I subscribe to ChatGPT and think it’s awesome, but what difference is local ai going to make? Is integration with the os going to be that useful? Plus if it uses loads of ram as is suspected is local processing worth it? ",
        "created_utc": 1730400522.0,
        "subreddit_name": "mac",
        "comments": 177
    },
    {
        "title": "MacBook Air with fan",
        "score": 66,
        "url": "https://www.reddit.com/gallery/1gg5uwo",
        "content": "I hooked up my MacBook Air m2 8gb with a fan blowing on the underside to keep it cool while playing Minecraft with shaders. I got crazy fps as compared to no fan.",
        "created_utc": 1730346882.0,
        "subreddit_name": "mac",
        "comments": 25
    },
    {
        "title": "MacOS scaling: Is 5K that much better than 4K on Macs?",
        "score": 39,
        "url": "https://www.reddit.com/r/mac/comments/1ggktex/macos_scaling_is_5k_that_much_better_than_4k_on/",
        "content": "With a lot of people now buying the Mac mini, I was wondering what the most popular screen option would be. I read a lot about 4K monitors not working well with MacOS because of scaling. Is that really a big deal?\n\nFrom what I understood indicates to image for a 5k screen and then scales it down to 4k, which can lead to some UI glitches?",
        "created_utc": 1730397715.0,
        "subreddit_name": "mac",
        "comments": 54
    },
    {
        "title": "Kudos to Apple.",
        "score": 21,
        "url": "https://www.reddit.com/r/mac/comments/1ggau4v/kudos_to_apple/",
        "content": "Props to Apple for doubling the RAM from 8 to 16 in their base models, yet still keeping the base prices the same. 8 Gb was like damn 2014 memory size, they REALLY needed a fucking change.",
        "created_utc": 1730368709.0,
        "subreddit_name": "mac",
        "comments": 50
    },
    {
        "title": "Happy Halloween 2024 Black and Aluminium MacBook",
        "score": 17,
        "url": "https://www.reddit.com/gallery/1gg8on5",
        "content": "",
        "created_utc": 1730358511.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Why do you prefer MacOS over Windows?",
        "score": 13,
        "url": "https://www.reddit.com/r/mac/comments/1ggkdb1/why_do_you_prefer_macos_over_windows/",
        "content": "I currently use an older HP Windows computer, but I'm going to get a 'new' computer soon. I currently have an iPhone, but I might upgrade to a 2022 MacBook Air. Along with that, I might get an iPad. I can afford the MacBook, but I wanted to ask you all: why do you like macOS over Windows? I don't know much about computers, so if you could explain the pros, that would be helpful.",
        "created_utc": 1730396568.0,
        "subreddit_name": "mac",
        "comments": 134
    },
    {
        "title": "Ratings of the new Macs! An Apple’s sheep perspective.",
        "score": 13,
        "url": "https://www.reddit.com/r/mac/comments/1gg5ggi/ratings_of_the_new_macs_an_apples_sheep/",
        "content": "So as someone that has spent waaaaayyy too much money and time building my Apple ecosystem this are my thoughts on every new Mac.\n\nMac Mini:\n\n-Base M4: OMG for $600 this is such a killer machine!! 16GB and M3 Pro levels of performance! 256gb sucks, but its a desktop so you can get an external SSD for super cheap\n\n-M4 Pro: This might be one of the best options Apple has ever offered. $1400 for one of the best CPUs on the market and 24GB of RAM for the tiniest form factor? That’s hell of worth it!\n\niMac:\n\nNow it’s probably the first time I think the iMac is a good buy. The base M4 is powerful enough to do pro work, and by getting an all-in-one, if you have no portability issues, you are getting around the notoriously difficult task of finding a good display for a Mac. I am disappointed, they don’t offer the M4 Pro in the iMac. If it can be cooled in the mini and the MacBooks it can be cooled there too.\n\nMacBooks:\n\n- M4 MacBook Pro: It is a very good machine, same as everything I said for the mini M4 Pro, plus we are getting 512GB as standard here which is good.\n\n- M4 Pro MacBook Pro: Ok this is it for me. The M4 Pro is so powerful now and with 10 performance cores!!!! That’s a huge upgrade from the 6 of the M3 Pro. To be honest it’s one of the few times, that if I had an M3 Pro I would be considering an 1 generation upgrade.\n\n- M4 Max 14/32 MacBook Pro: That’s a no from me. It ain’t worth it. Same CPU as the M4 Pro, the only difference being basically the GPU. But the GPU is already so much better than the previous gen on the M4 Pro, if you actually need the GPU power it’s worth going for the full M4 Max version.\n\n- M4 Max 16/40 MacBook Pro: This is an ok machine. It’s the latest and greatest, but it’s not as much greater as it could have been. Having the same core count and layout CPU/GPU wise with the M3 Max, I think it’s a miss on Apple’s part. I don’t think that for any reason anyone with an M3 Max should upgrade to an M4 Max only for a slight core speed increase. IMO the M4 Max should be a 20 or 24 core chip. Now that would make me sell my M3 Max in this instance and upgrade! So M4 Max, very good but underwhelming.\n\n\nSo yeah overall I think it’s a very very nice new lineup of chips, with all of them hitting the nail in the head harder than we expected, with the exception of the M4 Max. Its base version is a no. It’s top version is very good, and of course the chip one should get if they want to buy something with the most power, but its not anywhere near the performance increase we saw in the M4, and M4 Pro compared to previous gens.\n\n\nAs for me, am I buying any of them? The answer is no. I spent a fortune over the last couple of years building my perfect apple ecosystem now containing chips from all gens up to M3’s. An M1 iPad Pro 12.9, an MacBook Air M2 base, a MacBook Pro 16” M3 Max 16/40 64GB, and an M2 Ultra Studio 192GB (office computer). So yeah, I am not replacing my M3 Max, I need no power in the Air as I just have it for a more portable machine to log in the M3 Max of Studio, and the Studio itself i bought very recently as I needed it urgently so no changing that even with the new studios unfortunately. (Tbh if we get an Studio M4 Ultra that’s like 2 M4 Max’s then that will be a machine that I would consider selling my M3 Max and getting as a personal machine, and just use the Air on the go). \n\nTo anyone that doesn’t own a Mac and wants to get one, get the MacBook Pro M4 Pro! that’s such an awesome machine!",
        "created_utc": 1730345533.0,
        "subreddit_name": "mac",
        "comments": 27
    },
    {
        "title": "So, the new MacBook Pro (M4 Pro) doesn't support 3 screens when the lid is closed?",
        "score": 7,
        "url": "https://www.reddit.com/r/mac/comments/1ggbkl2/so_the_new_macbook_pro_m4_pro_doesnt_support_3/",
        "content": "The new Mac Mini with the M4 Pro processor is capable of running three external displays; but ofcourse doesn't have a screen on it's own. \n\nmacOS 14.6 added support for two screens when the lid is closed on the regular M3 processor (so not the Pro/Max) [https://www.macrumors.com/2024/07/29/macos-sonoma-14-6-dual-display-support/](https://www.macrumors.com/2024/07/29/macos-sonoma-14-6-dual-display-support/)\n\nAs far I can tell, the new MacBook Pro (M4 and M4 Pro) can only support two external displays even when the lid is closed? And the only way to get three external displays (native, so not through DisplayLink) is buying a M4 Max processor?\n\nIs that right? ",
        "created_utc": 1730371744.0,
        "subreddit_name": "mac",
        "comments": 33
    },
    {
        "title": "The Right Side of my MacBook is Unclickable!",
        "score": 6,
        "url": "https://www.reddit.com/r/mac/comments/1ggoguo/the_right_side_of_my_macbook_is_unclickable/",
        "content": "I have a 2013 13-inch MacBook Pro and for some wild reason, the right side of my screen has become untouchable. My mouse icon can go over to that side of the screen and even click the clock and search icons above. But on the main screen, both in an application, web browser, or on the desktop, it won't click nor even let me drag any files over.\n\n  \nI have reset, powered down and powered it up, tried zooming in and out but alas, nothing works. Please, help! ",
        "created_utc": 1730407126.0,
        "subreddit_name": "mac",
        "comments": 61
    },
    {
        "title": "M3 Air or M4 Pro",
        "score": 7,
        "url": "https://www.reddit.com/r/mac/comments/1gggnm6/m3_air_or_m4_pro/",
        "content": "Should I buy the MacBook Air M3 with 16GB RAM and 512GB SSD or the MacBook Pro M4 with 16GB RAM and 512GB SSD? Is the price difference worth it? I won't be doing heavy tasks, I'll mostly be coding, playing Minecraft and Stardew Valley, watching series and movies, and probably doing some schoolwork. Which model do you think I should get?",
        "created_utc": 1730386976.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "USB C Magic Trackpad gestures don't work?",
        "score": 6,
        "url": "https://www.reddit.com/r/mac/comments/1ggfr61/usb_c_magic_trackpad_gestures_dont_work/",
        "content": "Hey all. I just got the new usb c magic trackpad and connected it to my M2 macbook pro running 14.3.1. It recognizes the trackpad and allows me to use it as a mouse (point & click) but none of the gestures work - I can't even scroll with 2 fingers. Anyone else experience this? What the heck is going on?",
        "created_utc": 1730384655.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "MacBook Air M3 or Pro M4?",
        "score": 6,
        "url": "https://www.reddit.com/r/mac/comments/1ggcery/macbook_air_m3_or_pro_m4/",
        "content": "Hello Reddit,\n\nI'm currently studying digital engineering and I'd like to buy a Mac, but I'm hesitating between two models.\n\nI intend to use the Mac for :\n\n1.  development with the JetBrains suite and other similar tools,\n2.  the Office suite for note-taking,\n3.  Teams for video conferencing and screen sharing,\n4.  a bit of gaming (really light),\n5.  and web browsing (many tabs).\n\nI also sometimes have about five applications open at the same time.\n\nThe options I'm considering are :\n\n1. MacBook Air M3 with 512GB of storage and 24GB of memory,\n2. MacBook Pro M4 with 512GB of storage and 16GB of memory.\n\nI'm leaning towards the MacBook Air M3, but there are a few things holding me back: the Pro range offers better battery life, a better screen, more ports, etc. I'd like your opinion on this.\n\nI'd love to hear what you think.",
        "created_utc": 1730374790.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "Is it dangerous? (iMac 2012)",
        "score": 6,
        "url": "https://www.reddit.com/gallery/1gg925s",
        "content": "I have a 2012 iMac, I looked at the smart status of the original internal hard drive...\n\nThis iMac stays on over the weekend (from Friday evening to Sunday evening and when I'm on vacation to avoid having to turn it on every time I need it.\n\nGiven the state of the hard drive, what is the best habit to have? Is my usage good?\n\nI have the idea of ​​putting an external SSD, with perhaps a recent system on it (sequoia with OCLP), will the performance of an external SSD be better? And what speed can I expect to have with an external SSD?\n\nThank you in advance for your help!",
        "created_utc": 1730360346.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "Is this a good choice of configuration?",
        "score": 5,
        "url": "https://i.redd.it/5g47do7n44yd1.png",
        "content": "I am mostly into software development with many docker images running including web and API servers, maybe a database image. And since docker does not run natively in macos it uses significantly more memory. \n\nThrow in apps like xcode, vscose, Chrome with many tabs with maybe a video editor and photo editor in background.   \n\nI have never spent this amount of money and feeling a bit of mental topsy turvy with this decision.\n",
        "created_utc": 1730389584.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "Is it me or the Macbook handling external monitors with higher refresh rates sucks?",
        "score": 5,
        "url": "https://www.reddit.com/r/mac/comments/1gghkj2/is_it_me_or_the_macbook_handling_external/",
        "content": "I have a MacBook Pro M2 Pro connected to an external monitor with a refresh rate of up to 144Hz (LG 27GP850P-B). I am using the HDMI cable that came with the monitor, which supposedly supports up to 8K at 60Hz, and everything works fine. The monitor refresh rate is set to 144Hz in macOS, and the monitor control panel also shows 144Hz. Everything seems fine, but for some reason, it doesn’t quite feel like 144Hz as it does on my other PC with Windows.\n\nWhen I use a web browser, scroll through Telegram or WhatsApp, everything just feels normal... except for the animations when changing desktops or showing all open windows. This makes me wonder if there’s some configuration I’m missing, because it doesn’t quite feel like it’s connected at 144Hz. Even the MacBook display feels smoother than this monitor. And again, on my gaming computer, it feels right, so I’m confident it’s not the monitor itself.\n\nIt could be the HDMI cable, but it wouldn't be showing 144Hz in macOS in the first place if that were the case? Any idea what could be happening?",
        "created_utc": 1730389320.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Deprecated MacBook Air",
        "score": 4,
        "url": "https://www.reddit.com/r/mac/comments/1gghcf9/deprecated_macbook_air/",
        "content": "Is there any security risk with hanging on to my early 2014 MBA? The OS is versioned out at 11.7.10 Big Sur. The laptop does everything I need it to do and has remarkable battery life. ",
        "created_utc": 1730388746.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Successful BestBuy Education Price Match and 24 Month 0% APR Financing for M4 Pro MacBook Pro",
        "score": 4,
        "url": "https://www.reddit.com/r/mac/comments/1ggey2e/successful_bestbuy_education_price_match_and_24/",
        "content": "Providing the information here so anyone else who are interested will benefit from it as well. Apple and BestBuy only used to offer 12 month 0% APR Financing for MacBooks. But since M4 Release, BestBuy provide 24 Month Financing. Also I made the per-order yesterday and was able to make a price match for the Apple Education Store pricing just now. If an agent says they can't do it or can't be done for Pre-Orders, try again later and you'll get through. ",
        "created_utc": 1730382490.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Seeking advice for My Next MacBook Purchase?",
        "score": 3,
        "url": "https://i.redd.it/flv5q0jeh1yd1.jpeg",
        "content": "Hello, everyone!\n\nI’m in the market for a new MacBook and have narrowed it down to a few options, but I’m torn on what to prioritize. Above are the models I’m considering\n\nI’m leaning toward the MacBook Pro M4 because it has a bigger battery and I believe it will last longer—I’m looking at a horizon of around 7-8 years with this laptop. However, I’m also debating whether to prioritize higher RAM or higher storage for my needs.\n\nWhat do you think? Should I focus on more RAM or more storage, or do you believe the M4 is worth the investment? Any insights or experiences would be greatly appreciated!\n\nThanks in advance!",
        "created_utc": 1730357555.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Home video project advice ",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1ggin0h/home_video_project_advice/",
        "content": "I have 19 mini dv tapes I want to convert to digital and do some editing. Nothing fancy. We already have an iMac so I figured a mini hooked up to my tv would be a good idea, especially when we want to watch the videos. I figured the basic mini- M4 chip and 16gb ram along with iMovie is all I would need. But that comes 256gb of storage. I don't really want to spend the money if I don't have to, does anyone have any idea if this machine would be good enough for the project or do I need something better, especially storage wise. That's my big concern, we may add more video later (from iPhones and an older digital camera)  so I'd like some left over storage room. TYIA",
        "created_utc": 1730392054.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "How would i use my imac as a monitor? In any way.",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1ggh0o8/how_would_i_use_my_imac_as_a_monitor_in_any_way/",
        "content": "I don’t use my Mid 2011 Imac, It has no OS installed and i’ve had so much issues getting the os to install but it doesn’t want to. Probably because i was using an external hard drive as my boot installer instead of a flash drive. Anyways how would i be able to use it as a monitor for xbox, or a roku or apple tv. Linux? Windows? any ideas would help",
        "created_utc": 1730387919.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Torn between M4 Pro and M1 Max",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gge3oh/torn_between_m4_pro_and_m1_max/",
        "content": "So I have a 2018 Mac Mini and a Late 2013 MBP retina, and was looking to upgrade and I have 2 choices that cost the same:\n\n1: Macbook Pro 16\" M1 Max 32-Core GPU with 64GB ram. Used with 3 year warranty \n\n2: Macbook Pro 14\" M4 Pro 12-Core cpu/16-Core GPU 48GB ram\n\nI want to use the system for programming and also to run some LLMs and screen size does not matter. Completely torn between these 2. \n\nWhich one is a better choice?",
        "created_utc": 1730380127.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Best external drive for new Mac Mini?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gg89ka/best_external_drive_for_new_mac_mini/",
        "content": "I got the base new Mac Mini... the 256GB will be a real squeeze though and I want to have an external drive on hand. I am coming from a 2019 Macbook Pro and not up to date on the latest drive or connection (thunderbolt?) technology tho. Please recommend me some drives to get that would work well and be fast. Thanks!",
        "created_utc": 1730356522.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "FN keys not working on USB C Magic Keyboard ",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gg84gw/fn_keys_not_working_on_usb_c_magic_keyboard/",
        "content": "Decided to upgrade from lighting Magic Keyboard to the new USB C one.   \nNoticed none of the fn keys work. Pressing  F11 is stuck to show desktop. \n\nFn keys are different on this keyboard than my lighting port one. WTH Apple ? \n\nAnyone else having this issue ? Huge bummer I've been waiting to upgrade to USB C\n\n  \n ",
        "created_utc": 1730355867.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "M4 Max MacBook Pro (128GB) for local LLM (coding and general advice)",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gg76yi/m4_max_macbook_pro_128gb_for_local_llm_coding_and/",
        "content": "Hi Reddit,\n\n\n\nI am thinking of getting the M4 Max MacBook Pro (128GB). My use cases are: \n\n(1) Coding (usually Rust and C++)\n\n(2) Asking some general advice (like career, how to format and ask a Reddit post, etc.)\n\n\n\nQuestion: \n\n(1) I want it at least above GPT 4 level AND 6t/s. Do you think it will work?\n\n(2) If so, which models? \n\n\n\nMy take is that Llama 3.1 70b instruct and Mistral Large would probably fit, but I would still like to check with the community’s knowledge before putting in the order. Not sure if this is the best place to post, I hope this doesn't violate the community rules (tried to post in other subreddit but got deleted immediately 🥲). \n\nThank you in advance! ",
        "created_utc": 1730351840.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Mac Mini M4 = Apple TV on steroids",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gg2tgv/mac_mini_m4_apple_tv_on_steroids/",
        "content": "Just sayin’… who needs tvOS and a remote when you have a Bluetooth keyboard and magic touchpad? 😁",
        "created_utc": 1730337279.0,
        "subreddit_name": "mac",
        "comments": 10
    },
    {
        "title": "Advice on external monitor for MacBook Pro",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggruy2/advice_on_external_monitor_for_macbook_pro/",
        "content": "Hello,\n\nRecently bought a 32 inch curved LG monitor to connect to my 2023 MacBook Pro (Apple M3). I didn't do my homework - this monitor is 32\" but with 1920x1080 resolution and everything is HUGE. I can't adjust the resolution to make things smaller.\n\nSo, can you please recommend a good monitor with higher resolution in the $180-240 range? I assume something like this 'Dell S3221QS 32 Inch Curved 4K UHD (3840 x 2160)' would work ok and I'd get a better resolution. Thank you.",
        "created_utc": 1730416659.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Macbook pro m4",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggm87j/macbook_pro_m4/",
        "content": "Is it worth getting the m4 macbook pro now, or waiting for the macbook air. I will be using it for Web searches and general tasks. Also, I want it to last for a long time - at least 8 years.",
        "created_utc": 1730401319.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "8GB M2/M3 MacBook Air",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggl26q/8gb_m2m3_macbook_air/",
        "content": "Do you think these will come down in price at Best Buy, etc. with Apple’s announcement that they’re not selling them anymore? As of today they’re still starting at $999 for the M3… If they are going to come down, would an 8GB RAM model make sense for my use case?\n\n\nI’m looking to buy a new MacBook to replace my ancient Windows PC and wondered if I should wait for a deal on one of these. I don’t have any interest in the AI stuff and don’t do anything that I think requires a lot of RAM, I just want to do the following:\n\n* Microsoft Office\n\n* Web browsers\n\n* Video calls - FaceTime, Signal, Zoom\n\n* Use two monitors (I know this eliminates M2)\n\n* Occasionally stream TV shows\n\nI do my gaming on consoles so no worries there. ",
        "created_utc": 1730398337.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Dock/Hub Recommendation for 2021 MacBook Pro M1 Pro",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggiu51/dockhub_recommendation_for_2021_macbook_pro_m1_pro/",
        "content": "I have a 16” MacBook Pro (2021, M1 Pro) with a 27” 4K LG and a 24” Dell monitor (1920x1200). Currently using an Anker 563 USB-C Hub ([link](https://www.amazon.com/dp/B0BNZ5TCG8?ref=ppx_yo2ov_dt_b_fed_asin_title)), but it only drives the second monitor through a silicon motion driver, which is buggy. \n\nLooking for a hardware-only dock/hub that powers my MacBook Pro (85W PD seems to keep it charged), supports both monitors, and connects with one USB-C cable. Ideally something affordable without too many extra features. Any recommendations?",
        "created_utc": 1730392553.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Citrix and Teams iPad App on Mac?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggisv2/citrix_and_teams_ipad_app_on_mac/",
        "content": "Hi all. I don’t currently have a Mac, I passed my M1 Air to my oldest daughter because I didn’t use it much. That said - I’m toying with the idea of using the new Mac Mini for work, but while my employer supports iPad, they will not support BYOD laptops.\n\nSo with that said, I’m curious if I could run the iPad Teams app/Citrix app on the Mac Mini, since i can’t use those apps for Mac? Can anyone see if those apps are available in the Mac App Store? ",
        "created_utc": 1730392463.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Help me buy a Mac?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gghr0w/help_me_buy_a_mac/",
        "content": "I'll provide as many details as possible.\nI just landed a new job at a company that is 100% Mac. I want to make the switch from PC / android as practically and cheaply as possible. Budget is flexible but frugal. Primary use is case is Excel spreadsheets... Loads of them. Not uncommon to have as many as 50 spreadsheets open at one time along with large PDFs of drawings/plans. \nMy office machine is a 2017 iMac, i5, 8GB.\nIt struggles a little with the workload and my boss is planning to replace next quarter. \nI want to get a refurbished Mac for home use to do this same work. Considering a mini or an Air. My current home PC set-up is a laptop on a stand pushing a large 2nd monitor, so an Air would be used in that same set up. I don't have room for a 2nd set-up. \n\nAre Intel Macs even worth considering anymore? Should I stick with an M1 or higher? Is 8GB still alright for my needs, or should I spring for 16GB? A mini would be cheaper but limits me to 1screen (however the iMac at work is only 1screen). The air would slide in to my existing set-up by simply replacing my current laptop. \n\nI have looked on Back market, and Mac of All Trades. Any thoughts on them or suggestions of others? \n\nAnything else that I should consider?\n\nThank you.",
        "created_utc": 1730389790.0,
        "subreddit_name": "mac",
        "comments": 8
    },
    {
        "title": "How much storage does macOS use up (deciding to get 256GB vs. 512GB)?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggh9ju/how_much_storage_does_macos_use_up_deciding_to/",
        "content": "Some are suggesting to get the RAM upgrade instead of storage. And getting an external SSD instead. Some might be fine with the base RAM, but want more storage. \n\n256GB might seem fine, but that isn't the actual amount of storage that you have at your disposal.\n\nAt the moment, how many GB does macOS use up, on a stock machine?",
        "created_utc": 1730388540.0,
        "subreddit_name": "mac",
        "comments": 15
    },
    {
        "title": "Performance on Macbook Air M2 16GB RAM vs Macbook Air M3 8GB RAM?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggh1kf/performance_on_macbook_air_m2_16gb_ram_vs_macbook/",
        "content": "Which of these is better in terms of noticeable performance? The use case is coding and note-taking, IDEs like IntelliJ, etc may be used. I assume the M3 will be bottlenecked by the low RAM so am leaning more towards the M2.\n\nto downvoters: suck my balls",
        "created_utc": 1730387980.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "New MacBook Pro with External Monitors? Or work with what I already have?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggfo43/new_macbook_pro_with_external_monitors_or_work/",
        "content": "So I've been going back and forth on this debate for weeks now, and I thought I would reach out to you guys, the masterminds.\n\nI have a Late 2020 MacBook air, a, M1 Chip iMac in light blue, and an apple watch SE that I am debating on turning in to get a gift card towards a new device. In total, I would be getting $655 in credit towards a device. I am debating on **EITHER**:\n\n**1. Turning in all of these devices for the new MacBook Pro M3 Chip, lowest level, and getting an external monitor system, which I would use for both working from home AND gaming on my computer, OR**\n\n**2. Turning in just my laptop and watch to my local Best Buy, getting a second monitor to work with my iMac, and going from there.**\n\nObviously one is more budget friendly than the other one, but I'm just trying to decipher whether Option 1 would be worth it in the long run. My late 2020 model 13 inch MacBook air lasted me two years during COVID-19 times on an external monitor, but then completely crashed right before my licensing exam, which is not something I want to happen with the new computer.\n\nI'm not saying the new computer has to last forever, but I don't want to have to purchase a new computer for the sake of a crash. I want to be able to turn in the computer and get money for it, rather than having to send it to the trash heap.\n\nAny and all opinions would be welcomed, thank you in advance!!",
        "created_utc": 1730384423.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Mac Mini - Powered USB Hubs",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggev15/mac_mini_powered_usb_hubs/",
        "content": "I currently have an Anker 575 dock hooked up to a monitor, speakers, Logitech receiver etc. the USB C out delivers power/charges my MacBook up to 85watts. \n\nWould I be able to plug this into the M4 Mac mini to use as a strictly as a hub (for old usb A ports and lower speed devices).  I hate the idea of having to change around the set up since it’s plug and play for multiple users in our household. \n\nI’m concerned about the 85 watt charging output on that port. I assume it wouldn’t output any power but I don’t want to risk damaging the Mac mini?  Thanks!",
        "created_utc": 1730382255.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Can Apple Silicon Mac utilize external SSDs connected to USB as if it was an internal storage?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggdw32/can_apple_silicon_mac_utilize_external_ssds/",
        "content": "Hello, I would like to buy my first MacOS Apple computer (I've been using iPad and Apple TV 4K but IBM PC desktops and laptops so far). I would like to buy the cheapest option (with 250GB internal storage) in case I wouldn't get used to using it. \n\nI'm used to using SSDs (including fast NVME SSDs) in external boxes connected to USB 3.2 Gen2 (10Gbps) in case of my IBM PCs; not only for data but also for booting various OSes and it works fine for me... I would like to ask if there is an easy way to operate MacOs on Apple-silicon MacOs computers in a similar way. Thus, specifically I would like to ask:\n\n1) Is it possible to configure to install (and run) AppStore MacOS applications in the default MacOs installation (i.e. installed on the internal SSD) to external SSDs connected to Apple Silicon Mac Mini via USB?\n\n2) Is it possible (and safe) to create bootable external SSD with another MacOs version / instance and boot and run the computer from the external SSD connected to USB without anyhow medling with the OS/data on the internal SSD?\n\n3) Is it possible and safe to do the same thing as in point 2) but with a non-MacOS operating system for testing purposes (e.g. Asahi Linux)?\n\nThanks for your answers.",
        "created_utc": 1730379534.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "What is the difference between M2 and M3",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggdr7o/what_is_the_difference_between_m2_and_m3/",
        "content": "I have to choose between a 13” MacBook Air (M3) and a 15” MacBook Air (M2) for work. I’ve looked over the specs but am not that computer literate. Is there any standout reason to go with one over the other? I’m especially not sure what the difference between M2 and M3 is. My job isn’t anything that requires any functions out of the ordinary. ",
        "created_utc": 1730379127.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Macbook Air M2 Questions",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggdibw/macbook_air_m2_questions/",
        "content": "I'm trying to connect my MacBook Air M2 Chip to two external monitors at work. Right now, I've got a Dell docking station, but I'm free to purchase a docking station. Do you have any suggestions? I can connect them via HDMI/DP. \n\nThat said, the other question would be an upgrade question. I'm looking at purchasing a new Macbook. Looking at the new options, would the recommendation be to go with the Pro (16GB) storage on the M4 chip or the Air (16GB) M3 chip? \n\nI travel quite a bit, and I have a lot of documents open at times, and I've felt my current M2 Air slow down. ",
        "created_utc": 1730378374.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Wireless USBC keyboard and mouse recommendations for mac mini m4",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggdcuq/wireless_usbc_keyboard_and_mouse_recommendations/",
        "content": "Looking to get a non apple wireless keyboard and mouse combo that uses USBC so I can plug the dongle into the Mac mini. \nDoes anyone have any recommendations?\n\nI'd like to avoid Bluetooth if possible.",
        "created_utc": 1730377896.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "MacBook Page Tool",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggcrui/macbook_page_tool/",
        "content": "I have created a document with the MacBook Page Tool, I need to add the Author name in the document properties (in the field of the metadata) How can I do it? Can I do it with the MacBook Page Tool? do I need to add the matadata with another tool?\n\nThanks",
        "created_utc": 1730376047.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "What do you want in a productivity timer?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggc7d8/what_do_you_want_in_a_productivity_timer/",
        "content": "I’m working on developing a productivity timer for macOS. I’m looking for advice on what works for you and any dream features . If anyone wants to beta test reach out. There will be a reward. \n\nAny advice, questions, comments appreciated. So you know what’s already built out: \n\nThe current features are:\n- click to start/stop timer\n- interval cycle of 20-10-20-10 min for each of sit-stand-sit-break respectively\n- customizable live nature backgrounds so it’s pretty\n- 10 second micro breaks every  5-15 min, requires no mouse movement, if you don’t stay still it will not start the micro break. \n\nThanks in advance. ",
        "created_utc": 1730374078.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "M2 MBA",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggbg3s/m2_mba/",
        "content": "So just today, apple announces to upgrade their M2 and M3 MBAs to 16gb as the base configuration. I just bought my M2 MBA (8gb RAM) recently, it's not even a week old. Is there a way to swap out or \"trade in\" my MBA to the new MBA 16gb when they come out? They said it will have the same price. ",
        "created_utc": 1730371265.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Anyone know how to download offline on Mac for Disney+ or Netflix?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggb96p/anyone_know_how_to_download_offline_on_mac_for/",
        "content": "I swapped to iPad only back in May - I knew I wanted only iPad, or only Mac.  The reason iPad won was because you could easily download offline for all the streaming apps where on Mac there’s only Prime and Apple TV+.\n\nTook me a few months, and I can easily complete all my tasks on iPad - but I don’t like how it’s so clunky with a cursor compared to Mac and is top heavy with the keyboard stand.\n\nDoes anyone know of a good way to do it for Netflix and Disney+?  Obviously would prefer free, but if the cost is cheaper than owning a Mac and iPad I can’t complain.\n\n",
        "created_utc": 1730370477.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Upgrade worth it from MB Pro 16 M1 Pro to new 16 inch M4 Pro Macbook ?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggazux/upgrade_worth_it_from_mb_pro_16_m1_pro_to_new_16/",
        "content": "HI,\n\nIm using the M1 Pro 16inch MB Pro since June 2022 mainly for video editing on Filmora (4k 30 ) youtube videos and Garagebend. Also all my office work. Basically my only computer. Its got 16Gb ram and a 1tb ssd.  Its on 89% battery health now and the machine is working perfectly fine. I was contemplating upgrading to the M4 16inch MB Pro base model with an upgrade to 1tb ssd. Would the performance benefits be worth it ?",
        "created_utc": 1730369379.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Still bad!",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggahwk/still_bad/",
        "content": "Audio-Technica earbuds working fine on iPhone.  Can't get Sequoia Macbook to connect to them.  On rebooting bluetooth is turned off.  Turn it on in menu bar, it's still off in bluetooth settings.  Won't turn on. FFS!",
        "created_utc": 1730367138.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Travelling setup - advice needed please",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggag8z/travelling_setup_advice_needed_please/",
        "content": "I own a Ipad Air M1 and love it, but as a device to do my job on it doesnt really work, so I was looking at a Macbook Air as a travel and video editing laptop.\n\nWhile waiting for the Air to be upgraded to M4, the new Mini was announced and the size is fantastic for travel.\n\nCould I use the Ipad Air as a monitor on the Mac Mini if I were to use that as my travel setup?\n\nFor context, I travel a lot, 3-6 months out of the each year and size is crucial hence I currently have two laptops, home gaming laptop (workstation) and travel laptop (Surface pro) and my iPad is just a entertainment, drawing and modeling device.",
        "created_utc": 1730366934.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Studio Display with a non-Bootcamp Win11 setup - How to get the built-in peripherals (esp. camera) to work?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gg9vf8/studio_display_with_a_nonbootcamp_win11_setup_how/",
        "content": "Dear community,\n\nI know the Studio Display has mixed popularity, but I really love mine.\n\nI have recently made the shift towards Windows for work, while keeping my iPad Pro and MBP for non-work usage. For work, I bought the best-value Lenovo ThinkCentre I could find that would run the 5K resolution (see specs in the images attached).\n\nI am anticipating lots of video calls in the next 2-3 years and would really like to get the built-in camera to work with the ThinkCentre. Getting the speakers and camera to work would be a great nice-to-have. I have spent some time scrolling through reddit and other forums, but only found posts relating to custom ITX builds or intel Macs with Bootcamp.\n\nThe steps in various guides have not yielded results. I can't even see the camera in the device manager. I have downloaded the Bootcamp Drivers to windows PC, but I am not sure how to proceed.\n\nAny advice?\n\nhttps://preview.redd.it/rm8mg66f12yd1.png?width=606&format=png&auto=webp&s=c1081a16f388398b6fb709253f415e622493e237\n\nhttps://preview.redd.it/h1ml5uqg12yd1.png?width=1450&format=png&auto=webp&s=f690f33a56b1a14944e45b2fbb64299be3958ef8\n\nhttps://preview.redd.it/hj9yhpmh12yd1.png?width=1464&format=png&auto=webp&s=35cc3ce4afc1e3442ef1bcb9474d18855d5836da\n\n",
        "created_utc": 1730364249.0,
        "subreddit_name": "mac",
        "comments": 7
    },
    {
        "title": "M1 Pro Vs M4 - worth the upgrade?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gg9aht/m1_pro_vs_m4_worth_the_upgrade/",
        "content": "Has anyone upgraded from their M1 Pro MBP 14\" to the newer models - if so, why?\n\nI'm a software developer and use my Mac almost daily for work, personal projects etc., and only really use it for developing all types of software. My current M1 Pro MBP still feels super fast and fluid, but at times I can see slowdowns. Now that Apple has make 16GB RAM their standard, I'm thinking more and more of selling this machine to get an upgrade, but not sure if that upgrade would be worth it? I'd ideally like to see this machine while it's still around the $900 mark as second-hand but obviously that value is going to go down as the years go on. After all, this machine will be 5 years old next year.",
        "created_utc": 1730361483.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Should I get Mac Mini M4 over a MacBook air M1?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gg91c4/should_i_get_mac_mini_m4_over_a_macbook_air_m1/",
        "content": "Hi, I am an owner of a MacBook Air M1 8/256 and right now I'm studying computer science at university. Should I change my MacBook air for a mac mini Or should I have both? The education price is very interesting, and I will get more power and RAM...\nI can't renounce at the portability of notebook for now (I use it when I'm moving), but 8GB of RAM is sometimes a limit. Should I Wait for a MacBook Air M4, or I buy the Mac Mini M4?",
        "created_utc": 1730360225.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Liquid damage MacBook Air M3 with Apple Care +",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gg6ogd/liquid_damage_macbook_air_m3_with_apple_care/",
        "content": "Water entered my screen and it’s not looking good rn. Data is being transferred as we speak. How much will Apple care plus charge me tomorrow when I show it to him? ",
        "created_utc": 1730349857.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Macbook Pro M2 Pro issue..",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gg65jl/macbook_pro_m2_pro_issue/",
        "content": "hey all,\n\nfor the past few months, my laptop would die when it was around \\~20 battery health and shut off completely. After plugging it in, it would then reboot saying it was 20% again. one day, i tried to use my laptop but it was completely dead despite charging it to 100% the night prior. the track pad didnt click, no display, and also the light from the charging was gone. apple store quoted me that the logic board was broken so i had that repaired ($1000). now, after 1 month, im noticing the same issue as it dies at around 10%. what should i do? is this a battery issue? should i go to an independent repair shop?",
        "created_utc": 1730347892.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Boot (almost) any old Mac from usb.",
        "score": 2,
        "url": "https://www.reddit.com/gallery/1gg4pho",
        "content": "I was having a lot of trouble booting Windows installation DVDs because of the silly \"select disk 1 or 0 to boot\" problem that blocked the keyboard completely, so remembering old problems I remembered an old Lanix PC that didn't boot via USB and only had a CD reader. , the tool is PLOP BOOT MANAGER, it can be burned to any disk and boot non-compatible devices from USB. This is how I have saved myself headaches and DVDs with this iMac 2005 5.1 that now has Windows 10 pro 64bits.",
        "created_utc": 1730343052.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Macbook Air Vs Mac Mini",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gg47p4/macbook_air_vs_mac_mini/",
        "content": "I want your opinion on something. You see, I am planning on buying a Mac. But I'm torn between buying the Macbook Air or the Mac Mini. The Macbook Air I'm considering is the M3 with 16GB RAM, 256GB storage and the Mac Mini has 16GB RAM, 512GB storage. The catch is that the Mac Mini is a desktop, and I still need to buy peripherals, which I already have—a 27\" Samsung Curve monitor and also a Logitech keyboard and mouse. I'm considering the Macbook Air because I have been dreaming about owning one since I was a teenager. I'm thinking of the Mac Mini because it aligns with my lifestyle. I do not do any uni, and I am a nurse, so I don't use my laptop more often. My current set-up is my 3yo Acer Laptop with Intel i5, 8GB RAM, 475GB of storage, with the monitor, keyboard and mouse. What do you think? What should I buy? I'm open to any suggestions. Thank you.\n\n  \nEDIT: I mainly use my computer for general use and maybe future-proofing. I also plan on going for a photography route soon. ",
        "created_utc": 1730341502.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Mac Mini - New M4 (Not pro)",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gg38cy/mac_mini_new_m4_not_pro/",
        "content": "Is Mac Mini M4 good for android and web development? Or should i go for M4 pro. But the pricing is three times higher.\n\nPlease clarify ..  \nThanks\n\n  \nedit:\n\nI chat with apple support. They told that base model can be used for android programming.",
        "created_utc": 1730338484.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Use iPad as second screen in my work computer",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gg1dwl/use_ipad_as_second_screen_in_my_work_computer/",
        "content": "I cannot sign into any apple account in my work computer, which prevents me from using sidecar.\n\nIs duet worth the money? I also saw the luna dongle. \n\nAny suggestion is welcomed. \n\nA last remark, I cannot access the App Store from my work computer either. \n\nThanks in advance to everyone!",
        "created_utc": 1730333164.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Kuo: iPhone 17 will use new Wi-Fi and Bluetooth chip made in-house by Apple",
        "score": 505,
        "url": "https://9to5mac.com/2024/10/31/kuo-iphone-17-will-use-new-wi-fi-and-bluetooth-chip-made-in-house-by-apple/",
        "content": "",
        "created_utc": 1730384338.0,
        "subreddit_name": "gadgets",
        "comments": 64
    }
]