[
    {
        "title": "Apple announces largest-ever $110 billion share buyback as iPhone sales drop 10% ",
        "score": 2991,
        "url": "https://www.reddit.com/r/stocks/comments/1ciq1fw/apple_announces_largestever_110_billion_share/",
        "content": "Apple reported fiscal second-quarter earnings on Thursday that were slightly higher than Wall Street expectations, but showed overall revenue down 4%, and iPhone sales falling 10%. \n\nApple announced that its board had authorized $110 billion in share repurchases, the largest in the company’s history, and a 22% increase over last year’s $90 billion authorization.  \n\nHere’s how Apple did versus LSEG consensus estimates in the March quarter: \n\nEPS: $1.53 vs. $1.50 estimated \n\nRevenue: $90.75 billion vs. $90.01 billion estimated \n\niPhone revenue: $45.96 billion vs. $46.00 billion estimated \n\nMac revenue: $7.5 billion vs. $6.86 billion estimated \n\niPad revenue: $5.6 billion vs. $5.91billion estimated \n\nOther Products revenue: $7.9 billion vs. $8.08 billion estimated \n\nServices revenue: $23.9 billion vs. $23.27 billion estimated \n\nGross margin: 46.6% vs. 46.6% estimated \n\nApple did not provide formal guidance, but Apple CEO Tim Cook told CNBC’s Steve Kovach that overall sales would “grow low single digits” during the June quarter.  \n\nApple posted $81.8 billion in revenue during the year-ago June quarter and LSEG analysts were looking for a forecast of $83.23 billion.  \n\nApple reported $23.64 billion in net income, a 2% decrease from $24.16 billion in the year-earlier period. Overall sales fell 4% in the March quarter. \n\nCook told CNBC’s Steve Kovach that year-over-year sales suffered from a difficult comparison to the year-ago period, when the company realized $5 billion in delayed iPhone 14 sales from Covid-based supply issues. \n\n“If you remove that $5 billion from last year’s results, we would have grown this quarter on a year-over-year basis,” Cook said. “And so that’s how we look at it internally from how the company is performing.” \n\nApple said iPhone sales fell nearly 10% to $45.96 billion, suggesting weak demand for the current generation of iPhones, which were released in September. The sales were in-line with analyst estimates, and Cook said that without last year’s increased sales, iPhone revenue would have been flat.  \n\nMac sales were up 4% to $7.45 billion, but they are still below the segment’s high-water mark set in 2022. Cook said sales were driven by the company’s new MacBook Air models that were released with an upgraded M3 chip in March.  \n\nOther Products, which is how Apple reports sales of its Apple Watch and AirPods headphones, was down 10% on an annual basis to $7.9 billion in revenue. \n\nDuring the quarter, Apple released its first new major product category in years, the Vision Pro virtual reality headset, but the $3500 device is expected to sell in low quantities, especially compared to Apple’s major product lines.  \n\n“We’re only scratching the surface there so we couldn’t be more excited about our opportunity there,” Cook said. \n\nApple has not released a new iPad since 2022, which is a drag on sales. Revenue for the division fell 17% to $5.6 billion. Apple is expected to announce new iPads on May 7 that could revive demand for the product line.  \n\nCook also said Apple has “big plans to announce” from an “AI point of view” during its iPad event next week as well as at the company’s annual developer conference in June.  \n\nServices was a bright spot during the quarter. Sales rose 14.2% to $23.9 billion. That’s how Apple reports revenue from its subscription services, warranties, licensing deals with search engines, and payments. Apple has a broad definition of subscribers, which includes users subscribing to apps through Apple’s App Store, and said that it has over 1 billion paid subscriptions.  \n\nSales in Greater China, Apple’s third largest region, were off 8% to $17.8 billion in revenue, which was significantly better than the $15.25 billion in sales expected by FactSet analysts, potentially quelling investor worries that Apple may have been losing market share to local competitors such as Huawei.  \n\n“I feel good about China, I think more about long term than to the next week or so,” Cook said. \n\nCook told CNBC that iPhone sales grew in China during the quarter. “That may come as a surprise to some people,” Cook said.  \n\nIn addition to the buyback authorization, Apple said it would pay a 25 cent dividend, a one cent increase. Apple’s $110 billion buyback authorization is the largest-ever announced, ahead of Apple’s previous repurchases, according to data from Birinyi Associates.  \n\nSource: https://www.cnbc.com/2024/05/02/apple-aapl-earnings-report-q2-2024.html",
        "created_utc": 1714681940.0,
        "subreddit_name": "stocks",
        "comments": 523
    },
    {
        "title": "Well played Mr. Tim Apple",
        "score": 3901,
        "url": "https://i.redd.it/vnhi72p673yc1.jpeg",
        "content": "",
        "created_utc": 1714687802.0,
        "subreddit_name": "wallstreetbets",
        "comments": 259
    }
]