[
    {
        "title": "Nvidia Overtakes Apple to Become World's Largest Company",
        "score": 820,
        "url": "https://www.reddit.com/r/stocks/comments/1gjgfct/nvidia_overtakes_apple_to_become_worlds_largest/",
        "content": "\nNvidia stock was rising early Monday, pushing its market capitalization past Apple's to make the chip maker the world's largest company.\n\nNvidia shares were up 1.4% at $137.35 in early trading. The stock rose 2% on Friday.\n\nThat gave Nvidia a market cap of $3.365 trillion, just ahead of Apple's $3.338 trillion, according to Dow Jones Market Data.\n\nContinued high spending from big technology companies on artificial-intelligence infrastructure, including the company's Blackwell processors, look to be a more fundamental driver for Nvidia stock.\n\n\"We have further raised our big tech capex forecasts following the quarterly results last week. We now expect their combined spending to grow 50% this year to $222 billion, and another 20% to $267 billion in 2025,\" wrote Mark Haefele, chief investment officer at UBS Global Wealth Management, in a research note.\n\nIntel shares were down 2.9% in morning trading. Among other chip makers, Advanced Micro Devices was off 0.6% and Broadcom rose 1.7%.​​​​​​​​​​​​​​​",
        "created_utc": 1730732786.0,
        "subreddit_name": "stocks",
        "comments": 189
    },
    {
        "title": "Mega Bull is about to be unleashed",
        "score": 2705,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gje2dz/mega_bull_is_about_to_be_unleashed/",
        "content": "The US equities market are about to experience a powerful surge in the coming weeks as the participants gets clarity on:\n\n1) US election results (Nov 5): Kamala and Trump have very different ideas on managing economy, international trade , and foreign policy. The market is sitting on the fence (not commiting any more cash and rightly so) till the election results are out and investors know how a sector is likely to perform in next 12-24 months.\n\n2) At least 25 basis rate cut by US Fed (Nov 7):  CPI report last week was benign enough to free US Fed for another rate cut of 25 basis points. US middle class, small businesses, and even investors are reeling under high interest rates. And another rate cut will bolster their confidence to invest and bring borrowing costs lower to spur consumption.\n\n3) Nvidia earnings (Nov 20): Nvidia has been the bulwark of AI sector. Most fabulous amongst the fabulous 7. Its earnings results are likely to give another confirmation of high demand of AI chips (which will lead to higher productivity and efficency) and provide a strong boost Nasdaq returns by the end of the year. \n\nHow to trade:\n\nBuy Nvda Calls at strike price of 145$ with 4 weeks expiry.\n\nBuy SMH ETF Calls at strike price of 255$ with 4 weeks expiry.\n\nBuy VOO ETF Calls at strike price of 545$ with 4 weeks expiry. ",
        "created_utc": 1730726479.0,
        "subreddit_name": "wallstreetbets",
        "comments": 501
    },
    {
        "title": "NVDA what are you trying to tell us?",
        "score": 209,
        "url": "https://i.redd.it/6bpr1ynf1xyd1.jpeg",
        "content": "",
        "created_utc": 1730739608.0,
        "subreddit_name": "wallstreetbets",
        "comments": 115
    },
    {
        "title": "Beware of the curse of the Dow and chasing NVDA ",
        "score": 111,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gjgd0i/beware_of_the_curse_of_the_dow_and_chasing_nvda/",
        "content": "Clever selling and timing by the ceo of NVDA and the Citadel group to off load in front of the curse of the Dow \n\n\n\"Over the past ten years, stocks that have been added to the Dow lost an average of 20% in the first year after inclusion. Some have done considerably worse.\"\n\nIt's a phenomenon known as the \n\" Curse of the Dow \"\n\nhttps://www.kiplinger.com/article/investing/t038-c008-s001-the-curse-of-the-dow.html",
        "created_utc": 1730732622.0,
        "subreddit_name": "wallstreetbets",
        "comments": 32
    }
]