[
    {
        "title": "Google to buy nuclear power for AI datacentres in ‘world first’ deal",
        "score": 528,
        "url": "https://www.reddit.com/r/stocks/comments/1g47oik/google_to_buy_nuclear_power_for_ai_datacentres_in/",
        "content": "https://www.theguardian.com/technology/2024/oct/15/google-buy-nuclear-power-ai-datacentres-kairos-power\n\nGoogle has signed a “world first” deal to buy energy from a fleet of mini nuclear reactors to generate the power needed for the rise in use of artificial intelligence.\n\nThe US tech corporation has ordered six or seven small nuclear reactors (SMRs) from California’s Kairos Power, with the first due to be completed by 2030 and the remainder by 2035.\n\nGoogle hopes the deal will provide a low-carbon solution to power datacentres, which require huge volumes of electricity.\n\nThe US company, owned by Alphabet, said nuclear provided “a clean, round-the-clock power source that can help us reliably meet electricity demands”.\n\nThe explosive growth of generative AI, as well as cloud storage, has increased tech companies’ electricity demands.\n\nLast month, Microsoft struck a deal to take energy from Three Mile Island, activating the plant for the first time in five years. The site, in Pennsylvania, was the location of the most serious nuclear meltdown in US history, in March 1979. Amazon bought a datacentre powered by nuclear energy in March from Talen Energy.\n\nThe locations of the new plants and financial details of the agreement were not revealed. Google has agreed to buy a total of 500 megawatts of power from Kairos, which was founded in 2016 and is building a demonstration reactor in Tennessee, due to be completed in 2027.\n\nMichael Terrell, the senior director for energy and climate at Google, said: “The grid needs new electricity sources to support AI technologies that are powering major scientific advances, improving services for businesses and customers, and driving national competitiveness and economic growth.\n\n“This agreement helps accelerate a new technology to meet energy needs cleanly and reliably, and unlock the full potential of AI for everyone.”\n",
        "created_utc": 1728998805.0,
        "subreddit_name": "stocks",
        "comments": 76
    },
    {
        "title": "ASML plummets 11% after releasing disappointing earnings, lowering revenue and gross margin guidance for the full year",
        "score": 511,
        "url": "https://www.reddit.com/r/stocks/comments/1g49oyi/asml_plummets_11_after_releasing_disappointing/",
        "content": "ASML shares are falling -11% in a matter of minutes as it reported Q3 bookings of €2.63B, versus the estimate of €5.39B, while 2025 sales are seen at €30-35B, versus estimates of €35.94B.  Other Semiconductor companies are falling in sympathy. AMD -5%, NVDA -4%, AVGO -4%\n\n  \nPress Release:\n\n  \n**ASML reports €7.5 billion total net sales and €2.1 billion net income in Q3 2024**  \n**ASML expects total net sales for 2024 of around €28 billion**\n\nVELDHOVEN, the Netherlands, October 15, 2024 – Today, ASML Holding NV (ASML) has published its 2024 third-quarter results.\n\n* Q3 total net sales of €7.5 billion, gross margin of 50.8%, net income of €2.1 billion\n* Quarterly net bookings in Q3 of €2.6 billion^(2) of which €1.4 billion is EUV\n* ASML expects Q4 2024 total net sales between €8.8 billion and €9.2 billion, and a gross margin between 49% and 50%\n* ASML expects 2024 total net sales of around €28 billion\n* ASML expects 2025 total net sales to be between €30 billion and €35 billion, with a gross margin between 51% and 53%",
        "created_utc": 1729004278.0,
        "subreddit_name": "stocks",
        "comments": 281
    },
    {
        "title": "Semis take a hit after news on limiting exports ",
        "score": 128,
        "url": "https://www.reddit.com/r/stocks/comments/1g49o6s/semis_take_a_hit_after_news_on_limiting_exports/",
        "content": "The semi industry is taking a hit after news about possible limits to exports.  See the article for more information on what is going on.  I just found it and wanted to get thoughts from the community about the news. \n\n\nPlease share your thoughts about the article and possible implications over the next few months.  \n\nhttps://finance.yahoo.com/news/us-weighs-capping-exports-ai-004651596.html\n\n(Bloomberg) -- Biden administration officials have discussed capping sales of advanced AI chips from Nvidia Corp. and other American companies on a country-spe...",
        "created_utc": 1729004223.0,
        "subreddit_name": "stocks",
        "comments": 44
    },
    {
        "title": "\"frontier tech\" portfolio ",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1g4cmvs/frontier_tech_portfolio/",
        "content": "hey all, sharing what i'm calling my \"frontier tech\" portfolio, broken down by percentages. i'm looking for valuable input, feedback, and discussion around it. and, if it happens to be helpful to anyone, even better. i do want to clarify a few things:\n\n* i'm focused on AI, bitcoin, and space. investment vehicles or not, i simply think each are tech frontiers that hold tons of promise, are poised for massive growth, and will bring immense amounts of value to the world over the next few decades. let's just call this a \"frontier tech\" portfolio, to give it a name i can reference.\n* i'm not looking for feedback that just disagrees with that thesis. whether you think AI is all hype, or you are anti-Bitcoin and think it's a ponzi scheme, or you think space is a waste of resources, or anything along these lines - that's ok, i respect that perspective, but i'd like to avoid arguing about it. we just disagree about some fundamental things, and you won't convince me i'm simply wrong.\n* i AM looking for feedback on blind spots, poor/missing assumptions, overconfidence, things i'm not considering, or any other constructive input that falls within the framework of the overall thesis. i'm not just looking for people to agree with me (though that is interesting input as well) - i just want feedback that can be applied within my overall investing philosophy.\n* yes, i'm missing some key areas of what many would call \"frontier tech\" - biotech, green / nuclear energy, cybersecurity, to name a few - but i just don't have the same level of confidence in specific areas of those. i prefer to stay relatively focused on the categories where i'm most confident and able to stay up to date.\n* i'm trying to keep my language somewhat appealing to a wide audience. not looking to get too bogged down in technical details or language that would alienate someone reading this stuff who's less familiar with one or any of the spaces/categories.\n* my primary goal is a portfolio of funds and stocks that i can invest in with *strong long-term confidence in growth.* not stuff i trade frequently. and not stuff i love the idea of or that seems interesting / sexy but that i don't know enough about (SMCI, PLTR, altcoins as some good examples). i also generally prefer companies whose leadership i trust and/or admire.\n\nok, with that out of the way, let's dive in:\n\n**30% AI** - 10% NVDA, 5% SOXQ, 15% balanced mixed of NOW, MSFT, AAPL, GOOGL, META, AMZN\n\n* HIGH LEVEL: to me, this category is ABSOLUTELY going to change our world in fundamental ways over the next several decades. AI's potential is not chatGPT, or smarter versions of it. it's far beyond what we're seeing from LLMs today. if you listen to the engineers and operational leaders within the AI space, listen to not what they \"believe\" is gonna happen, but to what they know is coming because they've already used the tech, usually 1-2 years before the public even sees it, these people are overwhelmed, amazed, terrified, enchanted, bewildered. to me, that's just very interesting. i believe what some others do - that we're in the midst or on the verge of another technological revolution. i'm not bothered much that AI isn't monetizing in demonstrable, repeatable ways. i think there's been and continues to be enough fundamental, increasing advancement in this field that the value creation will absolutely surpass what most people think. as for the individual stocks, i'll do a quick dive here. to be clear, I don't think these are groundbreaking choices and many are very obvious. but, seems useful to give my favorite things about each:\n* 10% NVDA - these guys are and will continue to be at the center of the whole thing. their moat is extensive. it's not just GPU / blackwell demand. it's their CUDA programming language and universe, and stickiness of it. it's the long-term horizon required for their data centers that makes 5-10 year customers out of everyone who buys their stuff. it's CEO jensen pushing them and already looking for the \"next big thing.\" just a lot of confidence here.\n* 5% SOXQ - i like this semiconductor ETF a little more than SMH because it's more diverse (SMH is like 25% NVDA, which is great if i didn't already allocate so much there), and it's got a low expense ratio (0.19%). i love this exposure because the AI industry is driven by these companies (e.g. TSMC, Micron, Broadcam, Qualcomm, AMD, AMAT).\n* 15% mix of these...\n   * NOW - excellent leadership and integrated heavily with NVDA tech; will benefit hugely from AI boom with AI-driven automation\n   * META - founder-run and with a clear vision; demonstrating enormous resources and focus on building AI models, meeting consumer needs, being pioneers in tech at large\n   * AAPL - will probably benefit the most from consumer-facing AI products and implementation; strong leadership\n   * AMZN - AWS is a profit monster that will be huge for AI tools and services and data centers; logistics and ecom will be big AI beneficiaries; strong leadership\n   * MSFT - deeply embedded in the AI revolution with its investment in OpenAI + AI integration into Azure and Microsoft 365; excellent leadership\n   * GOOGL - AI pioneer with DeepMind / Brain; they still own search; have enormous amount of data; questionable leadership but I'm holding for now\n* No TSLA??? no. i just don't trust elon musk enough at this point. and i need confidence in a company's leadership for me to invest in its stock. there's a big chance i'm missing out (their robotics division might be incredible), but I'm able to sleep OK with that.\n* i'm also missing plenty of other AI picks. i know that. these are the ones i can invest in with the most confidence.\n\n**30% Bitcoin** - 25% Bitcoin itself (cold storage or an ETF), 5% MSTR\n\n* HIGH LEVEL: why Bitcoin? books have been written about it, but to shortly summarize my perspective - it's quite volatile and risky short-term, and quite growth-oriented and (thus far) safe long-term. excellent store of value. wonderful technology, math/code based, and may or may not upend some portion of the financial system. limited supply that's only decreasing over time. immutable. now adopted by many big institutions. goes on giant bull runs every 4 or so years. some days, it's hard to justify NOT putting more into this one, but for now i'm convinced that  diversification is the better long-term play.\n* 20% Bitcoin - many would argue that holding actual Bitcoin, ideally off exchanges and on cold storage is the smartest play here. but there are also arguments for FBTC or IBIT (helpful in tax-advantaged accounts; trusting an ETF seems safer to some - very debatable). i do some cold storage, and some FBTC (they self-custody their Bitcoin, which not everyone does). either way, just Bitcoin. it's the only crypto play where my confidence level is very high.\n* 5% MSTR - this is a leveraged Bitcoin play. strong chance it outpaces BTC growth rate during bull runs. i may shift some MSTR profits to Bitcoin over time if it starts to really offset my 4:1 BTC:MSTR ratio.\n\n**30% Space** - 10% ASTS, 10% RKLB, 5% LUNR\n\n* HIGH LEVEL: the tech for space finally seems to match the potential that's been talked about for decades and decades. for a while, space-x really proved this out, almost single-handedly. but we clearly have some strong other players either in or entering the category. my favorites are these three. here's why:\n* 10% ASTS - you should read the kook report (google it) for a true deep dive, but to hit my high level points: they are pre-revenue but with the potential for MASSIVE growth. effectively, their satellite system aims to offer a global cellular network. think starlink but more b2b and generally better tech. they own tons of patents. they are 5+ years ahead of what many think will be a winner-takes-most race. their partners already include AT&T, Verizon, Vodafone, Rakuten, American Tower, Bell Canada, and more. they have excellent leadership. i find this a risky-ish play as they have tons to still accomplish, but the potential growth is enormous.\n* 10% RKLB - effectively, a space-x competitor on smaller rockets, with a fraction of the market cap and a huge runway for growth. i think still heavily undervalued today. nerdy/awesome leadership. vertically integrated. as telecom, defense, and general research spending expands to space economy, RKLB is positioned very, very well.\n* 5% LUNR - i've spent less time researching them than the other two, but my confidence level in the risk/reward is still pretty high. key player in the lunar economy - one of few companies that can deliver payloads to the moon. very niche but valuable moat. huge potential, good amount of risks ahead.\n\n**10% cash** - ...to buy them juicy dips.\n\nok, that's my \"frontier tech\" portfolio summary. to repeat - this is what i can confidently invest in for what i believe will be better-than-average returns over the next 10+ years. i recognize that this discussion didn't even really touch share price, EPS, P/E, profitability, revenue, or other key details. this just isn't the place where i'm getting into that. i can say that i'm comfortable with the financial metrics and details regarding these companies. but this discussion is mainly focused on what categories i think are poised for the most growth, and what companies/stocks/assets in those categories seem to be most positioned to lead that growth. thanks for reading.\n\n*\\*\\*\\*The information provided is for educational and informational purposes only and should not be considered financial advice. Please consult a professional advisor before making any financial decisions.\\*\\*\\**",
        "created_utc": 1729011681.0,
        "subreddit_name": "investing",
        "comments": 8
    }
]