[
    {
        "title": "My mother asked me if I can help her with investing",
        "score": 14,
        "url": "https://www.reddit.com/r/investing/comments/1gw7a66/my_mother_asked_me_if_i_can_help_her_with/",
        "content": "Im 20 years old and have been learning about investing for a solid 2-3 years now. My mother (37) sees and appreciates the work i’ve been putting in and asked me today for advice. \n\n“Should I invest with the bank or would you want to help me?”\n\nI told her i’d help her. She doesn’t like much risk in any areas of her life so i’m thinking on focusing her portfolio on ETFs (VOO, SCHD) or simply just the S&P 500. \n\nAlso thought about dividend paying companies (KO, O) or large caps like AAPL, MFST etc. \n\nConsidering the bull market, a lot of non investors have been getting excited about the market recently. We’re at/near market ATH so I feel like I should tell her to hold off for a bit and wait for a dip but you can never time the market. \n\nWhat are your thoughts? Any advice would be much appreciated. ",
        "created_utc": 1732161266.0,
        "subreddit_name": "investing",
        "comments": 31
    },
    {
        "title": "Deep dive into Etsy - On a path to a dangerous spiral",
        "score": 38,
        "url": "https://www.reddit.com/r/stocks/comments/1gwo236/deep_dive_into_etsy_on_a_path_to_a_dangerous/",
        "content": "**1.0 Introduction**\n\nEtsy started by brilliantly carving out a niche in handmade and vintage goods, but now it faces challenges that threaten its unique spot in e-commerce and I’ll argue it is going down the path to a dangerous spiral.\n\nThe idea to connect buyers with sellers of handmade/vintage goods is amazing, and there’s no doubt that there is demand for it.\n\nAny marketplace has two important metrics:\n\n* The **Gross Merchandise Value**, also known as “GMV”, represents the value of all products sold through the website. Etsy decided to use **Gross Merchandise Sales** (“GMS“), which is just a different term.\n* The **take-rate** represents their share of the GMS.\n\nIts GMS increased from \\~$4 billion in 2018 (prior to the pandemic) to $13.5 billion in 2021. However, since then, Etsy has experienced a decline and the GMS in 2023 was $13.2 billion. The lack of growth is either a lack of demand or a lack of supply in the marketplace.\n\n**2.0 The real problem**\n\nThe company discloses the number of active buyers and sellers, and together, they paint quite a picture.\n\nThe number of active sellers continued to grow. From 2021 to 2023, it increased from 7.5 million to 9 million.\n\nThe number of buyers has been flat.\n\nEconomics101 teaches us a simple lesson: ***If the demand is stable, and there is an increase in supply, the prices will decrease.***\n\nEconomics also teaches that ***lower prices would attract more buyers, increasing the demand.***\n\n***So, where are the buyers?***\n\nAs Etsy doesn’t (and cannot) check the quality of all the products, more and more AI-generated product images combined with dropshipping flood the market. Here's a comment from a Reddit user that in my opinion does a great job summarizing the development:\n\n\"*Drop-shipping has absolutely ruined online marketplaces. I used to adore Etsy when it first started, but now its just absolute garbage. You have to reverse image search everything nowadays to make sure it's the real deal and actually handmade. This recently happened to me when I was trying to buy some pretty dice for my dnd group. Turned out it was a scam using a real artisan's pictures to sell their cheap shit. Thankfully, I was able to rectify the issue, but it was a hustle.*\"\n\nThe U.S. sellers used to contribute over 75% of Etsy’s revenue a decade ago. Now, it’s down to \\~50%.\n\nI’ll argue that this might lead to a spiral that will harm Etsy in the long run, with the events being:\n\n1. Increase in low-value products on Etsy.\n2. The low-value products will be perceived as a better deal when compared to the high-value products as they are cheaper.\n3. The sellers of high-value products will sell fewer products, and some of them will eventually leave Etsy.\n4. The buyers will be disappointed by the low-value products and will not use Etsy as much (or at all).\n\n**3.0 What is Etsy doing?**\n\nEtsy is spending \\~30% of its revenue on Marketing (vs. 20% a decade ago) and has even engaged in TV ads to raise awareness and bring new customers.\n\nOver the last few years, the company has been spending $700-800m per year, only to keep the revenue flat. It is accepting the fact that buyers will be disappointed, and the strategy is to replace them with new ones.\n\n**4.0 The take-rate**\n\nThe only other way for Etsy to grow its revenue is to increase its take-rate, and its share of the GMS.\n\nThe company splits its revenue into two groups:\n\n* **Marketplace revenue** (\\~73% of total) - These are **required** fees that cannot be avoided (Transaction fees, payment processing fees, listing fees).\n* **Service revenue** (\\~27% of total) - These are **optional**, such as on-site advertising, shipping labels, etc.\n\nIts take-rate is incredibly high at \\~21%, double from a decade ago. For comparison, eBay’s take rate is \\~14%.\n\n**5.0 Terrible management decisions**\n\nAs the company was reaching its peak, the management decided to make 3 large acquisitions:\n\n* **Reverb** (Aug 15th, 2019) - A marketplace for new, used, and vintage music gear was acquired for **$270 million**.\n* **Elo 7** (July 2nd, 2021) - Also known as the “Etsy of Brazil”, a Brazil-based marketplace for unique, handmade items was acquired for **$212 million**.\n* **Depop** (July 12th, 2021) - a global fashion resale marketplace was acquired for \\~**$1.5 billion**.\n\nIt is important to note that Depop had an annual revenue of **$70 million!** No, this is not a typo. Etsy paid over 20x its revenue to acquire Depop!\n\nWell, not that long later, in Q3-2022, the company recorded impairment charges of **over $1 billion** for Depop and Elo7. No better way to destroy shareholders’ value quickly, than by overpaying for an acquisition.\n\nA year later, in Q3-2023, Elo7 was sold at a loss.\n\n**6.0 Historical financial performance**\n\nHistorically, this is still an impressive growth. Its revenue grew from <$200 million a decade ago, to $2.8 billion in the last twelve months and its gross margin remains stable at \\~70%.\n\nIts operating margin is lingering around 12% now, as both marketing & product development as % of revenue have been increasing. The increase in marketing expense (as % of revenue) has already been highlighted in a previous section. It is necessary to maintain the buyers’ base. So potential future improvements in the operating margin can only arise by decreasing the product development and general & administrative (as % of revenue).\n\n**7.0 Valuation**\n\nThe two key variables when it comes to valuing a company are:\n\n* **Revenue** \\- Given that the number of active buyers hasn’t grown in the last few years, it is difficult to expect revenue growth above inflation.\n* **Operating margin** \\- I do think there’s room to improve the margins by reducing product development and general & administrative (as % of revenue). My assumption is that that it will increase to 14% over time.\n\nBased on my input, the fair value of the company is **$3.2 billion ($29/share)**. This is significantly lower than the current market cap of **$5.7 billion ($51/share)**.\n\nAnyone betting on Etsy is ultimately betting that:\n\n1. The number of low-value products will decrease over time.\n2. The number of buyers will start growing again\n3. Etsy can continue increasing its take-rate, without losing sellers of high-value products.\n4. The management will not engage in acquisition (as they are clearly bad at it).\n\nI hope you enjoyed this post, feel free to share your thoughts.",
        "created_utc": 1732217582.0,
        "subreddit_name": "stocks",
        "comments": 14
    },
    {
        "title": "Bought the Dip: Alphabet (on sale)",
        "score": 94,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gwlxap/bought_the_dip_alphabet_on_sale/",
        "content": "The momentum is negative right now, mainly due to the ongoing lawsuit. However, this will pass—it's something that happens often with stocks. *Buy when there is fear.*\n\nI initially held 200 shares at $172.5, and today I added 400 more at an average price of $165.60 (split across two purchases). I expect a rebound in the short term, with profits returning soon.\n\nHere’s a recap of Alphabet's Q3 2024 numbers:\n\n* **Quarterly Results**:\n   * Total Revenue: $88.3 billion (+15% YoY)\n   * **Google Services**: $76.5 billion (+13%), driven by:\n      * Growth in Search and other services\n      * Increased subscriptions and device sales\n      * Strong YouTube ad performance\n   * **Google Cloud**: $11.4 billion (+35%), fueled by:\n      * AI infrastructure and generative AI solutions\n      * Higher adoption of core GCP products\n* **Profitability**:\n   * Operating Income: +34%, with a 4.5% margin expansion to 32%\n   * Net Income: +34%; EPS rose 37% to $2.12\n* **Key Highlights**:\n   * CEO Sundar Pichai highlighted AI as a major growth driver.\n   * YouTube's ad and subscription revenue surpassed $50 billion over the past four quarters.\n\n**Growth Drivers Moving Forward:**\n\n* Ad revenues: October (presidential ads), Black Friday, Christmas, and New Year campaigns.\n* YouTube: Big creators like Cristiano Ronaldo and MrBeast remain highly active.\n* Waymo: Successful expansion across multiple cities.\n* Cloud: Continued growth in demand and usage.\n\nI’m optimistic about a price target of $180 within two weeks. Good luck!",
        "created_utc": 1732212536.0,
        "subreddit_name": "wallstreetbets",
        "comments": 77
    },
    {
        "title": "Nvidia earnings: AI chip leader shows no signs of stopping mammoth growth",
        "score": 89,
        "url": "https://www.theguardian.com/technology/2024/nov/20/nvidia-earnings-ai-chipmaker",
        "content": "",
        "created_utc": 1732171379.0,
        "subreddit_name": "wallstreetbets",
        "comments": 21
    },
    {
        "title": "Here you go—you inbred sum b%tches!",
        "score": 5143,
        "url": "https://i.redd.it/qh2n8z6ikb2e1.jpeg",
        "content": "What felt like jewelry at first turned out to be chains.  Too many failed positions to post.  The crescendo was about a million desperado quick scalp attempts using 0DTE’s the last week.  Glued to my phone, cussing at an app that can’t talk back and pissing away a Range Rover! Now, I’m wearing a paper hat and slinging a salt shaker.  And before you say it…”Yes, you can give me your 2 cents worth!”  Thanks for all the brilliant DD.  See u on Monday!",
        "created_utc": 1732223058.0,
        "subreddit_name": "wallstreetbets",
        "comments": 588
    },
    {
        "title": "2 month rollercoaster: 2k>55k > -25k > 125k ",
        "score": 82,
        "url": "https://www.reddit.com/gallery/1gwj01d",
        "content": "After not trading for a 2 years to save up for a house, I started back up again in October with 2k. Hit a few runners with SOFI and Tesla earnings and got cocky with a weekly straddle on McDs earnings (theta-banged) which wiped me out. So like the degenerate I am, I pulled almost 60k from my EF and proceeded to lose about half from google and apple until apple finally had a good day. \n\n\nThe last 2 weeks I have come back with my biggest winners being Disney, Walmart and Snow. Outside of Walmart, I only played straddles with the last few being 12/20 expiries. I’m pulling out $160k to bolster the EF and play with the rest. ",
        "created_utc": 1732205748.0,
        "subreddit_name": "wallstreetbets",
        "comments": 21
    }
]