[
    {
        "title": "My mother asked me if I can help her with investing",
        "score": 14,
        "url": "https://www.reddit.com/r/investing/comments/1gw7a66/my_mother_asked_me_if_i_can_help_her_with/",
        "content": "Im 20 years old and have been learning about investing for a solid 2-3 years now. My mother (37) sees and appreciates the work i’ve been putting in and asked me today for advice. \n\n“Should I invest with the bank or would you want to help me?”\n\nI told her i’d help her. She doesn’t like much risk in any areas of her life so i’m thinking on focusing her portfolio on ETFs (VOO, SCHD) or simply just the S&P 500. \n\nAlso thought about dividend paying companies (KO, O) or large caps like AAPL, MFST etc. \n\nConsidering the bull market, a lot of non investors have been getting excited about the market recently. We’re at/near market ATH so I feel like I should tell her to hold off for a bit and wait for a dip but you can never time the market. \n\nWhat are your thoughts? Any advice would be much appreciated. ",
        "created_utc": 1732161266.0,
        "subreddit_name": "investing",
        "comments": 31
    },
    {
        "title": "Deep dive into Etsy - On a path to a dangerous spiral",
        "score": 38,
        "url": "https://www.reddit.com/r/stocks/comments/1gwo236/deep_dive_into_etsy_on_a_path_to_a_dangerous/",
        "content": "**1.0 Introduction**\n\nEtsy started by brilliantly carving out a niche in handmade and vintage goods, but now it faces challenges that threaten its unique spot in e-commerce and I’ll argue it is going down the path to a dangerous spiral.\n\nThe idea to connect buyers with sellers of handmade/vintage goods is amazing, and there’s no doubt that there is demand for it.\n\nAny marketplace has two important metrics:\n\n* The **Gross Merchandise Value**, also known as “GMV”, represents the value of all products sold through the website. Etsy decided to use **Gross Merchandise Sales** (“GMS“), which is just a different term.\n* The **take-rate** represents their share of the GMS.\n\nIts GMS increased from \\~$4 billion in 2018 (prior to the pandemic) to $13.5 billion in 2021. However, since then, Etsy has experienced a decline and the GMS in 2023 was $13.2 billion. The lack of growth is either a lack of demand or a lack of supply in the marketplace.\n\n**2.0 The real problem**\n\nThe company discloses the number of active buyers and sellers, and together, they paint quite a picture.\n\nThe number of active sellers continued to grow. From 2021 to 2023, it increased from 7.5 million to 9 million.\n\nThe number of buyers has been flat.\n\nEconomics101 teaches us a simple lesson: ***If the demand is stable, and there is an increase in supply, the prices will decrease.***\n\nEconomics also teaches that ***lower prices would attract more buyers, increasing the demand.***\n\n***So, where are the buyers?***\n\nAs Etsy doesn’t (and cannot) check the quality of all the products, more and more AI-generated product images combined with dropshipping flood the market. Here's a comment from a Reddit user that in my opinion does a great job summarizing the development:\n\n\"*Drop-shipping has absolutely ruined online marketplaces. I used to adore Etsy when it first started, but now its just absolute garbage. You have to reverse image search everything nowadays to make sure it's the real deal and actually handmade. This recently happened to me when I was trying to buy some pretty dice for my dnd group. Turned out it was a scam using a real artisan's pictures to sell their cheap shit. Thankfully, I was able to rectify the issue, but it was a hustle.*\"\n\nThe U.S. sellers used to contribute over 75% of Etsy’s revenue a decade ago. Now, it’s down to \\~50%.\n\nI’ll argue that this might lead to a spiral that will harm Etsy in the long run, with the events being:\n\n1. Increase in low-value products on Etsy.\n2. The low-value products will be perceived as a better deal when compared to the high-value products as they are cheaper.\n3. The sellers of high-value products will sell fewer products, and some of them will eventually leave Etsy.\n4. The buyers will be disappointed by the low-value products and will not use Etsy as much (or at all).\n\n**3.0 What is Etsy doing?**\n\nEtsy is spending \\~30% of its revenue on Marketing (vs. 20% a decade ago) and has even engaged in TV ads to raise awareness and bring new customers.\n\nOver the last few years, the company has been spending $700-800m per year, only to keep the revenue flat. It is accepting the fact that buyers will be disappointed, and the strategy is to replace them with new ones.\n\n**4.0 The take-rate**\n\nThe only other way for Etsy to grow its revenue is to increase its take-rate, and its share of the GMS.\n\nThe company splits its revenue into two groups:\n\n* **Marketplace revenue** (\\~73% of total) - These are **required** fees that cannot be avoided (Transaction fees, payment processing fees, listing fees).\n* **Service revenue** (\\~27% of total) - These are **optional**, such as on-site advertising, shipping labels, etc.\n\nIts take-rate is incredibly high at \\~21%, double from a decade ago. For comparison, eBay’s take rate is \\~14%.\n\n**5.0 Terrible management decisions**\n\nAs the company was reaching its peak, the management decided to make 3 large acquisitions:\n\n* **Reverb** (Aug 15th, 2019) - A marketplace for new, used, and vintage music gear was acquired for **$270 million**.\n* **Elo 7** (July 2nd, 2021) - Also known as the “Etsy of Brazil”, a Brazil-based marketplace for unique, handmade items was acquired for **$212 million**.\n* **Depop** (July 12th, 2021) - a global fashion resale marketplace was acquired for \\~**$1.5 billion**.\n\nIt is important to note that Depop had an annual revenue of **$70 million!** No, this is not a typo. Etsy paid over 20x its revenue to acquire Depop!\n\nWell, not that long later, in Q3-2022, the company recorded impairment charges of **over $1 billion** for Depop and Elo7. No better way to destroy shareholders’ value quickly, than by overpaying for an acquisition.\n\nA year later, in Q3-2023, Elo7 was sold at a loss.\n\n**6.0 Historical financial performance**\n\nHistorically, this is still an impressive growth. Its revenue grew from <$200 million a decade ago, to $2.8 billion in the last twelve months and its gross margin remains stable at \\~70%.\n\nIts operating margin is lingering around 12% now, as both marketing & product development as % of revenue have been increasing. The increase in marketing expense (as % of revenue) has already been highlighted in a previous section. It is necessary to maintain the buyers’ base. So potential future improvements in the operating margin can only arise by decreasing the product development and general & administrative (as % of revenue).\n\n**7.0 Valuation**\n\nThe two key variables when it comes to valuing a company are:\n\n* **Revenue** \\- Given that the number of active buyers hasn’t grown in the last few years, it is difficult to expect revenue growth above inflation.\n* **Operating margin** \\- I do think there’s room to improve the margins by reducing product development and general & administrative (as % of revenue). My assumption is that that it will increase to 14% over time.\n\nBased on my input, the fair value of the company is **$3.2 billion ($29/share)**. This is significantly lower than the current market cap of **$5.7 billion ($51/share)**.\n\nAnyone betting on Etsy is ultimately betting that:\n\n1. The number of low-value products will decrease over time.\n2. The number of buyers will start growing again\n3. Etsy can continue increasing its take-rate, without losing sellers of high-value products.\n4. The management will not engage in acquisition (as they are clearly bad at it).\n\nI hope you enjoyed this post, feel free to share your thoughts.",
        "created_utc": 1732217582.0,
        "subreddit_name": "stocks",
        "comments": 14
    },
    {
        "title": "Bought the Dip: Alphabet (on sale)",
        "score": 94,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gwlxap/bought_the_dip_alphabet_on_sale/",
        "content": "The momentum is negative right now, mainly due to the ongoing lawsuit. However, this will pass—it's something that happens often with stocks. *Buy when there is fear.*\n\nI initially held 200 shares at $172.5, and today I added 400 more at an average price of $165.60 (split across two purchases). I expect a rebound in the short term, with profits returning soon.\n\nHere’s a recap of Alphabet's Q3 2024 numbers:\n\n* **Quarterly Results**:\n   * Total Revenue: $88.3 billion (+15% YoY)\n   * **Google Services**: $76.5 billion (+13%), driven by:\n      * Growth in Search and other services\n      * Increased subscriptions and device sales\n      * Strong YouTube ad performance\n   * **Google Cloud**: $11.4 billion (+35%), fueled by:\n      * AI infrastructure and generative AI solutions\n      * Higher adoption of core GCP products\n* **Profitability**:\n   * Operating Income: +34%, with a 4.5% margin expansion to 32%\n   * Net Income: +34%; EPS rose 37% to $2.12\n* **Key Highlights**:\n   * CEO Sundar Pichai highlighted AI as a major growth driver.\n   * YouTube's ad and subscription revenue surpassed $50 billion over the past four quarters.\n\n**Growth Drivers Moving Forward:**\n\n* Ad revenues: October (presidential ads), Black Friday, Christmas, and New Year campaigns.\n* YouTube: Big creators like Cristiano Ronaldo and MrBeast remain highly active.\n* Waymo: Successful expansion across multiple cities.\n* Cloud: Continued growth in demand and usage.\n\nI’m optimistic about a price target of $180 within two weeks. Good luck!",
        "created_utc": 1732212536.0,
        "subreddit_name": "wallstreetbets",
        "comments": 77
    },
    {
        "title": "Nvidia earnings: AI chip leader shows no signs of stopping mammoth growth",
        "score": 89,
        "url": "https://www.theguardian.com/technology/2024/nov/20/nvidia-earnings-ai-chipmaker",
        "content": "",
        "created_utc": 1732171379.0,
        "subreddit_name": "wallstreetbets",
        "comments": 21
    },
    {
        "title": "Here you go—you inbred sum b%tches!",
        "score": 5143,
        "url": "https://i.redd.it/qh2n8z6ikb2e1.jpeg",
        "content": "What felt like jewelry at first turned out to be chains.  Too many failed positions to post.  The crescendo was about a million desperado quick scalp attempts using 0DTE’s the last week.  Glued to my phone, cussing at an app that can’t talk back and pissing away a Range Rover! Now, I’m wearing a paper hat and slinging a salt shaker.  And before you say it…”Yes, you can give me your 2 cents worth!”  Thanks for all the brilliant DD.  See u on Monday!",
        "created_utc": 1732223058.0,
        "subreddit_name": "wallstreetbets",
        "comments": 588
    },
    {
        "title": "2 month rollercoaster: 2k>55k > -25k > 125k ",
        "score": 82,
        "url": "https://www.reddit.com/gallery/1gwj01d",
        "content": "After not trading for a 2 years to save up for a house, I started back up again in October with 2k. Hit a few runners with SOFI and Tesla earnings and got cocky with a weekly straddle on McDs earnings (theta-banged) which wiped me out. So like the degenerate I am, I pulled almost 60k from my EF and proceeded to lose about half from google and apple until apple finally had a good day. \n\n\nThe last 2 weeks I have come back with my biggest winners being Disney, Walmart and Snow. Outside of Walmart, I only played straddles with the last few being 12/20 expiries. I’m pulling out $160k to bolster the EF and play with the rest. ",
        "created_utc": 1732205748.0,
        "subreddit_name": "wallstreetbets",
        "comments": 21
    },
    {
        "title": "Apple Pay to Be Treated Like a Bank With Federal Scrutiny in the U.S.",
        "score": 1632,
        "url": "https://www.macrumors.com/2024/11/21/apple-pay-to-be-treated-like-a-bank/",
        "content": "",
        "created_utc": 1732196861.0,
        "subreddit_name": "apple",
        "comments": 108
    },
    {
        "title": "iOS 18 Photos App Redesign: Two Months Later, Users Still Divided",
        "score": 815,
        "url": "https://www.macrumors.com/2024/11/21/apples-photos-app-overhaul-controversial/",
        "content": "",
        "created_utc": 1732191983.0,
        "subreddit_name": "apple",
        "comments": 342
    },
    {
        "title": "Thought I'd post this. Taken from the Apple Mac Mini website.",
        "score": 529,
        "url": "https://www.apple.com/105/media/us/mac-mini/2024/58e5921e-f447-487a-a789-3452c23b8400/anim/hero/medium_2x.mp4",
        "content": "",
        "created_utc": 1732161550.0,
        "subreddit_name": "apple",
        "comments": 59
    },
    {
        "title": "TV Time points to Apple's 'significant power' over developers after being removed from App Store ",
        "score": 396,
        "url": "https://techcrunch.com/2024/11/20/tv-time-points-to-apples-significant-power-over-developers-after-being-removed-from-app-store/",
        "content": "",
        "created_utc": 1732170041.0,
        "subreddit_name": "apple",
        "comments": 64
    },
    {
        "title": "Apple Readies More Conversational Siri in Bid to Catch Up in AI",
        "score": 416,
        "url": "https://www.bloomberg.com/news/articles/2024-11-21/apple-readies-more-conversational-llm-siri-in-bid-to-rival-openai-s-chatgpt",
        "content": "",
        "created_utc": 1732227692.0,
        "subreddit_name": "apple",
        "comments": 119
    },
    {
        "title": "Accents — iMac's accent colors on any Mac.",
        "score": 339,
        "url": "https://mahdi.jp/apps/accents",
        "content": "",
        "created_utc": 1732227039.0,
        "subreddit_name": "apple",
        "comments": 18
    },
    {
        "title": "Apple Black Friday Starts 11/29 - $200 GC for MacBook Air - $100 GC for iPads - $75 GC for iPhone 15/14/SE, AirPods 4/Max/Pro 2 - $50 GC for Apple Watch SE/HomePod/Apple TV/Select Beats - $25 GC for select accessories",
        "score": 245,
        "url": "https://www.apple.com/shop/gifts/shopping-event",
        "content": "",
        "created_utc": 1732195047.0,
        "subreddit_name": "apple",
        "comments": 96
    },
    {
        "title": "Apple fights to keep DOJ antitrust suit from reaching trial",
        "score": 227,
        "url": "https://www.theverge.com/2024/11/20/24301660/apple-doj-motion-dismiss-antitrust-lawsuit",
        "content": "",
        "created_utc": 1732165322.0,
        "subreddit_name": "apple",
        "comments": 26
    },
    {
        "title": "Daily Advice Thread - November 21, 2024",
        "score": 8,
        "url": "https://www.reddit.com/r/apple/comments/1gwdodt/daily_advice_thread_november_21_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1732186829.0,
        "subreddit_name": "apple",
        "comments": 34
    },
    {
        "title": "Apple Pay, Cash App, and other digital wallets will be regulated more like banks now",
        "score": 416,
        "url": "https://www.theverge.com/2024/11/21/24302322/apple-pay-cash-app-paypal-regulated-banks-cfpb",
        "content": "",
        "created_utc": 1732206057.0,
        "subreddit_name": "technology",
        "comments": 10
    },
    {
        "title": "Apple is reportedly building a more conversational Siri powered by LLMs | TechCrunch",
        "score": 103,
        "url": "https://techcrunch.com/2024/11/21/apple-is-reportedly-building-a-more-conversational-siri-powered-by-llms/",
        "content": "",
        "created_utc": 1732227853.0,
        "subreddit_name": "technology",
        "comments": 33
    },
    {
        "title": "Apple to be treated like a bank – Consumer Financial Protection Bureau",
        "score": 92,
        "url": "https://9to5mac.com/2024/11/21/apple-will-now-be-treated-like-a-bank-says-us-consumer-financial-protection-bureau/",
        "content": "",
        "created_utc": 1732197083.0,
        "subreddit_name": "technology",
        "comments": 7
    },
    {
        "title": "Why I Switched Back to a 16” MacBook Pro After Trying the 14” – Lessons Learned",
        "score": 246,
        "url": "https://www.reddit.com/r/mac/comments/1gwcvc2/why_i_switched_back_to_a_16_macbook_pro_after/",
        "content": "After almost 10 years as an Apple fan and several MacBook Pros under my belt, I was eagerly waiting to upgrade my 16\" i7 to the new M4 MacBook Pro. When the day finally came, I went all-in and ordered a 14” M4 Pro with 12 cores and 48GB of RAM. I’d read countless reviews and posts, particularly about screen size, and many convinced me that the 14” would be the perfect compromise between portability and usability—it’s only 2 inches smaller, after all.\n\nWhen it arrived, I was like a kid on Christmas morning. But soon, something started to feel... off. Despite adjusting the display resolution, I just couldn’t get used to the smaller screen. It constantly felt cramped, like I was working on a laptop that didn’t fit the scale of the applications I use daily.\n\nThis morning, I made the decision to return the 14” and upgrade to the 16”. Yes, it’s bulkier and heavier, but the moment I started using it, it felt like *home*.\n\nI wanted to share this experience for anyone debating between the two sizes. If you work a lot with multiple windows, need to edit text across various apps, or require a clear overview of multiple pages, the 16” is absolutely worth considering. I wish I’d stuck with what I knew worked for me in the first place.\n\nThat said, I’m blown away by the new M4 chip—coming from the latest Intel, the speed is night and day. As for RAM, going from 16GB to 48GB has been a game-changer. I briefly considered settling for 24GB, but if you’re someone who keeps dozens of Chrome tabs, documents, and applications open at once, the difference is noticeable. It’s unbelievably fast.\n\nHope this helps someone make their decision. Have a great day!",
        "created_utc": 1732183427.0,
        "subreddit_name": "mac",
        "comments": 130
    },
    {
        "title": "Deal alert - Apple Mac Mini 2024 M4 $499.99 on Amazon",
        "score": 181,
        "url": "https://www.reddit.com/r/mac/comments/1gwjpk1/deal_alert_apple_mac_mini_2024_m4_49999_on_amazon/",
        "content": "# Apple Mac Mini 2024 M4 $499.99\n\nListed for $559 with a $59.01 coupon. $499 total.\n\n[https://amzn.to/3V6uZNd](https://amzn.to/3V6uZNd)",
        "created_utc": 1732207423.0,
        "subreddit_name": "mac",
        "comments": 47
    },
    {
        "title": "With thunderbolt 5, why would I pay for internal storage instead of getting an external drive?",
        "score": 126,
        "url": "https://www.reddit.com/r/mac/comments/1gwng3d/with_thunderbolt_5_why_would_i_pay_for_internal/",
        "content": "I'm interested in a Mac Mini, or possibly a Mac Studio when it's released next year. I do a lot of GPU intensive data analysis and I edit a bit of video. I plan to upgrade the ram to around 48/64Gb, but the price apple is asking for storage is ridiculous. I feel like there must be something I'm missing.\n\nI'm debating on going with the base internal storage and getting a nice 2 or 4Tb external thunderbolt drive. Why is this potentially a bad idea? Or is it a great idea and I have just drank the apple kool-aid?",
        "created_utc": 1732216071.0,
        "subreddit_name": "mac",
        "comments": 152
    },
    {
        "title": "My experience switching to MacOS and optimizing a 4K monitor",
        "score": 96,
        "url": "https://www.reddit.com/r/mac/comments/1gwlmpy/my_experience_switching_to_macos_and_optimizing_a/",
        "content": "I am a lifelong Windows user and just bought my first Mac, a MacBook Air 15\" M3 16GB/512GB in Silver. I plan to use it on the go sometimes but really wanted to use it at home on my existing setup. I contemplated a M4 Mac Mini, but opted for this for the portability option. \n\nAnyway, once I set up my external monitor, I was initially not happy with how my 4K display looked, especially next to the incredible built-in display on the MacBook. The colors were washed out, the text wasn't clear, and it was significantly worse-looking than the built-in display. I went down a rabbit hole and made several tweaks to get it optimized and now it looks amazing. I figured that this post may help someone else who is looking to do a similar set up or is trying to tweak their 4K display to look its best.\n\n\\* Disclaimer: I am not an expert, just someone who spent a few hours working on this and am happy with the results. Others may have more to contribute.\n\n\\---\n\nFor my setup, I have a 28\" 4K Philips Display and am using a Lenovo ThinkPad USB-C Hybrid Dock (40AF0135US) with the latest Firmware. I have used this for a while with both my work and personal laptops, both Windows machines. These steps would work for a direct connection to an external monitor too.\n\nTo get set up, because of my dock, I had to install DisplayLink Drivers for MacOS from the Synaptics website which got the second display working. For the record, once that is installed, the dock works perfectly with the M3 Air, including charging.\n\nAfter that, it just didn't look right and I made several tweaks to the monitor settings and in MacOS that changed everything and now it looks amazing. Almost as good as the built-in display. Here's what I did:\n\n1. **Enable HiDPI resolutions:** This is a feature of DisplayLink that needs to be turned on, but can also be done through other apps like BetterDisplay if you're not using g a dock. Once enabled, I set my 4K monitor to the 1440p setting which is actually the OS rendering everything to 5120 x 2880 (2x 1440p) and then scaling down to fit the screen. This improved things a bit but some things were still off.\n2. **Strip out monitor settings:** I went to a basic 80% Brightness, 50% Contrast, 50% Sharpness, 2.2 Gamma, and turned off all color modes, SmartContrast/SmartUniformity and all other Smart and monitor-specific features. That way I was getting the most raw form of the monitor without adjustment.\n3. **Color adjustment:** Make sure MacOS Display settings have the monitor set to its default color profile, mine was the model # of the monitor. With the monitors side by side, I tweaked the color in the monitor's settings. While it looked good in sRGB, it didn't allow brightness adjustment and was still a little off. Instead I set custom RGB to R-100, G-100, B-95 very closely resembled the tone on the built-in display. Different monitors may vary in the adjustments and values needed to look like the Mac display.\n4. **Font Smoothing:** Even with the colors right, I struggled with the sharpness. I could only achieve too fuzzy or too harsh, and couldn't get the right balance. The color was vivid and nice, but the text just looked off no matter what I changed. Ultimately I kept the monitor sharpness at 50 which was too fuzzy and found the answer in two commands. I turned on CGFontRenderingFontSmoothing and turned on AppleFontSmoothing to 1 which makes the text sharper with minimal anti-aliasing. AppleFontSmoothing can also be set to 2 or 3, but 1 achieved the result I was hoping for. This setting has no noticeable impact not the built-in display but absolutely transformed the text on the external display. Here are the steps I took:\n   * Open Terminal and paste/execute each of the below commands\n   * `defaults write -g CGFontRenderingFontSmoothingDisabled -bool NO`\n   * `defaults write -g AppleFontSmoothing -int 1`\n   * Restart the computer for the changes to take effect.\n\nFor me, the above adjustments changed everything, especially the final step. I was pretty unhappy with the 4K monitor initially and wondered what I had gotten myself into. I worried I'd have to drop a huge amount of money on a Studio Display to be happy with it, but this got me to where I needed to be. I may make additional small tweaks here and there, but I am very happy now. Hopefully this helps someone else and you can benefit from the hours I put into this. If you have any other tips, feel free to comment them.",
        "created_utc": 1732211859.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "20 years of windows, switched to Mac today ",
        "score": 89,
        "url": "https://www.reddit.com/r/mac/comments/1gwovm4/20_years_of_windows_switched_to_mac_today/",
        "content": "I have been using windows computers for 20 years and decided today to get a MacBook Pro M1 Pro 16 inch. My experience has been incredible. How quick it is, seamless, smooth, I can’t believe I haven’t had one of these all my life. My phone works amazingly on it too (I have an iPhone and an iPad). I used to think so poorly of MacBooks but I completely understand why people have them now. This thing is a productivity monster. Loving it and can see myself buying more Mac’s long into the future. ",
        "created_utc": 1732219597.0,
        "subreddit_name": "mac",
        "comments": 95
    },
    {
        "title": "My favorite macOS apps",
        "score": 50,
        "url": "https://switowski.com/blog/my-favorite-macos-apps-2024/",
        "content": "",
        "created_utc": 1732176478.0,
        "subreddit_name": "mac",
        "comments": 15
    },
    {
        "title": "Reduce or disable Menu Bar blur for Wallpapers on Desktop? ",
        "score": 6,
        "url": "https://i.redd.it/j2fnu5v2hb2e1.jpeg",
        "content": "As you can see i have this cool DC wallpaper on my MacBook, but i think it would look even better without the menu bar blur effect. I would like the wallpaper to fill the whole screen. I thought “Fill Screen“ would disable this. I get that this probably exists to assure menu bar visibility but it’s kinda annoying if you just want to look at your wallpaper.",
        "created_utc": 1732221907.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Is there any way to lock the computer into a single Webpage, Mid 2011 iMac on 10.13.6",
        "score": 7,
        "url": "https://www.reddit.com/r/mac/comments/1gwg94v/is_there_any_way_to_lock_the_computer_into_a/",
        "content": "I’m a wedding photographer that’s looking to set up a booth at a local bridal expo show. My most recent show was my first and I used the iMac to display my work in a looped keynote, but this time I want to have the iMac serve as a station for perspective clients to type their name and contact info for a raffle. I’ve got a hidden webpage in my site that functions perfectly for this, but I need to somehow find a way to lock the iMac so users can’t leave Safari (or the webpage for that matter)\n\nAre there any solutions or suggestions on how to accomplish this?",
        "created_utc": 1732195685.0,
        "subreddit_name": "mac",
        "comments": 18
    },
    {
        "title": "Multi Mac Users…",
        "score": 6,
        "url": "https://www.reddit.com/r/mac/comments/1gw5y2e/multi_mac_users/",
        "content": "So I have a question for the multi Mac users…meaning those that utilize a MacBook as well as a Mac Studio/Mac Mini/Mac Pro. I have been a Mac user for about 15 years now, but I’ve only used 1 device at a time during my use. I started out with 2011 27in iMac, then I was gifted everso light 17in MacBook Pro 🤣 when the iMac crapped itself. \n\nMy question is, how are you maintaining your work on both? Ex. You’re out and about or at work and you’re working on a document, spreadsheet, or presentation on your MacBook…then you go home…do you finish the document on the laptop, or do you continue on the Mac desktop? If so, how are you doing this? Are you saving everything to iCloud, or is there another way to accomplish this? I recently purchased the new M4 MacBook Pro as well as an M4 Mac Mini. I bought the Mac Mini to use in my home office thinking it would force me to stick to “office hours” and not lay on the couch or in bed working on my laptop all night. \n\nSo how are you guys doing this (if you’re doing it at all)?",
        "created_utc": 1732157149.0,
        "subreddit_name": "mac",
        "comments": 41
    },
    {
        "title": "How Can I Install MacOS onto my Mac without an OS?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gwtxj8/how_can_i_install_macos_onto_my_mac_without_an_os/",
        "content": "I messed up and accidentally deleted my MacOS when trying to install Windows through Boot Camp Assistant. When I restart my computer and press option r to do internet recovery, it is stuck on 24:00. After searching it up it appears that internet recovery only works on Macs after 2012, but mine is mid-2011. I have heard I can buy a dvd to install MacOS, but is there another way to install MacOS High Sierra back onto my Mac?\n\nAll help is appreciated!\n\nEDIT: Thank you all for your helpful replies! I ended up doing a booting up Lion onto my Mac with a usb and updating it up to High Sierra! I though all hope had bee lost!\n\nThank you kind strangers!!!",
        "created_utc": 1732232638.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "2014 iMac 27 5k OK to buy?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gw9uxi/2014_imac_27_5k_ok_to_buy/",
        "content": "As title, need something just for internet browsing and logging into to email, bank, buying things etc. Is it safe to buy and will Apple keep it updated or is it left with no updates now and exposed to security risks not worth taking?",
        "created_utc": 1732170285.0,
        "subreddit_name": "mac",
        "comments": 8
    },
    {
        "title": "Boot Loop?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gwrivw/boot_loop/",
        "content": "Hoping this is the right place. \n\nI have a macbook pro (2021 I think? Not sure) \n\nI’ve had windows 10 or 11 (once again not sure) on it for months with no issues at all.\n\nToday, I updated bootcamp using the built-in system updater program in windows. Now I can’t boot into MacOS. And it boot loops unless I go into Recovery mode.\n\nA friend whose computer is having the same issue, but our computers haven’t interacted in any way ever, so it’s not a virus. We both updated bootcamp though. \n\nWe think it is a “broken seal” in the system because I went into terminal and found this on her computer. \n\nCurrently booting into Internet recovery mode but it’s stuck loading (💀).\n\nPlease PLEASE help 🙏\n\nEDIT: Solved via 4 labourous hours of reinstalling Ventura and crying a lot 😭👍",
        "created_utc": 1732226247.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "MacMini M4 - Can I connect two Dell 34\" wide screen monitors?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gwjgq8/macmini_m4_can_i_connect_two_dell_34_wide_screen/",
        "content": "I am new to this and tried to google this info but failed.\n\nPlanning on buying MacMini M4. It has 1 hdmi port but multiple thunderbolt ports. Can those thunderbolt ports be used to connect to Monitors?\n\n  \nI have two dell 34\" wide screen monitors which I was hoping to connect to this mac mini.\n\n  \nMore info :   \nUbuntu Desktop has Displayport only  \nMonitors have DisplayPort, HDMIPort, USB-C port.  \n  \n  \nAlso, is there KVM switch that works best with this configuration?",
        "created_utc": 1732206833.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "Migrating from onto a newer Mac - cleanest, most optimal approaches?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gwhh4e/migrating_from_onto_a_newer_mac_cleanest_most/",
        "content": "Currently running an M1 Mac Mini with latest Sequoia. This was set up using macOS' migration tools from my previous iMac (Intel chip) which I had for about 5 years. And before that, another iMac.\n\nBasically I've always used migration tools to go from one machine to another.\n\nBut I'm about to buy a Mac Studio M1 Max and I'm considering starting afresh.... install all software from scratch, let the thing index fully. BTW all my photos, music etc is on external drives\n\nIs there any real benefit it in this, given how 'smart' macOS is these days? Am I just better off using a Mac cleaner app on my current machine, then just doing an auto migration (and save some work)? \n\nOpinions please! Thanks",
        "created_utc": 1732199116.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Is it safe to use my MacBook closed with 2 Studio Displays?\n",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gwfi0x/is_it_safe_to_use_my_macbook_closed_with_2_studio/",
        "content": "I have a concern about using my MacBook closed while connected to two Studio Displays. Is it safe for the built-in screen if the MacBook is closed? Sometimes, when I hold my MacBook, it gets pretty hot, and I’m worried it might affect or damage the built-in monitor. My MacBook Pro has an M1 Max chip. I’ve heard of apps like Lunar and BetterDisplay that can put the monitor to sleep. Are those safe to use? Any suggestions would be appreciated!",
        "created_utc": 1732193371.0,
        "subreddit_name": "mac",
        "comments": 21
    },
    {
        "title": "Need urgent help: Macbook pro (Late 2013) only stays on when connected to HDMI?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gwb42w/need_urgent_help_macbook_pro_late_2013_only_stays/",
        "content": "I’m having issues with my MacBook Pro (Late 2013) and could really use some advice. Here’s what’s happening:\n\n1. **Freezing and Turning Off Without HDMI:** My MacBook only stays on when it’s connected to an external display via HDMI. If I disconnect the HDMI or try to start the laptop without it, it works for a few seconds but then freezes, showing a bluish/black screen before turning off within a minute.\n2. **Random Sleep or Shutdown with HDMI:** Even when connected to HDMI and charging, the laptop goes into sleep mode or turns off after about 10 minutes of inactivity, despite being plugged in. (I did change my settings to always stay on when charging) \n3. **Temperature and Performance Checks:** I’ve been monitoring the fan speed and CPU temperature using apps, and everything seems fine. The temperature typically stays between 45°C and 65°C, so overheating doesn’t seem to be the issue. My fans seem to average at 2000 RPM. \n\nDoes anyone know what might be causing these problems or how to fix them? Any advice would be greatly appreciated!",
        "created_utc": 1732175529.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "It it worth replacing my MacBook screen?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gwa9oc/it_it_worth_replacing_my_macbook_screen/",
        "content": "Apple support said $1049AUD to replace the screen on my MacBook Pro m1 13 inch.  m3 MacBook Pro is $1850AUD on their refurbished site. Would I be better off getting a new MacBook or replacing the screen?\n\nWould really love to upgrade but I love my touchbar",
        "created_utc": 1732171951.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Experience with first Mac Mini (M4 Base Model)",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gw8scl/experience_with_first_mac_mini_m4_base_model/",
        "content": "Hi\n\nI bought my first Mac Mini with the release of the M4 Base Model and i ahve to say i love it so far. My previous experience with Apple products were Ipod Tocuh 2G and 4G until i lost my 4G two years after it came out in 2012, than i bought my first Ipad in 2020. The only reason i bought a Pro over an Air was the USB C Port and it also broke this year. I actually using an Air with M1 so far and i noticed some differences way i would go with a Pro the next time. Flashlight, Screen Brightness, Thunderbolt etc. etc. Witht he release of the first gen of Apple Silicon i bought a MacBook Pro 13 (M1) and hated it. I guess 13.3 inches are just not my thing, i used it to play around with Mac OS, but never really tried to adapt to it and used my other devices more than it. As a tech person i am i wanted to give it another try, at least i wanted to have one device running Mac OS and the last 3 months i was blown away by the performance, especially transfeer speeds and im only using Sandisk Pro with max speed of roughly 1000mbit/s. I wonder why my Win11 device is so much slower? Ofc i dont expect the same speed from a machine with this specs:\n\nCPU: AMD Ryzen 5 5600X 3.7 GHz 6-Core Processor  \nRAM: 32GB RAM  \nGPU: Asus DUAL OC GeForce RTX 3070 8 GB  \nMB: Asus ROG STRIX B550-I GAMING Mini ITX AM4 Motherboard  \nStorage 500 GB M.2 PCIe 4.0 X4\n\nIs my machine so outdated in comparison or why are my speeds so slow in comparison. Thank god i got rid of all my HDD drives for now.\n\nI seriously considering pickung up a Mac Studio next year as a main work machine, that i will beef up with storage and more RAM.",
        "created_utc": 1732166322.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Planning on getting my very first Machintosh",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gw8ort/planning_on_getting_my_very_first_machintosh/",
        "content": "Lifetime Windows user just looking to spice things up and get to know a different environment. The sober look of Mac OS seems good to avoid distractions and do more work.\n\nI know I could get a better PC with less, but I want a fancy laptop with a good battery life (and battery performance). I don't want a noisy tower bitcoin miner target.\n\nI'll not leave Android whatsoever but I wanna give Mac a try. Also it's better to learn how to manage different systems.\n\nWhat I plan to do is draw, animate (2D) and maybe music production.\nAlso playing console emulators, not full-pc games.\n\nSuggestions?",
        "created_utc": 1732165966.0,
        "subreddit_name": "mac",
        "comments": 8
    },
    {
        "title": "Why won’t my devices connect to my Mac after the iOS 15 Sequoia update?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gw8c97/why_wont_my_devices_connect_to_my_mac_after_the/",
        "content": "I attempted to connect to my focus, right Scarlet solo and WebCam to my 14 inch MacBook Pro after the Mac update. My Mac is not recognizing any device I plug into it. Does anyone have any idea how I can go about fixing this issue?",
        "created_utc": 1732164774.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Apple pledges USD 100 million Indonesia investment to lift iPhone 16 ban",
        "score": 2988,
        "url": "https://www.engadget.com/big-tech/apple-pledges-100-million-indonesia-investment-to-lift-iphone-16-ban-162217627.html",
        "content": "",
        "created_utc": 1732208932.0,
        "subreddit_name": "gadgets",
        "comments": 165
    },
    {
        "title": "r/Stocks Daily Discussion & Options Trading Thursday - Nov 21, 2024",
        "score": 9,
        "url": "https://www.reddit.com/r/stocks/comments/1gwd90k/rstocks_daily_discussion_options_trading_thursday/",
        "content": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nRequired info to start understanding options:\n\n* [Call option Investopedia video](https://www.investopedia.com/terms/c/calloption.asp) basically a call option allows you to buy 100 shares of a stock at a certain price (strike price), but without the obligation to buy\n* [Put option Investopedia video](https://www.investopedia.com/terms/p/putoption.asp) a put option allows you to sell 100 shares of a stock at a certain price (strike price), but without the obligation to sell\n* Writing options switches the obligation to you and you'll be forced to buy someone else's shares (writing puts) or sell your shares (writing calls)\n\nSee the following word cloud and click through for the wiki:\n\n[Call option - Put option - Exercising an option - Strike price - ITM - OTM - ATM - Long options - Short options - Combo - Debit - Credit or Premium - Covered call - Naked - Debit call spread - Credit call spread - Strangle - Iron condor - Vertical debit spreads - Iron Fly](https://www.reddit.com/r/stocks/wiki/options-themed-post)\n\nIf you have a basic question, for example \"what is delta,\" then google \"investopedia delta\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1732185010.0,
        "subreddit_name": "stocks",
        "comments": 431
    },
    {
        "title": "What am I misunderstanding about SPYI?",
        "score": 3,
        "url": "https://www.reddit.com/r/stocks/comments/1gwgkyw/what_am_i_misunderstanding_about_spyi/",
        "content": "What am I misunderstanding about SPYI?\n\nIt is often recommended that investors just stick to ETFs such as SPY because it is very unlikely a person will out perform it with their own picks. If I am correct SPY has a like a 7%-8% return all time and closer to like 10% or higher in the last couple years. \nAnyway I see S&Ps high income ETF is just under 12% TTM. So does that mean if I have $100,000 I would get $11,950 in dividends a year? Wouldn’t this be higher than the growth and TTM combined SPY has? If so why wouldn’t everyone just invest in this and get 12% dividends a year?\n\nI know I am misunderstanding something I just don’t know what. Any clarification would be appreciated. ",
        "created_utc": 1732196624.0,
        "subreddit_name": "stocks",
        "comments": 29
    },
    {
        "title": "Unpopular Opinion: Market will 🚀 tomorrow ",
        "score": 270,
        "url": "https://www.reddit.com/gallery/1gw664i",
        "content": "Tomorrow, Nov 21: \nFutures jump 60 points by 8:35 AM after jobless claims. \n$SPY opens strong at 595 and hits a new ATH by EOD. \nAt 10 AM, existing home sales seal the fate of the bears. \n$NVDA surges 5-10%.\n\nAnd I’m not just saying that because I have 15k on $spy expiring tomorrow and 21k on $nvda\n\nI am already preparing this as a gain post. Now the market gods will do their thing.",
        "created_utc": 1732157831.0,
        "subreddit_name": "wallstreetbets",
        "comments": 189
    },
    {
        "title": "Best ETF to diversify against a decline in US equities?",
        "score": 46,
        "url": "https://www.reddit.com/r/investing/comments/1gwdofi/best_etf_to_diversify_against_a_decline_in_us/",
        "content": "My entire portfolio is US equities (s&p 500, QQQ, similar ETFs). With valuations stretched right now, I’m not saying a big drop is imminent or even likely, I just feel that investors are feeling jumpy any bad economic news (jobs, return of inflation, whatever) will have an outsized effect. \n\nBlah blah, can’t predict the market of course, but the point of this is to figure out good options for diversifying. My top 3 ideas right now are:\n\n- TIPS \n- Corporate bonds\n- A consumer staples ETF (yes, still equities but theoretically should provide some resilience)\n\nWhere else should I be looking?",
        "created_utc": 1732186833.0,
        "subreddit_name": "investing",
        "comments": 143
    },
    {
        "title": "What am I misunderstanding about SPYI?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gwgj18/what_am_i_misunderstanding_about_spyi/",
        "content": "It is often recommended that investors just stick to ETFs such as SPY because it is very unlikely a person will out perform it with their own picks. If I am correct SPY has a like a 7%-8% return all time and closer to like 10% or higher in the last couple years. \nAnyway I see S&Ps high income ETF is just under 12% TTM. So does that mean if I have $100,000 I would get $11,950 in dividends a year? Wouldn’t this be higher than the growth and TTM combined SPY has? If so why wouldn’t everyone just invest in this and get 12% dividends a year?\n\nI know I am misunderstanding something I just don’t know what. Any clarification would be appreciated. ",
        "created_utc": 1732196470.0,
        "subreddit_name": "investing",
        "comments": 12
    },
    {
        "title": "I'm a full time trader and this is everything I'm watching and analysing in premarket 21/11 - Including full detailed review of NVDA earnings, SNOW earnings and PANW earnings.",
        "score": 72,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gwfrx2/im_a_full_time_trader_and_this_is_everything_im/",
        "content": "MACRO:\n\n* Jobless claims out today\n\nNVDA EARNINGS\n\n* Non-GAAP EPS: $0.81 (Est. $0.74)  UP +103% YoY. MASSIVE GROWTH, MASSIVE BEAT. \n* Revenue: $35.1B (Est. $33.1B) ; UP +17% QoQ and UP +94% YoY. MASSIVE GROWTH, BIG BEAT,\n* Gross Margin: 75.0% (Est. 74.8%) ; UP 0.6 pp YoY. IMPROVING MARGINS, SLIGHT BEAT \n\nQ4 Guidance\n\n*  Revenue: $37.5B (Est. $37.1B) ; +2% guidance range. BEAT VS ESTIMATE\n* Gross Margin: 73.5% (Est. 73.5%) IN LINE  \n\nQ3 Segment Revenue:\n\n* Data Center: $30.8B (Est. $29.14B) ; UP +17% QoQ and UP +112% YoY. BEAT\n* Gaming: $3.3B (Est. $3.06B) ; UP +14% QoQ and UP +15% YoY BEAT\n* Professional Visualization: $486M (Est. $480M) ; UP +7% QoQ and UP +17% YoY BEAT\n* Automotive: $449M (Est. $360M) ; UP +30% QoQ and UP +72% YoY. BIG BEAT  \n\nOTHER Q3 METRICS:\n\n*  Operating Income: $21.87B (Est. $21.69B) ; UP +17% QoQ and UP +110% YoY BEAT\n*  Net Income: $19.31B; UP +16% QoQ and UP +109% YoY  \n\n**HIGHLIGHTS SEGMENt BY SEGMENT:**\n\nData Center:\n\n*  Record revenue of $30.8B driven by strong AI adoption.\n* Launched NVIDIA Hopper H200-powered cloud instances across AWS, CoreWeave, Microsoft Azure, with Google Cloud and Oracle Cloud joining soon.\n* Built national AI supercomputers in Denmark, Japan, Taiwan, and India using NVIDIA DGX SuperPOD™ and NVIDIA Blackwell platforms.\n*  Expanded AI partnerships with Lenovo, Accenture, Deloitte, and Google Cloud for enterprise and industry AI solutions.  \n\nGaming:\n\n* Revenue of $3.3B fueled by GeForce RTX GPUs and new AI PCs with RTX AI performance.   Professional Visualization:\n* Revenue of $486M, driven by adoption of NVIDIA Omniverse™ for industrial AI and digital twins.\n* Collaborated with Foxconn to accelerate factory development using Omniverse. \n\nAutomotive and Robotics:\n\n*  Revenue of $449M, reflecting surging demand for autonomous and electric vehicle technologies.\n* Announced Volvo's electric SUV built on NVIDIA’s platform. \n\n  \n**KEY COMMENTARY: - Crazy bullish, AI enterprise revenue to double.  DEmand to outstrip supply for many quarters out.** \n\n* \"Blackwell production shipments are scheduled to begin in the fourth quarter of fiscal 2025 and will continue to ramp into fiscal 2026.\"\n* The company continues to see demand exceed supply for several quarters out, margins solid\n* expects its AI enterprise revenue to \"DOUBLE\" this year compared to last year.\n* SAYS HOPPER DEMAND, BLACKWELL ANTICIPATION IS INCREDIBLE\n* CFO said Nvidia will continue selling Hopper chips even as customers prepare to deploy Blackwell systems. It's \"possible\" Hopper revenues could grow QoQ from Q3 to Q4 alongside Blackwell's rollout. \n* Additionally, she said that H200 is experiencing the fastest growth and ramp in Nvidia's history, with \"strong demand\" persisting.\n* GROSS MARGINS: expected to start in the low 70% range as Blackwell ramps, with a “reasonable” expectation to reach mid-70s by the second half of next year.\n* ON CHINA: China remains an important market. Things are improving because they’re shipping export-rule-compliant Hopper chips, but they will remain at a lower level than they would be without those rules\n* Cloud-computing providers now account for 50% of Nvidia's data center revenue, up from 45% three months ago.\n* 'Almost every company in the world, due to the demand of AI, touches Nvidia in some way'.\n\n  \nPANW earnings:\n\n* Revenue: $2.1B (Est. $2.12B)   UP +14% YoY. SLIGHT MISS\n* Product Revenue: $353.8M (Est. $341.2M) BEAT\n* Services Revenue: $1.785B (Est. $1.78B)  BEAT\n* NGS ARR: $4.5B (Est. $4.37B) BEAT  UP +40% YoY\n* (NGS refers to Next Gen security)\n* RPO: $12.6B (Est. $12.49B); UP +20% YoY BEAT\n\nQ1 Profitability Metrics:\n\n* Non-GAAP Gross Margin: 77.5% (Est. 77.5%)  IN LINE\n* Non-GAAP Operating Margin: 28.8% (Est. 27.7%) BEAT\n* Free Cash Flow: $1.46B (Est. $1.46B) IN LINE\n\n  \n Improvement to margins driven by efficiency initiatives and revenue growth\n\n  \n PLATFORMIZATION MOMENTUM\n\n* Added 70 more platform deals, with now 1,100 cumulative deals.\n* Up 6% YOY\n* Large deals over 1M were up 13% YOY\n* Cortex crossed $1B ARR milestone, driven by strong XSIAM momentum with over 150 active customers\n* Continued growth in hardware firewall adoption, including public cloud deployments, which represent 70% of virtual firewall ARR.\n* Prisma Access customer count grew by 20%, with 40% being new to Palo Alto Networks, creating upsell opportunities.\n* QRadar SaaS brought in $74 million in ARR during Q1, with significant upsell potential.\n* The company aims to transition QRadar customers to XSIAM, building a $1 billion pipeline opportunity.\n\nFY25 Guidance:\n\n* Revenue: $9.12B–$9.17B (Est. $9.10B–$9.15B);  Growth +14% YoY BEAT\n* NGS ARR: $5.52B–$5.57B; UP +31–32% YoY\n* Non-GAAP Operating Margin: 27.5%–28.0% (Est. 27.5–28.0%)  IN LINE\n* Non-GAAP EPS: $6.26–$6.39 (Est. $6.18–$6.31)  BEAT\n\nQ2 Guidance:\n\n* Revenue: $2.22B–$2.25B (Est. $2.23B) ;Growth +12–14% YoY SLIGHT BEAT\n* NGS ARR: $4.70B–$4.75B (Est. $4.64B) BEAT\n* Non-GAAP EPS: $1.54–$1.56 (Est. $1.55) IN LINE\n* RPO: $12.9B–$13.0B (Est. $13.0B) SLIGHT MISS\n\nOTHER Highlights:\n\n*  Stock Split: Announced a 2-for-1 forward stock split effective December 13, 2024.\n\n  \nSNOW earnings:\n\nPARTNERS WITH ANTHROPIC TO INTEGRATE CLAUDE MODELS INTO AI DATA CLOUD. This helps enabling enterprises to scale AI-powered apps and workflows securely. \n\n* Revenue: $942.1M (Est. $899.3M) UP +28% YoY. BIG BEAT\n* Product Revenue: $900.3M (Est. $848.5M) UP +29% YoY. BEAT\n* Net Revenue Retention Rate: 127%. V STRONG\n* RPO: $5.7B (Est. $5.34B) UP +55% YoY. MASSIVE BEAT\n\nCustomer Metrics:\n\n* Customers with Trailing 12-Month Product Revenue > $1M: 542; UP +25% YoY. STRONG GROWTH\n* Forbes Global 2000 Customers: 754; UP +8% YoY\n\nProfitability Metrics:\n\n* Non-GAAP Product Gross Profit: $686.9M (75.3% Margin; Est. 75.3%) . MARGINS IN LINE WITH EXPECTATIONS. COUPLE THAT WITH FAR STRONGER THAN EXPECTED REVENUE AND THAT GIVES A V STRONG BOTTOM LINE. \n* Non-GAAP Operating Income: $58.9M (6% Margin; Est. 3.2%)  BIG BEAT ON OPERATING MARGINS\n\nFY25 Guidance:\n\n* Product Revenue: \\~$3.43B (Est. $3.356B)  UP +29% YoY. BEAT\n* Product Gross Profit Margin: \\~76% (Est. 75%) . SLIGHT BEAT\n* Non-GAAP Operating Margin: \\~5% (Est. 3%) CLEAR BEAT\n\nQ4 Guidance:\n\n* Revenue: $906M–$911M (Est. $934.6M) Growth +23% YoY. MISS\n* Product Revenue: $906M–$911M (Est. $881.7M) . BEAT\n* Non-GAAP Operating Margin: \\~4% (Est. 1.4%) BIG BEAT\n\nCOMMENTARY:\n\n “Snowflake delivered a strong third quarter, with product revenue of $900M, up 29% year-over-year, and remaining performance obligations of $5.7B, with year-over-year growth accelerating to 55%,”\n\n  \nPDD earnings: - down hard. Sizeable misses in key metrics of the report. \n\n* ADJ earnings per American depositary receipts 18.59 yuan, EST 20.19 yuan BIG MISS\n*  Revenue 99.35B yuan, EST 102.83B yuan MISS\n* Revenues from online marketing services and others 49.35B yuan, EST 49.01B yua BEAT\n*  Transaction services revenue 50.00B yuan, EST 53.01B yuan MISS\n* ADJ net income 27.46B yuan, EST 29.21B yuan MISS\n* Total operating expenses 35.35B yuan, EST 35.08B yuan BEAT\n* Sales and marketing expense 30.48B yuan, EST 30.18B yuanBEAT\n* General and administrative expenses 1.81B yuan, EST 1.82B yuan\n* R&D expenses 3.06B yuan, EST 3.56B yuan\n* Earnings per American depositary receipts 16.91 yuan, EST 17.28 yuan\n\nMARKETS:\n\n* SPX trading higher again today, up at 5927. \n* Nasdaq and Dow marginally higher too\n*  Bitcoin surges again, up 4%, above 98k. Now up more than 50% since Tru mp's victory\n* Gold higher this morning\n\n  \nFOREX:\n\n* Dollar still playing with the resistance at 107\n* Given this, EURUSD heads lower towards 1.05. As mentioned, traders buying puts on 1.04\n* GBP lower towards key trendline. \n\nMAG 7 NAmes:\n\n* After strong earnings, NVDA hit with a number of upgrades across the board by analyst. Still trades lower in premarket\n* For instance, Citi opened positive catlyst watch on NVidia after earnings, removing their 90 day catalyst watch on Marvel. \n* GOOGL - Yday news US justice department proposed that GOOGLE shoudl divest chrome browser to address its monopoliszation of online search market. \n* GOOGL responded to this, calling it radical. Said it is a staggering proposal. GOOGL will file counter proposals in December. \n*  OTHER COMPANIES: Software names like DDOG, SNOW etc all higher on Strong SNOW earnings\n* Crypto names ripping agian on very strong bitcoin action, as BTC tops 98k\n* MSTR ripping especially. \n* Their PT was doubled at BTIG from 290 to 570 overnight. Said their plan to raise 42B of capital to acquire more bitocin is off to fast start. \n* SNOW - following earnings, Goldman rates as conviction buy, with PT of 220. reinforce our conviction that the company can sustain mid-20s revenue growth at a $4B revenue scale while delivering 25% FCF margins.  long runway in core Data Warehousing opportunities via continued legacy migrations and emerging product cycles.\n* SNOW targets raised aross the board. \n* NEtflix - BofA raises PT to 1000 from 800, cites very strong reach. Said the event last weekend, despite technical issues, was a net positive. \n* SBUX - looking at options for Chinese operations including potentially selling as take to local aprnters or private equity firms. \n* ROKY - cut to underperfrom at Jefferies, PT of 55. \"Streaming Distribution (SSD) Under Pressure for Roku (\\~40% of Platform Revenue). NFLX shifting away from ROKU's services may signal other streamers to do a similar thing. \n* DFH - Dream Finders Homes to join Small cap 600, replacing Haynes international\n* Huawei plans to begin mass-producing its latest AI chip, the Ascend 910C, in early 2025 despite ongoing U.S. restrictions. This chip is supposed to compete with NVDA. \n* BABA unifies ecommerce platforms unde rone roof for the first time. Announced establishment of Alibaba E-commerec ebusiness groups integrating all its e-commerce platforms, including Taobao, Tmall, AliExpress, Lazada etc under one umbrella. \n* TGT - after stinky earnings yesterday, Deutsche bank downgrades TGT to Hold, lowers PT to 108 from 184. \n* GRAB - downgraded at China REnaissance to Hold from BUy PT 5.40\n* RBC - BofA downgrades to neutral form BUy, PT 335\n* SHOP - DZ bank downgrades to sell from Hold\n* ULTA - William Blair downgrades to market perform from outperform\n* PLL - upgraded at Macqaurie to neutral from underperform. PT 13.50 from 7.80\n* LMND - piper Sandler raises to 44 frotm 25, neutral. Said that the targets outlined in the Investor day in NY was strong. \n\nOTHER NEWs:\n\n* Fed's barkin says that the US is more vulnerable to inflation shocks. Says these could be wage related or otherwise. Said his base case is for inflation to continue dropping, but said unclear what tru-mps tariffs will do. \n* BARKIN BASICALLY ADVISED HIS STANCE WAS TO BE CAUTIOUS ON RATE CUTS\n* This is in line with comments made by Bowman yday. Seems fed officials are shifting to more cautious outlook on rate cuts. Bowman said that progress in lowering inflation had stalled. \n* Goldman Sachs CEO says that Trum p's tariffs are an uncertainty at the moment. \n* China intrdouces comprehensive measure sto stabilise and boost foreign trade growth. Focys on export credit insurance, increasing financing for smlal and medium sized enterprises etc. Strengthening ecommerece logistics and agricultural exports\n* South Korea's exports grew 5.8% YOY in first 20 days of november, making rebound after a drop in october. maind river was strength in Semis and shipbuilders\n* Bloomberg Economics projects Korean exports to the U.S. could fall by 55% by 2028 if tariffs are fully implemented\n* Ukriane used UK missiles in Russian attack.\n* Ukraine saying that Russia used new missiles in their attack on Ukraine today. \n* Swiss Bank saying US could reach a Liz Truss moment should borrowing costs jump. \n*  INDIA'S 2ND RICHEST MAN, GAUTAM ADANI CHARGED WITH \"MASSIVE\" FRAUD IN NEW YORK CITY INVOLVING A BRIBERY SCHEME IN ONE OF THE WORLD'S LARGEST SOLAR ENERGY PROJECTS",
        "created_utc": 1732194228.0,
        "subreddit_name": "DayTrading",
        "comments": 0
    },
    {
        "title": "awesome free indicator for supply and Demand",
        "score": 9,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gwovr6/awesome_free_indicator_for_supply_and_demand/",
        "content": "I have been using this indicator for about 6 weeks.. it works really good for QQQ and SPY.. I get great trades with this...  here is the last 3 days.. on Trading view it is free and called \"Supply Demand visible range\" by Luxalgo.. enjoy \n\nhttps://preview.redd.it/7ijwl065ab2e1.jpg?width=1490&format=pjpg&auto=webp&s=bf087d6ee9db9d8d02eb7d91c093f53f86c9024e\n\n",
        "created_utc": 1732219606.0,
        "subreddit_name": "DayTrading",
        "comments": 7
    },
    {
        "title": "Platform/Service to Analyze Real-Time Market Order Data",
        "score": 2,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gwpo9v/platformservice_to_analyze_realtime_market_order/",
        "content": "Hi!\n\nDoes anyone know any platform or service that gives you real-time information into market order details for a specific stock/asset? My goal is to track large market orders relative to a determined average market order size. Just want to explore how this affects short-term price movement, but need the data. Any service that does this would be amazing, especially if it can give insights into the market order details for SPY, QQQ, etc. ",
        "created_utc": 1732221567.0,
        "subreddit_name": "DayTrading",
        "comments": 0
    },
    {
        "title": "What to do with multiple S/R's?",
        "score": 2,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gwjf88/what_to_do_with_multiple_srs/",
        "content": "https://preview.redd.it/ajznr0dl7a2e1.png?width=1387&format=png&auto=webp&s=98539181d233b5776d200548c1800b6704c060d5\n\nIs this simply a matter of waiting/checking higher TFs? I also often will look mag7 stocks ($NVDA, $AAPL) and find how their S/R correspond to $SPY for added confluence",
        "created_utc": 1732206739.0,
        "subreddit_name": "DayTrading",
        "comments": 0
    },
    {
        "title": "Thinkorswim vs Active Trader Pro vs Interactive Brokers (plus TradingView?) -- beginner question",
        "score": 2,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gwffds/thinkorswim_vs_active_trader_pro_vs_interactive/",
        "content": "Hi,\n\nI just started an account with Schwab and studying the TOS platform right now after some research on getting started with trading. I'll be doing SIM for a while. But I wonder if I'm on the right path with TOS.\n\nI have a TradingView account and I like how it does charts, but I know I can use it for execution as well and it supports IBKR so I'm wondering if I should just sign up for IBKR also? I heard IBKR is not as beginner-friendly as TOS, so maybe using TradingView with it for execution will help with that?\n\nI also already have a Fidelity account for various things and maybe I should just use with Active Trader Pro to begin with (I hate the desktop application, though--especially because I'm on a Mac)?\n\nOr try all three at the same time the next 3-6 months and see? I intend to have a paid TradingView account.\n\nThank you so much in advance for the advice!",
        "created_utc": 1732193134.0,
        "subreddit_name": "DayTrading",
        "comments": 6
    },
    {
        "title": "Stock Market Today: MicroStrategy Tumbles After Citron Research Shorts the Stock + Comcast Spins Off Cable Networks",
        "score": 1,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gwu2uz/stock_market_today_microstrategy_tumbles_after/",
        "content": "# MARKETS \n\n* The Dow Jones Industrial Average climbed 461 points (1.06%), as investors ditched tech in favor of economically sensitive stocks. The S&P 500 rose 0.53%, while the Nasdaq barely budged, adding just 0.03%. Nvidia’s underwhelming earnings and Alphabet’s antitrust headlines set the tone for a tech pullback.\n* Snowflake shares exploded 33% after crushing revenue estimates, lifting peers like Salesforce and powering the Dow’s rally. Bitcoin also made waves, blowing past $98,000, while Treasury yields ticked higher, signaling optimism for growth-focused plays in an economy on the move.\n\n# \n\n# Winners & Losers\n\n# What’s up 📈\n\n* **Snowflake** surged 32.71% after posting impressive earnings and a 28% revenue increase last quarter. The company also projected $3.43 billion in fiscal 2025 product revenue, implying 29% growth. ($SNOW)\n* **Oklo** jumped 20.43% after announcing its proposed acquisition of Atomic Alchemy, marking its expansion into the radioisotope market. ($OKLO)\n* **Reddit** gained 15.96%. ($RDDT)\n* **BJ’s Wholesale Club** rose 8.24% after beating third-quarter earnings estimates, raising full-year guidance, and announcing its first membership fee hike in seven years. ($BJ)\n* **Cloudflare** climbed 8.05%, continuing its upward momentum on better-than-expected growth in its cloud security offerings. ($NET)\n* **Deere** gained 8.12% after exceeding earnings expectations last quarter, despite projecting a slowdown in farming equipment demand. ($DE)\n* **Merus** climbed 3.3% after Goldman Sachs initiated coverage with a buy rating, citing optimism about its cancer treatments. ($MRUS)\n\n# What’s down 📉\n\n* **PDD Holdings** tumbled 10.64% after the e-commerce giant, parent to Temu, missed earnings and revenue expectations. ($PDD)\n* **Coinbase** fell 7.74%, reversing earlier gains tied to bitcoin's surge above $98,000, after Galaxy Digital's Michael Novogratz warned of an eventual pullback. The SEC also announced that Chair Gary Gensler will step down at the end of the year. ($COIN)\n* **Baidu** fell 5.90% as the Chinese tech company reported a 3% year-over-year revenue decline last quarter, despite growth in its AI cloud business. ($BIDU)\n* **Alphabet** slid 4.74% amid concerns that the DOJ may push for the divestiture of its Chrome browser to address monopoly claims. ($GOOGL)\n\n# \n\n# MicroStrategy Tumbles After Citron Research Shorts the Stock\n\nMicroStrategy’s stock nosedived 16% Thursday, courtesy of a scathing call from Andrew Left’s Citron Research. \n\nThe once high-flying software-turned-Bitcoin hoarder got a cold shower as Citron accused it of floating far above Bitcoin fundamentals. The kicker? Citron is still bullish on Bitcoin but says MicroStrategy’s stock has become a clunky detour in a world of sleek Bitcoin ETFs.\n\nMichael Saylor’s Bitcoin gamble turned MicroStrategy into the unofficial crypto ETF by amassing a jaw-dropping 331,200 bitcoins—worth over $31 billion. But with Bitcoin ETFs now making crypto exposure as simple as shopping on Amazon, investors might wonder if MicroStrategy’s stock is still worth the extra clicks.\n\n# From Darling to Short Target: A Citron Twist\n\nHere’s the irony: Citron used to be one of MicroStrategy’s loudest cheerleaders during its pivot to Bitcoin back in 2020. Fast forward to today, and Citron’s short position is a sharp reality check for Saylor’s strategy. \n\nTheir main gripe? The stock’s value seems more like a speculative joyride than a sustainable business play.\n\nEven with Bitcoin hitting a record $98,000, MicroStrategy’s reliance on hype over fundamentals has some investors tapping the brakes. Thursday’s tumble brought the company’s market cap back down to $89 billion—still hefty but a far cry from its momentary seat among the S&P 500’s big shots.\n\n# Bitcoin Boom, But at What Cost?\n\nSure, MicroStrategy is still up over 500% this year—thanks, Bitcoin—but that kind of surge has its skeptics. Kerrisdale Capital made a similar call earlier, shorting MicroStrategy while betting long on Bitcoin. \n\nTheir reasoning? You don’t need to ride the Saylor train when Bitcoin ETFs offer first-class seats.\n\nMeanwhile, crypto miners like CleanSpark and Marathon Digital are picking up steam as alternative plays for Bitcoin exposure. And with President-elect Trump eyeing U.S.-only Bitcoin mining, the competition could heat up further.\n\n# \n\n# Market Movements\n\n\n\n* 🎄 **Gap CEO Optimistic on Holiday Sales:** Gap's holiday season is off to a strong start, with CEO Richard Dickson raising sales and profit expectations. However, potential tariffs under the incoming Trump administration remain a concern.\n* 📈 **Snowflake Surges on Earnings Beat:**Snowflake shares spiked 19% after the company reported better-than-expected Q3 earnings and raised its full-year guidance. The company also announced a multi-year partnership with AI startup Anthropic.\n* 🚗 **Ford Plans European Job Cuts:** Ford plans to reduce its European workforce by 4,000 jobs (14%) by 2027, citing weak EV demand and competition from Chinese automakers. ($F)\n* 🏦 **CFPB Finalizes Payment Supervision Rule:** The CFPB finalized a rule requiring digital payment giants like Apple and Google to face bank-like supervision, aimed at strengthening consumer protections. ($AAPL)\n* 🔋 **Hyundai Unveils All-Electric Ioniq 9 SUV:** Hyundai announced the 2026 Ioniq 9, a 3-row all-electric SUV with a 335-mile range, rapid charging, and a 4.9-second 0–60 mph time. Production will begin in Georgia in spring 2025. ($HYMTF)\n* 🚘 **Nissan Workforce Reduction in the U.S.:** Nissan revealed that 1,000 U.S. employees, or 6% of its workforce, accepted early retirement offers as part of a global effort to cut 9,000 jobs. ($NSANY)\n* 💻 **Baidu Posts Mixed Q3 Results:** Baidu reported a 2.6% YoY revenue drop to $4.63B due to weak advertising, but net profit rose 14% to $1.05B, with growth in AI Cloud and chatbot adoption. ($BIDU)\n* 🛍️ **TJX Tops Estimates But Shares Dip:** TJX delivered Q3 EPS of $1.14 and 6% revenue growth YoY to $14.06B. Despite strong holiday sales, shares fell 0.28% after issuing lower Q4 EPS guidance. ($TJX)\n* 🍔 **McDonald’s Introduces 2025 McValue Platform:** McDonald’s announced a 2025 \"McValue\" platform featuring $5 value meals and \"buy one add one\" deals to address affordability amid economic pressures. ($MCD)\n* 🛒 **Alibaba Integrates E-Commerce Platforms:** Alibaba is merging its domestic and international e-commerce units under a new group, appointing Fan Jiang as CEO to streamline operations. ($BABA)\n\n# \n\n# Comcast Spins Off Cable Networks\n\nComcast is putting most of its cable networks into their own sandbox, spinning them off into a new publicly traded entity called SpinCo. \n\nThe move allows NBCUniversal to focus on its shinier toys—like streaming, theme parks, and entertainment—while cord-cutting continues to gnaw at the profitability of traditional TV. This strategic reshuffle sets the stage for a more streamlined Comcast, primed to compete in high-growth areas.\n\n# Cable Castaways: What’s In and What’s Out\n\nSpinCo will house networks like USA, MSNBC, CNBC, Oxygen, E!, Syfy, and Golf Channel, as well as digital properties like Fandango and Rotten Tomatoes. These assets brought in $7 billion over the past year but are increasingly seen as anchors in a sinking industry. \n\nBravo and Peacock, however, are staying put. Why? They’re integral to NBCUniversal’s growth story, with Peacock recently flexing its muscles via Olympics coverage and an 82% revenue surge last quarter.\n\nLeadership for SpinCo is already lined up, with NBCU veteran Mark Lazarus taking the CEO reins and Anand Kini serving as CFO and COO. The new venture is being touted as \"well-capitalized\" and ripe for partnerships—or maybe a few mergers, given the Trump administration's expected M&A-friendly stance.\n\n# A Play for Growth, Not Nostalgia\n\nThe spin-off underscores the brutal math of the modern media landscape. Cable TV, while still profitable, lacks growth potential. Comcast’s move mirrors a broader industry shift, as rivals like Disney and Warner Bros. \n\nDiscovery weigh similar strategies but haven’t yet pulled the trigger. Meanwhile, Comcast is all-in on its forward-facing ventures, such as Peacock, which now boasts 29% more paid subscribers and is nearing profitability.\n\nNBCUniversal isn’t just banking on streaming. Its theme park arm is preparing to debut Epic Universe in Orlando, described as the most advanced park yet. Translation: It’s full steam ahead for investments in experiences people can’t stream from their couches.\n\n# The Big Picture: Spin Now, Merge Later?\n\nSpinCo won’t be left to fend for itself indefinitely. Comcast hinted at future acquisitions or partnerships to build scale in a fragmented cable market. With 70 million U.S. households still paying for cable, there’s value in consolidation—even if the long-term trajectory remains bleak.\n\nFor Comcast, this isn’t just about cutting loose legacy assets. It’s about unburdening its core business to take bigger swings in streaming and entertainment. As Peacock and Epic Universe gain momentum, the SpinCo experiment will test whether old-school cable can thrive—or merely survive—when left to its own devices.\n\n# \n\n# On The Horizon\n\n# Tomorrow\n\nEarnings season is wrapping up, with only a few notable reports left to trickle in next week. Tomorrow, though? It’s looking pretty quiet on the corporate front.\n\nInstead, all eyes will be on two economic reports: Services and Manufacturing PMI. The PMI, a monthly pulse check on U.S. businesses, surveys companies about production, inventories, and overall conditions to gauge economic health.\n\nThe services sector has been on a roll, hitting 56% last month (anything above 50% signals growth) and marking its best showing since July 2022. Manufacturing? Not so much. With a 46.5% reading, it’s stuck in a seven-month losing streak. While rate cuts could eventually revive the sector, economists are still waiting for the tide to turn.",
        "created_utc": 1732233032.0,
        "subreddit_name": "DayTrading",
        "comments": 0
    },
    {
        "title": "What just happened?",
        "score": 1,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gwg17v/what_just_happened/",
        "content": "I entered a trade today on ES1 on market price. In just 2 minutes, it hit my take profit but instead of +$80, it shows -$80 in trade history and my account is also down by $80. I swear I buy and not sell. I'm attaching screenshots as well. I trade on MT5 and currently doing challenge for 5ers funded account.   \nI took a couple of trades previously as well but it didn't happen before.  \nI have no clue what just happened here can anyone tell me what could be the issue or anyone faced this issue before?  \nI can't pass funded challenge like this I wanna throw my laptop outta window lol :(\n\nhttps://preview.redd.it/1hbzhf84992e1.png?width=1894&format=png&auto=webp&s=f8101e45f475de3ef5658efef0e504ddd9792a06\n\nhttps://preview.redd.it/kzv82ps4992e1.png?width=1920&format=png&auto=webp&s=7039f066cccdb11b457837a1ad8fdd9dc15c54f0\n\n",
        "created_utc": 1732195024.0,
        "subreddit_name": "DayTrading",
        "comments": 0
    },
    {
        "title": "MSTR going up more? ",
        "score": 1,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gwfg99/mstr_going_up_more/",
        "content": "I’m late to this train but looking at buying some MSTR call options? \n\nDo yall think it going to continue up? When does it stop? And I’ve see mentioned NVDA performed like this too…",
        "created_utc": 1732193213.0,
        "subreddit_name": "DayTrading",
        "comments": 6
    },
    {
        "title": "What the hell just happened?",
        "score": 1,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gwe10g/what_the_hell_just_happened/",
        "content": "I entered a trade today on ES1 on market price. In just 2 minutes, it hit my take profit but instead of +$80, it shows -$80 in trade history and my account is also down by $80. I swear I buy and not sell. I'm attaching screenshots as well. I trade on MT5 and currently doing challenge for 5ers funded account. \n  \nI took a couple of trades previously as well but it didn't happen before.  \n\nI have no clue what just happened here can anyone tell me what could be the issue or anyone faced this issue before?  \n\nI can't pass funded challenge like this I wanna throw my laptop outta window lol :(\n\nhttps://preview.redd.it/ne4rotl7o82e1.png?width=1894&format=png&auto=webp&s=dfb17d93e0ece972de1550a8d0805496eddc3c77\n\nhttps://preview.redd.it/ndbszxbwm82e1.png?width=1920&format=png&auto=webp&s=7ff4372dc3790434e358ce2d16509ab876f3c0b5\n\n",
        "created_utc": 1732188244.0,
        "subreddit_name": "DayTrading",
        "comments": 2
    },
    {
        "title": "Too bullish in this sub this morning. (100%+ port gain). OTM SPY💫💫💫",
        "score": 23,
        "url": "https://i.redd.it/emie9f91q92e1.jpeg",
        "content": "",
        "created_utc": 1732200704.0,
        "subreddit_name": "wallstreetbets",
        "comments": 6
    },
    {
        "title": "Looking for a Reliable Funded Account for Trading Options/Spy Futures with Actual Payouts",
        "score": 0,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gwjcd6/looking_for_a_reliable_funded_account_for_trading/",
        "content": "Hey everyone,  \n  \nHas anyone had good experiences with programs that are transparent and actually pay out? I came across a TopStep Ad and it seemed interesting but I don't see anyone talking about payouts. I'm a pretty good trader, i scalp daily 0dte spy calls, want to try some new strategies that need more capital and i don't want to risk any of my own right now. Appreciate any recommendations or insights! I’m currently looking for a reputable funded account program that supports trading options or SPY futures. I’ve come across a few, but I’m hoping to find one that actually follows through with payouts. \n\nThanks in advance!",
        "created_utc": 1732206549.0,
        "subreddit_name": "Daytrading",
        "comments": 4
    },
    {
        "title": "The Technology the Trump Administration Could Use to Hack Your Phone",
        "score": 19,
        "url": "https://www.newyorker.com/news/news-desk/the-technology-the-trump-administration-could-use-to-hack-your-phone",
        "content": "",
        "created_utc": 1732216309.0,
        "subreddit_name": "technology",
        "comments": 45
    },
    {
        "title": "A new ‘ultra-secure’ phone carrier says it can make you harder to track / Cape’s privacy-focused service comes with a pre-configured Android phone and aims to minimize data collection.",
        "score": 17,
        "url": "https://www.theverge.com/2024/11/21/24302416/cape-ultra-secure-phone-data-collection-tracking",
        "content": "",
        "created_utc": 1732210646.0,
        "subreddit_name": "technology",
        "comments": 13
    }
]