[
    {
        "title": "Amazon will overtake Walmart as the largest U.S. retailer in 2022, JPMorgan predicts",
        "score": 4822,
        "url": "https://www.reddit.com/r/stocks/comments/nxi8vu/amazon_will_overtake_walmart_as_the_largest_us/",
        "content": "https://www.cnbc.com/2021/06/11/amazon-to-overtake-walmart-as-largest-us-retailer-in-2022-jpmorgan.html\n\nAmazon is on track to surpass Walmart as the largest U.S. retailer by 2022, J.P. Morgan analysts wrote in a note published Friday.\n\nAmazon's U.S. retail business is the \"fastest growing at scale,\" the analysts wrote.\n\nAfter 9 months of consolidation, amazon should be finally able to break out. AWS and advertising keep growing, and amazon shipping operation can now challenge UPS, Fedex and USPS. For e-commerce, it is still a leader that none of the any other company can match or catch up. For the past 2 weeks investors were slowly rotating back to the established growth big tech stocks, so amazon should be able to break ath this month.\n\nThanks for the awards.",
        "created_utc": 1623424234.0,
        "subreddit_name": "stocks",
        "comments": 640
    },
    {
        "title": "iPadOS 15 confirms Apple's M1-equipped iPad Pro is a V8 engine powering a Ford Pinto",
        "score": 6192,
        "url": "https://appleinsider.com/articles/21/06/11/ipados-15-confirms-apples-m1-equipped-ipad-pro-is-a-v8-engine-powering-a-ford-pinto",
        "content": "",
        "created_utc": 1623414162.0,
        "subreddit_name": "apple",
        "comments": 909
    },
    {
        "title": "The Trump administration forced Apple to secretly reveal at least two Democrats’ data",
        "score": 5818,
        "url": "https://www.theverge.com/2021/6/10/22528853/trump-force-apple-democrat-house-intelligence-committee-data",
        "content": "",
        "created_utc": 1623373642.0,
        "subreddit_name": "apple",
        "comments": 508
    },
    {
        "title": "I made an algo that tracks sentiment on Reddit (and trades those stocks). Here's the source code and the sentiment results for this week. I rebalance weekly, but can set rebalance speed to as fast as a couple ticks (although that would be a bit silly)",
        "score": 263,
        "url": "https://www.reddit.com/r/Daytrading/comments/nxiqcn/i_made_an_algo_that_tracks_sentiment_on_reddit/",
        "content": "Here's the [source code](https://github.com/tstewart161/Reddit_Sentiment_Trader)! Note: this does need to be edited according to your needs (how many of the top you want to invest in, how you want to deploy it, etc.)\n\nAnd here's the [hosted version](https://getquantbase.com/). Note: this is for \\*investing\\* in the sentiment index. The actual algo that tracks sentiment for you to do it yourself is the source code, and while it works to list out the stuff below, it ain't super pretty\n\nYour typical sentiment analysis stuff coming through. I do this stuff for fun and make money off the stocks I pick doing it most weeks, so thought I'd share. I created an algo that scans the most popular trading sub-reddits and logs the tickers mentioned in due-diligence or discussion-styled posts. Instead of scanning for how many times each ticker was mentioned in a comment, I logged how popular the post was among the sub-reddit. Essentially if it makes it to the 'hot' page, regardless of the subreddit, then it will most likely be on this list.\n\n**How is sentiment calculated?**\n\nThis uses VADER (Valence Aware Dictionary for Sentiment Reasoning), which is a model used for text sentiment analysis that is sensitive to both polarity (positive/negative) and intensity (strength) of emotion. The way it works is by relying on a dictionary that maps lexical (aka word-based) features to emotion intensities -- these are known as sentiment scores. The overall sentiment score of a comment/post is achieved by summing up the intensity of each word in the text. In some ways, it's easy: words like ‘love’, ‘enjoy’, ‘happy’, ‘like’ all convey a positive sentiment. Also VADER is smart enough to understand the basic context of these words, such as “didn’t really like” as a rather negative statement. It also understands the emphasis of capitalization and punctuation, such as “I LOVED” which is pretty cool. Phrases like “The turkey was great, but I wasn’t a huge fan of the sides” have sentiments in both polarities, which makes this kind of analysis tricky -- essentially with VADER you would analyze which part of the sentiment here is more intense. There’s still room for more fine-tuning here, but make sure to not be doing too much. There’s a similar phenomenon with trying to hard to fit existing data in stats called overfitting, and you don’t want to be doing that.\n\nThe best way to use this data is to learn about new tickers that might be trending. As an example, I probably would have never known about the ARK ETFs, or even BB, until they started trending on Reddit. This gives many people an opportunity to learn about these stocks and decide if they want to invest in them or not - or develop a strategy investing in these stocks before they go parabolic.\n\n&#x200B;\n\n**Results and some stats:**\n\nRight now I'm up 75% YTD, compared to the SP500's 15% (the recent spikes in GME and AMC have helped tremendously of course, and I don't claim that this is a great strategy, just one that has been lucky due to 2021's craziness)\n\n\\- The strategy is **backtested** only to the beginning of 2020, but I'm working on it. It's got an annualized return of 35% (compared to 16% for the SP500)\n\n\\- **Max drawdown of -8.7%** (aka how far it went down before coming back up -- interestingly enough, Reddit sentiment weathered COVID pretty well)\n\n&#x200B;\n\n**Reddit - Highest Sentiment Equities This Week (what’s in my portfolio)**\n\nEstimated Total Comments Parsed Last 7 Day(s): 501,150\n\n|**Ticker**|**Comments/Posts**|**Bullish %**|\n|:-|:-|:-|\n|AM\\* (ticker is banned)|2,040|17|\n|CLOV|1,944|15|\n|BB|1,830|21|\n|GM\\* (ticker is banned)|1,201|21|\n|CLNE|888|33|\n|WKHS|934|21|\n|UWMC|740|19|\n|CLF|1,069|13|\n|SENS|1,255|7|\n|ORPH|544|37|\n|TSLA|512|40|\n|AAPL|267|51|\n|TLRY|290|31|\n|MSFT|82|22|\n|MVIS|56|40|\n\n&#x200B;\n\nHappy to answer any more questions about the process/results. I think doing stuff like this is pretty cool as someone with a foot in algo trading and traditional financial markets",
        "created_utc": 1623425496.0,
        "subreddit_name": "Daytrading",
        "comments": 62
    }
]