[
    {
        "title": "Meta's Reality Labs posts $3.85 billion loss in first quarter",
        "score": 920,
        "url": "https://www.reddit.com/r/stocks/comments/1cchrf6/metas_reality_labs_posts_385_billion_loss_in/",
        "content": "Meta shows no signs of substantially trimming its losses from investing in the metaverse, as competition heightens between the Facebook parent and Apple in the virtual reality market.\n\nIn its first-quarter earnings report Wednesday, Meta disclosed that its Reality Labs unit recorded a $3.85 billion operating loss. Revenue in the metaverse division was $440 million, up about 30% from $339 million a year ago and representing only around 1% of Meta’s total sales for the quarter.\n\nAnalysts were expecting a $4.31 billion operating loss and sales of $512.5 million for the quarter, according to StreetAccount.\n\nReality Labs has now lost more than $45 billion since the end of 2020, when Meta first began reporting the business segment separately.\n\nMeta CEO Mark Zuckerberg has called the metaverse “the next frontier,” imagining a digital world that facilitates both productivity and recreation. He changed the name of his company from Facebook to Meta in 2021 to reflect his vision for the future of computing.\n\nFor now, developing metaverse technology remains a fledgling and costly effort.\n\nThe company unveiled in September the Quest 3 VR headset, the latest version of its mixed reality hardware, with a starting price of $499. Apple started selling its $3,499 Vision Pro in February, touting a so-called “spatial computing” experience.\n\nMeta announced Monday that it will partner with third-party hardware companies to create new VR headsets using the same Meta Horizon operating system that powers its Quest headsets. Zuckerberg said that while Apple “basically won out” in the phone market with its closed ecosystem, Meta’s move aims to ensure the “open model defines the next generation of computing.”\n\nSource: https://www.cnbc.com/2024/04/24/metas-reality-labs-posts-3point85-billion-loss-in-first-quarter.html",
        "created_utc": 1714015131.0,
        "subreddit_name": "stocks",
        "comments": 266
    },
    {
        "title": "No, Apple Didn't Really Cut Vision Pro Production By 50%",
        "score": 1119,
        "url": "https://www.uploadvr.com/apple-vision-pro-production-cut-claims-debunked/",
        "content": "Heaney points out that this entire news cycle is based on Kuo backpedaling. Kuo originally gave a number that other analysts agreed on, then went to a much higher number that everyone called out as impossible and now that he’s gone back, he’s saying it’s Apple’s fault instead. ",
        "created_utc": 1714053587.0,
        "subreddit_name": "apple",
        "comments": 208
    },
    {
        "title": "Apple Partner TSMC Unveils Advanced 1.6nm Process for 2026 Chips",
        "score": 726,
        "url": "https://www.macrumors.com/2024/04/25/tsmc-unveils-1-6nm-process/",
        "content": "",
        "created_utc": 1714068028.0,
        "subreddit_name": "apple",
        "comments": 90
    }
]