[
    {
        "title": "Warren Buffett Sells Apple Shares, Buys Lots Of Oil",
        "score": 485,
        "url": "https://www.reddit.com/r/investing/comments/1as5eli/warren_buffett_sells_apple_shares_buys_lots_of_oil/",
        "content": "[https://www.ft.com/content/780409aa-8285-4c58-bb1e-97c6f69a87b9](https://www.ft.com/content/780409aa-8285-4c58-bb1e-97c6f69a87b9)\n\n&#x200B;\n\nHow is this not a big deal? Bezos continues to sell Amazon, Buffett sells Apple, everything in tech is super high, and Russia is turning into a war economy.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
        "created_utc": 1708079161.0,
        "subreddit_name": "investing",
        "comments": 266
    },
    {
        "title": "Foldable iPhone Development Allegedly Paused Due to Failing Screens",
        "score": 1306,
        "url": "https://www.macrumors.com/2024/02/16/foldable-iphone-paused-failing-screens/",
        "content": "",
        "created_utc": 1708091381.0,
        "subreddit_name": "apple",
        "comments": 419
    },
    {
        "title": "Apple Negotiating With OLED Suppliers for Next Year's iPhone SE 4",
        "score": 940,
        "url": "https://www.macrumors.com/2024/02/16/apple-iphone-se-4-oled-panel-orders/",
        "content": "",
        "created_utc": 1708083787.0,
        "subreddit_name": "apple",
        "comments": 185
    },
    {
        "title": "Apple Lifts Ban on Epic Games, Letting It Build Third-Party iOS App Store in EU",
        "score": 917,
        "url": "https://au.pcmag.com/mobile-apps/103896/apple-lifts-ban-on-epic-games-letting-it-build-third-party-ios-app-store-in-eu",
        "content": "",
        "created_utc": 1708119258.0,
        "subreddit_name": "apple",
        "comments": 216
    },
    {
        "title": "$1.5k -> $125k in a month",
        "score": 12762,
        "url": "https://i.redd.it/ommk3d7a7zic1.jpeg",
        "content": "Almost all NVDA calls with a splash of COIN too. Not an entirely smooth ride but overall happy. Keeping half in next week through earnings, holding other half back in case things go south.",
        "created_utc": 1708101686.0,
        "subreddit_name": "wallstreetbets",
        "comments": 1527
    },
    {
        "title": "Making 100-200 a day by day trading spy.  How long is it really sustainable?",
        "score": 133,
        "url": "https://www.reddit.com/r/Daytrading/comments/1as8a5g/making_100200_a_day_by_day_trading_spy_how_long/",
        "content": "I’ve recently started to day trade. I have almost no experience trading but have been studying the stock market for two years, I know the Greeks very and how options work and how volatility effects options prices. As of now I’ve been day trading spy using Robinhood for the last two weeks and am making around 100-200 a day by mainly scalping. I started with 120 and grew my account to 1100 dollars, so basically if my account blows up I only really lost 120 dollars. I read a lot that it is really hard to make money at all day trading but it seems fairly easy if you have a strategy and risk management. I usually wait for 30 minutes after market open to enter a position or I just wait for big spikes and immediately buy the next ITM call, jump in and then out once I hit 100 or if it has real good momentum I’ll wait to hit 200 and jump out no matter how good the momentum. Haven’t lost yet because if I see it going sideways I’ll pull out as soon as I break even to avoid wash sale tax. I know I’ll lose eventually.\n\nI guess I’m wondering how long this is actually sustainable or did I just get lucky and find a strategy that works? At this point I’m waiting for my account to blow up due to beginners luck lmao.\n ",
        "created_utc": 1708089207.0,
        "subreddit_name": "DayTrading",
        "comments": 118
    },
    {
        "title": "I just bought AAPL stocks and I'm not sure if it's a good investment.",
        "score": 11,
        "url": "https://www.reddit.com/r/AAPL/comments/1aryqrr/i_just_bought_aapl_stocks_and_im_not_sure_if_its/",
        "content": "I'm a fresh graduate with little to no money and I just bought AAPL stocks for about $1800. I am probably going to keep it for the next 5 years/decade, is this a good idea? Or should I find another stock to invest on instead?",
        "created_utc": 1708054216.0,
        "subreddit_name": "AAPL",
        "comments": 15
    }
]