[
    {
        "title": "Just bought a couple shares as my first stocks ever!",
        "score": 25,
        "url": "https://www.reddit.com/r/AAPL/comments/nb6jzr/just_bought_a_couple_shares_as_my_first_stocks/",
        "content": "30 years old and just starting my investing journey, and I've been slowly researching things over the last couple of months and AAPL just makes sense to have for the 20-30+ years long-term which I will hold. I have been an Apple fan since 2008 when I got introduced to them, I love watching their keynotes and all press media related things. It's just a company I enjoy seeing grow and I guess I wanted my first stock pick to be a business I enjoy and love learning about.\n\nCan't wait to keep adding shares throughout the years and smile at the progress!",
        "created_utc": 1620873797.0,
        "subreddit_name": "AAPL",
        "comments": 11
    },
    {
        "title": "Apple (AAPL) Weekly Stock Chart Analysis",
        "score": 10,
        "url": "https://www.youtube.com/watch?v=kFTHgHFu7Gk",
        "content": "",
        "created_utc": 1620869147.0,
        "subreddit_name": "AAPL",
        "comments": 5
    },
    {
        "title": "Just sold everything and went index fund...",
        "score": 3858,
        "url": "https://www.reddit.com/r/stocks/comments/nbmq5e/just_sold_everything_and_went_index_fund/",
        "content": "I just sold all my tech/meme stocks and just went straight to index funds. Over the past few months of \"investing\" I realized volatility is not my friend. Maybe that is the wrong approach but I figured, I'll take the loss as a tax credit and just keep everything in VTI/SCHG and some dividend stocks.\n\nEdit: thanks for the support\n\nAn example I’ll use is PLTR.\nOn March 8th it was at 22$. Analysts were saying buy buy buy. Great. So as of today, it is down 20% from March 8th. Vs VTI, March 8th it was 200, closed at 211 today so you’d be up 6%. Of course, you can wait 5 more years, and maybe PLTR will get to 40-45 again... that is if they don’t have competition, no issues with their business model... whole VTI may go up 30-35% but with less stress of worrying about an individual company... yes less risk, less reward...\n\nEdit:\nThere have been some messages about \"paper hands\" etc, buy high sell low... valid points perhaps, but, \nI did this for my own self, as I realized that:\n 1. I am not a person who can handle the volatility of some of these stocks, I am sure that they will go up in 1,2,3, years etc, but if they do, so will VTI / VOO / SPY.... maybe not to the same level but the road will be less bumpy\n 2. This is a way to build a base of my portfolio. I will go back to stocks, but to at a much lower exposure. I do think that inflation will be an issue over the next few years and I think some of the tech stocks will be up / down for the next bit. Especially those companies that are trading at 100x their earnings, so I am sure I will have the opportunity to re-enter (again my opinion). \n\nIn the meantime, I sold, yes I took a loss, but this will be used against any gains I did make this year my offset my taxes a bit (not sure how much, will see in Jan).",
        "created_utc": 1620928322.0,
        "subreddit_name": "stocks",
        "comments": 1321
    }
]