[
    {
        "title": "Advice I really wanted to give to new traders, im a new day trader myself but I take it very seriously,",
        "score": 359,
        "url": "https://www.reddit.com/r/Daytrading/comments/iy0thm/advice_i_really_wanted_to_give_to_new_traders_im/",
        "content": "**Edit before you read:** I have traded live for 3 months but had so strategy and switched to a new broker so I wanted to learn the platform so I went to paper on thinkorswim and took it most seriously, *before you shit on this post its for  new traders, newer than me that I'm 6 months in.*\n\nFor starters im paper trading now dont shit on me for paper trading, I have 60k in savings at 23 im frugal and im not about to spend my savings because I was too dumb to dive, in. I traded live for 3 months swing trading, I know how the emotions feel, and anyone who tells you paper trading is the same as live trading is lying.\n\n**You dont learn to fly a plane getting thrown in the cockpit? You go in a simulator first.**\n\n&#x200B;\n\n**Paper trading is not the same as live trading but at least it lets you know how you need to think, it helps you more clearly develop a strategy otherwise if you dive in thinking you know it all you will get punched in the face before you re-think your entire process** & yes that happened to me.\n\nANYONE who makes posts on Reddit talking about their success 99% are BS posts I have been trading for 6 months now I study & learn new golden nuggets every day and I still don't know shit in fact no one knows anything or **no one knows what's gonna happen next**. 99% of reddit, some twitter posts, stock twits, are BS everyone's insecure and whats advice when to sell and buy or what to sell and buy everyone follows the crowd, I barely come on these types of pages and this is why. Chat rooms are basically BS everything is a big ball of BS, come back to me in 5 years when I know more than I do now & ill tell you im still learning.\n\nThe best way to describe it to me is.. **think of most of the trading community as a corporate job, everyone discusses what the other person is doing, said, gossiping, talking shit, coming up with theories, spreading rumors, lies.** Where if you sat in your cubicle with your 1 homie and focused on shit together you probably would be better off shit, if you're by yourself that's okay too. Trading is very lonely I can see I'm very new to it but I can see to what it is. A friend brought it on to me but I took it very seriously from the start, I took a month of educating before even buying my first share, he's more of an investor with no motive or interest to do his own research, he doesn't have the funds to day trade but even basic fundamentals or charting skills he has none, zero.\n\nIf I go anywhere on any chat room any comment section, people will ask whats your PT, when should I sell? how do you know this? that? Its easy to get lost and I truly and learning every day but the biggest help for me has been putting 11 sticky notes on my screen to remind me to sit on my hands. I have journaled every trade since the first one & I suggest you do as well, I go over what I did wrong, right, what I will improve on next time. I record every single trade and go over it at the end of the day, I go over all my trades at the end of the week, I meditate and prepare psychologically for a good day, if I wake up late I woke to go on the computer and trade I will go on a walk before my coffee come back stretch meditate and trade. **Patience is key, persistence is key. Im breaking even all the time, I'm paying market tuition but I'm learning**, I very strong risk management, I stick to really 2 strategies and if they are not there I won't trade.\n\n***Things to take note of or reminders for your trading:***\n\n1. **Don't be impatient -** sit on your damn hands & wait for A+ setups\n2. **Have a plan**, don't FOMO jump in. If you do wait for a pull-back and make sure you have a plan\n3. **chat rooms will fuck with your head, you're never going to be a good trader with that shit around**, unless you really really have a small group and extremely supportive of your millions of answers but even then your almost looking for the 'answer' for it all. This being said there is exceptions where some discord channels have excellent education tabs or groups online do, go on youtube go look at blogs don't go to one source go to a bunch and go for what feels right for YOU.\n4. **log your trades**, you will thank yourself for this I go over exactly where I entered by using a screen shot of the trade itself, entry and exit. A lot of traders use excel sheets with a boatload of numbers and criteria but personally that's not for me it may be for you, Im more of a visual learner. I mark what I did right, what went wrong, what I could have done better, where was SPY at the time of the trade, what was the ATR of the stock, short interest, float, market cap, news, did I mark previous areas of value? important areas of support and resistance? I will edit this photo with blocks showing the type of stregy it was, what I will do and prepare for next time, did I take a start position? Did I scale out of my position immediately when I saw a profit? was I eyeing level 2? I found in logging my trades I used to put all the bad trades and then one good one, now I only put the good trades and screw the bad ones as humans we naturally focus on our failures and remember them so why not hone in on our successes and what exactly about it to the tee made it a winning trade for me? I also rephrase words like \"loss\" to \"cost of doing business\" like people say think of it as market tuition, loss is just such a harsh word there is no way to look at that otherwise. I promise you making your own playbook of your best trades will be the best thing you can do, especially screen recording. I will see trades and this light pops in my brain saying this is your playbook trade you cant skip out on this, I enter and before I even enter the trade due to the ATR i know exactly the max I could lose multiplying - # of shares X my cents I'm risking below support. and the ATR shows me my expected PT for the trade. This is just what I do, regardless it doesn't matter find what suits you, but If you're paper trading and not logging your trades and just doing it mentally your wasting your time.\n5. **if / then statements** \\- couldn't be any more helpful if you dont know where your getting out then why are you even getting in, again trading is simple but it sure isn't easy, buy at support / sell at resistance right? Seems life changing & so easy when your first see those things then you try to determine good risk reward opportunities and your in the heat of the moment chasing things and messing up but you can look at the chart later and say oh, \"if only I bought here\" patience is so so key, it really is. I have to instill it every day, I am so new to trading but I do everything I can to better myself every day, and all my mistakes are psychologically and dealing with just how I handle myself, the impulsiveness, the hesisitation, trading too large, overtrading, these are all the things that mess me up and they will do that to you too. So be aware of yourself that's the best thing you can do as a trader. Your trading journey is identifying where you go wrong not the market, it just makes opportunities all damn day, its you to capitalize on those, flow with the tide not against it.\n6. **talk to yourself - yes literally out loud.** I screen record myself with my voice guiding my thoughts in that exact moment only so I can watch it later realize it didn't actually go down as fast as I felt like and think wow what an idiot what were you thinking... well! im thinking out loud so I can actually hear my damn mistakes.\n7. **Most importantly do you even love trading?** \\- If you are influenced by the money only and simply have no interest in trading you're going to fail simple as that, my dad forced me to do so much shit in my life, yeah I was good at them but I was passionate enough to be great, this is the first time I have ever truly wanted to spend every single second doing something. From the morning I wake up, until my body tells me I can finish where I left off tomorrow\\*\\*.\\*\\*\n8. **If you really love trading - learn to have balance** \\- this is something I need to remind myself of. I have saved my money for a long time, trying to make my dad proud of something, not knowing what the fuck im doing with my life and going to be 24 in a few months. I have become obsessed with this, it really is the first time I dont want to watch movies, I dont want to play video games, I spend every breathing second learning how to trade better and learn more than I did the day before. I need balance and everyone does, dont let it control your life.\n9. **Trading is a lonely and challenging aspect but what are you really in it for?** \\- I love the challenging aspect of trading, I love that many people cant make it, I love most that It allows me to learn about myself, the way I psychologically deal with my mind and my day to day, how I handle hardships, how I face things within myself, I have always loved psychologically studying a couple of courses at community college and business but it brings them both together, it fascinates me.\n10. **Dont get stuck on paper trading -** As I said above the only reason I went to paper trading is because I wanted to learn my brokers platform, (thinkorswim) I wanted to hone in on one or two strategies which I currently am, I believe those who shit on paper trading started off live and once they got punched in the face revised and took that as the bias towards creating a strategy, i dont know everything but im not an idiot i already said this happened to me, so to not have a strategy and then switch to a new broker no knowing the platform will set you up your failure. Dont get stuck on paper trading though, set a time frame you want to be on it for I think 3 months is a good go, some people stay on it for a year and I dont think thats good, again you can ALWAYS go back.\n11. **Paper trading is simply to format strategy and learn from your most common mistakes -**  All my mistakes right now majority of them come down to impatience because if you are patient and wait the opportunities there and you will just know if studied that set up enough, it will stare at you and almost say \"buy me\" those have litterly been my best moves that I have felt and are in my playbook where I recognized them and added them as good risk reward opportunities, its easy to want to buy everything and this is why I disregard most reddit posts and chat rooms its easy to say huh what is everyone buying before you know it you're clicking away and incorporating a strategy only resembling gambling, its like you're obsessing with the green on the screen. If this is really a problem for you, *remove your P/L from the screen, if your broker wont let you remove it litterly tape a paper over that part of the screen a trader cares about risk / reward and good opportunities to benefit that's what gets you P/L not magically watching if it will be there.*\n12. ***My favorite places to learn are..*** *If I had to choose two places for you to go as a new trader is SMB capital youtube videos - they are authentic/real / no BS and can guide you in the right way.*\n\n*Chat with Traders Podcast - there is a little over 200 podcasts roughly 35-60 minutes each I have listed to 80 of them so far and I log notes and journal on them all - if you want to really hear how pro traders got started go here, what they do and how they do it, a lot of them you will find stuck with one thing, and do it very very well.*\n\n13. **My favorite trading books...**\n\nI have read **trading in the zone by Mark Douglas, the Warren Buffett portfolio** (just a basic book on warrens principles of investing and going with what you know, not checking your stocks every day and buying Stocks only if you plan on holding them for the long term) after reading this book is when I cleared up my portfolio and now only have large blue-chip companies mainly tech. I’ve also read **price action trends by AL Brooks. How to day trade for a living by Andrew Aziz, Trading Psychology 2.0 by Brett Steenbarger, mindset by Carol S. Weck** Is one of the best psychology books I’ve read it really is eye-opening to how you deal with things in boat trading and life. **One good trade by Mike Bellafiore Owner of SMB Capital** this book talks a lot about focusing on quality over quantity and identifying your mistakes And I am like 100 pages left of his second book called **the playbook** which has to do with journaling and tracking every single one of your trades and primarily having A separate journal where are you put only one trade from each day that really stood out to you and made sense and why. These last two books have been my favorite I think. If you’ve ever watched any SMB capital videos on YouTube you know how straightforward forward and authentic they really are.\n\n**Why did I make this post???** \\- I made this to remind you - the reader, I made it to remind myself. Im a big fan of progress in my life but also in seeing shit down to the core of what it really is. I made this because I saw someone post a BS story of how to make it as a trader and I see to many and it pissed me off.\n\n**there isn't a time where you just \"make it\" as a trader** its not like oh here's your master's degree. Its something that gets crafted over time, real traders do one thing and only one thing very well. Wanna be traders follow everyone else, & learn to cry about how shitty they are or learn to sell courses, the best traders know how to adapt to every situation.",
        "created_utc": 1600824603.0,
        "subreddit_name": "Daytrading",
        "comments": 109
    }
]