[
    {
        "title": "Warren Buffett now owns more T-bills than the Federal Reserve ",
        "score": 1397,
        "url": "https://www.reddit.com/r/stocks/comments/1emj1gk/warren_buffett_now_owns_more_tbills_than_the/",
        "content": "Berkshire Hathaway now owns more in Treasury bills than the U.S. Federal Reserve as Warren Buffett builds up his cash fortress to a record level.\n\nThe Omaha, Nebraska-based conglomerate held $234.6 billion in short-term investments in Treasury bills at the end of the second quarter, while it owned more than $42 billion of cash and cash equivalents that included T-bills with maturities of three months or less, according to its quarterly financial report.\n\nThat compared with $195.3 billion in T-bills that the Fed owned as of July 31. The central bank held $4.4 trillion in Treasury securities that include notes, bonds and inflation-linked securities. The Fed was a big buyer of the government’s debt during the pandemic and is always one of the largest holders of Treasurys as part of its effort to keep liquidity in the markets.\n\nBuffett, 93, pulled off a surprising and yet prescient move by selling big chunks in stock holdings including Apple last quarter, ahead of a drastic global sell-off this week. Berkshire has been a seller of stocks for seven quarters straight, but that selling accelerated in the last period with Buffett shedding more than $75 billion in equities in the second quarter.\n\nMany loyal Buffett watchers viewed the decision to dump his top holdings as a wake-up call with the Oracle of Omaha seemingly turning bearish on the economy and the markets.\n\nBuffett has noted in the past during times of crisis that he’ll buy Treasury bills directly at auction. The government sells T-bills for terms ranging from four to 52 weeks.\n\nBuffett’s gigantic war chest has been earning sizeable returns thanks to the pop in Treasury yields over the past two years. If invested in 3-month Treasury bills at about 5%, $200 billion in cash would generate about $10 billion a year, or $2.5 billion a quarter.\n\nAfter the Covid-19 pandemic rattled markets, the central bank bought about $5 trillion of Treasurys and mortgage bonds to help aid the economy. But the Fed has been shrinking its asset holdings since June 2022, in a program widely known as quantitative tightening.\n\nThe Fed seeks to promote maximum employment and stable prices by independently setting monetary policy. It includes buying and selling Treasury securities held by the public to control the money supply and interest rates.\n\nSource: https://www.cnbc.com/2024/08/07/warren-buffett-now-owns-more-t-bills-than-the-federal-reserve.html",
        "created_utc": 1723054415.0,
        "subreddit_name": "stocks",
        "comments": 214
    },
    {
        "title": "If you had to have 100% of your portfolio in either Microsoft, Apple, or Nvidia which would you choose?",
        "score": 230,
        "url": "https://www.reddit.com/r/stocks/comments/1em3z4e/if_you_had_to_have_100_of_your_portfolio_in/",
        "content": "In a theoretical scenario where you had to choose between the three, which would you choose and why? What do you see as having the most potential upside / downside of the three? Just curious as to what the general opinion of these companies futures are. Any input is appreciated \n\nThis is assuming a long term position 10+ years ",
        "created_utc": 1723009121.0,
        "subreddit_name": "stocks",
        "comments": 408
    },
    {
        "title": "iOS 18 Adds Camera Setting to allow iPhone audio playback when  shooting videos",
        "score": 1302,
        "url": "https://www.macrumors.com/2024/08/07/ios-18-shoot-video-during-audio-playback/",
        "content": "",
        "created_utc": 1723043479.0,
        "subreddit_name": "apple",
        "comments": 112
    },
    {
        "title": "The $200 Daytrading challenge. Deposit 1: Day 1",
        "score": 107,
        "url": "https://www.reddit.com/r/Daytrading/comments/1emcv3z/the_200_daytrading_challenge_deposit_1_day_1/",
        "content": "[Original post here](https://www.reddit.com/r/Daytrading/s/jvKAJwfft5)\n\nHello again!\n\nThis challenge is about practicing discipline, avoiding overtrading, and taking profit. These are things I have struggled with as a new trader. I have made great trades in the past and ended up giving all the profit back almost every time. I need to walk before I run. Until I reach at least $200 profit total I will be taking very small profit to avoid losses. Today was an example of that.\n\nMy thoughts going into today were that with VIX coming down and seemingly strong bullish sentiment in the market despite Mondays pullback, we would see SPY continue to rise.\n\nAt market open, after a very strong premarket, SPY dipped very slightly and started to rise again. I bought a single 8/7 532c. I saw the price bounce off of $530 a few times so as soon as it broke through and held I sold. I was admittedly nervous about blowing my first day of this challenge and profit is profit. Even as I type this post I can see a few more minutes would have netted me close to triple what I got out with.\n\nToday's P&L: $24.13 CAD\n\nTotal P&L: $24.13 CAD\n\nSee you tomorrow!",
        "created_utc": 1723039989.0,
        "subreddit_name": "DayTrading",
        "comments": 45
    },
    {
        "title": "AAPL trading so far today 08/07/24 07:47am",
        "score": 3,
        "url": "https://i.redd.it/66q75p8r89hd1.jpeg",
        "content": "",
        "created_utc": 1723042085.0,
        "subreddit_name": "AAPL",
        "comments": 5
    }
]