[
    {
        "title": "Intel board member quit after differences over chipmaker's revival plan",
        "score": 406,
        "url": "https://www.reddit.com/r/stocks/comments/1f2ji5j/intel_board_member_quit_after_differences_over/",
        "content": "The sudden resignation of a high-profile Intel board member came after differences with CEO Pat Gelsinger and other directors over what the director considered the U.S. company's bloated workforce, risk-averse culture and lagging artificial intelligence strategy, according to three sources familiar with the matter.\n\nLip-Bu Tan, a semiconductor industry veteran, had said he was leaving the board because of a personal decision to \"reprioritize various commitments\" and that he remained \"supportive of the company and its important work,\" in a regulatory filing on Thursday.\n\nThe former CEO of chip-software company Cadence Design joined Intel's board two years ago as part of a plan to restore Intel's place as the leading global chipmaker. The board expanded Tan's responsibilities in October 2023, authorizing him to oversee manufacturing operations.\n\nOver time, Tan grew frustrated by the company's large workforce, its approach to contract manufacturing and Intel's risk-averse and bureaucratic culture, according to the sources, who were not authorized to speak publicly. \n\nThe circumstances around Tan's exit have not previously been reported. The departure of the industry veteran, who is well-regarded by investors, over Intel's strategy illustrates the uncertainty of its turnaround efforts.\n\nTan leaves as the company endures one of the bleakest periods in its five-decade history that has left it vulnerable to a potential activist shareholder attack, former executives said. Intel has hired investment bank Morgan Stanley to prepare a defense, according to sources familiar with the matter, confirming an earlier report.\n\nIntel, headquartered in California, declined to comment. Tan's venture capital firm, Walden Catalyst, did not respond to a request for comment.\n\nTan's exit leaves a vacuum of chip-industry technical and business acumen on the board, which is populated by leaders in academia and finance, and former senior executives from the medical, tech and aerospace industries, say investors and semiconductor industry insiders.\n\nFormer Intel executives told Reuters the company began preparing for a potential activist threat months ago. Reuters could not independently confirm if any shareholders were preparing an approach.\n\nThis month, Intel paused its dividend that it had been paying for decades when it reported results and plans to reduce capital spending on factory construction. The next day, investors wiped more than $30 billion from its market value, or more than a quarter of its worth.\n\nIntel's struggles are occurring against the backdrop of aggressive investment and sales from rivals swept up by the surge of interest in artificial intelligence. The AI boom turned graphics chipmaker Nvidia into a $3-trillion market-cap company. Intel passed on an opportunity in 2018 to take as much as a 30% stake in ChatGPT-maker OpenAI, Reuters previously reported.\n\nIntel acquired at least two AI startups, among more than four efforts since 2010 to build a blockbuster AI chip, according to former executives. Even though its Habana acquisition yielded promising AI chips, its senior leaders left to form a rival effort in Israel, hurting Intel's program, two sources said.\n\nTo cut costs, Intel announced in August layoffs of more than 15% of its workforce, its second round of cuts in two years. Intel had nearly 125,300 employees globally according to its August financial results.\n\nThe layoff plan was one source of tension between Tan and the board, according to sources. Tan wanted specific cuts, including middle managers who do not contribute to Intel's engineering efforts.\n\nGelsinger, who took over in 2021 as part of a turnaround plan, added at least 20,000 employees to Intel's payroll by 2022.\n\nTo Tan and some former Intel executives, the workforce appeared bloated. Teams on some projects were as much as five times larger than others doing comparable work at rivals such as Advanced Micro Devices, according to two sources. One former executive said Intel should have cut double the number it announced in August years ago.\n\nTan has told people he believed Intel was overrun by bureaucratic layers of middle managers who impeded progress at Intel's server and desktop chips divisions and the cuts should have focused on these people.\n\nIntel's workforce, which is larger than those of Nvidia and Taiwan Semiconductor Manufacturing Co combined, has led to a complacent and uncompetitive culture, far from the \"only-the-paranoid-survive\" ethos of Intel co-founder Andy Grove, former Intel executives said.\n\nIntel's turnaround plan relies on building its foundry business, which helps other companies manufacture chips, similar to TSMC. But the company has not disclosed a big customer and has said the business is not expected to turn a profit until 2027.\n\nAn attempt last year to break into contract-manufacturing through a $5.4-billion purchase of Israel-based chip manufacturer Tower Semiconductor was scuttled after China blocked the deal. Intel would have obtained an organization dedicated to contract chipmaking, something Intel has never done successfully.\n\nWithout Tower, Intel, historically a maker of its own chips, lacks the expertise to work with external customers, which it has struggled to attract, according to four sources familiar with Intel's manufacturing business.\n\nTan grew frustrated as the board did not follow his recommendations over how to make the manufacturing business more customer-centric and to remove unnecessary bureaucracy, a person close to Tan said.\n\nIntel has continued to build new factories in Ohio, Arizona and across Europe without naming new customers.\n\nhttps://m.economictimes.com/tech/technology/intel-board-member-quit-after-differences-over-chipmakers-revival-plan/amp_articleshow/112843092.cms",
        "created_utc": 1724771447.0,
        "subreddit_name": "stocks",
        "comments": 109
    },
    {
        "title": "Snapchat Finally Comes to iPad After 13 Years",
        "score": 1010,
        "url": "https://www.macrumors.com/2024/08/27/snapchat-finally-comes-to-ipad/",
        "content": "",
        "created_utc": 1724773116.0,
        "subreddit_name": "apple",
        "comments": 203
    },
    {
        "title": "These surprise announcements could make it into Apple’s iPhone 16 event",
        "score": 677,
        "url": "https://9to5mac.com/2024/08/27/these-surprise-announcements-could-make-it-into-apples-iphone-16-event/",
        "content": "",
        "created_utc": 1724776557.0,
        "subreddit_name": "apple",
        "comments": 202
    }
]