[
    {
        "title": "Tesla’s biggest retail shareholder is voting against Elon Musk’s $55 billion package",
        "score": 5665,
        "url": "https://www.reddit.com/r/stocks/comments/1c8shlq/teslas_biggest_retail_shareholder_is_voting/",
        "content": "Tesla’s biggest retail shareholder, Leo Koguan, confirmed that he is voting against Elon Musk’s $55 billion package and the re-election of two board members.\n\nWe first reported on Koguan in 2021 when the little-known investor became the third largest individual shareholder in Tesla behind Elon Musk and Larry Ellison.\n\nThe Indonesian-born Chinese American businessman is better known for founding SHI International Corp, a large private IT company that made him a billionaire. He is also involved in academia and philanthropy.\n\nKoguan has previously described himself as an “Elon fanboy” (the featured image above is him and Musk) and believes in Tesla’s mission to accelerate the world’s transition to sustainable energy. He has been willing to put his money on it and by 2022, he had invested more money in Tesla than Musk himself.\n\nSource: [Electrek](https://electrek.co/2024/04/19/tesla-biggest-retail-shareholder-voting-against-elon-musk-55-billion-package/)",
        "created_utc": 1713626411.0,
        "subreddit_name": "stocks",
        "comments": 708
    },
    {
        "title": "I found thousands of shares of stock for a company which was merged, and then bought again, by Ingram Micro, Inc.",
        "score": 400,
        "url": "https://www.reddit.com/r/stocks/comments/1c8xy8w/i_found_thousands_of_shares_of_stock_for_a/",
        "content": "After an immediate family member recently passed away, I uncovered thousands of shares of physical 1986 stock certificates in a company called “International Computer Applications, Inc” and accompanying paperwork from the transaction.  After some top-tier googling, this company may have merged with “Connecting Point of America” (became the largest Apple retailer of its time with $2B annual revenue), which was then bought by “Ingram Micro” (still in business with $45B annual revenue). \n\nIs there a process for moving these shares into shares of Ingram Micro? ",
        "created_utc": 1713640461.0,
        "subreddit_name": "stocks",
        "comments": 107
    },
    {
        "title": "Days like this show the power of diversification when picking an index fund",
        "score": 36,
        "url": "https://www.reddit.com/r/investing/comments/1c8fl0w/days_like_this_show_the_power_of_diversification/",
        "content": "For example from today (04/19/2024):\n\n* S&P 500 Top 10 Average (MSFT, AAPL, NVDA, AMZN, META, GOOG, GOOGL, BRK-B, LLY, AVGO): -2.72%\n* S&P 500 Top 50 (XLG): -1.73%\n* S&P 500 Top 100 (OEX): -1.26%\n* S&P 500 (VOO): -0.84%\n\nand as someone mentioned\n\n* Global Stocks (VT): -0.46%\n\nWhile the opposite might be true some days (where the top weighted holdings / highest cap companies have the highest gains)... on days like this I appreciate having a majority of my portfolio in broad index funds like VOO (or even broader) to lower risk.",
        "created_utc": 1713582132.0,
        "subreddit_name": "investing",
        "comments": 31
    },
    {
        "title": "Apple Vision Pro used to assist doctor during shoulder surgery",
        "score": 789,
        "url": "https://9to5mac.com/2024/04/19/vision-pro-surgeon-rotator-cuff-tear/",
        "content": "",
        "created_utc": 1713603162.0,
        "subreddit_name": "apple",
        "comments": 95
    },
    {
        "title": "YouTube’s Screen Stealer (Apple TV)",
        "score": 685,
        "url": "https://joe-steel.com/2024-04-12-YouTubes-Screen-Stealer.html",
        "content": "",
        "created_utc": 1713581308.0,
        "subreddit_name": "apple",
        "comments": 133
    },
    {
        "title": "How Apple ReALM AI Will Change The World Forever",
        "score": 7,
        "url": "https://youtu.be/aALm-lthxE8?si=Arxpw4AePgoS7RIh",
        "content": "",
        "created_utc": 1713578405.0,
        "subreddit_name": "AAPL",
        "comments": 1
    }
]