[
    {
        "title": "BB is not a phone company. Here’s some DD.",
        "score": 5373,
        "url": "https://www.reddit.com/r/stocks/comments/lfuoe9/bb_is_not_a_phone_company_heres_some_dd/",
        "content": "They are the forefront in the AI Autonomous cyber security software market, there is no other competitors besides Google, but does not have the patents and broad variety of software that BB provides. Partnerships with the 19 of the top 25 EV companies which make up 61% of the EV market. Not to mention the recent deal with ticker: BIDU to provide their QNX System to over 175 million EV’s. They’ve successfully moved on from their product sales of phones and at most majority of revenue comes from the software they provide to homes, stations, and EVs. \n\nThey have completely wiped their department, obviously bringing in the Almighty papa chen who’s know for reviving software companies such as Sybase! A billion dollar software company with reported 55 consecutive profitable quarterly earning reports before they were bought out by SAP. Chen also announced today they signed a contract to provide power and cyber security to ISS for the next moon landing.\n\nIf you look at the analytics of their department, they revamped the company completely. By browsing linkedin they have a 3:1 ratio of engineers to sales, which means they are keen on developing their product and not so worried about sales. \n\nEdit: I also want to point out by looking at the TA from February 2nd on, BB is the only stock with a higher moving average to that of GME AMC and NOK. Throughout last week we can see it breaking the meme trend and acting on its own. Sorry I’m not sure how to add pictures but if you have the resources, you’ll see if you overlay all 4 stocks, they move very similar, but BB is the only one that breaks out right before market close. \n\nEdit 2: There’s a rumor that BB executives sold shares with the incentive to leave, remit ownership from BB, or have concerns of company being overvalued. Shares given to these executives are part of their salary compensation, so under company policy, they have every right to sell shares for capital gains. You can google search this yourself if you don’t believe so. \n\nEOY target is $60\n\nBB Literally to the moon \n\n17c 3/5 @20",
        "created_utc": 1612845342.0,
        "subreddit_name": "stocks",
        "comments": 551
    },
    {
        "title": "Morning Update for Tuesday, 02/09/21",
        "score": 624,
        "url": "https://www.reddit.com/r/Daytrading/comments/lg3moh/morning_update_for_tuesday_020921/",
        "content": "Good morning everyone, and happy Tuesday.\n\n**Large Cap Watchlist (over $10)**\n\n* Gapping UP: MARA, RIOT, TLRY, APHA, ACB, CGC, MGNI, CRSR, KALV, CHCI, HTBX, GLUU, MDVL, CYTH, PERI\n* Gapping DOWN: EKSO, OCGN, CLF, WKHS, GME, \n\n**Small Cap Watchlist (under $10)**\n\n1. AUVI: Gapping up on a news catalyst. Seeing good volume and price action in the premarket. Looking a bit extended in the premarket, so don't force trades and be patient. Premarket high is just over 11.\n2. ITRM: Gapping up but could not find a catalyst. Premarket resistance around 2.48-2.49. Showing weakness at the moment, so I'll want to wait and see if it can get back up to the same levels as in premarket. \n3. BSQR: Gapping up on momentum from recent days of trading. Seeing good volume with good price action in the premarket. Low float, so could see some volatile swings, especially in the morning. Just make sure to use proper risk management. \n4. ORTX: Gapping up on multiple news catalysts. Seeing good price action on decent volume in the premarket. Premarket high is sitting at 8.45 currently.\n5. TYME: Gapping up on momentum from previous days. Seeing the same levels that we saw a few days ago, so I'll be keeping an eye on this one.\n6. CHEK: Gapping up but couldn't find a catalyst. Has held a new level of support for quite a few days, and now gapping up from that support. I'll be watching this one closely. Premarket resistance at 2.30, with support just below 2.00. \n7. SOS: Gapping up but couldn't find a catalyst. Seeing decent volume and decent price action in premarket. This is one of those low-float Chinese stocks that can see a lot of volatility, so just be weary.\n8. KIQ: Gapping up on momentum from yesterday. Could be a bit extended here, so be cautious and use good risk management. Premarket resistance at 1.66.\n\nOverall market slightly in the red this morning. This is healthy, given the recent streak of green days. After hitting ATH two days in a row, SPY could see some choppiness this morning. Crypto-related plays such as MARA and RIOT will be hot again today, and the marijuana sector is seeing a lot of attention, as I suspected.\n\nLots of small caps gapping up to choose from, so be picky, and don't be afraid to run the screener again a few times as the morning goes on. Nothing wrong with just watching everything after market open. Also, have a plan to take profits on a trade; the stock is not going to run up infinitely, I promise.\n\nAlways remember to have a plan when you enter a trade, use proper risk management, and make sure you size appropriately for your account. Happy trading everyone :)",
        "created_utc": 1612878369.0,
        "subreddit_name": "Daytrading",
        "comments": 163
    },
    {
        "title": "Apple will aquire Ford",
        "score": 2,
        "url": "https://www.reddit.com/r/AAPL/comments/lfv0mm/apple_will_aquire_ford/",
        "content": "Ford is the US lonely woolf, with the  infra to make it happen for apple .apple have the money and can snap the F like this .",
        "created_utc": 1612846602.0,
        "subreddit_name": "AAPL",
        "comments": 11
    }
]