[
    {
        "title": "How to scam $200,000 per month and get 67,882 all 5 Star reviews on the app store",
        "score": 6914,
        "url": "https://www.reddit.com/r/apple/comments/7mzib4/how_to_scam_200000_per_month_and_get_67882_all_5/",
        "content": "I often go researching apps on the app store to see what's trending, inspiration for app ideas, look at nice UI designs etc. \nThis morning I came across this app which is currently ranked #26 in their category and had over \t67,882 all 5 star reviews. Yes, you read that right, all 5 star reviews despite only being available since September 15, 2017.\n\nAs soon as I read the name and rating, my bullshit meter went ding dong and I got extremely curious on how they have acheived such high ranking? Let's dig a bit.\n\n----------------\n\nThe name is \"One Night Stand - Adult Hook up Tonight\" - if Ashley Maddison's \"Have an affair\" was too bold for you, this isn't that bad. Who doesn't want to have instant sex at a moment's notice with a complete stranger right? But any how, I digress. Let's move on to the app icon. Sure beauty is subjective but I would expect such a top rated dating app to have a bit better looking icon.\n\nLet's look at the promotional text: \"Looking for someone who wanna find a dating with top hot singles and love adventures. Find the real dates online. Help you hook up with the one you interested in.\"\n\nI am an immigrant and English isn't my first language. But I am pretty sure there's a ton of grammatical errors in this. App claims \"real dates\". ROFL. \"Top hot singles\" & \"love adventures\". LMFAO.\n\n----------------\n\nLet's read the description. I am going to trim this down a bit because I can only handle bullshit to a limit. \n\n*\"If you are a good talker, maybe you can hookup with someone on a beautiful night. Drag your photos & fill in your profile, with a click of mouse, you can check the one you like and chat with him/her directly. Start a chat freely since it’s your time to show and you may meet the one you like and hookup now.\"*\n\n**Click of a mouse eh. I didn't know Apple replaced the headphone jack with a fucking mouse.**\n\n*\"Get ready to a new dating with someone you like, enjoy chatting with him/her or dive into the world of passion and desire. All you need is our app One Night Stand. Search One Night Stand in iTunes now and be ready for a new life here. meet your fate one\nStill shame to share your expression with others? Wanna make yourself more attractive? Eager to meet someone you like and wanna hookup with him/her directly. One Night Stand is your best choice. With all benefits above, you can enjoy more while you wanna hookup with someone.\nFind the real one online, meet the one you like nearby & One Night Stand will help you hook up with the one you interested in.\nNow, download it, and then meet the one you love!\"*\n\n**MAN, I AM SOOOO GETTING LAID TONIGHTTTT!!! Just gotta buy this 1 Week at 19.99 USD in app purchase and I will make all kinds of \"love adventures\" with the \"top hot singles\". Or maybe I will go for the 3 months at 69.99 USD. 69 nomsayin ;)**\n\n*\"As our app enables the display of users' locations on a map, to help you find users nearby you, and before display your information, we would request for your permission, you have right to reject it and don’t use the feature, if you turn on the location sharing, then keep an eye on unfriendly person and fake information.\"*\n\n**I am no rocket scientist but I am sure this app is the definition of \"fake information\".**\n\n----------------\n\nLet's move on to the reviews. I don't like the iOS 11 app store review system, so I use Appannie to look at all the reviews.\n\nThe app has received a total of 68,066 reviews since inception. \nI sorted them to show \"5 star only\". I am a developer myself and my mind was absolutely blown with \t67,882 all 5 star reviews. Man, even Apollo for Reddit has only received a total of 3800 reviews with only 3100 5 star reviews. So this dating app must be exceptionally good. /s\n\nLet's look at the name of the last few reviewers:\nMaria84, 7Linda, 84Peter, Howard35, 61Nicola, Boyle33, Geoffrey93, Jones24, 66Celeste, Maggie42, Doyle19, 46Letitia,  18Michelle.\n\nAnyone notice a pattern in these names? It's like someone left a phone directory inside a for loop.\n\n----------------\n\n**Let's read a few of them:**\n\n*Thank you for trying your best to make one night stand a safe, fun app.Stay happy, developers! -  Betsy Scripps63*\n\n*Thank you for trying your best to make one night stand a safe, fun app.Stay happy, developers! - Gerald Watt*\n\n*Overall good app, really helps meet new people, and build relationships. - 46Letitia MacAdam*\n\n*Overall good app, really helps meet new people, and build relationships. - gZachary*\n\n*As soon as I sign up, I swipe to the cute girl. Got match. Now we planned to meet up and have dinner with. I recommended this app for all singles. -  Lennon Gunter*\n\n*As soon as I sign up, I swipe to the cute girl. Got match. Now we planned to meet up and have dinner with. I recommended this app for all singles. - 37Gwendolyn Jackson*\n\n*I likes it. I was using the app and feel great. I will use often and invite your friends to join. Thanks developers.*\n\n*date app Wonder - Bernice Rosalind*\n\n*date app app - 74Zara Kennan*\n\n*date app Great - Richard Carllylek*\n\n*date app Great - 9Sally Tours*\n\n*date app Great - Nora Hopkin88*\n\n*date app Wonder - Patricia Browning*\n\n*date app Nice - Jill Wolfv*\n\n*date app Kool - 46Elsa Lucy*\n\n*date app Nxnsn - Frances Brightk*\n\n*date app Great Stuff - Benjamin Jenkin*\n\n*date app Awesome - 50Maria Wood*\n\n*The quickest way too hook up fresh meat for the evening :) - 69Elizabeth Blume*\n\n*i got a 9 month relationship off of it* - another fake bot\n\n*tinder dating Best app ever little costly tho*\n\n*pof.com It&#39;s pretty good*\n\n*tinder app This app is amazing*\n\n*tindrr Awesom!!!*\n\n*okcupid Amazing, and I&#39;m loving how friendly the people are.*\n\n*free dating app Awesome*\n\n*tinder app Mee*\n\n*hook up dating Awesome app*\n\n*pof app Awesome app ig*\n\n*dating apps for teens This app is pretty decent.*\n\n*pof.com*\n\n*tinder dating Fantastic app, tons of girls. Would do again*\n\n*tider It was so great even if the 12 hours is the only time that itis free it is still worth it coz you will know a lot of girls very nice app must try it!!*\n\n*tinder app gang*\n\n*net a cougar Was a fun experience*\n\n*grinder dating Great app*\n\n*dating app cheat Very good app make me fell good*\n\n*tinder for kids Amazing*\n\n*ginder Ijgdg. Thug ytjtffb thug*\n\n*bumbles Is amazing*\n\n----------------\n\nNo, I didn't make a typo pasting the same review twice. That's the same exact text, down to the typos reviewed by hundreds of different people within a few minutes. There's hundreds of reviews which start with the exact same first few lowercase characters, then a random word in upper case. There's another pattern of pasting some other popular app's name in the review - probably for ASO (App store optimization) purposes to get better ranking in the store. Some reviewers claim to get 9 month long relationships from a 3 month old **\"one night stand\"** app.\n\nNow, sure, there are real reviews too which are all 1 star reviews warning everyone else about the scam but 3000 1 star real reviews easily get overpowered by 67000 5 star fake ones.\n\n----------------\n\nLet's look at the screenshots. App uses pictures of attractive women as you would expect from most dating apps. However let's dig a bit deeper. I downloaded the screenshots and did a reverse google search with them. These pictures are straight up stolen from someone's instagram profile and other chive articles with titles \"Sometimes you gotta let them breathe\" with pictures of women with big tits.\n\n----------------\n\nNext let's estimate the downloads and revenue for this app. For this, we go use SensorTower. For November, it estimates 70,000 downloads and $200,000 revenue. Now I know that sensor tower estimations aren't that accurate but for an app which is #26 in the store, I won't be surprised if this number were actually close enough. Considering this app has been available since September 15th and Christmas is when apps get the most revenue, I won't be surprised if they had scammed half a million by taking advantage of gullible people.\n\n**EDIT:**\n \nMore about accuracy of Sensor Tower estimates as explained by /u/drysart here:\nhttps://www.reddit.com/r/apple/comments/7mzib4/how_to_scam_200000_per_month_and_get_67882_all_5/dry1fw0/?st=jbt3zziy&sh=51109789\n\nand by a Sensor Tower employee /u/dizietzz here:\n\nhttps://www.reddit.com/r/apple/comments/7mzib4/how_to_scam_200000_per_month_and_get_67882_all_5/dry5eir/?st=jbt67j93&sh=bca18e9a\n\n----------------\n\nI downloaded the app to test it and no surprises, was bombarded with a ton of fake messages from obviously fake \"milfs\". But unfortunately, I couldn't read most of the messages as I couldn't afford to buy a $69 in app purchase. App was also filled with obvious typos, misspellings like \"Reciving info\" etc. Didn't bother wasting too much time on the app.\n\nIf anyone is interested, here are 2 copies of this app. I am not sure if they are different apps or the same because my browser shows them with the same icon but slightly different names. **Be careful if you download this, it will bombard you with popups asking you to subscribe to the in app purchase. Keep your finger OFF of the home button unless you want to accidentally buy the $69 IAP and hook up with some hot singles!**\n\nhttps://itunes.apple.com/ca/app/one-night-stand-flirt-hookup-to-meet-locals/id1274313060?mt=8\n\nhttps://itunes.apple.com/us/app/one-night-stand-adult-hook-up-tonight/id1274313060?mt=8\n\n----------------\n\nIf anyone is interested in screenshots: https://imgur.com/a/kIqC9\n\nVideo recording: https://www.dropbox.com/s/bw9xzek2xeuq2zj/Video%202017-12-30%2C%204%2012%2023%20PM.mp4?dl=0\n\n~~I am also working on a way to download all reviews in bulk so I can recognize more similar patterns in the fake reviews.~~ **EDIT:** Check out a google docs data dump of all the reviews here:\n\nhttps://docs.google.com/spreadsheets/d/1wPKwLd8BIX3AFVFkSFQcPqqYMKBUd19StG_UT24s_tc/edit?usp=sharing\n\n----------------\n\nCan we all please discuss how such scam gets around the app review team when us developers often have to go through such a strict app review on our legitimate apps? Can we also please discuss the completely broken rating system and how such app has been available on the store for over 3 months despite being reported countless times and despite getting thousands of fake 5 star reviews?\n\nThere were a few other posts couple months ago about apps claiming to be antivirus software but were just scam. This proves disparity in the app review system for legitimate apps vs such scam apps. \n\n**Proposed solutions:**\n\n1.\tHave some trigger which auto flags any app which is climbing up the rankings or getting too many reviews too fast and then have some human manually verify it?\n2.\tFlag reviews which have the same text.\n3.\tIf an app has a subscription model OR very expensive pricing, pay extra attention while reviewing the app.\n4.\tPay attention when reviewing apps and shit like “click of a mouse”, “Drag photos”, “Play store” should be easy to identify scams. When I submit my apps, they go through extreme scrutiny and often get rejected for silly stuff (example: Restore button not available for IAP - even though it actually is, App was rated 9+ and should be higher even though I rated the app 17+). So I wonder how these ones get through. \n5.\tWhy is reporting an app so hard on iOS? I can’t find a report button anywhere on the app page. Ended up using the support website to report it. \n6.     iOS 11 App store has no way to sort/filter reviews. So if you look at this app, it ONLY shows you the 5 star ratings ONLY. Completely hides the 1 star reviews which deceives the consumer. The app store should have a filter for sorting by time/rating, filtering by number of stars, should let you see other reviews from the same user etc.\n\n\n**EDIT:** Check out a google docs data dump of all the reviews here:\n\nhttps://docs.google.com/spreadsheets/d/1wPKwLd8BIX3AFVFkSFQcPqqYMKBUd19StG_UT24s_tc/edit?usp=sharing\n\n**EDIT:** Few people are asking me why I went through such extent to expose this? I did network security in school, so this is up my alley. Plus, I am a developer and make my living off of the app store, so this kind of stuff personally impacts me. Maybe I am jealous that a shady app is taking a spot in the top rankings which could be taken by real apps and also reducing the trust of regular people in the app store and making them skeptical about legitimate apps and in app purchases too. So when they would come across one of my legitimate apps with legitimate 5 star reviews, they would be skeptical. This stuff erodes the trust in a marketplace and should be exposed. Is it bad then that I am frustrated and outraged? You tell me.\n\n~~**EDIT:** Just woke up to somehow getting banned from posting in iosprogramming subreddit without a reason. Can a moderator please explain why I was banned?~~ **EDIT** Got banned probably because one of the mods saw the title and thought it was just some spam. Contacted mods and now I am unbanned there :)\n",
        "created_utc": 1514607737.0,
        "subreddit_name": "apple",
        "comments": 334
    }
]