[
    {
        "title": "50 million $TSLA shares bought yesterday which cause the 10% rise. Rumour of Berkshire Hathaway buying $11b worth.",
        "score": 1775,
        "url": "https://www.reddit.com/r/stocks/comments/jwyzfl/50_million_tsla_shares_bought_yesterday_which/",
        "content": "A good read for those invested in Tesla or potential investors.\n\n>\tThere are only 25 companies listed on US exchanges big enough to not reach the threshold, and Berkshire Hathaway owns nine of them and is one of them.\n\n>\tBuffett would actually be one of the last investors I would have thought would be buying into Tesla. \n   \tHe generally invests in fundamentals, and you don’t invest into Tesla based on fundamentals. \n   \tHowever, he is toward the end of his career and slowly letting go of the reins at Berkshire Hathaway, and maybe other leaders at the firm like Tesla?\n\n@FrankPeelon did point something out:\n\n>\tFrank Peelen found that about 50 million Tesla (TSLA) shares have disappeared into the hands of currently unknown investors based on the 13F filings, which disclose large ownerships\n\n>\tI made a small mistake, so the number is actually a little over 50M shares, but nonetheless this is a large number of shares that can't be explained away by retail buying, delta hedging, and smaller institutional investors increasing their stakes.\n\nPlease take this information as a rumour and not real evidence or proof. Do your own DD.\n\nhttps://electrek.co/2020/11/18/tesla-tsla-surges-record-high-mysterious-investor-buying-big/",
        "created_utc": 1605773989.0,
        "subreddit_name": "stocks",
        "comments": 375
    },
    {
        "title": "Apple will pay $113 million to settle a 'batterygate' investigation into its practice of intentionally slowing down old iPhones",
        "score": 47036,
        "url": "https://www.businessinsider.com/apple-paying-113-million-lawsuit-slowing-down-iphones-2020-11",
        "content": "",
        "created_utc": 1605782600.0,
        "subreddit_name": "technology",
        "comments": 2469
    },
    {
        "title": "Apple doubles down on upcoming iOS 14 privacy features, slams Facebook for collecting ‘as much data as possible’",
        "score": 8470,
        "url": "https://9to5mac.com/2020/11/19/apple-privacy-letter-ios-14-facebook/",
        "content": "",
        "created_utc": 1605813694.0,
        "subreddit_name": "apple",
        "comments": 428
    },
    {
        "title": "For context. M1 MacBook Air.",
        "score": 5373,
        "url": "https://twitter.com/every_daydad/status/1329413281182834694?s=20",
        "content": "",
        "created_utc": 1605794418.0,
        "subreddit_name": "apple",
        "comments": 721
    }
]