[
    {
        "title": "Morgan Stanley Raises Apple Target Price to $180",
        "score": 7,
        "url": "https://www.reddit.com/r/AAPL/comments/11i7zi0/morgan_stanley_raises_apple_target_price_to_180/",
        "content": "Investment bank Morgan Stanley has raised its Apple price target for the first time in eight months, based on its expectation of new launches and a possible [iPhone](https://appleinsider.com/inside/iphone) subscription program.\n\nRecently, Morgan Stanley's analysis of what proportion of Apple stock is owned by pension funds and other institutions, led to it recommending investors buy now. Key to that conclusion was what its analysts described as \"5 idiosyncratic tailwinds over the next 6-9 months that make Apple our top pick for 2023.\"\n\nNow in a note to investors seen by *AppleInsider*, Morgan Stanley has raised its Apple price target from $175 to $180 based on those same expectations. The new note breaks down much more detail in its analysis, but the five factors, or \"catalysts,\" remain:\n\n1. **Services \"re-accelerating\" growth**\n2. **Record gross margins**\n3. **\"Pent up demand\" for the** [**iPhone 15**](https://appleinsider.com/inside/iphone-15)\n4. **An Apple AR headset**\n5. **Possible hardware subscription service**\n\nThe new note reiterates that Apple still faces \"a challenging macro backdrop, FX \\[foreign exchange\\] headlines\" plus \" iPhone production shortages, and lingering COVID restrictions.\"\n\n\"However, if we look beyond the near-term,\" it says, \"we see a catalyst-rich event path over the next 12 months that is underappreciated by investors.\"\n\n\"Combined, we believe the first 4 of these 5 catalysts have the potential to drive a re-rating in Apple shares toward our new sum-of-the-parts driven $180 price target,\" it continues, \"with the launch of a hardware subscription program key to unlocking our $230 LTV-driven bull case valuation.\"\n\nMorgan Stanley does predict that iPhone replacement cycles \"will extend to 4.4 years by the end of FY23,\" which is \"a new all-time record.\" However, the company expects the average replacement cycle is \"set to contract in FY24, but conservatively assume to just 4.1 years.\"\n\nThe analysts also believe that Apple's Services growth is under-appreciated. On the face of it, Services declined from \"strong double-digit growth in FY21 to mid-single digit Y/Y in the last 6-9 months.\"\n\n\"However, underlying this deceleration has been the most extreme FX headwinds the company has faced as far back as we've tracked the data,\" says Morgan Stanley, \"which suggests that in constant currency, Services has still been growing low double-digits.\"\n\nIn the near future, the firm says it expects to see \"a Services re-acceleration through the end of FY23 and into FY24.\" That expectation is driven in part by the \"120M new iPhone users onboarded in CY22 that Apple can begin to monetize,\" and also an improvement in foreign exchange.\n\n\"History shows you want to own Apple stock 6-9 months ahead of key product launches,\" say the analysts, \"with Apple's new AR/VR headset and the [iPhone 15](https://appleinsider.com/inside/iphone-15) launch both key upcoming catalysts.\"\n\nApple has not announced either product, though, and the market for AR headsets is a [difficult one](https://appleinsider.com/articles/23/03/01/meta-leaks-its-ar-four-year-plan-before-apple-can-beat-them). However, Morgan Stanley thinks that even if it takes time for Apple's headset to become a success, it will.\n\n\"\\[Our\\] analysis of new product category launches shows the market has historically under-estimated the long-term impact of new product/services launches,\" it continues, \"that on average, have accounted for \\~6% of revenue in any given year (over the last 5 years).\"\n\nMorgan Stanley is less confident that Apple will launch its [rumored iPhone subscription](https://appleinsider.com/articles/23/02/12/apples-iphone-hardware-subscription-could-arrive-by-march) service, but argues that if it does, the impact on its stock price will be enormous.\n\n\"A Hardware subscription launch would help unlock over $1T of market cap and re-rate shares toward our $230 bull case valuation,\" says the firm.\n\n\"What gets us most excited as an Apple analyst today is the business model transformation Apple is undergoing,\" it continues, \"shifting toward a model focused on installed base monetization rather than unit growth, which in our view, increasingly argues for a valuation more commensurate of a subscription-like business \\[instead of a technology platform.\\]\"\n\nThat $230 price target is greater than even Morgan Stanley's [previous high](https://appleinsider.com/articles/22/01/28/morgan-stanley-bumps-apple-price-target-to-210-on-record-breaking-q1-2022) of $210, which came on the back of a record-breaking 2021.",
        "created_utc": 1677951878.0,
        "subreddit_name": "AAPL",
        "comments": 1
    }
]