[
    {
        "title": "Intel working with bankers to present board with strategic options, sending shares up 8%",
        "score": 558,
        "url": "https://www.reddit.com/r/stocks/comments/1f54n54/intel_working_with_bankers_to_present_board_with/",
        "content": "Intel executives are working with multiple advisors to formulate options to address its [flagging business](https://www.cnbc.com/2024/08/29/intel-intc-gelsinger-skepticism-activist-layoffs.html), according to a person with knowledge of the matter.\n\nThose advisors, which include Morgan Stanley and other bankers, will likely present Intel’s directors with options at an upcoming board meeting in September, said the person, who requested anonymity to discuss confidential matters. The advisors are considering a full range of options, including splitting off and selling businesses, the person said.\n\nIntel shares rose more than 8% on the report in Friday morning trading.\n\n[Bloomberg News](https://www.bloomberg.com/news/articles/2024-08-30/intel-is-said-to-explore-options-to-cope-with-historic-slump) first reported that the company was working with its advisors to come up with strategic options. Spokespeople for Intel and Morgan Stanley declined to comment.\n\nCEO Pat Gelsinger acknowledged publicly on Thursday that the company understood investor skepticism and was working to address it.\n\n“We realize we have to operate efficiently with nimbleness, with urgency,” Gelsinger said at Deutsche Bank’s Technology Conference. CNBC previously reported that some advisors, including Morgan Stanley, were helping the company on activism defense.\n\nIntel remains on track to launch its next iteration of its laptop central processor, Lunar Lake, Gelsinger said at the appearance. But investors don’t see a turnaround on the horizon, and have pushed the stock down almost 60% this year.\n\nThe once-dominant company has been trounced primarily by Nvidia, which produces the graphics processing units (GPUs) that are are the heart of today’s prominent AI models.\n\nAlongside a disastrous earnings report earlier this month, Intel announced it would lay off 15,000 workers. The job cuts, part of a broader focus on slashing expenses, did little to assuage investor dismay. And while Gelsinger said Thursday that the company’s foundry business had roughly a dozen interested customers, the buildout remains costly for Intel.\n\nSource: [https://www.cnbc.com/2024/08/30/intel-working-with-bankers-to-present-board-with-strategic-options.html](https://www.cnbc.com/2024/08/30/intel-working-with-bankers-to-present-board-with-strategic-options.html)",
        "created_utc": 1725048131.0,
        "subreddit_name": "stocks",
        "comments": 175
    },
    {
        "title": "Spotify says Apple 'discontinued' the tech for some of its volume controls on iOS",
        "score": 5511,
        "url": "https://www.engadget.com/big-tech/spotify-says-apple-broke-some-of-its-volume-controls-on-ios-204746045.html",
        "content": "",
        "created_utc": 1725021523.0,
        "subreddit_name": "technology",
        "comments": 475
    }
]