[
    {
        "title": "Nvidia reports 122% revenue growth on surging demand for data center chips",
        "score": 2455,
        "url": "https://www.reddit.com/r/stocks/comments/1f3judv/nvidia_reports_122_revenue_growth_on_surging/",
        "content": "Nvidia reported earnings after the bell that beat Wall Street expectations for earnings and guidance, and provided stronger-than-expected guidance for the current quarter.\n\nNvidia shares fell nearly 4% in extended trading.\n\nHere are the results.\n\nEarnings per share: 68 cents adjusted versus 64 cents per share expected by LSEG.\n\nRevenue: $30.04 billion versus $28.7 billion expected by LSEG.\n\nNvidia said it expected about $32.5 billion in current quarter revenue, versus $31.77 billion expected by analysts, according to StreetAccount.\n\nNvidia is the primary beneficiary of the ongoing artificial intelligence boom. Its market value has expanded more than nine times since the end of 2022 and was up 34% since the company’s last earnings report.  \n\nNvidia said it approved $50 billion in share buybacks.\n\nSource: https://www.cnbc.com/2024/08/28/nvidia-nvda-earnings-report-q2-2025.html",
        "created_utc": 1724876861.0,
        "subreddit_name": "stocks",
        "comments": 603
    },
    {
        "title": "Buffett's Berkshire Hathaway hits $1 trillion market value ",
        "score": 609,
        "url": "https://www.reddit.com/r/stocks/comments/1f3avu0/buffetts_berkshire_hathaway_hits_1_trillion/",
        "content": "Warren Buffett’s Berkshire Hathaway reached a $1 trillion market capitalization on Wednesday, the first non-technology company in the U.S. to score the coveted milestone.\n\nShares of the Omaha-based conglomerate have rallied more than 27% in 2024, nearly doubling the S&P 500′s return. The $1 trillion threshold was crossed just two days before the ‘Oracle of Omaha’ turns 94 years old.\n\nThe shares were up 1.2% on Wednesday, allowing it to top the $1 trillion mark, per FactSet.\n\nUnlike the six other companies in the trillion dollar club (Apple, Nvidia, Microsoft, Alphabet, Amazon, Meta), Berkshire is known for its old-economy focus as the owner of BNSF Railway, Geico Insurance and Dairy Queen. (Although its sizable Apple position has helped drive recent gains.)\n\nBuffett took control of Berkshire, a struggling textile business, in the 1960s and transformed the company into a sprawling empire that encompasses insurance, railroad, retail and energy with an unmatched balance sheet and cash fortress.\n\nBuffett has been in a defensive mode as of late, dumping a massive amount of stock, including half of his Apple stake, while raising Berkshire’s cash pile to a record $277 billion at the end of June.\n\nWhile Buffett famously never times the market and advises others to not try to either, these recent moves served as a wake-up call to some of his followers on Wall Street, who believe he saw some things he did not like about the economy and market valuation.\n\nBerkshire invests the majority of its cash in short-term Treasury bills, and its holding in such securities — valued at $234.6 billion at the end of the second quarter — has exceeded the amount the U.S. Federal Reserve owns.\n\nHigh price tag\n\nBerkshire’s original Class A shares carry one of the highest price tags on Wall Street. Today, each one sells for 68% more than the median price of a home in the U.S. \n\nThat’s because Buffett has never split the stock, arguing that the high share price attracts and retains more long-term, quality-oriented investors. The Ben Graham protégé has said that many Berkshire shareholders use their stock as a savings account.\n\nStill, Berkshire issued Class B shares in 1996 at a price equal to one thirtieth of a Class A share to cater to smaller investors wanting a small piece of the Buffett’s performance.\n\nSource: https://www.cnbc.com/2024/08/28/buffetts-berkshire-hathaway-hits-1-trillion-market-value-first-us-company-outside-of-tech-to-do-so.html",
        "created_utc": 1724853486.0,
        "subreddit_name": "stocks",
        "comments": 70
    }
]