[
    {
        "title": "Apple downgrades new M2 iPad Air, now says it features a 9-core GPU instead of 10-core",
        "score": 1785,
        "url": "https://9to5mac.com/2024/06/01/m2-ipad-air-gpu-core-count/",
        "content": "",
        "created_utc": 1717274702.0,
        "subreddit_name": "apple",
        "comments": 290
    },
    {
        "title": "Exclusive: iOS 18 to Add Text Effects to iMessage",
        "score": 1014,
        "url": "https://www.macrumors.com/2024/05/31/ios-18-imessage-text-effects/",
        "content": "",
        "created_utc": 1717212189.0,
        "subreddit_name": "apple",
        "comments": 251
    },
    {
        "title": "Fake iPhone return scam cost Apple $12 million in losses, five people charged of fraud",
        "score": 798,
        "url": "https://9to5mac.com/2024/06/01/fake-iphone-return-scam-millions-dollars/",
        "content": "",
        "created_utc": 1717258631.0,
        "subreddit_name": "apple",
        "comments": 52
    },
    {
        "title": " New to investing - trying to understand what’s going on with Apple stock",
        "score": 9,
        "url": "https://www.reddit.com/r/AAPL/comments/1d5ker9/new_to_investing_trying_to_understand_whats_going/",
        "content": "I’m very new to investing, think I’d be more on the long term side, but just initially trying to understand how these equity analysts in the market work. I get you shouldn’t rely on their reports to make investment decisions, but maybe use it for starting research and for informational purposes.\n\nWhat justifies certain analysts like from Wedbush, Bank of America or Tigress financials being so bullish on Apple stock, in the wake of WWDC  \n- Do they know something we don’t know?  Are they in any way incentified to give good ratings or are they truly independent?\n\nEven if Apple comes out with Ai features, wouldn’t other companies already have similar features or could build similar features?  Not too techy myself, but was taking a look at some leaked features, and it doesn’t seem over the top amazing.  How can this lead to the growth these analysts are saying?\n\nEveryone in my house has iPhones, we have always preferred them over other phones, but we hesitate to buy a new phone because of the high price and not so much a change from prior year, I’m sure in this economy, other people are thinking the same, ie the high price?\n\nEven if more people buy iPhones this September, are these analysts saying that Apple will add AI features in each successive model that will drive a lot of growth?\n\nI just don’t see the growth without a new successful product, which is definitely a possibility given it’s Apple but to repeat another iPhone era…\n\n Do you think any future product has growth potential ? Which one?",
        "created_utc": 1717239373.0,
        "subreddit_name": "AAPL",
        "comments": 17
    }
]