[
    {
        "title": "Nvidia passes Microsoft in market cap to become most valuable public company ",
        "score": 2035,
        "url": "https://www.reddit.com/r/stocks/comments/1divtu5/nvidia_passes_microsoft_in_market_cap_to_become/",
        "content": "Nvidia, long known in the niche gaming community for its graphics chips, is now the most valuable public company in the world.\n\nShares of the chipmaker climbed 3.2% in mid-day trading on Tuesday, lifting the company’s market cap to $3.33 trillion, surpassing Microsoft. Earlier this month, Nvidia hit a $3 trillion market cap for the first time, and passed Apple.\n\nNvidia shares are up more than 170% so far this year, and took a leg higher after the company reported first-quarter earnings in May. The stock has multiplied by more than nine-fold since the end of 2022, a rise that’s coincided with the emergence of generative artificial intelligence.\n\nNvidia has about 80% of the market for AI chips used in data centers, a business that’s ballooned as OpenAI, Microsoft, Alphabet, Amazon, Meta and others have raced to snap up the processors needed to build AI models and run increasingly large workloads.\n\nFor the most recent quarter, revenue in Nvidia’s data center business rose 427% from a year earlier to $22.6 billion, accounting for about 86% of the company’s total sales.\n\nFounded in 1991, Nvidia spent its first few decades primarily as a hardware company that sold chips for gamers to run 3D titles. It’s also dabbled in cryptocurrency mining chips and cloud gaming subscriptions.\n\nBut over the past two years, Nvidia shares have skyrocketed as Wall Street came to recognize the company’s technology as the engine behind an explosion in AI that shows no signs of slowing. The rally has lifted co-founder and CEO Jensen Huang’s net worth to more than $117 billion, making him the 11th wealthiest person in the world, according to Forbes.\n\nMicrosoft shares are up about 20% so far this year. The software giant has also been a major beneficiary of the AI boom, after it took a significant stake in OpenAI and integrated the startup’s AI models into its most important products, including Office and Windows. Microsoft is one of the biggest buyers of Nvidia’s graphics processing units (GPUs) for its Azure cloud service. The company just released a new generation of laptops that are designed to run its AI models, called Copilot+.\n\nNvidia is a newcomer to the title of most valuable U.S. company. For the past few years, Apple and Microsoft have been trading the title.\n\nNvidia’s ascent has been so rapid that the company has yet to be added to the Dow Jones Industrial Average, a benchmark of 30 stocks that’s historically included the most valuable U.S. companies. Alongside its earnings release last month, Nvidia announced a 10-for-1 stock split, which went into effect on Jan. 7.\n\nThe split gives Nvidia a better shot at being added to the Dow, which is a price-weighted index, meaning that companies with higher stock prices — rather than market caps — have outsized influence on the benchmark.\n\nSource: https://www.cnbc.com/2024/06/18/nvidia-passes-microsoft-in-market-cap-is-most-valuable-public-company.html",
        "created_utc": 1718730478.0,
        "subreddit_name": "stocks",
        "comments": 512
    },
    {
        "title": "Apple stops offering buy now, pay later loans in U.S.  ",
        "score": 627,
        "url": "https://www.reddit.com/r/stocks/comments/1dih5sa/apple_stops_offering_buy_now_pay_later_loans_in_us/",
        "content": "Apple said on Monday that it has stopped issuing loans through Apple Pay Later, its buy-now-pay-later program that launched last year.\n\nThe move comes after Apple said it would start allowing installment loans later this year in its Apple Pay checkout process through third-party companies, such as Affirm, and credit and debit cards from issuers, such as Citigroup.\n\nApple said it would no longer issue Apple Pay Later loans, which enabled customers to buy products online and pay in four interest-free installments, at prices up to $1,000. The discontinuation is a sign that not every new fintech feature or product that Apple launches becomes a success or fits in with the iPhone maker’s overall strategy.\n\n“Starting later this year, users across the globe will be able to access installment loans offered through credit and debit cards, as well as lenders, when checking out with Apple Pay,” an Apple spokesperson told CNBC. “With the introduction of this new global installment loan offering, we will no longer offer Apple Pay Later in the U.S.”\n\nApple said users who wanted installment plans at checkout would gain access to them through other financial intermediaries in more countries around the world than they would with Apple Pay Later, which was only available in the U.S.\n\nApple said its priority with Apple Pay, the brand name for its contactless and online payment software, was to enable secure and private payments. Users with open loans will continue to have access to Apple Pay Later features to manage and pay their loans, Apple said.\n\nBefore it was discontinued, Apple Pay Later enabled users to apply for loans within the iPhone Wallet app, and approved users would see a “Pay Later” option when checking out online.\n\nThe process notably involved Apple taking over more of the financial backend than some of its other products, like Apple Card. For the program, Apple made some of its own credit credit checks and loan decisions, instead of having those handled entirely through financial partners. Apple’s loans were issued by a wholly owned subsidiary.\n\nSource: https://www.cnbc.com/2024/06/17/apple-stops-offering-buy-now-pay-later-loans-in-us-.html",
        "created_utc": 1718681738.0,
        "subreddit_name": "stocks",
        "comments": 130
    }
]