[
    {
        "title": "Nvidia passes Microsoft in market cap to become most valuable public company ",
        "score": 2035,
        "url": "https://www.reddit.com/r/stocks/comments/1divtu5/nvidia_passes_microsoft_in_market_cap_to_become/",
        "content": "Nvidia, long known in the niche gaming community for its graphics chips, is now the most valuable public company in the world.\n\nShares of the chipmaker climbed 3.2% in mid-day trading on Tuesday, lifting the company’s market cap to $3.33 trillion, surpassing Microsoft. Earlier this month, Nvidia hit a $3 trillion market cap for the first time, and passed Apple.\n\nNvidia shares are up more than 170% so far this year, and took a leg higher after the company reported first-quarter earnings in May. The stock has multiplied by more than nine-fold since the end of 2022, a rise that’s coincided with the emergence of generative artificial intelligence.\n\nNvidia has about 80% of the market for AI chips used in data centers, a business that’s ballooned as OpenAI, Microsoft, Alphabet, Amazon, Meta and others have raced to snap up the processors needed to build AI models and run increasingly large workloads.\n\nFor the most recent quarter, revenue in Nvidia’s data center business rose 427% from a year earlier to $22.6 billion, accounting for about 86% of the company’s total sales.\n\nFounded in 1991, Nvidia spent its first few decades primarily as a hardware company that sold chips for gamers to run 3D titles. It’s also dabbled in cryptocurrency mining chips and cloud gaming subscriptions.\n\nBut over the past two years, Nvidia shares have skyrocketed as Wall Street came to recognize the company’s technology as the engine behind an explosion in AI that shows no signs of slowing. The rally has lifted co-founder and CEO Jensen Huang’s net worth to more than $117 billion, making him the 11th wealthiest person in the world, according to Forbes.\n\nMicrosoft shares are up about 20% so far this year. The software giant has also been a major beneficiary of the AI boom, after it took a significant stake in OpenAI and integrated the startup’s AI models into its most important products, including Office and Windows. Microsoft is one of the biggest buyers of Nvidia’s graphics processing units (GPUs) for its Azure cloud service. The company just released a new generation of laptops that are designed to run its AI models, called Copilot+.\n\nNvidia is a newcomer to the title of most valuable U.S. company. For the past few years, Apple and Microsoft have been trading the title.\n\nNvidia’s ascent has been so rapid that the company has yet to be added to the Dow Jones Industrial Average, a benchmark of 30 stocks that’s historically included the most valuable U.S. companies. Alongside its earnings release last month, Nvidia announced a 10-for-1 stock split, which went into effect on Jan. 7.\n\nThe split gives Nvidia a better shot at being added to the Dow, which is a price-weighted index, meaning that companies with higher stock prices — rather than market caps — have outsized influence on the benchmark.\n\nSource: https://www.cnbc.com/2024/06/18/nvidia-passes-microsoft-in-market-cap-is-most-valuable-public-company.html",
        "created_utc": 1718730478.0,
        "subreddit_name": "stocks",
        "comments": 512
    },
    {
        "title": "Apple stops offering buy now, pay later loans in U.S.  ",
        "score": 627,
        "url": "https://www.reddit.com/r/stocks/comments/1dih5sa/apple_stops_offering_buy_now_pay_later_loans_in_us/",
        "content": "Apple said on Monday that it has stopped issuing loans through Apple Pay Later, its buy-now-pay-later program that launched last year.\n\nThe move comes after Apple said it would start allowing installment loans later this year in its Apple Pay checkout process through third-party companies, such as Affirm, and credit and debit cards from issuers, such as Citigroup.\n\nApple said it would no longer issue Apple Pay Later loans, which enabled customers to buy products online and pay in four interest-free installments, at prices up to $1,000. The discontinuation is a sign that not every new fintech feature or product that Apple launches becomes a success or fits in with the iPhone maker’s overall strategy.\n\n“Starting later this year, users across the globe will be able to access installment loans offered through credit and debit cards, as well as lenders, when checking out with Apple Pay,” an Apple spokesperson told CNBC. “With the introduction of this new global installment loan offering, we will no longer offer Apple Pay Later in the U.S.”\n\nApple said users who wanted installment plans at checkout would gain access to them through other financial intermediaries in more countries around the world than they would with Apple Pay Later, which was only available in the U.S.\n\nApple said its priority with Apple Pay, the brand name for its contactless and online payment software, was to enable secure and private payments. Users with open loans will continue to have access to Apple Pay Later features to manage and pay their loans, Apple said.\n\nBefore it was discontinued, Apple Pay Later enabled users to apply for loans within the iPhone Wallet app, and approved users would see a “Pay Later” option when checking out online.\n\nThe process notably involved Apple taking over more of the financial backend than some of its other products, like Apple Card. For the program, Apple made some of its own credit credit checks and loan decisions, instead of having those handled entirely through financial partners. Apple’s loans were issued by a wholly owned subsidiary.\n\nSource: https://www.cnbc.com/2024/06/17/apple-stops-offering-buy-now-pay-later-loans-in-us-.html",
        "created_utc": 1718681738.0,
        "subreddit_name": "stocks",
        "comments": 130
    },
    {
        "title": "Apple Reportedly Suspends Work on Vision Pro 2",
        "score": 2221,
        "url": "https://www.macrumors.com/2024/06/18/apple-suspends-work-on-vision-pro-2/",
        "content": "",
        "created_utc": 1718725446.0,
        "subreddit_name": "apple",
        "comments": 679
    },
    {
        "title": "Apple just made your app obsolete? You've been 'Sherlocked'",
        "score": 896,
        "url": "https://www.npr.org/2024/06/17/g-s1-4912/apple-app-store-obsolete-sherlocked-tapeacall-watson-copy",
        "content": "",
        "created_utc": 1718716359.0,
        "subreddit_name": "apple",
        "comments": 413
    },
    {
        "title": "Apple \"i\" Product Lists",
        "score": 799,
        "url": "https://miro.medium.com/v2/resize:fit:4780/format:webp/1*tVXlrSwSUhO2JOb4vOS20g.png",
        "content": "",
        "created_utc": 1718717346.0,
        "subreddit_name": "apple",
        "comments": 190
    },
    {
        "title": "M4 MacBook Pro Models Expected to Launch in Late 2024",
        "score": 721,
        "url": "https://www.macrumors.com/2024/06/18/m4-macbook-pro-late-2024/",
        "content": "",
        "created_utc": 1718746180.0,
        "subreddit_name": "apple",
        "comments": 140
    },
    {
        "title": "Apple's Phone App Finally Supports T9 Dialing in iOS 18",
        "score": 718,
        "url": "https://www.macrumors.com/2024/06/18/ios-18-phone-app-keypad-t9-dialing/",
        "content": "",
        "created_utc": 1718710656.0,
        "subreddit_name": "apple",
        "comments": 279
    },
    {
        "title": "Strategy means nothing without Risk management ",
        "score": 130,
        "url": "https://www.reddit.com/gallery/1dityqq",
        "content": "My approach has been Stock trading with breakout scalping in the AM , and momentum trading in the Post market lunch. I trade almost exclusively on my phone using aWebull cash account and started with ~500. I had some red days, but nothing major with the exception of one big red day by an oversight of my stop loss. \n\nTechnical analysis+Emotional Intelligence+Risk management=profit",
        "created_utc": 1718725837.0,
        "subreddit_name": "DayTrading",
        "comments": 90
    },
    {
        "title": "I'm a professional trader and this is everything I'm watching and analysing in premarket 18/06 INcludes all the news catalysts that are driving premarket price action. ",
        "score": 64,
        "url": "https://www.reddit.com/r/Daytrading/comments/1dip20s/im_a_professional_trader_and_this_is_everything/",
        "content": "**ANALYSIS:**\n\n* NVDA positioning update:\n* So for this OPEX, we see bullish positioning ITM but slighly more puts opening up. It is slight, but it's there. Lower volumes too. But if we look for a later opEX like August, we can see very bullish positioning OTM. Traders are expecting NVDA to continue rising into August\n* Traders look like they are even targeting as high as 150 by then.\n* [https://imgur.com/a/vcJXBZ0](https://imgur.com/a/vcJXBZ0) \n* Across the MAg7 and semis we see strong positioning:\n* Googl positioning is mostly flat\n* But AVGO, MU NVDA, SMCI etc all very strong positioning\n* AMZN positioning flat but improving as traders looking higher. \n* IWM looks choppy for today but let’s see. \n* look at USO, which is an oil ETF and will give us a better read on Oil/ bullish and supportive positioning ITM. Not much OTM Put delta but a fair bit of ITM Call delta will support. A lot of call delta on 80, which makes it a target.Not seeing signs of big pullback here rn.\n* GOld - skew is pointing higher, this tells us that traders are looking higher and senitment is improving, while gold holds 2300. 2350 looks like the resistance atm. Top options are buying calls, selling puts. 2400C a target. Looks like improving momentum under hood, but lets see after retail sales.\n* [https://imgur.com/a/ZqM1QJ6](https://imgur.com/a/ZqM1QJ6) Here we see top options mostly calls buying and puts selling\n* FTSE update: still stuck in this downtrend. needs to break 8200 to go higher, below this and we can see pullback, but positioning is improving ITM with more call delta showing up which means that the price action will be more supportive now. \n* [https://imgur.com/a/vwczL3G](https://imgur.com/a/vwczL3G) \n* Commodities like Steel look oversold, but positioning is not supporting bounce right now. \n\n\n\nDATA LEDE:\n\n* RBA interest rate decision:\n* Held rates at 4.35%, in line with expectations Taken as a hawkish pause though:\n* Said Main problem is the services inflation which remains persistent. \n* Return to CPI target won’t be smooth. \n* Sees inflation more stagnant than expected. \n\n\n\n* ZEW Eurozone economic sentiment index - Came in at strongest level in last year, at 51.3, above consensus at 47.8\n* Still a weak reading, only 50% of analysts expect economy to improve. \n* However, ZEW said in survey that sentiment and situation indicators have stagnated. \n* Different picture for the ZEW reading in Germany - where Sentiment came in at 47.5, missing estimates of 50. \n* More significantly, current conditions really bad, at -73.8 vs -65 expected. Current conditions in Economy are very weak. \n* There are still signs of economic deterioration in Germany such as weaker industrial production, rising defaults etc.\n* Inflation expectations increased.  \n* Final revision of Core inflation in Eurozone comes in line with previous reading, so no surprise there hence Eno big impact. \n\n\n\n* The big one is retail sales - coming premarket. \n* Then industrial production numbers come out 15 minutes before market opens. \n\n\n\nCOMMENTS FROM RBA’s GOV PRESS CONFERENCE AFTER HOLDING RATES STEADY: TAKEN HAWKISHLY BY MARKETS, HENCE AUD HIGHER.\n\n* Main problem is the services inflation which remains persistent. \n* Return to CPI target won’t be smooth. \n* Sees inflation more stagnant than expected. \n* It’s not obvious what to do with rates\n* We discussed case for rate hikes, but agreed its not appropriate. - hawkish\n* We look across broader economy, not just at the CPI last quarter. \n* Need a lot to go our way to bring inflation to range - hawkish\n* At a very hard part of the cycle. Said they need to see productivity growth to bring inflation down. \n\n\n\n\n\nMARKETS:\n\n* SPX - squeezed bearish flows yesterday, to hit 5488, led higher by Semiconductors mostly. SPX closed at 5477 which is more or less where it is today. Flat in premarket. Awaiting retail sales\n* Nasdaq -:  up 0.25% today in premarket. Trading basically at 20k. Led higher by Semis.\n* Note: breadth on SPX and Nasdaq was actually better yesterday. \n* Dow: Reached 38,850 yesterday, after opening lower, pushed 0.67% higher. today flat at 38,750. \n* GER40: managed to hold 18k yesterday. Today cannot break upside resistances, hence is moving lower towards 18k again. Strong support there.\n* FTSE100: Rejected off 8200. Struggling to break out of the downtrend pattern thats forming on daily chart. \n* HKG50: yesterday, went above 18k temporarily, but failed to close above there. Today, is down by 0.55% to 17,900. Awaiting volume. \n* OIL - surged higher yesterday, trading at 80. \n* GOLD - Red yesterday and in premarket, 2350 is resitance. 2300 is support. \n* VIX: Opened at 13 yesterday, then moved lower. More Vol Crush as traders are short on VIX. Today, we see VIX at 12.72. Flat. \n\n\n\nFX:\n\n* AUD higher after hawkish RBA\n* JPY lower after traders continue to go short on Yen after they maintained same pace of bond buying. \n* EURUSD under pressure and so is GBPUSD into BOE meeting and inflation reading. \n* DXY slightly higher into retail sales. \n* CHF USD moves higher ahead of SNB decision\n\n\n\n\n\nMAG 7:\n\n* AAPL - Analyst says that Apple Watch Series 10 will be thinner with larger screens. Expected release will be in September. Components will use 3D printing to improve production efficiency. \n* AAPL - Discounting Apple Pay Later in US, effective yesterday. Introducing global instalment loans through AFRM. \n* TSLA - Develops new stock based compensation program for high performing employees. Encouraging outstanding performance\n* TSLA - Musk yesterday says that he is working on Tesla Master Plan 4 which will be epic. Yesterday Tsla was higher as China approved 10 cars to roll out FSD as part of steps towards full roll out. \n* AAPL - JPM raises Apple PT to 245 from 225. Said they are updating iPhone 16 and iPhone 17 volume forecasts due to AI features driving an upgrade cycle. Expect iPhone volumes to reach 250M units in CY25 and 275M in CY26. \n* AAPL - EU competition chief says that Apple has a number of v serious issues under EU’s Sweeping Digital markets Act. Said conclusions of the probe will be revealed soon. \n* AMZN, GOOGL and META - Bank of America puts out a piece noting that whilst Capex increases for the 3 companies, the FCF is still expected to increase annually over next 3 years. \n* NVDA - chose Foxconn as their sole supplier of its NVLink switches, a key component for NVDA’s GB200 AI servers. This will offer higher gross margins than server assembly. This is v positive for Foxconn really, increases their AI position. \n* NVDA - Wells Fargo sets price target of 155 from1 25. \n\n\n\nOTHER COMPANIES:\n\n* BTC moving lower today, trading at 65.2k. Hence mining stocks are red in premarket. \n* MU - Stifel raises Micron PT to 165 from 145. Said that despite supply disruption from Taiwan earthquake, increasing Q3 estimates towards upper end of guidance range on better memory pricing. Favourable pricing persists. \n* NEE - plans to sell $2B of equity units at $50. Net proceeds to be used for funding investments in energy and power projects. The company also reaffirmed its 2024 adjusted profit outlook.\n* SQ - BoA reiterates Block with buy rating and PT of 82, stating stock is cheap no matter how you slice it. Said their rule of 40 target for 2026 is not priced into shares fully. \n*  FSR - Files for Chapter 11 bankruptcy after investment talks with major automaker fell through. \n* AVGO - Interactive Brokers chief strategist says AVGO should replace TSLA in mag 7. \n* QCOM - May become the exclusive SoC supplier for Samsung Galaxy S25, up from about 40% for the S24, due to lower than expected yield rates for Samsung’s 3NM process. \n* TSM is the sole producer of QCOM chips so they will also be a key beneficiary here. \n* MCD - ends 2 year test of using AI for automated order taking at drive thru. \n* ELF - Canaccord raises PT to 250 from 214. \n* BSX 0 will acquire Silk Road medical for 27.50. Deal values Silk at a 27% premium to last closing price. \n* CELH - Piper Sandler says they are still bullish on CELH with PT of 90. \n* BA - CEO heads to Senate hearing over safety and manufacturing crisis. \n* STLA - to recall over 1M vehicles due to rearview camera issue\n* CHGG - announced a comprehensive restructuring plan to refocus on its core student audience. Reducing global headcount by 23%, targeting international markets and enhancing brand strategy with Aid riven education tools. \n* SMCI - adding 3 new manufacturing facilities in Silcon Valley to support growth of AI and enterprise\n* ONON - price target maintained 46, buy\n\n\n\n\n\nOTHER NEWS:\n\n*  Fed’s Harker yesterday: \n* LATEST INFLATION READING WAS ENCOURAGING BUT WASNT ENOUGH TO DISSIPATE ANY UNCERTAINTY. \n* HARKER SAID HE SEES 1 RATE CUT BY YEAR END. \n* We need to be cautious and want several more months of data. Global rates are heading down, but at different paces. We are not evne close to material deterioration in jobs market. \n* For now, best to keep rates where they are and wait for more data. NEUTRAL COMMENTS, MORE HAWKISH. \n* Fitch raise global growth forecast for 2024 due to domestic demand in emerging markets showing stronger momentum (just not China). \n* Said they expect weak China growth in2 025 as gov spending declines.\n* Fitch says US is slowing down, but only gradually. \n* Performance gap between S&P and Equal Weight S&P over last 2 years is widest in nearly 24 years. NVDA has accounted for 34% of the SPX’s YTD gain. \n* Australia’s PM lobbied to remove rest of China’s Trade barriers. \n* Premier Li said, speaking in Australia, that there is widespread desire for improved Australia-China relations. \n* Eurozone Zew showed stagnation in economic sentiment and conditions.\n* German ZEW survey showed current conditions really bad, at -73.8 vs -65 expected. Current conditions in Economy are very weak. There are still signs of economic deterioration in Germany such as weaker industrial production, rising defaults etc.\n*  BOJ’s Ueda speaking: economy unlikely to enter stagflation. Said need improved consumer spending for economic recovery. \n* Said they will exercise caution when deciding on bond purchases. \n* Said there is possible chance of rate hike based on data in July\n* China Say they expect domestic EV demand to grow fast. \n* Putin visits North Korea \n* EU said that they will seek to contend with US and China on trade. EU has become much better at defending itself against unfair trade practices says Competition chief. This comes after EU announced higher tariffs on China EVs last week. \n* China continue to say that the EU EV probe is selective and discriminatory",
        "created_utc": 1718712435.0,
        "subreddit_name": "DayTrading",
        "comments": 13
    },
    {
        "title": "Bought a total 51 long calls in AAPL",
        "score": 18,
        "url": "https://i.redd.it/tb4ztxv96c7d1.jpeg",
        "content": "",
        "created_utc": 1718719090.0,
        "subreddit_name": "AAPL",
        "comments": 53
    },
    {
        "title": "XLK rebalancing 06/21 NVDA and AAPL",
        "score": 9,
        "url": "https://www.reddit.com/r/AAPL/comments/1dit50a/xlk_rebalancing_0621_nvda_and_aapl/",
        "content": "As many of you know the XLK is rebalancing this Friday June 21st. Two major changes is the weighting of NVDA and AAPL. Currently NVDA is around 6% and AAPL is 22% of the XLK. Friday NVDA will be around 21% and AAPL will be around 4.5%. That means around 10 billion purchased shares of NVDA and 11 billion shares of APPL sold. \n\nHistorically, the performance of a stock like NVDA can experience an increase in price movement going into the  ETF rebalancing and see a sell off following, as the rebalancing is digested and profit taking occurs.\n\nFor AAPL the opposite can occur as a short term negative selling pressure takes place going into the rebalancing. However post rebalancing is sometimes viewed as a buying opportunity. \n\nAs this will occur after hours on 6/21 a lot of buying and selling could occur before the market opens on the following Monday. With APPL there is a pivot point at 208 which I consider a buying opportunity. A few months ago I started buying the June 2026 310 calls and they have performed well. If you are buying calls on AAPL I would give it some time and buy leaps in 2025 post earnings in Q1. This would give you time to capture and news from August 2024 earnings the iPhone 16 release, the post election rally and Xmas spend. ",
        "created_utc": 1718723729.0,
        "subreddit_name": "AAPL",
        "comments": 3
    },
    {
        "title": "AAPL and NVDA to rise 50% more by elections ",
        "score": 1,
        "url": "https://www.reddit.com/gallery/1disect",
        "content": "The only two stocks worth buying today are AAPL and NVDA.  Buy stock and call options on both.  Both stocks will rise 50% more each over the next 3 to 6 months.  Just in time for the presidential elections.",
        "created_utc": 1718721869.0,
        "subreddit_name": "AAPL",
        "comments": 18
    },
    {
        "title": "Opening AAPL long call position",
        "score": 1,
        "url": "https://i.redd.it/om11fth57b7d1.jpeg",
        "content": "Looking to position myself for what I believe is the underlying stocks testing of resistance at $220 and possible new ATH. Hopefully I can accumulate 50-100 contracts before any significant moves to the upside",
        "created_utc": 1718707279.0,
        "subreddit_name": "AAPL",
        "comments": 22
    }
]