[
    {
        "title": "The Apple Watch ban is preventing repairs of many models",
        "score": 783,
        "url": "https://www.theverge.com/2023/12/21/24011536/apple-watch-ban-series-repairs-replacements",
        "content": ">That’s according to Bloomberg’s Mark Gurman, who reports that Apple has informed customer service employees that out-of-warranty hardware repairs and whole unit replacements for the Apple Watch Series 6 onward (with the exception of the SE) will be unavailable for the duration of the ban imposed by the US International Trade Commission.\n\n>Products under warranty (or the extended AppleCare Plus program) aren’t affected by this situation.\n\nFor some more background:\n\n>[Masimo would be open to settling its dispute with Apple to prevent the Apple Watch import ban that Apple is facing, but Apple so far has not expressed interest. \"They haven't called,\" Kiani told Bloomberg.](https://www.macrumors.com/2023/12/19/masimo-ceo-on-apple-watch-ban/)",
        "created_utc": 1703219799.0,
        "subreddit_name": "apple",
        "comments": 172
    },
    {
        "title": "How I Trade (Merry Christmas)",
        "score": 279,
        "url": "https://www.reddit.com/r/Daytrading/comments/18onqhl/how_i_trade_merry_christmas/",
        "content": " \n\n**Dear Traders,**\n\nThis piece of work is my way of giving back after everything I learned from other traders over the years. I'm a full-time trader and have nothing to sell. \n\nEDIT: I can’t answer the comments because I have no karma point (I’m new to Reddit)\n\n**If you enjoy this post, I have a free blog with more than 160 articles about scalping, trade reviews, backtesting and more. It’s called The Statistical Edge on Substack (see profile).**\n\n**Merry Christmas.**\n\nI will, for obvious reasons, not share my scalping strategies. However, my goal is that by the end of this article, you’ll get the following takeaways:\n\n* A better understanding of what being a scalper means;\n* A systematic framework to approach the market;\n* Tools to read and exploit your P\\&L;\n* New ideas to start building measurable trading strategies;\n* Tools to identify volatile days to avoid losing it all;\n* Tips to understand how your risk impacts the evolution of your trading capital;\n* Actionable ideas to incorporate programming into your trading arsenal (don’t be afraid!!)\n\nIt’s quite a heavy schedule, so I’d suggest you don’t read it in one go. The more we advance in this guide, the more technical it’ll get. Take your time, take notes when something speaks to you, and see how to implement it in your daily trading life. This article took me hours to write and is basically a summary of my last ten years of trading journey, full of mistakes, pain, tears, hope, joy, introspection… I do believe it made me a better person, and I hope people realize the chance they have to be able to go for such a career in today’s world. Trading is my passion. Most days, when I close my eyes, I see candlesticks. During the weekend, I can’t wait for markets to open again. A wise man once said, “Never give up on something you can’t go a day without thinking”.\n\n**Caveat: None of this is financial advice. I write out of passion, and you are responsible for your actions.**\n\n# A better understanding of what being a scalper means\n\n## Become a Samurai and scale-up\n\nBeing a scalper means catching small moves, multiple times during the day, with a tight risk. It also means, leaving a TON on the table. Being a scalper is a philosophy. It’s a choice of life. I see it as being a samurai. To survive, you need to execute the perfect gesture, on every single trade. Day after day. Week after week. Month after month. Year after year. You have to practice every day, be a humble student of the market, and master your emotion. Scalping is probably the most frustrating type of trading that exists. If you’re wrong, you’ll take an instant loss. If you’re right, and you hit your take profit of +20-40ticks, you might see prices going 400-800 ticks in your original direction, but you won’t be in that train anymore. \n\nAs a scalper, you need to be in absolute control of your body and mind, at any time. You profit from micro edges you have against the market. There’s no place for hard feelings. If you let the frustration take over, you’ll be soon gone.\n\n## What is scalping (to me)?\n\n>My definition of scalping is pretty easy, get in and get out of your trade in seconds, sometimes a few minutes, but no more. I don’t do scaling, or leave runners. I like to go with my full size and take my win or my loss.\n\n \n\n>To me, the beauty of scalping is that you get instant feedback from the market. You enter, and a few seconds after, you know if you were right or not.\n\nThis is crucial to me because it allows me to refine my strategy over and over whereas if I was a day trader or a swing trader, it would take me so much more time to gather enough trades history to see if what I’m doing is profitable or not.\n\n**The only inconvenience with scalping is that most people tend to overtrade. A year ago, I was doing more than 100 trades a day. I was exhausted by the end of the week and it was too many trades to review, so I wasn’t making any progress.**\n\nI list below my dos and don’t of scalping.\n\n \n\n### Dos\n\n* Extensively prepare your session, and identify areas that have a high probability of rejections. The worst thing you want is entering a trade and missing the bigger picture, which will lead to your stop loss being hit in seconds.\n* Have a tight stop loss. You can have a positive risk-reward ratio scalping, and I highly recommend it.\n* **Have a clear setup and trade it over and over.**\n* Review your scalps at least on a weekly basis.\n\n### Don’t\n\n* Take too many trades. You’ll get lost and won’t even remember what your primary strategy is.\n* Have tons of indicators. Keep your chart clean, you’ll thank me later.\n* Go for home runs. Scalping is about compounding.\n* Have a sub-1 risk-reward ratio. I know we discussed it right above, but it’s essential to your survival.\n\nIf you can put your ego on the side, have only a short amount of time to allocate to trading every day, and are a technical person, you might want to give a try to scalping.\n\n# A systematic framework to approach the market\n\n&#x200B;\n\nhttps://preview.redd.it/rw9h7erzhw7c1.png?width=840&format=png&auto=webp&s=aca91b1d4d749173a8c5f94a00eece5945dca4d9\n\n## Say your goodbyes to laziness\n\nIf you want to become successful, and we all have our own definition of successful, there’s no secret path. You’ll not only have to put in the hours, but you’ll also need to have a systematic approach to the market. An approach that you can repeat, day after day. An approach that you can measure, day after day. This is critical because you want to gather as many data points as possible to see where are your strengths and weaknesses.\n\n>In trading, like in any competitive field, you’ll need to elevate yourself to new highs every single day. There’s no place for laziness, contemplation, or ego (yes I talk about ego a lot because you need to get rid of it). I’m not a basketball fan at all, but this guy is an aspiration. Working harder than anyone else, even when he was at the top. Working hard as he’s only comparing himself to himself. There’s no limit. Same in trading. A year from now, you could be losing a trader or a winning trader. If you want to give yourself a chance, you’ll have to work your ass as you’ve never done before. Sacrifice anything without excepting anything in return. You have to love the game, not the money.\n\n## What does a systematic approach to trading looks like?\n\nIt will be different for everyone, but I believe there are some constants.\n\n## Market preparation\n\nIt all starts the day before. You want to be ready before the next trading session starts.\n\nBelow is what I use during my trading session.\n\n* I trade with two charts: 10 ticks and 40 ticks range charts.\n* I use Volume Profile, deltas per price, volume, VWAP, and VWAP bands.\n* That’s all.\n\nHowever, during my preparation time, I use other timeframes. I always start with higher timeframes, especially during times when we enter new prices territories (or unseen for a long time). If we’re evolving in a range for a few days/weeks/months, it’s easier because we already know the key levels, and to me, less preparation is required.\n\nHowever, when we keep making new highs or new lows on the daily and higher timeframes, it’s critical to spend more time analyzing the previous days where prices were evolving at these levels.\n\nI like to look at the following:\n\n* Quarterly/yearly closes;\n* Daily/weekly/monthly/quarterly/yearly highs and lows;\n* Weekly/Monthly/Quarterly/Yearly VWAP last level;\n* Weekly/Monthly/Quarterly/Yearly Point Of Control (POC), Low Volume Nodes (LVN), and High Volume Nodes (HVN);\n* Previous day’s open/high/low/close/30min opening range/VWAP close/POC/LVN/HVN.\n\nThis might take some time to have set up on your charts, but it’s worth it. I’d much rather have these key levels than any other indicators. Analyzing the market’s reaction when prices hit these levels will give you key insights into where the market wants to go.\n\nYou might not see it directly, and that’s why you need practice time. Eventually, it’ll become second nature during your trading session to analyze quickly and take action accordingly.\n\n>**Practice until it’s perfect.**\n\n## Morning ritual\n\nI’ve already shared that on Twitter, but I have a very strict ritual regarding my morning routine. I like to tick as many boxes as I can on my checklist. If there are more than two boxes unticked, I simply don’t trade.\n\nThere’s enough money to be made during days where you have a defined edge, so don’t feel bad about it, and don’t let your ego goes in your way toward success.\n\nThen, I take my coffee, open the charts, and look at the overnight action. If any significant action, I can reassess the key levels I drew the night before.\n\nNow, it’s time to trade.\n\n## Trading time\n\nIf you’re an aspiring trader, chances are that you’re still stuck in a 9-5. If that’s the case, your screen time is very limited. I think the biggest mistake beginners do is to trade from their phones.\n\nI’ve been guilty of that for years. What a waste of time… and money! Do you seriously think you can outsmart hedge fund algorithms, experienced retail traders, by trading on your phone when your boss gives you a few minutes of freedom throughout the day? I’ll save you some time, it’s not gonna work.\n\nYou need to find a window in your day that is dedicated to trading and only trading. It can be as little as 45min a day. If it means you need to wake up at 4 am, then do it. Everything has a cost.\n\nThe benefits are multiple. I’ve listed mine below:\n\n* I’m in a deep **focus mode** trading from 6 am to 7 am every single morning';\n* I’m **really excited to wake up** because I know the first hour of the day is investing in my future life;\n* I am more **comfortable** with the market I trade because it moves in a specific way during pre-market;\n* **I can’t overtrade**. Once the session is done, I move on and go to my work.\n\nThe latter point is maybe the most crucial reason for my recent ‘success’.\n\n## Journaling\n\nHands down my favorite time of the day. It’s peaceful, the job has been done, win or loss. Now is the time to look back at the choices you made during the day, and see how well you executed the plan you had, and the strategy you built.\n\nHere are some of the questions I ask myself, and what I note in my notebook:\n\n* Have I only traded setups that I know are A+ setups (e.g., proven profitably from my backtests)?\n* Have I been emotional at any point during the day?\n* Have I waited at least five minutes after a losing trade (the time I need to cool down and don’t make big mistakes)?\n* Have I felt in line with the market today?\n\nAt the beginning of my journey, I had more questions on my list, like:\n\n* Have I respected my max loss?\n* Have I not traded during the market opening?\n* Have I not let anyone’s else view skew my trading?\n\nThey are now gone from my list as it has become second nature, but you might want to have these in yours if you’re starting. You are the one who knows your strengths and weaknesses, so build a list of questions to rate your own trading, day after day.\n\nBy trading only one hour a day with one system, you should not have too many trades taken. This will immensely help you in that reviewing process.\n\nAnalyze each trade, and look at the parameters that made you enter and exit that trade. See how you executed the trade against the plan, and draw your conclusions. Then, when the next day comes, you know exactly what you need to improve.\n\nMaybe you closed too early, maybe you entered a bit too late because you were scared.\n\n>Repeat that process every day for a month, and I’ll promise you that you’ll see the difference.\n\n## (Bonus) Talking to someone\n\nThe best thing is to have someone to talk to about your trading. Let’s face it, it’s quite difficult to have close people to talk to about trading. This is a pretty uncommon career path, and most people see it as gambling. I’m lucky I have my partner who is absolutely amazing and listens to me every single day about how my trading day went. With Twitter, I’m sure you’ll be able to find someone to talk to. My DMs are also always open if you need someone to talk to (However, I’ll answer when I want. I choose to trade to be free, not to have obligations). But yeah, don’t be scared. Ask people for help, you’ll be surprised by all the positive answers you’ll get, and the connections you’ll build. \n\n# Tools to read and exploit your P&L\n\nIf you don’t know what MAE, MFE, PF… mean, then you’re at the right place.\n\n**At the end of this section, you’ll be able to analyze your own P&L and improve your trading results.**\n\n### Trading is like running a company\n\nAll companies have a Balance Sheet and a Profit & Loss (‘P&L’). When you’re a trader, it’s no different. The cost of doing business as a trader will be your losses, commission, and fees (A). Your gross revenue will be your winning trades (B).\n\nYour net profits will be (B) - (A).\n\nBut there’s more than that.\n\n A P&L statement can be intimidating at first, but I will explain each line of it so you can do it too. \n\n# New ideas to start building measurable trading strategies\n\nI’m a firm believer that your exit is more important than your entry. I know a few traders that challenge themselves by doing trading sessions with an algorithm that takes random entries, and then it’s up to the trader to close the trader. These are exceptional scalpers, but I guarantee you that end up their scalping session in the green much more often than in the red, with random entries.\n\nThis section will be broken down into two parts:\n\n1. How to create a simple framework;\n2. How to derive a simple strategy from the framework.\n\nWe will focus on building a framework around VWAP (Volume Weighted Average Price) for the following reasons:\n\n* It’s widely used across the trading industry;\n* It’s a **consistent** approach to trading. Every day, VWAP will be here. You want something consistent to be able to measure your success and failures, in order to learn from them.\n\nI apply that framework every single weekend during my review sessions.\n\n**Sunday/Monday**\n\n>Drop at the open followed by a rally during London's session. NY opened at the high of the day and prices saw a continuous nuke all day. VWAP was never strong support and prices failed to reach it again after it broke. Prices ended well below VWAP at end of the day.\n\n&#x200B;\n\nhttps://preview.redd.it/6t95s0uniw7c1.png?width=1681&format=png&auto=webp&s=b1c9b40f77f6175ad24f6480fb44c290c98c9158\n\n**Tuesday**\n\n>Consolidation around VWAP before an impressive run through new highs of the day. Reactions at VWAP were very interesting and left clues for the rest of the day. Prices end the day at around VWAP and POC.\n\nhttps://preview.redd.it/iwoyurqpiw7c1.png?width=1681&format=png&auto=webp&s=dcd1823d0007aa27a99fe4955e0f11b1ecb58acc\n\n**Wednesday**\n\n>The most interesting day. Tuesday showed strength through VWAP's reaction. Wednesday was a straight day up through all 3 sessions. A day to study!!\n\n&#x200B;\n\nhttps://preview.redd.it/3xh90nwriw7c1.png?width=1687&format=png&auto=webp&s=05805e81014cefffd8d72c87172fd420277ac99b\n\n**Thursday**\n\n>After the green dildo from the day before - look at Thursday's action. VWAP has defended every bounce with bears being in total control most of the day until the 4th assault at the end of the day. Prices closed at around VWAP. Very clean PA and lots of points to be made.\n\n&#x200B;\n\nhttps://preview.redd.it/487u0p0uiw7c1.png?width=1686&format=png&auto=webp&s=4acda87c5f1f14e25c8bc2a41d584f115364ff4c\n\n**Friday**\n\n>Second most interesting day. Clean breakout of VWAP then successful retest, maybe the cleanest setup of the week. At NY open VWAP was quickly lost + failed double top of London session indicating bear trend day.\n\nhttps://preview.redd.it/efs1kwtviw7c1.png?width=1710&format=png&auto=webp&s=72bedee75dfe4f1c0385480633d76edc82a4efea\n\nYou can make a career out of VWAP only. Study this week's PA and the reactions through VWAP. Pull the triggers when it's a clean setup. One trade a day can be enough. \n\n# Tools to identify volatile days to avoid losing it all\n\nLately, the action has been “crazy” in the markets. People like to identify days where they don’t have an edge to crazy days. Usually, it’s massive trend days, up or down, doesn't matter. Every time the market close +/-2%, +/-3%, many people lose it all.\n\nThere are a few ways to know in advance if tomorrow will be a “crazy” day, namely:\n\n* Did we have an inside day the prior day?\n* What does the VIX look like?\n* How about the fear/greed index?\n* Building statistics sheets.\n\nI’m gonna talk more about the latest point, and how to build statistics sheets, and I advise you to build similar statistics for every single scenario that might lead to “crazy” days.\n\n## Building statistics spreadsheets\n\n#### Distribution of daily returns since March 1995\n\n##### The daily returns almost follow a normal distribution\n\n&#x200B;\n\nhttps://preview.redd.it/dflry471jw7c1.png?width=1432&format=png&auto=webp&s=c6f5888c04d2d9f20d4cc64504adaff6c041e7b9\n\nFirst, let’s try to measure what is considered an abnormal red day.\n\nThe above chart is a histogram representing the distribution of Nasdaq’s daily returns since March 1995. As one can see, this looks like a normal distribution.\n\n*If you’re not familiar, a normal distribution is a mathematical type of continuous probability distribution. I would suggest you read more on Wikipedia, this will be useful, especially if you use the Volume Profile, to understand the concept of the Value Area.*\n\n&#x200B;\n\nhttps://preview.redd.it/aef6v8r2jw7c1.png?width=865&format=png&auto=webp&s=bbeb977578d3ca5ba54661d33df389349c654bb7\n\n*FYI - this is what a normal distribution looks like.*\n\n#### What is considered a big red day?\n\n##### Hello my friend Percentile\n\nI have ranked every trading day on the Nasdaq since March 1995 and I’ve looked at the return of the 5% worst days. In other words, out of 100 trading days, what are the returns for the 5 worst days in that sample.\n\n*For those of you who are interested, this is called the 0.05 percentile.*\n\nIt’s a very powerful function that allows you to quickly get a grasp of key thresholds in a series of numbers.\n\n**Since 1995, a day that has a return below -2.78% (let’s round it to -3%) is considered in the 5% of the worst day.**\n\nMy first reaction looking at this is that -3% red days happen more often than what I would expect. 5 days out of 100 we have a -3% red day, or **once a month**.\n\n**Key points from that table**\n\n* The returns are skewed towards positive returns: the best days have higher absolute returns than the worst ones, and the median is also positive.\n* 50% of the trading days since 1995 have a return at least equal to or above 0.05%.\n* 2 days a year (on average) we see a -4.70% red day.\n* 2 days a year (on average) we see a +5.03% red day.\n\nI find it useful to have those statistics in my mind, especially during volatile times. It helps me keep the bigger picture and trade more rationally.\n\n#### What happens after a -3% red day?\n\nOk so now that we’ve paved the foundations, let’s look at the market’s reaction after such days.\n\nI’ve been looking at the returns of the day following trading days that close at least 2.78% in the red. And the results are quite interesting.\n\n**Key statistics**\n\n* 357 days out of 6735 we closed below -2.78% (or 5% of the time, ok no big news here that was expected, but it’s always good to double-check our results).\n* **0.50%**. **This is the average daily return of the Nasdaq since March 1995 on a day following a -2.78% close or worst.**\n* Since 2010, we don’t have as many -3% days as we used to have between 1998 and 2009. **The market has changed**, and that’s your job to do your homework to adapt and survive. It means that 10 years from now the market will probably be different from today. I personally like to update my personal statistics at least once a year.\n\n*Now, does that means that one can just buy the dip at the close of a red day and come back the next day?*\n\nLet’s look at this in more detail.\n\n&#x200B;\n\nhttps://preview.redd.it/t79c4hu6jw7c1.png?width=630&format=png&auto=webp&s=2337a811426bb0fd0a59d9100d64183a0a344f31\n\n \n\n>I’ve gathered for you the details per year of each of these following days. Even though the average return is 0.5%, there is a bigger potential, on average, for being short.  \n**-1.97% is the average low a day after a -2.78% red day. Sure, it then retraces and closes in the green, but I find it fascinating that the market still goes almost 2% lower FIRST.**\n\nThis is the type of statistics you want to build to know what to expect before the trading day starts.\n\n## Building a risk framework to avoid losing it all\n\nIn this section, I’ll provide you with the framework that I’ve been using for the last few months, and that helped me gain consistency in my trading journey.\n\n### KISS Concept\n\nAs a retail trader, I believe EVERY aspect of our trading should be kept SIMPLE. You may have heard the KISS principle (Keep It Simple, Stupid). We will never be able to process data as efficiently as Hedge Funds are doing, and we have to fight with different weapons.\n\nFrom my trading strategies to my Risk Framework, I always apply the KISS concept.\n\n### Weaknesses and Strengths\n\nTo build a successful trading Risk Framework, you need to know your weaknesses and strengths. I believe we have to learn to live with our weaknesses, making them as meaningless as possible, whilst getting the best out of our strengths.\n\nA good exercise I suggest you do is **to list your top three strengths and weaknesses**. This will be used as the foundation for our Risk Framework.\n\nFor me, it looks something like this.\n\n**Top 3 Weaknesses**\n\n1. I’m too greedy;\n2. I become too emotional when the volatility peaks; and\n3. I can’t focus for more than 1 hour in a row.\n\n**Top 3 Strengths**\n\n1. I trust myself;\n2. I happily admit when I’m wrong and learn from it; and\n3. I’m passionate about trading.\n\nFrom these points, we can now build our trading rules/Risk Framework, or as I like to call it ‘The Code’. I’m a big fan of the TV Show ‘Dexter’, where the main character has to live a life full of lies. The only way for him not to get caught and end up in jail is to follow The Code, *a set of rules* instructed by his father.\n\n### The Code\n\nFrom the above six bullet points, I built **The Code,** which I try to follow every trading day.\n\n1. Greed - To avoid being too greedy and turning green days into red days, I now **have a target for each day**. When/if that target is hit, I close NinjaTrader.\n2. Volatility - I underperform in volatile times because my P&L moves too quickly. To tackle that issue, I have **stopped trading the market open**.\n3. Attention span - I trade 45min per day, every day, at the same time.\n4. Trust - If there is no clear reason to exit a trade, I stay in it.\n5. Low ego - Review my trades on a regular basis.\n6. Passion - **Live to trade another day.**\n\nThese rules are simple, and easy to follow because *they make sense to me*. I know why I have to apply them.\n\nFinally, don’t let extreme volatile days rethink your whole approach to trading. You just need to be more prepared.\n\n# Tips to understand how your risk impacts the evolution of your trading capital\n\nBeginner's Luck or Unlucky MF? or Why you'll fail in trading if you don't use the Law of Large Numbers A simple graphical explanation\n\nhttps://preview.redd.it/clld4i9ejw7c1.png?width=680&format=png&auto=webp&s=2e2c7bfbee676009374021160c49a54c2ce157b2\n\nIn probability theory, the law of large numbers (LLN) is a theorem that describes the result of performing the same experiment a large number of times.' Let's see what are your chances of going broke with a specific risk per trade and winrate setups. \n\nExample 1 'The crazy gambler' You start with $1000, risk 10% per trade, win 50% of the time and your winners equal your losers. If you do 100 trades with 10 different accounts, 6 will get blown (60%!!) even though this is not a losing strategy. \n\nhttps://preview.redd.it/jrdbrvuhjw7c1.png?width=680&format=png&auto=webp&s=839582c50696bf493e73f59601080739b24f12a6\n\nExample 2 'The wise gambler' Same as above but this time we're risking only 5% per trade. Only 1 account is blown this time. By dividing the risk by 2, we are reducing our chances of going broke by 6. Risk is not linear, and it's important to understand it. \n\nhttps://preview.redd.it/phusrnljjw7c1.png?width=680&format=png&auto=webp&s=ecf9bcea1949b1e5eac7e8ca3815a22181a5dc74\n\nExample 3 'The John Doe' Very common - No edge, losers are bigger than winners and you win c. 50% of the time. Your account will die slowly but surely. You don't want to be in this case. \n\nhttps://preview.redd.it/1v6pdrzkjw7c1.png?width=680&format=png&auto=webp&s=fd09c2454e1ad52abd601b0719408ac1c78e04ca\n\nExample 4 'The I have an edge but I gamble' Proven statistical edge but betting 20% of the capital per trade. You'll go broke 3 times out of 10! That's a shame because you could have made a lot of $ respecting better risk management. \n\nhttps://preview.redd.it/xh5516mnjw7c1.png?width=680&format=png&auto=webp&s=fc2cd4b955b6e02a6d476e45b9c68c4eb700b1aa\n\nExample 5 'I have an edge and I risk 10% per trade' This time, no account is blown after 500 trades on 10 different accounts. You're in profit every time. See the difference? \n\nhttps://preview.redd.it/2jfdj9opjw7c1.png?width=680&format=png&auto=webp&s=6166b07462ecd8aa4d424fe35311d068add90d0c\n\nExample 6 - 'The Holy Grail' 60% winrate 5% risk per trade Winners = losers After 500 trades, on 10 different accounts, you MADE it. On average, you have multiplied your account by 5.8. Congratulations, you understand why the risk you can take is correlated to your edge. \n\n&#x200B;\n\nhttps://preview.redd.it/lnz95xqrjw7c1.png?width=680&format=png&auto=webp&s=fb354a054482135b61224ce672e40d08984e2cbf\n\nOnce again, it’s a lot of groundwork, but you need to understand these mechanics to understand why you can’t risk too much per trade, and how your winrate and risk-reward ratio influence the risk you can take. \n\n# Actionable ideas to incorporate programming into your trading arsenal (don’t be afraid!!)\n\nI’ve been programming for years. I started in high school as a hobby learning C/C++, then Java for my first internship, before definitely switching to Python a few years ago. I’m a firm believer that anyone should incorporate some sort of programming into their trading to become a better trader.\n\n* Building automated spreadsheet to gather broad statistics (like I explained above);\n* Building scanners if you trade multiple underlying assets;\n* Backtesting your trading ideas;\n* Automating your entries;\n* Automating your whole strategy.\n\nYou can use google sheets and the Yahoo Finance built-in API to start building a spreadsheet that gathers statistics.\n\nIf you’re using Ninja Trader, you can start using the Strategy Builder to start backtesting some ideas.\n\nYou’ll need to read some documentation, but you will have more insights and statistics for your trading. It can’t hurt. And it’s fun, I promise.\n\n# Conclusion\n\nWherever you are in your life, it’s never too late to live your dreams.\n\n&#x200B;\n\nhttps://preview.redd.it/4sncg85vjw7c1.png?width=680&format=png&auto=webp&s=21aab3eb96afccbaa5618cca9edec1151cb37446\n\nIf you’ve made it thus far, congratulations, and thank you for taking the time to read my guide. I do this for free, as a way to give back to the community. I believe in positive karma.\n\n**Merry Christmas**\n\nRC",
        "created_utc": 1703275779.0,
        "subreddit_name": "DayTrading",
        "comments": 39
    },
    {
        "title": "how can I pinpoint which weekday tends to have the highest trading volume and the biggest range? $AAPL",
        "score": 3,
        "url": "https://www.reddit.com/r/AAPL/comments/18okukz/how_can_i_pinpoint_which_weekday_tends_to_have/",
        "content": "&#x200B;\n\nhttps://preview.redd.it/rujcq4huvv7c1.png?width=1000&format=png&auto=webp&s=121dc37e2a89ec936730916f8aaaa519f8681ff3\n\nhttps://preview.redd.it/b43za5huvv7c1.png?width=1000&format=png&auto=webp&s=c4435c78b01e2eb4dfaa106d4e6c4465337400e7\n\nfor the sake of this scenario, let's say you're looking to find the weekday where $AAPL has the highest volume & the highest range, because, like me, you find that high volume generally leads to moves having more followthrough and high range makes it easier for you to find profitable entries and exits because you don't have to be so precise. \n\nif we look at the avg. volume & avg. range by weekday chart - we see that Wednesday's tend to have the highest range and Friday's the highest trading volume. personally, in this case, I'm gonna go with Wednesday because I prefer to prioritize high range when having to pick between the two. what we see is that the range on Wednesday's has historically been roughly $3.20.\n\nmoving on to the range to ATR by weekday chart, we see that historically, $AAPL has covered 95.8% of its range on Wednesday's. meaning that price, on average, moves $3.06.\n\nwhile historical trends and patterns don't necessarily guarantee future ones, we can estimate based on the averages what has the highest probability of happening. \n\nno matter what your trading style is, these insights can be used to estimate price movements.\n\n\\*not financial advice\\*",
        "created_utc": 1703267898.0,
        "subreddit_name": "AAPL",
        "comments": 13
    }
]