[
    {
        "title": "Apple’s new iPad Pro is amazing, but iPadOS holds it back from its true potential",
        "score": 5891,
        "url": "https://www.xda-developers.com/apple-ipad-pro-ipados-limitations/",
        "content": "",
        "created_utc": 1622389296.0,
        "subreddit_name": "apple",
        "comments": 832
    },
    {
        "title": "A backtested algorithm for trading meme stocks – 366% on AMC in just under 2 months and 16 trades",
        "score": 310,
        "url": "https://www.reddit.com/r/Daytrading/comments/nogja2/a_backtested_algorithm_for_trading_meme_stocks/",
        "content": "**Introduction**\n\nI recently started working as a contributor on sentimentinvestor’s open source software and I decided to start building algorithms using the data. Given the recent AMC mania I’ll share one that spun a huge return in just under a couple of months. \n\nFor non-devs, I’ll explain conceptually how you can do something like this. For developers, I will also show how to implement this, but (for obvious reasons) I won’t share the codebase, if you want to know please message me (I just don’t want to disseminate it publicly as I want to continue trading with it).\n\n**Also as there is confusion: the model obviously was tested on data that was not used to make it.**\n\n**The Concept** \n\nI used social media activity (i.e. number of posts, comments etc) from various places to input the data. I suspected (and now confirmed) that activity to some extent preempts price changes for meme stocks. \n\nWhile the platform has some better (more precise metrics) for volume, I decided to go for RHI, which is essentially in their words “how much as stock is being talked about compared to usual”. Its calculated by taking the total activity in the past day and dividing by the average daily activity of the past week. \n\nI chose this metric because it is very clean, although it loses information. \n\nI compared the graphs of RHI and stock price for various meme stocks and I saw a clear pattern which I decided to build a strategy around. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/x59w0atlqa271.png?width=936&amp;format=png&amp;auto=webp&amp;s=81dc81d3b21a3830ebb2f4c61b4fb96073879729\n\n&amp;#x200B;\n\nhttps://preview.redd.it/4k34hpkmqa271.png?width=868&amp;format=png&amp;auto=webp&amp;s=b26bbb7d889edc9880c915b892b924e2db7a5a98\n\nHere the first graph is RHI and the second is price. Notice the surges around May 13 and of course May 23, the dip around the start of may, peak a couple of days ago and so on\n\nStep 0 (for algotraders only) – clean your data: I used the Sentipy Python module to download historical RHI data. I then cleaned it. I used a simple method of converting RHI datapoints into deltas. RHI comes with an hour on hour granularity so I compared the RHI to what it was a couple of hours ago and saw if it went up, this was stored as a 1, if it decreased it was stored as a 0. \n\nThis gives you a chain of 1s and 0s. This looks something like 00000010000011111111010011111111. Here you can see 2 distinct chains of 0s and 1s with some noise. You need to remove this noise. \n\nHonestly, how you clean your data is not that important, the above method is primitivebut effective. \n\n**Step 1: Identify stationary points in RHI**\n\nWhile the stationary points are consistent we can do better by indentifying points of inflection – as this will give us even more warning. You do this by seeing when the direction of the graph is changing. Sometimes this will be obvious like in the above RHI graph you see around May 23/24 there is a clear inflection point. Of course you would only know this a few hours later in case it is noise. You can set your tolerance for noise as quite low because RHI is very clean. In fact I set mine for only 5 hours as you would have cleaned all the noise. \n\n**Step 2: Buy or sell**\n\nNow all that’s left is buying and selling when you have set your stationary points. This gave me 16 trades over around 2 months. Of these 15 have been successful yielding about 183% on just buy/sell and double that on margin. \n\n**End notes**\n\nI have tested this on other meme stocks and while yields have not been as high (the last AMC trade I made yielded 88%) they have been great. I have not tested this on stuff like $AAPL or $GS and I doubt it would be as effective. \n\nAlgotraders take note! - you can make more accurate decisions with less noise tolerance although conversely you get fewer trades in. I tried with a few different scales and they all yielding nearly the same thing. Having said this, the fact that this works macrocopically and at a greater granularity is exciting. \n\n**Challenges**\n\nMaking this work better- since we use RHI which is fairly abstracted we lose information so to speak. Using AHI or raw platform breakdowns have the potential to be even more profitable. If anyone plans on making something like these please hmu as I am interested to see where that could go.",
        "created_utc": 1622397313.0,
        "subreddit_name": "Daytrading",
        "comments": 83
    },
    {
        "title": "My Q2 Summary and some notes",
        "score": 10,
        "url": "https://www.reddit.com/r/AAPL/comments/nof3mq/my_q2_summary_and_some_notes/",
        "content": "Apple Notes -\n\nThird Quarter Earnings tentative 07/29/2021, after close. \n\n28 analysts covering, consensus EPS estimate is $1.00, and the high and low estimates are $1.16 and $0.82, respectively.\n\nAuthorized an increase of $90 billion to existing share repurchase program on 4/28/2021 (FY Q2 earnings announcement).\n\nShares repurchased in Fiscal Year 2021: Q1 - $24 billion, Q2 - $19 billion.\n\nApple's index membership is Nasdaq 100, Russell 1000, Dow Jones Industrial Average, Nasdaq Composite, Dow Jones Composite Average, S&P 500 IT Sector, Russell 3000, S&P 100 and S&P 500.\n\n4/28/2021 - Quarter 2 Notes:\n\nApple did not provide formal guidance for this Q2 2021 period, which corresponds with the first calendar quarter of 2021.\n\nQ2 2020 (last YOY quarter) was the first quarter affected by the pandemic.\n\nThere were reports of iPhone 12 and iPhone 12 Pro demand weakening.\n\nSurprised investors with a much stronger-than-expected fiscal second-quarter earnings report.\n\nMarch quarter record revenue of $89.6 billion, $77.1 billion expected, up 54 percent year over year.\n\nEarnings per diluted share of $1.40, consensus estimate of $0.99. \n\nInternational sales accounted for 67 percent of the quarter’s revenue.\n\nGenerated operating cash flow of $24 billion.\n\nReturn nearly $23 billion to shareholders, $19 billion stock repurchase plus $3.7 billion dividends.\n\nDividend increased 7% to $0.22/quarter. Yields .71%.\n\nAuthorized an increase of $90 billion to the existing share repurchase program.\n\nOperating costs only rose 38.01%.",
        "created_utc": 1622393164.0,
        "subreddit_name": "AAPL",
        "comments": 1
    }
]