[
    {
        "title": "The absolute madness of Tesla",
        "score": 611,
        "url": "https://www.reddit.com/r/stocks/comments/1gcvgji/the_absolute_madness_of_tesla/",
        "content": "![img](51seuul3t5xd1)\n\nJust the sheer madness, i know its just a multiple and future growth and all that. Still, you gotta take a moment to contemplate this.\n\nThe funny thing is that Elon has outright lied/being wrong with predictions like dates for models and stuff, most recently the shenanigans with the robot at his events.\n\n\nBUT 2 weeks later he says 20-30 revenue growth next year and everyone believes him lol.\n\n\nThanks god im not a bear",
        "created_utc": 1729978330.0,
        "subreddit_name": "stocks",
        "comments": 250
    },
    {
        "title": "What’s the stock you’ll never sell",
        "score": 306,
        "url": "https://www.reddit.com/r/stocks/comments/1gcjdqh/whats_the_stock_youll_never_sell/",
        "content": "Our investment philosophy and goals usually depend on our age. You probably wouldn’t accept the same risk at 20 than at 60, especially if your stock portfolio is part of your retirement plan.\n\nI agree with a value investing philosophy, so to me never selling implies the original investment thesis doesn’t change. \n\nI think we could have an interesting discussion if we share our age (or age range) and the company in which we trust for the rest of our lives (and why).\n\nI’m in my 30s, so assuming I live for the next 50 years, I believe Lockheed Martin ($LMT) will remain an important player in the defense sector, as I expect war (mostly proxy wars) to continue being used for political interests and if the US DoD sees its budget reduced, our current Western society’s paradigm will be over.\n\nOther candidates I’ve considered are Visa ($V), Microsoft ($MSFT) and Amazon ($AMZN), but I could see all those titans being disrupted someday in the next 50 years.\n\nHow about you? What’s the stock you think you’ll never sell?",
        "created_utc": 1729943744.0,
        "subreddit_name": "stocks",
        "comments": 727
    },
    {
        "title": "DOJ explaining why you should invest in Visa ",
        "score": 181,
        "url": "https://www.reddit.com/r/stocks/comments/1gcy62i/doj_explaining_why_you_should_invest_in_visa/",
        "content": "Excerpt is from their lawsuit against V\n\n\n5. As a result, debit networks face what Visa calls \"a chicken-and-egg problem.\" To be successful, the network needs many issuers and acquirers to accept the network. But issuers are unlikely to join the debit network unless many merchants already use the network. And merchants are unlikely to join the network unless their customers have cards that work with the network, which requires the issuer to have activated the network. As Visa itself observes, \"build[ing] scale on both sides... with consumers/payers and with merchants/payees\" is \"a herculean task.\" Visa further recognizes that these effects create \"an enormous moat\" around its business.\n\n6. Visa's market shares demonstrate just how deep that moat is. Visa has been the largest debit network in the United States for decades. Today, over 60% of all U.S. debit transactions run via Visa's payments network. And Visa's share of card-not-present debit transactions exceeds 65%. Mastercard is a distant second, processing less than 25% of all U.S. debit transactions and card-not-present U.S. debit transactions. Other networks, known as \"PIN networks\" because they originally facilitated ATM transactions for which accountholders needed to enter a PIN, are significantly smaller.\n\n7. This moat is no accident. Coming out of the Great Recession, Visa identified two significant threats to its monopoly—one from legislation and one from emerging technology. Visa took steps to counter both, enriching itself handsomely in the process.\n\n",
        "created_utc": 1729986307.0,
        "subreddit_name": "stocks",
        "comments": 59
    },
    {
        "title": "Do you ever look back at old r/stocks topics and wonder what people decided to do? Or how they feel about their takes ending up being right.",
        "score": 64,
        "url": "https://www.reddit.com/r/stocks/comments/1gcndoc/do_you_ever_look_back_at_old_rstocks_topics_and/",
        "content": "Or if the hot take was wrong? The reddit upvote system tends to favor saying what is popular that day. So a lot of threads become time capsules into a different area of thinking. One example were all those shorting NVDA threads on this sub in mid 2023 like this thread\n\n[https://www.reddit.com/r/stocks/comments/13lki8i/is\\_there\\_potential\\_to\\_short\\_nvda/](https://www.reddit.com/r/stocks/comments/13lki8i/is_there_potential_to_short_nvda/)\n\nStock was at $31 split adjusted back then and people were saying time to short. Wonder how they feel with stock being higher.",
        "created_utc": 1729955927.0,
        "subreddit_name": "stocks",
        "comments": 44
    },
    {
        "title": "Dollar cost average or wait until downturn",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gcb0wz/dollar_cost_average_or_wait_until_downturn/",
        "content": "Hi all I am a 22 year old Masters student (econ) who is in a very fortunate position of having no major debt (apart from revolving credit card debt, never more than $1.5k and always paid in full) and $130k in savings thanks to inheritance from my late grandfather and some work. Currently I have about $53,000 in stocks and etfs, mostly SPY and QQQ (thinking about trimming this position). The rest is mostly in CDs and treasuries, with a bit in gold and cash. I am fairly sure we're heading towards a downturn in 2025 and think that the potential earnings from AI in the near future doesn't match up with the valuations right now. Plus employment data and fed saying interest rates wont go back down to near zero levels (which I think the market has priced in) has me spooked. \n\nMy dillame in short, is do I continue to slowly dollar cost average my cash position into  stocks/etfs or do I wait for a downturn to go in? I cant shake the sinking feeling tht buying right now would be like buying in 1998/99 and that if I do ill wait for a long time to see real returns. A third option is to dollar cost average so slow (eg. $20k a year) that I will still be sitting on most of my cash when a downturn hits. Any input would be warmly welcome!\n\n  \nMany thanks,\n\n  \nA new investor",
        "created_utc": 1729909394.0,
        "subreddit_name": "investing",
        "comments": 17
    },
    {
        "title": "Researchers say an AI-powered transcription tool used in hospitals invents things no one ever said",
        "score": 5826,
        "url": "https://apnews.com/article/ai-artificial-intelligence-health-business-90020cdf5fa16c79ca2e5b6c4c9bbb14",
        "content": "",
        "created_utc": 1729943188.0,
        "subreddit_name": "news",
        "comments": 396
    },
    {
        "title": "Nvidia overtakes Apple as world's most valuable company.",
        "score": 1377,
        "url": "https://i.redd.it/t1dazhpbm0xd1.jpeg",
        "content": "",
        "created_utc": 1729911257.0,
        "subreddit_name": "wallstreetbets",
        "comments": 103
    },
    {
        "title": "College student savings allocation? ",
        "score": 9,
        "url": "https://www.reddit.com/r/investing/comments/1gca1uz/college_student_savings_allocation/",
        "content": "I am a senior in college currently. I have $2k in stocks (mainly S&P500, some Apple and Tesla), $1500 in my checking account, and $1k in my Apple savings account (4.10% APY). \n\nMy question is, how should I split this? I don’t have any expenses (no loans) and earn about $100/week from an on campus job. Should I move money that’s sitting in my checking into stocks? Should I move money from my Apple savings into stocks too, or is it smart to have just in the savings account? The thing is, if I move after graduation I may need some of my money, but I may not. What should I do with it in the mean time? \n\nOpen to any and all suggestions. TIA.",
        "created_utc": 1729906035.0,
        "subreddit_name": "investing",
        "comments": 7
    },
    {
        "title": "Apple and Goldman Sachs fined millions for misleading Apple Card holders",
        "score": 1341,
        "url": "https://www.theverge.com/2024/10/23/24277710/apple-goldman-sachs-cfpb-fine-charge-disputes-system",
        "content": "",
        "created_utc": 1729969730.0,
        "subreddit_name": "apple",
        "comments": 163
    },
    {
        "title": "Genmoji rollout in iOS 18.2 beta might take a few weeks",
        "score": 318,
        "url": "https://9to5mac.com/2024/10/25/genmoji-image-playground-ios-18-2-rollout/",
        "content": "",
        "created_utc": 1729916494.0,
        "subreddit_name": "apple",
        "comments": 78
    },
    {
        "title": "iOS 18.2: Everything You Should Know About Image Playground",
        "score": 109,
        "url": "https://www.macrumors.com/guide/image-playground/",
        "content": "",
        "created_utc": 1729923982.0,
        "subreddit_name": "apple",
        "comments": 45
    },
    {
        "title": "iPad Mini 2024 Teardown - Did Apple Fix Jelly Scrolling?",
        "score": 46,
        "url": "https://youtu.be/T8ssn_VimnQ?si=vMOxG6NADDL4qWC9",
        "content": "",
        "created_utc": 1729967964.0,
        "subreddit_name": "apple",
        "comments": 65
    },
    {
        "title": "Daily Advice Thread - October 26, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/apple/comments/1gchojp/daily_advice_thread_october_26_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1729936826.0,
        "subreddit_name": "apple",
        "comments": 32
    },
    {
        "title": "Hidden Tips in macOS Sequoia by Snazzy Labs",
        "score": 0,
        "url": "https://www.youtube.com/watch?v=6kxNJ7ptMxk",
        "content": "",
        "created_utc": 1729911802.0,
        "subreddit_name": "apple",
        "comments": 47
    },
    {
        "title": "Android 16 could get iPhone-like ‘ongoing’ notifications",
        "score": 158,
        "url": "https://www.theverge.com/2024/10/26/24280157/android-16-rich-ongoing-notifications-beta-code-iphone-ios-live-activities",
        "content": "",
        "created_utc": 1729968053.0,
        "subreddit_name": "technology",
        "comments": 84
    },
    {
        "title": "Apple wins $250 in Masimo smartwatch patent case.",
        "score": 156,
        "url": "https://www.engadget.com/big-tech/apple-wins-250-in-masimo-smartwatch-patent-case-150020340.html",
        "content": "",
        "created_utc": 1729964899.0,
        "subreddit_name": "technology",
        "comments": 31
    },
    {
        "title": "Black apple laptops 23 years apart",
        "score": 232,
        "url": "https://www.reddit.com/gallery/1gc9e1l",
        "content": "My 2022 M2 MacBook Air and my 1999 PowerBook g3 lombard 🤌",
        "created_utc": 1729903892.0,
        "subreddit_name": "mac",
        "comments": 13
    },
    {
        "title": "Realised today that every Mac I've ever owned is still in regular use, and performs a unique role for me...",
        "score": 119,
        "url": "https://www.reddit.com/r/mac/comments/1gclaa8/realised_today_that_every_mac_ive_ever_owned_is/",
        "content": "As per the title, every Mac I've owned still works perfectly and is still in use.  Not only that, each one serves a purpose.   Specifically - \n\n\\- 2012 13\" MacBook Pro (MD101) \\[12 years old\\] - Used as a spare in the guest bedroom, but brought into service on the occasions I need to burn or copy CD/DVDs.\n\n\\- 2015 iMac 21\" Intel i5 8GB \\[9 years old\\] - Runs 24/7 as a Unify Network controller & management console.  Used to bootcamp into Windows when Windows is needed too. \n\n\\- 2017 12\" Macbook \\[8 years old\\] - Used as my ultra-portal laptop when travelling, for times when I want to put a laptop in my bag without being able to tell I'm carrying a laptop around with me. \n\n\\- 2020 iMac 27\" 5K Intel i5 64GB \\[3 years old\\] - My daily-driver work machine when working from home (most days).  Also used as studio machine for audio and video editing.\n\n\\- 2020 M1 MacBook Pro Touch Bar \\[3 years old\\] - My regular work laptop while travelling or when going into the office, and for working in the garden. \n\n  \nI moved away from decades of using Windows, where every machine I've owned was either dead or unusable after 2-3 years, and I still find amazing that Apple machines can literally almost last forever, and remain completely useable.  Has anyone else managed to keep all their Macs in constant service? ",
        "created_utc": 1729949905.0,
        "subreddit_name": "mac",
        "comments": 54
    },
    {
        "title": "Are second hand or refurbished a waste of time? Should I just bite the bullet and buy new?",
        "score": 12,
        "url": "https://www.reddit.com/r/mac/comments/1gciuxw/are_second_hand_or_refurbished_a_waste_of_time/",
        "content": "I used to have an iMac in my old job which I could use for personal stuff as they basically just gave me a iMac off the shelf so it didn’t have any of the company software etc. Now in my new role they are all windows and working off a HP Probook. \n\nI miss having a Mac especially as I do a lot of UX/UI designing. I know my company won’t ever buy me a Mac (it’s a charity so limited money and also heavily security conscious etc) so I don’t want to buy an expensive computer just for work purposes but then again I know I’ll use it for personal stuff too. \n\nI’ve been looking at CEX and gumtree to see if I can get a good deal second hand but unsure about if I should have a cut off in terms of how old they are for future compatibility/updates. \n\nMy worry is buying second hand and not being happy with the speed/experience etc and wishing I’d bought new but also just not sure how I would justify spending £1.3k+ on what is primarily a ‘want’ not a ‘need’. \n\nAny advice would be appreciated. ",
        "created_utc": 1729941711.0,
        "subreddit_name": "mac",
        "comments": 95
    },
    {
        "title": "2015 macbook air wont turn on",
        "score": 5,
        "url": "https://i.redd.it/e5kpauxyi1xd1.jpeg",
        "content": "soo i’ve had this macbook for a while, and one day i woke up and it just wont turn on. the light on the charger still works & says it’s charging, but absolutely nothing when i try to turn it on. no sound, no lights, nothing. \n\ni’ve tried every key pattern that i’ve found on google and reddit and youtube, ive even opened up the back and took the battery out and put it back in.. nothing. i also changed the battery from the current one to the one from my old macbook (screen broken but it still turned on) just to see if anything happened, still nothing. \n\nplease keep in mind ive tried every way possible to restart it with different key patterns, literally nothing will work. is there anything else i can do or do i just need to take it to a repair shop? i miss my laptop but im not sure im willing to pay to repair something i didnt do :/",
        "created_utc": 1729922233.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "Will this crack affect the screen or affect the whole macbook😭",
        "score": 5,
        "url": "https://i.redd.it/qtq8sd36a1xd1.jpeg",
        "content": "",
        "created_utc": 1729919275.0,
        "subreddit_name": "mac",
        "comments": 8
    },
    {
        "title": "Flutter for Android on Mac ",
        "score": 5,
        "url": "https://www.reddit.com/gallery/1gcoim2",
        "content": "Does anybody here have experience with flutter (mainly for android but preferably for Android and iOS) on Mac (especially M series)? I have a flutter course and I need to get it to work on Android Studio but I’m having issues with running the code (every time a different error), so I thought maybe someone here can help. It was a different error sometimes but every time I try a fix, the error changes to another error and sometimes I get a security pop up too “Apple can’t verify for malware” or something like that, sometimes there is a giant blue error too. The guys at university didn’t help and I tried a lot of YouTube tutorials, also didn’t help. ",
        "created_utc": 1729958996.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Does the 2020 m1 macbook pro support a 1440p 120+hz monitor?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gctw7s/does_the_2020_m1_macbook_pro_support_a_1440p/",
        "content": "that's it, im thinking of buying a monitor but can not find anything online about this specific model, i know the m1 pro and max can, but haven't seen anything regarding the base m1, any comment would be appreciated. thank you very much.",
        "created_utc": 1729973822.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "Trouble reinstalling OS X 10.11",
        "score": 3,
        "url": "https://i.redd.it/7zljw4cp33xd1.jpeg",
        "content": "When I try to reinstall El Capitan on my 2007 iMac I am greeted with this, is it even possible to reinstall El Capitan?",
        "created_utc": 1729941321.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "macbook pro stuck on strange diagrams then language selection ",
        "score": 3,
        "url": "https://www.reddit.com/gallery/1gcehh4",
        "content": "hi I’ve attempted to reset the nvram and attempted to reboot in safe mode but the cursor doesn’t move and the keyboard is non-responsive how should I fix this ",
        "created_utc": 1729922365.0,
        "subreddit_name": "mac",
        "comments": 19
    },
    {
        "title": "Unplug and replug MacBook Pro",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gcy9ea/unplug_and_replug_macbook_pro/",
        "content": "For some reason, my MacBook Pro just stops charging. There's nothing (seemingly) wrong with the magsafe connection. It looks clean and secure. But sometimes it just stops responding, unless I unplug from the wall and re-plug into the wall. It's baffling. None of the other devices plugged into the outlet act that way and the MacBook is like this with every outlet.\n\n  \nDoes anyone else experience this?",
        "created_utc": 1729986581.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "What program on macbook pro can look up all speeds of SD Card if sticker fell off card?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gcu6q5/what_program_on_macbook_pro_can_look_up_all/",
        "content": "Hi. I have seen black magic as one option to looking at the reviews for mac they seem pretty low.\n\n  \nI am looking for a program, even if I have to pay, to see what some of my SD cards are that have had label come off and really aren't that old...Thanks for any help!",
        "created_utc": 1729974649.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Keyboard issue during OpenCore Legacy Patcher install",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gcr05q/keyboard_issue_during_opencore_legacy_patcher/",
        "content": "Hi! So I am installing OpenCore Patcher to a 2012 imac, and I'm at the point of the process where I need to restart holding the option key. However, my Mac keyboard died and I'm using a regular pc keyboard. ALT is supposed to be the equivalent key, but when I hold it down while restarting, it does not work and I can't get to the option for different drives. I also tried holding down the windows key to no avail. Any tips on fixing this or an alternative? Thank you!",
        "created_utc": 1729965794.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Apple Studio Display: PC Use",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gcqtmh/apple_studio_display_pc_use/",
        "content": "Hi everyone, I have been using Apple Thunderbolt Displays with my personal MacBook Pro for years now. For my new job, I finally got a Thunderbolt-enabled PC laptop (TB-4). I wanted to use the Thunderbolt Displays through my Caldigit TS3-Plus dock as a home office setup too, but I can not do this because Thunderbolt Displays are not rated to work with PCs.\n\nOn to the question; has this been updated with the newer Studio Displays? Can you use them with a Thunderbolt-enabled PC laptop? Does anyone have experience with this, if so how did it work out? I don’t need insane capabilities out of it, just to have it function for my pencil-pusher analyst job (extended display, webcam, speakers).",
        "created_utc": 1729965319.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Mac Pro 2006 USB Booting",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gce2o0/mac_pro_2006_usb_booting/",
        "content": "I recently got a Mac Pro 2006 from my school and it's a pretty good system with the dual xeons and a gts 450 and 12gb of ram but, I've been trying to install tiger on it but can't because the boot picker won't show and neither will the apple logo. It just hangs on a black screen then goes to the login. Any ideas?",
        "created_utc": 1729920603.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "Repair YouTuber creates upgradable SSD storage modules for Apple Silicon MacBooks",
        "score": 497,
        "url": "https://9to5mac.com/2024/10/26/youtuber-m1-macbook-ssd-upgradability/",
        "content": "",
        "created_utc": 1729956490.0,
        "subreddit_name": "gadgets",
        "comments": 26
    },
    {
        "title": "AI probably isn’t the big smartphone selling point that Apple and other tech giants think it is",
        "score": 1569,
        "url": "https://thenextweb.com/news/ai-smartphone-selling-point-apple-tech-giants",
        "content": "",
        "created_utc": 1729932723.0,
        "subreddit_name": "technews",
        "comments": 236
    }
]