[
    {
        "title": "Comcast’s Corporate response to my recent Reddit front page post (“Comcast’s Notorious Unreturned Equipment Fees”) sends clear message: Comcast does not give a sh*t about customers – unless your story goes national.",
        "score": 44514,
        "url": "https://www.reddit.com/r/technology/comments/2duzfi/comcasts_corporate_response_to_my_recent_reddit/",
        "content": "*Before I can even begin to justify the very charged title of this post, I beg of you to please bear with me and allow me to share the entire context of what has transpired.*\n\nI am Dann Furia, OP of [Comcast’s Notorious Unreturned Equipment Fees]( http://www.reddit.com/r/technology/comments/2dibwq/in_order_to_avoid_comcasts_notorious_unreturned/) which made the top spot on Reddit’s front page four days ago, highlighting a common Comcast phenomenon: customers getting repeatedly billed for “Unreturned” equipment and other fees.\n\n**The purpose of this post is two-fold:**\n\n* Share my (previously untold on Reddit) entire Comcast story\n* Address Comcast’s response to my recent front page Reddit post about Comcast’s fees\n\n\n**Part I - MY ENTIRE COMCAST STORY**\n\n**During the six month period from mid-January of 2014 through the end of July of 2014, I had to contact Comcast an astounding 25 times in regards to a multitude of issues, errors, and mistakes with my service, and charges related to my Comcast account.**  I kept careful, written records of my experiences as far back as January of this year, and by early July I had experienced such a stupefying range of problems with Comcast, that I additionally began recording my interactions with them.\n\nDuring the above-referenced six month period, Comcast was a thoroughly disconcerting 0 for 25 in resolving anything.  Now, I completely understand that it may seem rather farfetched for me to claim that a single company (even one as notorious as Comcast) could fail the same customer 25 consecutive times, that is until you consider that I have previously documented at length each of [25 Consecutive Failed Comcast Interactions here in a four page Comcast blog] (http://www.dannfuria.com/comcast) spanning 6 months, 17 phone calls, 6 appointments, 2 online interactions, 20+ hours of my personal time, and $1320 in fees) and further that I possess months of paperwork, 50+ pages of documents, files, images, bills, screen shots, phone records, and roughly two hours of audio recordings, to support my claims.  While my four page Comcast blog may not be the most exhilarating read, the entirety of the account - the sum of its parts, if you will - is in my opinion a damning indictment of Comcast customer handling.  At a minimum, my four page Comcast blog provides another well documented account of a relentlessly awful brand of service.\n\n\n**Part 2 - COMCAST’S RESPONSE TO MY FRONT PAGE REDDIT POST ABOUT COMCAST’S NOTORIOUS FEES**\n\nAs noted above, I tried in earnest 25 times in a six month period from January through July of 2014 to get Comcast to help me.  Comcast steadfastly ignored, neglected, dodged, and billed the crap out of me.  Put more poignantly, Comcast played an incredibly effective game of “Annoying you out of your money, wearing you down until you're too weak to complain, and then when you just can't go on, charge you for early cancellation. Or just make something up and put it on a bill and hope no one notices.\" (Bill Maher, 7/25/14).\n\nThen, *after* my [Comcast’s Notorious Unreturned Equipment Fees]( http://www.reddit.com/r/technology/comments/2dibwq/in_order_to_avoid_comcasts_notorious_unreturned/) post topped the Reddit front page four days ago and my story received national attention, Comcast’s Corporate office left me 5 messages in 18 hours.  I repeat - not a SINGLE Comcast employee could bother to help me one time in 6 months, despite my 25 well documented attempts to get help, and now all of the sudden Comcast has the ability to contact me 5 times in 18 hours?  That is interesting.\n\nWhen I listened to the first voicemail from Comcast Corporate, I felt relieved that someone might actually finally help me.  But by the time I made my way through five consecutive Comcast Corporate messages (4 of them from the same person), and realized that they had all been delivered in an 18 hour period directly after my “Comcast fees” post went Reddit-viral, I literally began to feel sick to my stomach by Comcast’s response.  Now, I understand that when a Comcast customer story like mine starts to get national attention, Comcast probably tries to minimize whatever gripes might publicly emerge.  I also concede – flat out – a measure of hypocrisy on my part for reacting partly in anger that Comcast finally responded to me.  Having said that, there could not possibly be a more poignant, scathing illustration of the contrast between Comcast’s treatment of a regular customer (contemptuously disregarded 25 times in 6 months) and a “Special / Going Public” customer (5 Corporate messages in 18 hours).\n\nAll indications are that Comcast has just now (as of about 3 days ago) taken notice of a customer - who for several years has resided in their backyard, the suburbs of Philadelphia – and begun to address but one of many unfortunate aspects of my Comcast experience (the $1320 in fees aspect).  I, meanwhile, have had 7 months to bake in the rancor of Comcast Purgatory, a dimension from which very few, if any, escape.  So please allow me, indulge me if you would be so kind, to summarize how this feels from my perspective:  In a six month period this year, Comcast mishandled my account 25 times in a row, put me on hold on the phone for several hours, failed to show up to multiple appointments, hung up on me while I was on hold, fed me a torrent of misinformation (much of which is recorded on audio, mine and theirs), threatened me with and then auto-generated to my account a Literally-Unremovable $960 Termination Fee, repeatedly billed me $360 for properly returning my equipment, and wasted way more than 20 hours of my time.\n\nComcast’s effective response in helping me during the six month time frame? Zero. Zilch. None. Null. Devoid.\nComcast’s response when I cancelled my account?  They buried me $1320 in fees.\nComcast’s response when I went public to complain?  Their Corporate office immediately contacted me 5 times in 18 hours.\n\n**And so this appears to be the standard for receiving attention from a Comcast representative who actually has the ability or power to address problems that Comcast has caused a customer:** First, a customer should suffer through months of negligence and poor treatment, documenting each step of the journey while firmly battling a motley assortment of heinous fees, then after 6 months utterly give up all hope and feel like a fool for bothering to try so hard to get Comcast to help you, then – if you can manage to find the time - write a [4 page blog about your Comcast experience](http://www.dannfuria.com/comcast), then [share part of your story with Reddit](http://www.reddit.com/r/technology/comments/2dibwq/in_order_to_avoid_comcasts_notorious_unreturned/), be fortunate enough to receive incredible & overwhelming support that vaults your post to the Reddit front page, and gain some national coverage (from The Verge, Gawker, & International Business Times).  Perhaps then - and only then - can a customer get Comcast to clean up a mess they’ve created.\n\nIt appears, for the time being, that I might just escape from Comcastic Purgatory.  \n\nBut believe me when I say this with heartfelt sincerity: I feel genuinely sorry for the rest of you poor souls.",
        "created_utc": 1408338226.0,
        "subreddit_name": "technology",
        "comments": 2199
    }
]