[
    {
        "title": "Apple to stop selling its latest smartwatches after losing patent case to rival that says 'even the world’s most powerful company must abide by the law'",
        "score": 9254,
        "url": "https://fortune.com/2023/12/18/apple-watch-halt-us-sales-smartwatches-patent-loss/",
        "content": "",
        "created_utc": 1703019889.0,
        "subreddit_name": "technology",
        "comments": 706
    },
    {
        "title": "Apple Plans Rescue for $17 Billion Watch Business in Face of Ban",
        "score": 1732,
        "url": "https://www.bloomberg.com/news/articles/2023-12-18/apple-plans-rescue-for-17-billion-watch-business-in-face-of-ban",
        "content": "",
        "created_utc": 1702944755.0,
        "subreddit_name": "apple",
        "comments": 321
    },
    {
        "title": "Apple releases new iOS 17.2.1 update alongside macOS 14.2.1",
        "score": 1102,
        "url": "https://9to5mac.com/2023/12/19/apple-releases-ios-17-2-1/",
        "content": "",
        "created_utc": 1703013931.0,
        "subreddit_name": "apple",
        "comments": 182
    },
    {
        "title": "I'm a professional trader and this is some of my notes on what's been happening in premarket.",
        "score": 354,
        "url": "https://www.reddit.com/r/Daytrading/comments/18m0xdm/im_a_professional_trader_and_this_is_some_of_my/",
        "content": "Note: I tried to take on some of the feedback from yesterdays post and provide a bit more analysis, although I keep some more back for my personal notes. Hopefully you can find value in this post though.\n\n**What happened yesterday, and thoughts on this:**\n\n* Yesterday, SPX and Nasdaq made marginally new highs, whilst Dow was flat. This despite fed officials continuing to try to walk back rate cut optimism.\n* This move higher in SPX and Nasdaq was driven by Mag7 again, with exception of Apple and Tesla. We can see the mag7 dominance by the fact that QQQ rose by 0.43%, whilst QQQEqualweight was down for much of the day.\n* Oil was higher on Red Sea disruption, particularly after BP said they would not be using the Red Sea Routes after Houthi attacks. This forces them through the Suez Canal which delays oil shipments by 2 weeks on average.\n* Steel stocks pumped after Nippon Steel agree deal for X, although Senator Fetterman says he intends to try to stop the deal.\n* Solar stocks notable losers as Sunpower raises doubts over its ability to continue as going concern, which dragged other Solar stocks lower.\n* Vix remained suppressed around 12 which is supporting the market higher.\n\n**My Thoughts:**\n\n* Personally seeing signs that the market is topped out. Saw Tesla reached resistance near 260 but got rejected. NVDA now trading at 500, which I think is a psychological level that sellers will be sitting at, so would expect it to get rejected there over next few days. Apple trading near 200, which I think will be a psychological level sellers will be at. To be honest, I would have expected Apple to be down more than 0.85% with news of Apple Watch sales being paused and China accelerating their Apple ban in government institutions.\n* Snapchat got a very bullish analyst upgrade but was flat on the day, which can be a sign madcaps are topping out too after a very bullish run.\n* Nasdaq (IXIC, not NDX) now coming close to 15k which will see sellers sitting there.\n* Other than lack of headwinds in the market in coming days in terms of data, I think market is close to key resistance levels.\n\n**TODAY’S DATA LEDE/MACRO EVENTS:BOJ RATES DECISION - recall from previous reddit post, my expectation was for BOJ to hold rates despite speculation of possible hike.**\n\n* Made no change to negative interest rate, holding benchmark at -0.1%Yield curve control unchanged.\n* People had speculated that they would tighten which pumped up yen. Yen to now retrace those gains.\n* BOJ spoke of “extremely high uncertainties” and said more needs to be seen to determine if “positive wage inflation cycle is in place”.\n* Seeing gradual improvement in inflation but still not in a position to be sufficiently confident.\n* Didn’t remove the rhetoric about “won’t hesitate to take additional easing measures if necessary”. Thats quite dovish\n\n**ANALYSIS:**BEFORE SPECULATION THAT BOJ WOULD TIGHTEN, USDJPY WAS TRADING AT 147.22JXY was trading at 68.Probably needs to retrace close to back to this.As Yen falls, Japanese equities going to become cheaper, so Nikkei will likely pump for few days now.\n\n&#x200B;\n\n**AUSTRALIA RBA MINUTES - For meeting where RBA went back to pausing after hiking again last month.**\n\n* Board considered whether to raise rates by 25 bps or to keep steady. Decided on pause.\n* Will continue to analyse the data to determine future policy.\n* Some encouraging signs on inflation that need to continue.\n\n**ANALYSIS**:Not much to these comments to be honest. Continued data driven rhetoric.**US** \n\n**BUILDING PERMITS AND HOUSING STARTS DATA COMING.**\n\n**———— FX ——————**\n\n* Yen lower, propping up USDJPY. USDJPY was trading at 147 before speculation of tightening. Since that didn’t materialise, USDJPY needs to retrace.\n* Money rotating out of yen into other currencies like AUD, GBP etc\n* Note Risk reversal on dollar index has touched lowest since 2020, and options pointing to substantial drop in USD. This would support equity markets.\n* Note: Dollar and US equities are most inversely correlated since May - Can watch for some correction there.\n\n**———— OPTIONS —————**\n\n* 4800 remains sticky strike\n* Record Call skew - Bullish.\n* Single Digit implied Vol\n* CTAs moving supporting on Brent Crude now - algorithmic strategies supporting oil\n\n**——— MARKETS OVERVIEW ———**\n\n* Markets: Flat as you would expect in premarket when they are trading at all time highs and there’s little macro catalysts to drive them notably higher right now.\n* NIKKEI: Japanese stocks pumping after ultra easy monetary policy maintained for foreseeable future. Makes yen lower and Japanese equities cheaper\n* GER40:Majority of sectors slightly green.\n* HKG50: NOTE: I’m holding positions in the HKG50. I think it’s undervalued and people will rotate from US equities into HKG at some point.\n* OIL: Flat this morning after pushing yday, although it did pare those gains when US said they will help to safeguard Red Sea vessels. Launched a task force. This reduces risk premium and made oil fall again.Yields: Flat, slightly lower\n\n**——— INSTITUTIONAL RESEARCH ———**\n\n* PIMCO SAYS THEY THINK UK WONT ACHIEVE SOFT LANDING. Said they are betting against GBP. Said UK consumers feeling brunt of interest rates more than US as less on 30 year fixed mortgages.\n* MS’s MIKE WILSON SAYS US EQUITIES HAVE GREEN LIGHT TO MOVE HIGHER. - Another Bear capitulates. To be honest, I see this as a sign of market topping out too.\n* GOLDMAN releases paper saying UST yields are higher in short term, but near historical averages. Bullsh\\*t report really. They’re high, lets be real. Highest since 2005.\n* GOLDMAN’s SENTIMENT INDICATOR TICKED UP TO 1.1. Points to stretched equity positioning. Due a correction.\n\n**——— Company Specific ————**\n\nQuite a flat premarket, not TOO much company specific news driving big moves. Piper Sandler put out some pieces in analyst reviews on solar sector.\n\n* SEDG - Downgraded at Piper Snalder to neutral, price target at 105 (which is 15% above spot)\n* RUN - Piper Sandler upgraded to overweight, raising price target to 31 , 72% above spot. Because RUN is more sensitive to cutting rates\n* TSM - TSMC chairman, Mark Liu will retire in 2024, but CEO is recommended as successor, so still very in house succession plan.\n* BA - receives an order of up to 100 737 Max jets from Lufthansa\n* UBS - Activist investor Cevian Capital is investing $1.2b into UBS, with expectation they will overtake Morgan Stanley as world’s top wealth management company.\n* SALESFORCE AGREES TO ACQUIRE SPIFF - TERMS OF DEAL not DISCLOSED\n* ENPH WILL CUT GLOBAL WORKFORCE BY 10%, This represents 350 workers. This is part of a restructuring plan. They will take a $16m restructuring charge from this. Also stopped manufacturing plant operations in Wisconsin and Romania.\n* LUMN - appoints a new Chief Product officer\n* ARRY - JPM remains buy on ARRY, Piper Sandler however downgrades to neutral, price target set 16% above spot.\n* ZIM - continues higher on ongoing Houthi disruptions\n* LTHM - Allkem shareholders vote in favour of Livent merger\n\n**------- OTHER NEWS HEADLINES: ---------**\n\n* GAS PRICES AT CHEAPEST LEVEL OF YEAR, AS WINTER TEMPERATURES WARMER THAN EXPECTED\n* CHINA SECURITIES REGULATOR TELLS COMPANIES TO INCREASE DIVIDENDS AND BUYBACKS - bullish\n* BOA FUND MANAGER SURVEY: What are others doing?Moving overweight on bonds nowOverweight equities too90% say fed hikes over73% say Yen undervaluedALL OF THESE ARE OBVIOUS OBSERVATIONS\n* ECB’s VILLEROY COMMENTS - Dovish.Was making positive comments on France growth prospects.Said We will be able to lower interest rates some time in 2024, as wages grow faster than inflation now.Not going to raise any further.\n* Note: ECB’s SIMKUS AND VUJCICALSO TALKING TODAY WALKED BACK SOME OF THIS DOVISHNESS. SAID MARKET AHEAD OF ITSELF.\n* MAGNITUDE 5.5 EARTHQUAKE HITS XINJIANG REGION OF CHINA. 105 people were killed, 390 injured and 4,700 houses damaged\n* CHINA CENTRAL BANK ADVISER REMAINS BULLISH ON CHINA to ACHIEVE 5% GDP GROWTH IN 2024.\n* HOUTHI ATTACKS IN THE RED SEA COTNINUE - US central command report 2 more attacks on Dec 18th, striking oil tankers.\n* CLIMATE GROUPS SUE UK OVER North Sea OIL PROJECT\n* **FED DALY - rate cuts could be needed next year to prevent over tightening**\n\n**——— FAANG NEWS (can move markets) ———**\n\n* AAPL - still trying to work out what to do about their smartwatch halt. Trying to rescue the situation by doing software tweak. NOTE; THIS SITUATION IS GENUINELY BEARISH AND WILL HAVE AN IMPACT ON AAPL TOP LINE.\n* TESLA - PLANNING 10% OR HIGHER HOURLY PAY RATE FOR SOME WORKERS AT NEVADA BATTERY PLANT FROM JANUARY\n* TESLA - less market impact as its very much in future, but TESLA is supposedly working on a wireless charging pad where you just park over it and it automatically charges your vehicle.\n* GOOGL - will pay $700m in play store settlement, agreeing to make changes to App Store. Was in an anti trust dispute. NOTE: THIS IS A SMALL FINE FOR THEM AND NO BIG DEAL.\n\n**——— EARNINGS REPORT ————**\n\nHEICO:Will read during the day. Is too pumped up right now and I was hoping for a correction aftermarket. Didn’t come so not an immediate priority to read before market open. Wont be buying it at these prices.I just read a short overview with summary that aerospace product demand was strong, and acquisitions helped to fuel their growth. Without acquisitions, still 12% organic sales growth though. So strong performance.\n\n&#x200B;",
        "created_utc": 1702989525.0,
        "subreddit_name": "DayTrading",
        "comments": 88
    }
]