[
    {
        "title": "Thoughts on Globalstar (GSAT) post-election",
        "score": 43,
        "url": "https://www.reddit.com/r/stocks/comments/1gnmb69/thoughts_on_globalstar_gsat_postelection/",
        "content": "GSAT is my speculative play right now. Looks like it is (maybe was) a good runner, with apple using it for their satellite cell service, and non-emergency use/satellite text coming in 2025.\n\nProblem: SpaceX/Starlink and GSAT are in a battle over satellite radio bands. FCC dismissed SpaceX's request to basically take over GSAT's dedicated section of bandwidth.\n\nBut Musk is now firmly latched onto future POTUS, in what is certain to become a grifty political-economic symbiosis.\n\nWhat's the liklihood Musk tries to court government favors from the white house/FCC to give SpaceX a (probably illegal, but laws don't matter anymore) leg up?",
        "created_utc": 1731192934.0,
        "subreddit_name": "stocks",
        "comments": 30
    },
    {
        "title": "Has anyone used CNN Business's 12-month stock price projections?",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gndamw/has_anyone_used_cnn_businesss_12month_stock_price/",
        "content": "I came across this 12-month price projection for [META on CNN Business](https://edition.cnn.com/markets/stocks/META?iid=cnn-mobile-app#forecasts).\n\nHas anyone used their projections before? \n\nHow accurate have they been in your experience? \n\nI'm curious to know if it's worth considering when making investment decisions.\n\n\n\n\n\n\n",
        "created_utc": 1731168250.0,
        "subreddit_name": "stocks",
        "comments": 8
    },
    {
        "title": "70k gain thanks to the Trump Trade no one talked about",
        "score": 3623,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gmx7z7/70k_gain_thanks_to_the_trump_trade_no_one_talked/",
        "content": "Everyone piling into Tesla, Bitcoin, DJT, etc. and no one ever mentioned Fannie Mae and Freddie Mac. These two companies have been orphaned ever since their conservatorship 15+ years ago. During Trump's first presidency he implemented steps to re-privatize the entities and with him back in office the market reacted accordingly. I started building my position in the junior preferreds a little over a year ago.\n\nShould mention that there is still room to run. Most of the junior preferred issues are trading at around 30% of their face value. I only hold the junior preferred shares as the common will most likely get wiped in any recap and release scenario. \n\nIt will be interesting to see who Trump picks as his treasury secretary in the coming weeks. John Paulson is one of the names being floated around - he famously bet against subprime mortgages during the GFC and holds a large amount of Fannie and Freddie junior preferreds. \n\n[Ignore other financial company holdings - virtually all gains coming from Fannie and Freddie JPS](https://preview.redd.it/q6o6mipgprzd1.png?width=1025&format=png&auto=webp&s=880dad11ef1c86ff4ed5d4820b8d206e1d20ab87)\n\n  \n",
        "created_utc": 1731111088.0,
        "subreddit_name": "wallstreetbets",
        "comments": 398
    },
    {
        "title": "Stocks that are going to go nuclear, no, literally.",
        "score": 1604,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gngaye/stocks_that_are_going_to_go_nuclear_no_literally/",
        "content": "You have seen in recent news that lots of data centers and AI fueled companies are looking for sustainable carbon free energy. That still isn't enough for the likes of amzn, and msft. They need sustainable STABLE energy. Nuclear is the only real option to hit this. Wind and solar energy are not feasible and if we are honest to ourselves, they simply aren't efficient enough. This is why nuclear is needed. \n\nMany disasters have occured: chernobyl, three mile island, and fukushima to name a few. This has caused the public to have a negative outlook on the technology. Many people believe wrongly that these reactors will destroy the world, when in fact post construction they are some of the safest forms of energy production.\n\nThe issue in the past with traditional reactors are that these projects are super fund sites. BILLIONS of dollars, government regulations bloat the cost and balloon the build time. In order to get a new design, the government is the only source. A lengthy billion+ dollar gamble so most build off the last approved design making small improvements. \n\nEnter SMR's , small modular nuclear reactors. They are extremely small sites in comparison to traditional monstrosities. The safety zone surrounding a SMR set up is limited to the bounds of the actual generator site. This is a big deal because with traditional reactors you have to build out a secured zone 10+ miles around the actual sites perimeter. The costs continuously add up for traditional economies. \n\nWho is designing SMRS? Tons of people are attempting but it no longer matters. As of 2020, the company NuScale is the only company in the united states with an approved reactor design. Other companies attempting to design and theorize have already gained support from the private industry in most recent history Amazon did so. They are giving money to start ups who are 10+ YEARS behind NuScale in hopes of getting in early.\n\n  \nNuScale has lost money year over year but have done amazing at cutting down on costs and bloat reducing their year over year expenses drastically. They have received government assistance already in 2014 (https://www.energy.gov/ne/articles/doe-approves-award-carbon-free-power-project), to the tune of 1.4b USD from the DOE which means government relations have already been built. \n\nThey went to deploy and test the reactors by building a 12 module reactor but fear of extra costs and hitting deadlines drove off private investors causing a halt on the project. AND YET NuScale performed relatively well in sustaining its value for a startup that's never made money. They continue to strive for a mid 2025 start to selling and commercializing their product to prove to the world it is safe and possible. I don't really think I need to explain in depth how AI data super centers, mass surveillance, quantum computing, and the general virtualization of everything will continue to drive the demand for stable sustainable energy and how that relates to NuScale.\n\n  \nYou may ask the following: \"How is this a small risk investment if you're claiming such higher performance?\", \"How are you sure we are going to go nuclear? The coming administration in the US wont be favorable to renewables!\", \"How do you think even if we are it will happen on a short time span?\"\n\n  \nI have answers. \n\n  \nEven if NuScale goes tits up in debt, has no way of securing contracts, gets beat out my competitors (impossible lol), IT STILL HAS ITS APPROVED DESIGN. That is their (for lack of a better term) trump card. It is worth the 24$ alone depending on who scoops them up to finish the mission. This leads me into the second nuclear stock. To supply this industry uranium will be needed. The government has been looking for a domestic supplier of fuel grade uranium that is ready for enrichment. Sadly, the enrichment game is mostly private holdings can't get in on that public goodness. But Uranium Energy Corp. has been making money moves, aquiring LIQUIDATABLE uranium and hodling it as hard as they can. Increasing mining, storage, and infrastructure capacities. They are ready for the next move. The united states is already trying to bid on BOTH A GenIII+ nuclear reactor(https://www.energy.gov/oced/generation-iii-small-modular-reactor-program), as well as a domestic supplier and enricher of fuel grade uranium(https://www.energy.gov/articles/biden-harris-administration-announces-four-contracts-boost-domestic-haleu-supply-and) <-- they have one for Low enriched as well.\n\nThe government is cheap and wants to save money. They have made a report investigating the savings made per killowat compared to the incentives given. They found they gave out 50+ billions and made jack shit return. They equated to do the same garbage return rate they'd only have to use 10 billion for the SMR tech coming out if they support the role out. \n\nEven with trump in office these stocks make sense to invest in for both hodling potential and short term options gamba. The government is already in favor of this, they will do whatever they need to change the public perception Hell, they don't even care., They will executive order whatever they need.  The following are reasons a trump office will help nuclear.\n\nHe has already stated that he will slash 4 or however many regulations per passed regulation. This will benefit all industries regardless of how you feel about it on an emotional level. Furthermore he wants a stronger American offense and defense. Putting SMRs into most states after commercial shows its viability will make for an invasion insurance, solar flare insurance, EMP insurance, supernova insurance, etc. SMRs are off grid capable. They can provide direct power hence the stability for data centers. If the grid goes down SMR's keep pumping. The steam they produce in the next generation will be more efficiently harvested for chemical manufacturing of ammonia and other reagents.\n\nEven with a strong want to continue using fossil fuels for trump, all the fossil fuel industries benefit. With the minimal space requirements needed essentially anywhere near any industry center a nuclear reactor could be built. And on the same page, lets talk about the building of this reactor(s) and its module(s).\n\n  \nIt is a modular system and NuScale has already put thought and money into fabrication plants to create the modular components, as well as invested in what they call E2 centers across the globe to train professionals to work at NuScale reactor sites. They aren't a tech bullshit startup with false promises they are actively confident and preparing for a 3 year explosion into the industry. They have made talks and contracts and centers in eastern europe namely romania, they have done the same in the middle east, they have done the same in africa specifically full blown university support from Ghana(https://www.reuters.com/markets/deals/ghana-signs-agreement-build-small-nuscale-nuclear-reactor-2024-08-29/). This shit is happening but retail regards still have their head in the sand. I think the big boys are waiting to blow this shit up over night in the coming few years.\n\n  \nI bought in at 22 something and it hit almost 26 the other day. UEC is a bit more volatile but in the exact same boat. This isnt a source of uncorrelated returns, these markets are both going online. And if tariffs happen, these people are MOONING. The signs are right in our faces.\n\nFINAL KEY POINTS AND WRAP UP FOR THE TLDREGARDS:\n\n\n\n\\*\\*Nuclear energy is happening short term and already has DOE support.\n\n\\*\\*\\*ONLY ENTITY THAT HAS AN APPROVED SMR DESIGN BY THE NUKE COMITEE IN THE US\\*\\*\\*\n\n\\*\\*TRUMP SLASHING REGS ++ TARIFFS??\\*\\*\n\n\\*\\*UEC MEETS DOE FUTURE GOALS AS DOMESTIC URANIUM SUPPLY\\*\n\n\\*US ALLIES URANIUM SUPPLIES FACE UNCERTAINTIES WHICH MEANS $$$$ FOR US SALES\\*\\*\n\n\\*\\*MINIMAL RISK LONG TERM AS THEY BOTH HAVE AN EXTREMELY VALUABLE INTRINSIC ASSET REPSECITVELY\\*\\*\n\n\\*\\*EVERYTHING IS ON SCHEDULE ACCORDING TO NUSCALE SMR Q3 REPORT\\*\\*\\*\n\n  \nSOURCES::\n\n  \n[https://www.energy.gov/ne/articles/doe-approves-award-carbon-free-power-project](https://www.energy.gov/ne/articles/doe-approves-award-carbon-free-power-project)\n\nhttps://www.energy.gov/sites/prod/files/2018/11/f57/Examination%20of%20Federal%20Financial%20Assistance%20in%20the%20Renewable%20Energy%20Mark...\\_1.pdf\n\n[https://www.energy.gov/oced/generation-iii-small-modular-reactor-program](https://www.energy.gov/oced/generation-iii-small-modular-reactor-program)\n\n[https://www.energy.gov/articles/biden-harris-administration-announces-four-contracts-boost-domestic-haleu-supply-and](https://www.energy.gov/articles/biden-harris-administration-announces-four-contracts-boost-domestic-haleu-supply-and)\n\n[https://www.nuscalepower.com/en/news/press-releases/2024/nuscale-power-reports-third-quarter-2024-results](https://www.nuscalepower.com/en/news/press-releases/2024/nuscale-power-reports-third-quarter-2024-results)\n\n[https://www.reuters.com/markets/deals/ghana-signs-agreement-build-small-nuscale-nuclear-reactor-2024-08-29/](https://www.reuters.com/markets/deals/ghana-signs-agreement-build-small-nuscale-nuclear-reactor-2024-08-29/)\n\n",
        "created_utc": 1731176362.0,
        "subreddit_name": "wallstreetbets",
        "comments": 852
    },
    {
        "title": "Intel CEO optimistic about CHIPS Act’s future after trading texts with JD Vance",
        "score": 914,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gn8a0p/intel_ceo_optimistic_about_chips_acts_future/",
        "content": "[https://www.oregonlive.com/silicon-forest/2024/11/intel-ceo-optimistic-about-chips-acts-future-after-trading-texts-with-jd-vance.html](https://www.oregonlive.com/silicon-forest/2024/11/intel-ceo-optimistic-about-chips-acts-future-after-trading-texts-with-jd-vance.html)  \n$INTC\n\n>  \nIntel CEO Pat Gelsinger told employees Friday that he has texted with Vice President-elect JD Vance since the election and that Gelsinger is optimistic that the incoming Trump administration will support efforts to boost the domestic semiconductor industry.",
        "created_utc": 1731152401.0,
        "subreddit_name": "wallstreetbets",
        "comments": 115
    },
    {
        "title": "$TSLA $70 -> $2800 +4000%",
        "score": 344,
        "url": "https://www.reddit.com/gallery/1gmy2zw",
        "content": "Placed a limit order on lotto calls and went to sleep as I live upside down, to my surprise my broker sold my position at top before I woke up Ty for 4k kangaroo dollars ",
        "created_utc": 1731113636.0,
        "subreddit_name": "wallstreetbets",
        "comments": 78
    },
    {
        "title": "PLTR & TSLA Gain Porn",
        "score": 187,
        "url": "https://i.redd.it/y3aftfsl8wzd1.jpeg",
        "content": "Thank you PLTR and TSLA 😭😭. Had 48 strike price calls on PLTR for earnings that started this momentum. Then got 307.5 strike calls on TSLA that got me to 25k. My only regret is not holding… I’ve done the math and with the calls I had if I held a few more days on both PLTR and TSLA I could easily have over 150k in my acct. I try not to think about it since I made great money and played it safe by not holding the calls overnight.",
        "created_utc": 1731165757.0,
        "subreddit_name": "wallstreetbets",
        "comments": 40
    },
    {
        "title": "TSLA Potential Bearish Next Week",
        "score": 0,
        "url": "https://www.reddit.com/gallery/1gne1e0",
        "content": "Next week look at potential bearish TSLA crash\n\nTesla’s recent price action suggest a possibility of a pullback, potentially to the $307 level, before moving up to the $335 range. Analysts have noted that Tesla’s RSI is over 80, placing it in an “overbought” category, which often leads to a temporary pullback as investors take profits. Additionally, technical indicators show that the stock may face resistance near $335, suggesting it may first need to “cool off” with a slight dip before any attempt at higher levels.\n\nIf Tesla does pull back to around $307, it could serve as a consolidation phase, allowing the stock to gather momentum for a push upward. However, this movement is contingent on overall market conditions and investor sentiment staying supportive. Some sources view this pullback as a healthy correction within Tesla’s ongoing uptrend, while others suggest that breaking below $307 could trigger further declines.\n\nIn summary, a pullback to around $307 is likely, but it should be monitored closely, as further decline would indicate potential support level testing around $288. \n\nWhile it’s difficult to predict Tesla’s exact movements over the next week, there is some consensus among analysts that the stock could face further volatility.\n\nThe price is currently above $320, with analysts having varying opinions about where it could go in the near future. Some predict a potential pullback to the $220–$250 range, particularly considering concerns about profitability and broader market conditions. Other more optimistic forecasts suggest that Tesla could eventually see a rebound, with some price targets as high as $350, but this would be contingent on Tesla maintaining strong market position and positive news, such as advancements in their self-driving tech.\n\nGiven these mixed views, while a pullback to around $230–$240 is possible, it is equally plausible that the stock might stabilize around the $300 mark or rise, depending on the broader market trends and company performance.\n\nMarket hype is dying down after this past week, people are taking out profits and we are looking at a big potential dip in the stock. Overvaluation and Tesla having a bad year so far if we talk sales and production; the uptrend is most likely over and if you haven’t already this could be a good time to sell. The risk is way too high for minimal profit margins.\n\n(It all depends on how much Elon Musk will post on Twitter/X lol)\n\nLinks:\n\nhttps://www.benzinga.com/money/tesla-stock-price-prediction\n\nhttps://stockanalysis.com/stocks/tsla/forecast/\n\nhttps://www.marketbeat.com/stocks/NASDAQ/TSLA/forecast/",
        "created_utc": 1731170290.0,
        "subreddit_name": "wallstreetbets",
        "comments": 144
    },
    {
        "title": "Hear me out, hear me out (TSLA)",
        "score": 0,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gmzju3/hear_me_out_hear_me_out_tsla/",
        "content": "So Elmo was on a call today with The Donald and Zelensky. 🥭 may have been negative in the past about EVs, but Elon has to have a deal in place - most likely to tariff international EVs so that Tesla wins bigly. But, we all know this. Tesla smashed it this week. Am I pissed I missed it? Yes. Am I looking inwards for losing 30% this week, when the market rallied and a young degen chimpanzee could’ve made money? Absolutely. Do I think on Monday I will be buying the Tesla top? Absolutely not. \n\nI think there is another catalyst for Tesla. Fuck the election, fuck the new administration. That’s yesterday’s news. I’m talking Russia. \n\nWe’ve seen Elon and Putin in headlines recently. Putin allegedly asked Musk not to activate Starlink over Taiwan as a favor to China. But unlike Sleepy Joe, Trump, a fan of Elon, and seemingly friend of Putin, will not give a shit about this communication. With the prospect of at least a ceasefire, if not all out end, to the war in Ukraine looking likely, I believe this opens up trade with Russia again. But this is where it gets interesting. We have an inside man. Elon is first in the running to reopen business in Russia. He is the business face of this administration, and I believe his targets will be set on the Russian automobile market potential. \n\nSome stats I have found:\n- The Electric Vehicles market in Russia is projected to reach a revenue of US$2,470.0m in 2024.\n- The market is expected to experience an annual growth rate (CAGR 2024-2029) of 18.09%, resulting in a projected market volume of US$5,673.0m by 2029.\n- By 2029, it is estimated that unit sales of Electric Vehicles market in Russia will reach 61.94k vehicles.\n- In 2024, the volume weighted average price of Electric Vehicles market in Russia is expected to be US$89.9k (Elmo can sell for cheaper)\n\nFeel free to collectively shit all over me in the comments, but can you really say to yourself this is farfetched? I don’t think so. Elon will do Elon things. This is a PR and economic win for him - be one of the faces associated with ending a war, and be one of the leaders in re-intergating Russia into the global economy. \n\n(Or just go into 0DTE.)",
        "created_utc": 1731118091.0,
        "subreddit_name": "wallstreetbets",
        "comments": 51
    },
    {
        "title": "Wendy's Uses Palantir AI Tech To Manage Burger, French Fry Inventories says Return On Investment Is 'Significant'",
        "score": 729,
        "url": "https://www.reddit.com/r/stocks/comments/1gnbgko/wendys_uses_palantir_ai_tech_to_manage_burger/",
        "content": "https://www.benzinga.com/news/24/11/41817215/wendys-uses-palantir-ai-tech-to-manage-burger-french-fry-inventories-return-on-investment-is-signifi\n\n> Wendy's supply chain purchases are handled by an independent co-op group that first tested Palantir's technology last year amid tight profit margins and increasing pressure from inflation, according to a Bloomberg report. The group is using Palantir's system to spot shortages and suggest solutions like placing an order from a supplier. Pete Suerken, who leads the purchasing co-op, said the system's AI learns over time and can suggest a specific warehouse, after considering factors such as cost and the probability of the items arriving on time. The software can predict when specific products will run out by analyzing current and historical sales figures.\n\n> Suerken praised Palantir's platform and said it was \"so much better\" than spreadsheets and other customary inventory management methods. He also said the return on investment is \"significant.\" Wendy's recently asked the supply chain program to identify shortages restaurants could face over the following three weeks and then staff trained the model by showing how the shortages should be solved. Wendy's purchasing group plans to eventually allow the AI model to manage smaller inventory and ordering tasks autonomously and without human intervention.\n\n> \"Three or four years from now, if you're not doing this, you'll be at a distinct disadvantage,\" said Suerken. \"This is something that, as an industry, will change the way we work.\"",
        "created_utc": 1731163077.0,
        "subreddit_name": "stocks",
        "comments": 126
    },
    {
        "title": "Wendys Uses Palantir AI Tech To Manage Burger, French Fry Inventories; Return On Investment Is Significant",
        "score": 2517,
        "url": "https://www.benzinga.com/news/24/11/41817215/wendys-uses-palantir-ai-tech-to-manage-burger-french-fry-inventories-return-on-investment-is-signifi",
        "content": "",
        "created_utc": 1731164620.0,
        "subreddit_name": "wallstreetbets",
        "comments": 195
    },
    {
        "title": "Daily Advice Thread - November 09, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/apple/comments/1gn7p9s/daily_advice_thread_november_09_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1731150024.0,
        "subreddit_name": "apple",
        "comments": 62
    },
    {
        "title": "Got my family’s old iMac G2 up and running!",
        "score": 234,
        "url": "https://www.reddit.com/gallery/1gndo5a",
        "content": "Now to play club pengui- oh…",
        "created_utc": 1731169287.0,
        "subreddit_name": "mac",
        "comments": 24
    },
    {
        "title": "Mac Mini (non-pro) display support for 4k, since that’s the display resolution you probably already have",
        "score": 70,
        "url": "https://www.reddit.com/r/mac/comments/1gn2vvb/mac_mini_nonpro_display_support_for_4k_since/",
        "content": "I kinda dislike that Apple describes the display performance in terms of displays that are very not common, like 5k and 6k. So I tested with a more common resolution.\n\nI “tested” the display support for the base M4 non-pro Mac Mini with my 4k 144fps display, which has 4 inputs. The mini will drive any 3 of the inputs at once, and the 4th one to be plugged in gets ignored. \n\nFurther, the Mini will connect to two of them at 4k144, but for the third monitor, it will only give 4k60. This is in line with what I was expecting. \n\nAlso, these results are for testing with 4-lane DisplayPort alt mode on the Thunderbolt 4 ports. If you use a non-Thunderbolt hub that has any USB 3 connectivity, that hub is using only two of the lanes for DisplayPort data, and is reserving the other two for USB 3 data. And this apparently causes the 4k frame rate to be limited to 60 FPS from that output. I assume this means that the Mac doesn’t use DSC, in the same way it doesn’t use MST. \n\nSo, use 4-lane hubs (kinda rare, but I can provide a link) or Thunderbolt hubs (kinda $$$) if you’re not going to direct-connect to your higher-performance monitors. \n\nAlso, for power output, the rear ports are required to supply 15w each, and I got all three of them supplying 10-11w simultaneously. On the front ports, one was able to supply 12w, and while doing so, if the other one pulled more than 5w, the port shut down. \n\nWhile all of those were happening, I ran a CPU and GPU benchmark. And doing all that together, I got the power-draw at the wall up to 121 watts. It is rated for 155 watts, and I assume most of what’s left is for the extra cores on the M4 Pro.",
        "created_utc": 1731129420.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "Upgrading from 2019 intel iMac ",
        "score": 47,
        "url": "https://www.reddit.com/gallery/1gnbc9y",
        "content": "Decided to upgrade my intel iMac 🖥️ from 2019 to this. While I would have liked to have more storage than the 512gb my resources are limited. I have external storage so I’m optimistic this will work out for me. ",
        "created_utc": 1731162721.0,
        "subreddit_name": "mac",
        "comments": 17
    },
    {
        "title": "Potential mods for iMac and Mac Mini M4",
        "score": 42,
        "url": "https://www.reddit.com/gallery/1gnl5ol",
        "content": "(I’m not a pro at drawing, modeling, just quick scribbles on my iPad). So, I thought of some potential mods for the two machines, if not already done by someone else.\n\n1. iMac SSD attachment.\n2. Mac Mini bottom base.\n\n",
        "created_utc": 1731189680.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "Apple should name an upcoming version of MacOS \"Calico\"",
        "score": 32,
        "url": "https://www.reddit.com/r/mac/comments/1gmyy0t/apple_should_name_an_upcoming_version_of_macos/",
        "content": "Apple has been naming its MacOS releases after locales in California for some time. \n\nNot sure if we'll ever get MacOS Golden Gate, MacOS Humboldt, MacOS Santa Anita Canyons, MacOS Marina, MacOS Bakersfield Derricks, MacOS Vernon, or MacOS LA River, but I'd love if we could get ***MacOS Calico,*** initially named after the now-mostly-defunct mining town...\n\nBut then, when a minor update of Calico comes later, Apple can throw in a new wallpaper of a Calico cat, and they can go back to naming new MacOS versions after cats! ",
        "created_utc": 1731116225.0,
        "subreddit_name": "mac",
        "comments": 44
    },
    {
        "title": "80% charge limit",
        "score": 13,
        "url": "https://www.reddit.com/r/mac/comments/1gnkqoy/80_charge_limit/",
        "content": "I was disappointed to find Apple didn't add the 80% charge limit feature to the new M4 MacBook Pro. The feature was first introduced with iPhone 15, and expanded to iPad with the current M4 iPad Pro. I assumed they'd add it with this upgrade, but that doesn't appear to be the case. Considering many users use their MacBooks plugged in all day long, of all these devices an 80% charge limit would have made the most sense here. I guess I'll have to stick with CoconutBattery for a while longer. ",
        "created_utc": 1731188521.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "High efficiency core usage and consistently higher SSD readings since installing 15.1 although Apple Intelligence is not enabled. Is my Mac indexing / preparing itself for Apple intelligence, despite it being turned off at the moment?",
        "score": 11,
        "url": "https://www.reddit.com/gallery/1gnhdns",
        "content": "",
        "created_utc": 1731179252.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "14\" MacBook Pro M4 Pro vs M4 Max",
        "score": 10,
        "url": "https://www.reddit.com/r/mac/comments/1gmxi2g/14_macbook_pro_m4_pro_vs_m4_max/",
        "content": "Hi all, just looking for a little guidance please! I'm coming from a 2017 Intel MBP and am looking at either the M4 Pro or M4 Max MBP to be my creative powerhouse. I'm deadset on getting a 14\" and one of the M4 models and preordered the M4 Pro with 14 core CPU and 20 core GPU with 48GB of unified memory. But lately I've been considering cancelling my order and instead going for the M4 Max with 16 core CPU, 40 core GPU and 48GB of unified memory instead. I know either will be a massive step up for me, but I wanna make sure I'm making the right choice and I don't have any prior experience with Apple silicon.\n\nI spend probably 60% of my time doing RAW photo editing in Lightroom Classic, 20% of my time doing music production in Logic Pro X, and 20% of my time video editing in DaVinci Resolve. For most of my work, I think the M4 Pro will be more than capable, but my main concern comes to video editing - particularly when it comes to future-proofing. For video editing, I currently shoot 4K 10-bit 4:2:2 in Sony's XAVC-S codec and I colour grade quite heavily with multiple LUTs and a handful of nodes with various effects like the occasional noise reduction or halation effect. From my research, I gather the M4 Pro should be able to handle all of this pretty well, but I could see myself upgrading to shooting 4K RAW with the same heavy colour grading a few years down the track and wonder if the M4 Pro would be enough to handle that smoothly without having to resort to proxies?\n\nOn another note; I was originally considering jumping straight to the M4 Max for future-proofing seeing as I have the cash for it, but I'm aware that the Max chip in the 14\" has the worst battery life, and seeing as I move around a lot, battery life is very important to me. Not just for how many hours I get out of it, but also for the battery cycle count, as I plan on using this for at least 5+ years and want as much battery as possible without having to plug into anything. So if the M4 Pro can do everything I need now and in the future well enough, I'd very much like to avoid the Max. \n\nI know it's obviously still very early days with these machines, but would love any insight people have as I have no experience with any of the new Apple silicon macs. Sorry this was a long post 😅 Thanks so much in advance!",
        "created_utc": 1731111890.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "Can we consolidate two Macs to one?",
        "score": 8,
        "url": "https://www.reddit.com/r/mac/comments/1gnhii8/can_we_consolidate_two_macs_to_one/",
        "content": "My husband and I have two MacBook Pros with two different Apple IDs. They are both over 10 years old, so we are looking to upgrade. If we were to get one new MacBook, is there a way to copy the info and settings from each computer onto the new one with separate users? And still be logged into our own Apple ids? ",
        "created_utc": 1731179631.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Mac Mini M4 Base vs Macbook Pro 14\" M3 Pro Base",
        "score": 5,
        "url": "https://i.redd.it/is61k2id9xzd1.png",
        "content": "",
        "created_utc": 1731178193.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "MacBook Pro M4 vs M4 Pro Battery Life",
        "score": 4,
        "url": "https://www.reddit.com/r/mac/comments/1gn3zjg/macbook_pro_m4_vs_m4_pro_battery_life/",
        "content": "I’m doing research to pick the right M4 MacBook Pro for me. I’ve got two builds I am deciding between. Everything is the same except one is the M4 and the other is the M4 Pro. The difference in price is $300. I am willing to spend the extra $300 to get better CPU and GPU performance but I think it’s likely I won’t be making use of that extra power.\n\nMy question is, is there any significant impact on battery life between the M4 and M4 Pro? I heard the Pro has less efficiency cores. I’d like to know if getting the Pro is actually a downgrade if I am not going to use the extra power it offers.\n\nThe main thing I would use it for is fusion 360 and cura for 3D printing. I figured the extra CPU and GPU performance would be nice, especially for future proofing. My current device is a 2016 MacBook Pro and I intend to keep my next one for a while too.\n\nThanks in advance!",
        "created_utc": 1731133737.0,
        "subreddit_name": "mac",
        "comments": 13
    },
    {
        "title": "having a nightmare trying to upgrade macbook pro from catalina to big sur someone please help!",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gnl1vu/having_a_nightmare_trying_to_upgrade_macbook_pro/",
        "content": "I have a 2014 Macbook pro and finally cleared plenty of space on it to update to Big sur. It took a while for it to download then just before upgrading it came up with a message saying can’t be upgraded due to something that wasn’t available or could be found. Before I could properly read it, it had gone ahead and done the upgrade.\n\nIt took about 20 minutes, restarted itself lord knows how many times. Then asked me a couple of things to confirm which I did and then nothing happened… it just opened straight back up to catalina on the old system and now having to go through the whole process again by redownloading the update. I’ve have been seeing that loads of people have been experiencing problems upgrading to big sur please can anyone help?? ",
        "created_utc": 1731189384.0,
        "subreddit_name": "mac",
        "comments": 8
    },
    {
        "title": "Apple Magic Keyboard for Mac, third party options",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gniwkq/apple_magic_keyboard_for_mac_third_party_options/",
        "content": "Is there any third party case, or cover options that make it more ergonomic? That tilts the back up, adds wrist support, etc. Im an author, and I love the way Apple keyboards type, and I would love the Touch ID feature when I put my MacBook in desktop mode, but I just can't use an apple keyboard for long the way it is. It's flat, too close to the desk, no wrist support it becomes uncomfortable too quickly. Suggestions?",
        "created_utc": 1731183416.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Time Machine Could Not Complete Backup -\"Some Files Were Unavailable Message\"",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gnfcql/time_machine_could_not_complete_backup_some_files/",
        "content": "MacBook Pro M2 16GB\n\nEver since I upgraded to macOS 15.1 I periodically get this error message. Nothing has changed except for the OS upgrade. This occurs at some point on both Backup drives. Once I see this error message I just perform the backup manually and have no problem. It looks like it is happening when the laptop has gone into sleep state. I never see this problem if I'm using the laptop and a backup happens. I also have no idea which files are causing the problem. Both backup drives have a Bkup partition and no space issues.\n\nAnyone else encounter this problem?\n\nhttps://preview.redd.it/p3jg56w6vwzd1.png?width=1548&format=png&auto=webp&s=b5663e00c7eb907f35823d3a7fee72988e84aaa3\n\n  \n",
        "created_utc": 1731173816.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Users that switched from Windows to Mac\n",
        "score": 1,
        "url": "https://www.reddit.com/r/mac/comments/1gn5ppn/users_that_switched_from_windows_to_mac/",
        "content": "Hello! I'm considering switching to a Mac but am not sure which Mac model would be the best fit. I'm especially unsure about the different types of Mac RAM, specifically the unified memory, and the variety of cores.\n\nHere’s my current daily usage on my Windows PC: I usually have around 20 Chrome tabs open, run Photoshop and Lightroom, do some 1080p to 4K video editing, and listen to YouTube Music in the background. I don’t play games, so that’s not a concern.\n\nMy current Windows PC is admittedly a bit outdated for today’s standards. It does okay for the most part, though it struggles when I open 20 Chrome tabs or when rendering video footage. It’s workable, but I’d like something more efficient.\n\nWhat would you recommend as a Mac or non-portable Apple desktop that can handle my needs and provide a bit of an upgrade? Thanks!\n\nhttps://preview.redd.it/nwsubbq27uzd1.png?width=503&format=png&auto=webp&s=19c0191051646b7cf85cbb810ee7107a4f6b24ed\n\nhttps://preview.redd.it/ujchjcq27uzd1.png?width=788&format=png&auto=webp&s=0fd254b5dc1875f2e9b4951ce34f75ba680c5ddb\n\nhttps://preview.redd.it/2ji9ceq27uzd1.png?width=791&format=png&auto=webp&s=23b502e2365c20ecac479f86c4654ef5ea72076c\n\nhttps://preview.redd.it/83gc0fq27uzd1.png?width=417&format=png&auto=webp&s=a751772f56ba680ee24ba64b74246a7f802c2880\n\nhttps://preview.redd.it/69s97gq27uzd1.png?width=438&format=png&auto=webp&s=cde0bb7ad9bc79009c85554381fb84a8991edbc8\n\nhttps://preview.redd.it/ambuaiq27uzd1.png?width=438&format=png&auto=webp&s=477acf8d69ce9cec457bce980a991a9ba51b9419\n\nhttps://preview.redd.it/4msp5hq27uzd1.png?width=795&format=png&auto=webp&s=44f12d973378f48b8217d9ded6fc3384a64b6fd8\n\nhttps://preview.redd.it/vs94jiq27uzd1.png?width=820&format=png&auto=webp&s=bf5b84df9fd46a0e0146bc8a935f58b181b38509\n\n",
        "created_utc": 1731141140.0,
        "subreddit_name": "mac",
        "comments": 20
    },
    {
        "title": "Exploring thermal mod options for M4 Mac Mini",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gn4l4g/exploring_thermal_mod_options_for_m4_mac_mini/",
        "content": "https://preview.redd.it/pidmr97crtzd1.png?width=544&format=png&auto=webp&s=d3c4740396f8acad896547f1e8bef028f42f0d77\n\nHere's a zoomed-in (sorry for non-matching orientation here) chip/heatsink picture collected from MaxTech's YT video. Visible potential of improving thermals, hence potential perf boost on this already tiny beast. \n\nPotential options I see,\n\n1. bit more spreaded thermal paste for better contact with open copper we see on right.\n\n2. thin copper shims for the memory chips, the past for them is visibly very thick. This could be more like 2018\\~2022 macbook air like solution.\n\n3. liquid metal on the compute side. extremely thin padding around the copper spreader part should offer good insulation for preventing spillover.",
        "created_utc": 1731136211.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Monitor for Macbook air M1",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gn2vrm/monitor_for_macbook_air_m1/",
        "content": "My budget is honestly like $200 (AUD), and I understand that I won't be getting something amazing with my budget. I just need something to last till the end of high school. I looked at previous people asking this, but all of them were out of my budget, or the people asking them were doing things like Photoshop/editing. ?",
        "created_utc": 1731129409.0,
        "subreddit_name": "mac",
        "comments": 0
    }
]