[
    {
        "title": "Super Micro hires new auditor to maintain Nasdaq listing; shares pop 23%",
        "score": 247,
        "url": "https://www.reddit.com/r/stocks/comments/1gukbfk/super_micro_hires_new_auditor_to_maintain_nasdaq/",
        "content": "Embattled server maker Super Micro Computer said on Monday that it’s hired BDO as its new auditor and submitted a plan to Nasdaq detailing its efforts to regain compliance with the exchange. The shares jumped 23% in extended trading.\n\n“This is an important next step to bring our financial statements current, an effort we are pursuing with both diligence and urgency,” Super Micro CEO Charles Liang said in a statement.\n\nSuper Micro is late in filing its 2024 year-end report with the SEC, and said earlier this month that it was looking for a new accountant after its previous auditor, Ernst & Young, stepped down in October. Ernst & Young was new to the job, having just replaced Deloitte & Touche as Super Micro’s accounting firm in March 2023.\n\nSuper Micro said it told Nasdaq that it believes it will be able to file its annual report for the year ended June 30, and quarterly report for the period ended Sept. 30. The company said it will remain listed on the Nasdaq pending the exchange’s “review of the compliance plan.”\n\nShares of Super Micro soared more than twentyfold over a two year period from early 2022 until their peak in March of this year. But the stock has been hammered on troubling news about its compliance with Nasdaq. Once valued at about $70 billion, the company’s market cap was at $12.6 billion at the close on Monday, following a 16% rally during regular trading.\n\nSuper Micro has been one of the primary beneficiaries of the artificial intelligence boom, due to its relationship with Nvidia. Sales last fiscal year more than doubled to $15 billion.\n\nOn Monday, Super Micro announced that it was selling products featuring Nvidia’s next-generation AI chip called Blackwell. The company competes with vendors like Dell and Hewlett Packard Enterprise in packaging up Nvidia AI chips for other companies to access.\n\nSuper Micro was added to the S&P 500 in March, reflecting its rapidly growing business and then-soaring stock price. Less than two weeks after the index changes were announced, Super Micro reached its closing high of $118.81.\n\nThe troubles began within months. In August, Super Micro said it wouldn’t file its annual report with the SEC on time. Noted short seller Hindenburg Research then disclosed a short position in the company, and said in a report that it identified “fresh evidence of accounting manipulation.” The Wall Street Journal later reported that the Department of Justice was at the early stages of a probe into the company.\n\nThe month after announcing its report delay, Super Micro said it had received a notification from the Nasdaq, indicating that the delay in the filing of its annual report meant the company wasn’t in compliance with the exchange’s listing rules. Super Micro said the Nasdaq’s rules allowed the company 60 days to file its report or submit a plan to regain compliance. Based on that timeframe, the deadline was Monday.\n\nSource: [https://www.cnbc.com/2024/11/18/super-micro-hires-new-auditor-to-maintain-nasdaq-listing-shares-pop.html](https://www.cnbc.com/2024/11/18/super-micro-hires-new-auditor-to-maintain-nasdaq-listing-shares-pop.html)",
        "created_utc": 1731976303.0,
        "subreddit_name": "stocks",
        "comments": 93
    },
    {
        "title": "Qualcomm says it expects $4 billion in PC chip sales by 2029, as company gets traction beyond smartphones",
        "score": 178,
        "url": "https://www.reddit.com/r/stocks/comments/1gv9g66/qualcomm_says_it_expects_4_billion_in_pc_chip/",
        "content": "Qualcomm said on Tuesday that it expects its push into new markets to generate an additional $22 billion per year by 2029.\n\nOf that amount, roughly $4 billion will come from PC chips, Qualcomm said at its investor day on Tuesday. The chipmaker just introduced PC processors earlier this year, when it released Snapdragon X for Windows devices.\n\nThe latest forecast marks an important milestone for Qualcomm CEO Cristiano Amon, who took over the company in 2021 with a promise to get past a reliance on smartphones. In fiscal 2024, Qualcomm’s handset business reported $24.86 billion in sales, about 75% of its entire chip business.\n\nQualcomm also said on Tuesday that automotive revenues would rise about 175% by 2029 to $8 billion, of which 80% is tied to contracts that have already been secured.\n\n*″*We have been on this trajectory realizing that the technologies we have developed over the many years can be very relevant to a number of different industries beyond mobile,” Amon said at the investor event.\n\nAnother $4 billion in revenue will come from industrial chips and $2 billion will come from chips for headsets, a category Qualcomm calls XR. About $4 billion of the forecast is a catch-all for other chip sales, like those for wireless headphones and tablets.\n\nQualcomm shares are up 16% this year, trailing the Nasdaq, which has gained 26%.\n\nQualcomm grew rapidly over the past decade as its modems and processors became essential parts for high-end smartphones, especially those running Google Android. Qualcomm also sells modems and related parts to Apple for its iPhones.\n\nBut the company has warned investors that Apple could choose to stop buying Qualcomm parts as soon as 2027. Qualcomm said on Tuesday that its growing businesses will more than offset any losses from Apple.\n\nQualcomm’s strategy under Amon has been to use the technology its developed for its handset chips, like modems, processors, and AI accelerators, in new markets, including cars, PCs, and virtual reality. The investor event was the first time in years that the company has given a forecast for those new markets. Qualcomm said its total addressable market is as large as $900 billion.\n\n“We put a strategy in ’21, and we’re not changing our strategy,” Amon said.\n\nLaptop and desktop chips are currently dominated by Intel, which has over 70% percent of the market, according to Mercury Research. Intel reported $29 billion in PC chip sales in its 2023.\n\n“The competitive landscape changed between the Windows and Macs,” Amon said, referring to Apple’s move in 2020 to switch from Intel to its own processors. “We saw that as an opportunity, especially as the ecosystem did not have confidence in the existing players to actually deliver a solution.”\n\nThe forecast for XR headsets also hints at the growth potential of the VR market over the next five years. Qualcomm supplies chips to many of the top headset makers, including Meta for its Quest and Ray-Bans products.\n\nWhen it comes to artificial intelligence, Qualcomm calls itself an “edge AI” company, in contrast to cloud-based AI that’s typically powered by Nvidia processors. Company officials didn’t rule out introducing data center products in an interview with CNBC.\n\nQualcomm suggested that its mobile chips will be able to run the kind of advanced AI that’s restricted to large server farms today, an indication that that company may benefit from the AI boom down the road as the technology becomes more efficient.\n\n“What you can run on the cloud last year, you can run on the device this year,” Durga Malladi, Qualcomm’s senior vice president in charge of planning, said at the event.\n\nSource: [https://www.cnbc.com/2024/11/19/qualcomm-says-it-expects-4-billion-in-pc-sales-by-2029.html](https://www.cnbc.com/2024/11/19/qualcomm-says-it-expects-4-billion-in-pc-sales-by-2029.html)",
        "created_utc": 1732054126.0,
        "subreddit_name": "stocks",
        "comments": 30
    },
    {
        "title": "C3.ai (AI) Company Analysis",
        "score": 37,
        "url": "https://www.reddit.com/r/stocks/comments/1gv3vio/c3ai_ai_company_analysis/",
        "content": "1. Financial performance:\n\nRevenue of $86.6 million in Q4 FY2024, up 20% year-over-year; full-year revenue of $310.6 million, up 16%.\n\nSubscription revenue accounted for 92% of revenue and grew 41% in the fourth quarter, representing a significant source of revenue and demonstrating strong stability and sustainability.\n\nGross margin performance was good: GAAP gross margin of 60% and non-GAAP gross margin of 70%.\n\nDespite still having a net loss (GAAP loss per share of $(0.59), non-GAAP loss per share of $(0.11)), the Company has strong cash reserves ($750.4 million) and achieved $18.8 million in positive free cash flow.\n\n2. Market Performance:\n\nMarket presence is diversified across federal, defense, aerospace, oil & gas, manufacturing and other sectors with a diverse customer base.\n\nIn FY2024, 191 agreements were signed, up 52% year-on-year, and its market position was further strengthened by cooperation with strategic customers such as the U.S. Air Force and the Navy.\n\n3. Industry position and product innovation:\n\nWith a first-mover advantage in enterprise AI software, [C3.ai](http://C3.ai) has been widely adopted in 19 industries, demonstrating strong adaptability and scalability.\n\nC3.ai has been widely adopted in 19 industries, demonstrating strong adaptability and scalability. C3.ai has launched C3 Generative AI, enhanced product innovation, and promoted pilot protocols in multiple industries, demonstrating continuous progress in technical capabilities.\n\n4. Growth Potential:\n\nDoubled revenues in the federal market, demonstrating high acceptance of its solutions by government customers.\n\nFY 2025 revenue growth expected to reach 23% with a target range of $370 million to $395 million, with first quarter revenue guidance of $84 million to $89 million signaling accelerated growth.\n\nC3.ai performed well in the enterprise AI market, particularly in subscription revenue and expansion in the federal market. While losses remain, healthy cash flow and reserves provide strong support for the company's future growth. As demand for AI solutions continues to grow in both the enterprise and government sectors, C3.ai is well positioned to capture a larger share of the market in the future through its product innovation and market penetration.\n\nInvestment outlook: I think investors who are optimistic about the AI market in the long term can keep an eye on C3.ai's development.",
        "created_utc": 1732040186.0,
        "subreddit_name": "stocks",
        "comments": 38
    },
    {
        "title": "AMCOR (AMCR) AND BERRY (BERY) TO COMBINE IN AN ALL-STOCK TRANSACTION, CREATING A GLOBAL LEADER IN CONSUMER & HEALTHCARE PACKAGING SOLUTIONS",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1guvy9k/amcor_amcr_and_berry_bery_to_combine_in_an/",
        "content": "[Article link:](https://finance.yahoo.com/news/amcor-berry-combine-stock-transaction-092500028.html)\n\n# Article Summary:\n\n* Merger Announcement: Amcor and Berry Global Group have entered into a definitive merger agreement, combining in an all-stock transaction.\n* Shareholder Details: Berry shareholders will receive 7.25 Amcor shares for each Berry share, resulting in Amcor shareholders owning 63% and Berry shareholders 37% of the combined company.\n* Strategic Benefits: The merger aims to create a global leader in consumer packaging solutions, enhancing innovation capabilities and sustainability efforts.\n* Financial Impact: The merger is expected to generate $650 million in annual earnings synergies and over 35% adjusted cash EPS accretion.",
        "created_utc": 1732019199.0,
        "subreddit_name": "stocks",
        "comments": 4
    },
    {
        "title": "I think my friend sold me my calls on $SMCI",
        "score": 1593,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gumcrx/i_think_my_friend_sold_me_my_calls_on_smci/",
        "content": "I swear on my mother’s eyes. I’m sitting there like a fing genius looking at my hood gambling account, staring at the SMCI chart and reading all this bullshit regards are spewing on twitter about the stock getting delisted. Luckly, I just came out of a similar trade on B.Riley and kinda figured if those frauds can get away with not filing financials on time for over 180 days and they are still trading, there is no way SMCI will get delisted.\n\nI buy 250 $34.5 strike weekly calls on SMCI at $0.50 a pop. That’s a \\~$12,500, baby position babbyyy. Why $34.5 calls? idk whats funnier than $34? $34.5. Also I looked at where it dropped when EY announced they wouldn't proceed as their auditors amd $34.5 is about the level they closed at that day. Finally, $34.5 is within my personal risk tolerance. guh\n\nToday, I’m minding my own business, scrolling Reddit, eating a sandwich, watching Ana De Armas AI Porn, minding my own business. My phone buzzes, and it’s my buddy. This guy texts me out of nowhere, “Man, I think I’m fucked. I sold $34.5 naked calls on SMCI this week. Thought it’d be easy money.”\n\nSo I’m like, waiiiiiiiiiiiiiit.. I check my broker app and look at the open interest on these contracts, and my jaw hits the goddamn floor. The open interest is 257. lol. **257 contracts**, and your boy here owns **250** of them. I’m the goddamn other side of his trade! I'm the guy that said yuuuuuuuuuup I'll take those off your hands sir. \n\nIf everything holds up and SMCI opens strong tomorrow, this guy is about to be bent over a financial barrel, down 500% at open (das what the app is saying rn at least). He thought he was playing it safe, slinging naked calls like he’s DFV or something, and now he’s unknowingly writing me a fat f\\*\\*\\*ing check for $62,000 (so far).\n\nHe knows I bought SMCI calls. I mentioned it in passing, like, “Yeah, I’m in on SMCI this week.” But he doesn’t know **how many** or **what strike**. I didn’t tell him I went full-blown degenerate with $12.5K on a strike so far out of the money.\n\nNow I’m sitting here, “Do I tell him?” Like, “Hey bro, funny story, you’re about to owe me your next three paychecks because I’m holding all the cards—and by cards, I mean your fuckiing calls.” Or do I keep my mouth shut and let the market gods do what they do? I feel bad, but not that bad, you know? Trading is a tough game isn't it? No mercy.\n\nSo that’s where I'm going to hold a little past open and then I’m cashing in big-time, and he’s gonna be selling plasma to cover his losses. What would you guys do? Do I come clean, or let him find out the hard way? Either way, I’m buying a steak dinner tomorrow. Maybe I’ll even let him smell it. Also a hooker.",
        "created_utc": 1731982227.0,
        "subreddit_name": "wallstreetbets",
        "comments": 270
    },
    {
        "title": "Let it $SNOW",
        "score": 626,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gv77n8/let_it_snow/",
        "content": "Let's face it, $SNOW has been one of the most disappointing-performing stocks of the year. While $NVDA is riding the AI wave, and $MSTR is riding the BTC boom, $SNOW has been sitting here like a fat child eating cake and shitting himself in the process.\n\nBut this is all about to change, and let's discuss why:\n\n1. Winter is coming, and people will associate $SNOW with warm fuzzy feelings while drinking hot cocoa by the fireplace. This is inherently bullish.\n2. $SNOW has historically always beaten revenue estimates (bullish), and 88% of the time it beats EPS estimates. I expect this time to be no different (beat both revenue and EPS), however this is never enough to rally this stock (more below).\n3. $SNOW has been hiring like crazy. I know because I've applied twice so far and been rejected both times (smart choice on their part - bullish), which means they're being picky and likely receiving a lot of strong candidates to improve their offering (extra bullish). I've been keeping an eye on all open positions, along with how long they're open for, and new ones that pop up. Everything I've seen indicates a hiring frenzy to expand into more markets, take on new clients, etc.\n4. $SNOW tends to retain their customers and strengthen existing relationships. Just today they announced a stronger partnership with $MSFT by releasing a new platform to work with $MSFT Power Platform (bullish AF)\n5. In May, $SNOW appointed Sridhar Ramaswamy as the new CEO, who is expected to focus on enhancing the company's AI (bullish) product strategy.\n6. Going off the point above, the actual real-world numbers of customers using their AI product is genuinely exploding, and we all know how bullish AI is in today's market. \n\n**Q**: Ok, but why is THIS time different than all the other earnings reports when $SNOW crashed and burned?\n\n**A**: Like I said in Point 2 above, we Snowflakians always beat revenue and EPS predictions, but for some reason the stock always goes down. The reason behind this - as is the consensus of analysts - is that investors are cautious against how much money $SNOW is pouring into their products, R&D, and operating costs. This quarter we should start to actually see the results of these investments, returning strong usage statistics and a healthy increase in overall adoption from the industry.\n\n**Q**: Ok, but what about, like, Databricks and stuff?\n\n**A**: Databricks can suck my nuts (they also haven't hired me yet - I'm trying to get in before they go public for those sweet stock gainz)\n\n**My Positions** (Screenshot below):\n\n200 Shares $SNOW @ $127.95\n\n10x 128C Exp 12/06/24 @ $8.36\n\n5x 160C Exp 06/20/25 @ $10.47\n\nhttps://preview.redd.it/t40qeg1d5x1e1.jpg?width=1226&format=pjpg&auto=webp&s=983664d9a5f3edd36636d54711c56d8d63a75620\n\nThis is not financial advice. Always inverse WSB.",
        "created_utc": 1732048483.0,
        "subreddit_name": "wallstreetbets",
        "comments": 346
    },
    {
        "title": "Wallstreet forecasts 'normal' year for stocks in 2025 - Some guy on the Internet disagrees.",
        "score": 106,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gusfdx/wallstreet_forecasts_normal_year_for_stocks_in/",
        "content": "According to yahoo finance [here](https://finance.yahoo.com/news/wall-street-forecasts-normal-year-for-stocks-in-2025-after-historic-rally-182124444.html) and [here](https://finance.yahoo.com/news/goldman-sachs-forecasts-p-500-054053974.html) several big financial institutions see the S&P moderating to a \"normal\" growth rate with the hype over AI starting to wane and a likely transition into other sectors. These are very reasonable assessments, if you make your prognosis on the base of efficient market behaviour.\n\nSo why would some rando - yours truly - troll these halls of wisdom with a random theory of what is going to happen? The answer is simple: That is what we do on WSB. Also, I have bullet points:\n\n  \n1st: The efficient market is dead. After the election massive amounts of retail investors have swept into the stock market and cryptocurrencies. According to [some video I saw on the internet](https://www.youtube.com/watch?v=P03PfYgNjmw&list=PLUl4u3cNGP63B2lDhyKOsImI7FjCf6eDW&index=20) when large amounts of retail investors get into the market, the \"efficiency\" suffers, meaning, the market does not find the right prices for equities and beins to overprice them.\n\n  \n2nd. According to [another video on the internet](https://www.youtube.com/watch?v=a5PF2PcElV0&list=PLUl4u3cNGP63B2lDhyKOsImI7FjCf6eDW&index=19) (just coincidentally from the same \"youtuber\") the human brain is evolutionary not equipped, to stop greeding after more profit, once it started seeing progress. This is true for professional investors and even much more so for significantly less sophisticated individuals without the saftey net of a risk desk. This means the people, who stream into the stock market and cryptocurrencies right now, will not stop driving the prices up.\n\n  \n3rd. I´ve done my own research (watching those videos on the internet) and it says, that only two options stop us in those tracks: Learning through losses to take less risk and price more realistically or going broke. I find \"my research\" heavily supported in this subreddit.\n\n  \n4th. Market efficiency will further erode by currently unpredictable effects of an unknown, but likely rather disrupting policy. This will cause for some investors the pain, necessary to adapt or leave the market, for others it will cause massive gains, which will draw even more less sophistcated traders in.\n\n  \n5th. Given the limited sophistication, these investors are likely to focus on a limited range of assets, which are well represented in the media: AI and cryptocurrencies. This will lead to a continuing strong and overperforming bull run, drawing other investments up in it´s wake, but only on a limited scale.\n\n  \n6th. Companies will use this opportunity to launch extremely well doing IPOs.\n\n  \n7th. This bull run will end in a crash, because - according to my research on the internet and a couple of decades watching the hoax establishment news - it always does. Keep in mind, that this event does not necessarily have to happen in 2025.\n\n  \n8th. That market crash will wipe out massive amounts of wealth, ruin existences and make other filthy, filthy rich. Usually the latter are those, who were already filthy, filthy rich before. Unsophisticated investors will leave the market or be forced to leave and the markets become significantly more efficient again.\n\n  \n7th. Doing my own research means, I have to put foward conclusions. I weighed mine at least for several minutes while writing this text, so they are highly reliable predictions, but I still warn anybody from mistaking them for financial advice or antyhing else than demigodly prohecies:\n\n  \n\\- The crash of the stock market will not lead to an extinction event, but a selection event. While companies will get wiped out, those, which survive will dominate the stock market just like the mag7 now, which are basically the survivors of the dotcom crash.\n\n  \n\\- The crash of the cryptocurrency market will lead to an extinction event. It will wipe out most of cypto investors and funds/ETFs. This is due to the simple fact, that the market is way to much of a single economic niche. After that it may recover up to a point.\n\n  \ntl;dr: The efficient market is dead - long live the goldrush.",
        "created_utc": 1732004236.0,
        "subreddit_name": "wallstreetbets",
        "comments": 78
    },
    {
        "title": "$VRT ➡️ S&P 500: Coming Soon",
        "score": 94,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gv6504/vrt_sp_500_coming_soon/",
        "content": "Vertiv ($VRT) has been ripping all year and is up 190% YTD fueled by continuous AI & data center demand.  I think it has a high likelihood of being **added to the S&P 500 during the Q4 rebalancing** which will be announced Dec 6th. I'll share a brief overview of $VRT and then my thinking behind the S&P 500 inclusion.\n\n*Position*: $VRT shares, 2025 & 2026 leaps  \n*Disclaimer*: not financial advice, do your own research  \n*Other analysts if you don't trust random redditors:*   \n\\- RadnorCapital on X  \n\\- Institutional analysts: [NASDAQ $VRT](https://www.nasdaq.com/market-activity/stocks/vrt/analyst-research)\n\n# Company Analysis\n\n**High level company overview:**  \n[Vertiv Holdings Co.](https://www.vertiv.com/en-us/) *engages in the design, manufacture, and service of critical digital infrastructure technology that powers, cools, deploys, secures and maintains electronics that process, store and transmit data. It also offers power management products, thermal management products, integrated rack systems, modular solutions, and management systems for monitoring and controlling digital infrastructure.* \n\n**Leadership team:**\n\n[Mr. Albertazzi?? absolute stud + italian](https://preview.redd.it/gluw4pmapw1e1.png?width=2552&format=png&auto=webp&s=9514eeb811f9d6fe57a756932c46dc81c9548d82)\n\n**Financial Overview**:  \nStrong financials across the board and continue to raise guidance. 2024 guidance confirmed, data is here:\n\nNet Sales: $7,805M, organic up 14%  \nAdj. Operating Profit: $1,485M  \nAdj. Operating Margin: 19.0%, up 370 bps  \nAdj. Free Cash Flow: $1,000M\n\nAnother overall view from today's investor day presentation, the full deck can be found here: [Nov 18 - Investor Day](https://s23.q4cdn.com/959471387/files/doc_presentations/Vertiv-2024-Investor-Event-Presentation.pdf).\n\n[Balance Sheet Metrics](https://preview.redd.it/ed3ayuigow1e1.png?width=2552&format=png&auto=webp&s=8471b4d6ccead1f63e7929882fe38b85ed9930f1)\n\nFundamentally I think they have some **key advantages** that will allow for them to continue to dominate the market:\n\n(1) AI-Demand & Margin Expansion: Multiple levers for continued further expansion of adjusted operating margin to \\~25% in 2029 (Slide 14 & 36)  \n(2) Product Leadership: Vertiv services provide unmatched critical digital infrastructure support (Slide 26-28)  \n(3) Flexible Capital: $12.5B of capital deployment through 2029. Up from $6.5B at Nov 2023 Investor Day (Slide 48)  \n(4) Energy Demand: Power and cooling capabilities are already crucial today, as energy demand surges, efficiency and cost will become a major factor\n\n**Risks**  \n\\- AI Bubble: tbh I'm not a believer in this narrative but its something to consider since their sales are driven by AI related companies  \n\\- $NVDA: $VRT trades with $NVDA (so does the market in a way) but if you pull up the charts there is high correlation. Also $NVDA ER is tomorrow  \n\\- Valuation: They trade at a 81.86 PE ratio \n\n# S&P 500 Inclusion\n\nThe S&P 500 index rebalancing occurs 4x/year with the next one coming up. [SP Global](https://www.spglobal.com/en) announces the additions to the index which will replace companies that have underperformed and will be removed.\n\nS&P rebalancing presents an opportunity to trade based on predictions of which companies will be added/removed as there is potential for a \\~5-10% price increase. In short, the rebalance forces institutions who follow certain indexes to buy the stock as it is now in the index & generally there is a positive impact on company's reputation.\n\nAlthough the selection committee has requirements for eligibility which can be found here: [SP 500 Criteria](https://www.spglobal.com/spdji/en/documents/methodologies/methodology-sp-us-indices.pdf), there is a bit of thematic flexibility. By definition the index is \"a market cap-weighted index of US large- and mid-cap stocks.\" Typically companies need to be $18B or larger in market cap and historically profitable. Negative trailing EPS, high volatility, recent IPO, etc. may restrict a stock from eligibility.\n\nBelow is the **SP 500 index sector weighting** (as of Nov 14):  \nTechnology: 33.32% | Financial Services: 13.19% | Consumer Cyclical: 10.80% |. Healthcare: 10.54% | Communication Services: 9.03% | Industrials: 7.58% | Consumer Defensive: 5.56% | Energy: 3.44% | Utilities: 2.54% | Real Estate: 2.17% | Basic Materials: 1.83%\n\n**Why Vertiv ($VRT)?**\n\n* Thematic fit: the index is focused on representing the best large/mid cap companies in the US and $VRT fits the industrial/energy category (the industry will get more love under the new administration), it fits the innovation/technology aspect, and of course the energy/AI theme \n* Solid earnings and growth: self-explanatory in the company financial analysis above\n* Strong momentum: this is important and imho, an underrated factor. A great example of this is Palantir ($PLTR) which btw pumped like 10% off of the news. Now I know r/wallstreetbets has a love/hate relationship with $PLTR but put that aside for now (it was added to the index around $35)\n\n**Rebalance Timeline**: [Q4 2024 ](https://www.nyse.com/publicdocs/ICE_NYSE_2024_Yearly_Trading_Calendar.pdf)  \n\\*based on the usual schedule, check the website for official announcements\n\n* Quarter End Date: Dec 31\n* Announcement Date: Early December (typically 1st week)\n* Rebalance Date: Dec 20 (typically 3rd Friday)\n\n# Closing Note\n\nI will be waiting until after NVIDIA reports earnings on 11/20 to make any adjustments to this trade or to rethink my thesis. Would recommend this especially if you do not already have a position in $VRT. I could be completely wrong. God speed!\n\n\nPOST NVIDIA ER UPDATE (Edit 11/21)\n- $NVDA great earnings, beat expectations, and currently trading green in the pre market\n- $VRT might not pull back at all since the momentum is continuing and they literally talked about the need for data centers and cooling solutions on the ER\n- IF and that’s an IF we pull back, look for the $127/$130 level to buy in\n",
        "created_utc": 1732045774.0,
        "subreddit_name": "wallstreetbets",
        "comments": 76
    },
    {
        "title": "Microsoft Unveils Azure AI Foundry, Hints at Collaboration with Palantir",
        "score": 40,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gv0ycm/microsoft_unveils_azure_ai_foundry_hints_at/",
        "content": "Microsoft has introduced the Azure AI Foundry, a unified platform designed to streamline its enterprise AI services. This initiative consolidates various AI tools and services, aiming to simplify the deployment and management of AI solutions for businesses. By integrating offerings such as Azure Machine Learning, Azure OpenAI Service, and Azure AI Studio, the Azure AI Foundry provides a cohesive environment for developing, training, and deploying AI models. This consolidation is expected to enhance efficiency and reduce complexity for enterprises leveraging Microsoft's AI capabilities.\n\nAdditionally, the presence of the subdomain \"microsoft-partner.palantirfoundry.com\" hints at a potential collaboration between Microsoft and Palantir. This suggests that Palantir Foundry's platform may be integrated with Microsoft's ecosystem, which could enhance joint offerings and create synergies in enterprise AI and analytics solutions. Such a partnership would likely be a positive development for Palantir, further cementing its role as a key player in enterprise software.\n\nSource - [https://techcrunch.com/2024/11/19/microsoft-brings-together-its-enterprise-ai-offerings-in-the-azure-ai-foundry/](https://techcrunch.com/2024/11/19/microsoft-brings-together-its-enterprise-ai-offerings-in-the-azure-ai-foundry/)",
        "created_utc": 1732033103.0,
        "subreddit_name": "wallstreetbets",
        "comments": 8
    },
    {
        "title": "Qualcomm expects $12bn in automotive and PC chip revenue in five years?",
        "score": 30,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gv9gg8/qualcomm_expects_12bn_in_automotive_and_pc_chip/",
        "content": "Qualcomm expects $8 billion in automotive chip revenue and $4 billion in PC chip sales by fiscal 2029, it said at an investor event held in New York on Tuesday.\n\nSan Diego, California-based Qualcomm is the world's top supplier of mobile phone chips that connect handsets to mobile data networks. It makes money off both the chips themselves and also licensing fees for its portfolio of 5G and other wireless technologies.\n\nThe company has been working to diversify its offerings, winning deals with companies including General Motors to supply chips for the dashboards and driver-assistance systems in vehicles, and collaborating closely with Microsoft and PC makers to compete against Intel and Advanced Micro Devices in the laptop market\n\n[https://finance.yahoo.com/news/qualcomm-expects-12-billion-revenue-213537340.html](https://finance.yahoo.com/news/qualcomm-expects-12-billion-revenue-213537340.html)",
        "created_utc": 1732054144.0,
        "subreddit_name": "wallstreetbets",
        "comments": 11
    },
    {
        "title": "GigaCloud ($GCT): Buying When Nobody Wants It",
        "score": 6,
        "url": "https://www.reddit.com/r/investing/comments/1gv31pp/gigacloud_gct_buying_when_nobody_wants_it/",
        "content": "**TL;DR:** I believe [GigaCloud](https://www.gigacloudtech.com/)'s stock will experience a price rally driven by strong fundamentals and its current undervaluation. I'm bullish on its business model, economic potential, and attractive pricing. I’m not expecting a 5x or 10x rally, but I do think a 2x gain is reasonable with a solid margin of safety. A DCF analysis indicates a fair price of $40. From a technical perspective, the company has delivered solid earnings growth quarter after quarter and has had years to consolidate, forming a large cup pattern.\n\nI’m holding 105 LEAPS for '26 and '27. This stock could potentially double, or it could drop to zero. Take it with a huge grain of salt. All information shared here is purely my opinion and should not be considered as advice. I’ve lost money, except for IonQ where I got lucky.\n\n# Introduction\n\n**Company:** GigaCloud Technology  \n**Ticker:** $GTC  \n**Industry:** Online Merchandise/E-Commerce Platforms  \n**Price:** $22.96\n\nOver the past few days, I’ve been diving deep into a small, sub-$1B market cap company, and after reviewing various opinions on $GTC online, I wanted to share my own thoughts.\n\nThe company has faced two short reports from [Grizzly](https://grizzlyreports.com/gigacloud-technology-inc-another-china-hustle-inflating-key-metrics-using-undisclosed-related-party-shell-companies/) and [Culper Research](https://x.com/CulperResearch/status/1707392689367347709), alleging that GigaCloud inflates its numbers using shell companies, reports costs as revenue, and falsifies addresses in official documents. While this is mostly boring stuff, it’s certainly had an impact, with the stock dropping by 50% since the reports were released. The company did [respond](https://investors.gigacloudtech.com/news-releases/news-release-details/gigacloud-technology-inc-responds-short-seller-report-0) to the allegations, and has requested to dismiss the class action filed by investors.\n\nAfter conducting my own research, I have a different view. I see signs of a potential compounder in the making, and I believe the current valuation makes it a worthwhile bet. I won’t go into too much detail here, as that would be boring to read, but I’ll keep it brief. This isn’t meant to be a detailed thesis, just a quick summary of the key points behind my bullish outlook.\n\nYou can find all the relevant information in the company’s annual report, the CEO [interview](https://x.com/CulperResearch/status/1707392689367347709) on Seeking Alpha, and several third-party articles. I have more insights to share, but it would be too long to write it out in a single post.\n\nThere’s also some speculation about $GCT following a similar technical pattern to Amazon after its IPO, and I won’t dive into that here, as it’s a bit far-fetched. What’s more interesting to me is the comparison between Amazon’s [early days](https://techcrunch.com/2017/06/28/a-look-back-at-amazons-1997-ipo/) in the fragmented book market and Giga’s furniture business. Both industries were large and fragmented when these companies started, with a chance to take a lot of market share, and that’s a key factor in my outlook on $GTC’s potential.\n\n# Operations\n\nThe company operates a platform called [GigaB2B](https://www.gigab2b.com/), where it connects businesses with products manufactured in industrial countries like China, Vietnam, India, etc. While selling products itself isn't particularly flashy, the strength of GigaCloud's model lies in the value it provides beyond simple merchandising. This platform doesn't rely on the typical low margins associated with standard product sales.\n\nGigaB2B connects large businesses: the sellers are manufacturers, and the buyers are companies looking to sell inventory to their own customers. What sets the platform apart is its ability to meet the needs of foreign businesses that lack affordable ways to directly reach their target customers, and U.S. buyers looking to trade these essential products. By consolidating this process into one channel, GigaCloud effectively simplifies international trade and logistics for businesses that might otherwise struggle to connect.\n\nMany of the visits occur through API connections, as GigaCloud functions as a digital warehouse, payment system, and ERP platform, linking their customers' systems directly to their store. Additionally, they offer a [Shopify app](https://apps.shopify.com/giga) to provide further value.\n\nI found this [article](https://www.furnituretoday.com/opinion/the-inventory-problem-how-e-commerce-thrives-where-brick-and-mortar-struggles-guest-contributor/) incredibly helpful to understand the business.\n\n# Tariffs and Bad market\n\nThe company specializes in selling furniture, and while the housing market is currently in a challenging position, this sentiment is already reflected in the stock price. However, I believe that despite the bleak outlook for housing, consumers might still experience some relief as central banks globally look to implement quantitative easing by lowering interest rates. As sad as it may sound, even though home buyers may not be able to move, people may still have more disposable income to spend. With this extra cash, rather than moving to a new home, many could choose to invest in improving their current living space by purchasing more home goods.\n\nRegarding tariffs, I'm not overly concerned. I believe the negative implications of tariffs are already priced into the stock, based on the assumption that tariffs will severely hurt companies and overshadow their profits. The new rules and tariffs primarily affect drop-shippers from China to the U.S., where there’s no middleman involved, just direct shipping of small items from platforms like Temu or Alibaba. However, since GigaCloud operates its own warehouses in the U.S. and Europe, it functions as both the buyer and seller, insulating itself from the negative effects of tariffs on drop-shipped goods.\n\nWe’ll have to wait for more stability to understand the concrete changes, but I think the negative effects of these factors have been significantly overblown, and that they will turn out to be much ado about nothing for this stock. Of course, I could be proven wrong. I'm not a tax expert, but the company's outlook remains bullish, as they continue to demonstrate confidence in their ability to grow and expand despite macroeconomic challenges, as highlighted in their recent earnings calls.\n\n# Catalysts\n\nThe acquisition of [Noble House](https://noblehousefurniture.com/), a smaller U.S. furniture company, is expected to break even by the end of 2024, with financial benefits becoming apparent in the first two quarters of 2025. Noble House brings thousands of SKUs to the platform, contributing to the company’s growing sales and expanding its market share.\n\nGiven the current political climate, with an incoming administration focused on deregulation and the potential for increased market confidence through lower interest rates, M&A activity is anticipated to surge in the coming year. In a fragmented industry with significant market share still up for grabs, each incremental acquisition, like Noble House (if proven to be accretive), could boost revenue and increase the platform's overall value.\n\nMoreover, with the company holding relatively substantial cash reserves, it is in a strong position to pursue further [acquisitions](https://www.furnituretoday.com/financial/acquistion-complete-gigacloud-finalizes-85-million-deal-for-furniture-maker-and-retailer/), which could accelerate its growth trajectory. This makes it well-positioned to capitalize on an environment ripe for consolidation.\n\n# The Street's view\n\nWhile many bear reports focus on claims that the company is outwardly 'fake', alleging that its numbers, employees, and balance sheet are fabricated, few of these critiques dive into the operational side. They rarely discuss why the business model could stagnate in the coming years or how increased competition might adversely affect GigaCloud.\n\nOn the other hand, bulls tend to align with the company's outlook, focusing on current data. They highlight the company's relatively 'cheap' valuation, as indicated by a low PE ratio and price-to-enterprise value, while also emphasizing the expected growth rate as the basis for their bullish thesis. This perspective often isolates GigaCloud within its current ecosystem of partners and the furniture market it serves.\n\nHowever, I take a different approach. When analyzing GCT, I base my thesis on management’s past actions and their long-term vision. Similar to how Costco and Amazon started with small operations, building up one warehouse at a time and selling limited goods, GigaCloud may follow a similar path. These companies benefited from economies of scale as they grew, and I believe GigaCloud has the potential to do the same. By focusing on niche markets, particularly large and 'bulky' goods that many competitors avoid due to logistical complexities, the company is tapping into a profitable, under-exploited area. With growth, this core competency could enable GigaCloud to achieve scaled economies and strengthen its market position.\n\n# Scaled economies\n\nThe potential for [scaled economies ](https://www.incrementaleconomics.com/scale-economies-shared/)is incredibly valuable, as it not only reduces costs and improves unit economics but also expands margins, making the company more attractive to investors. This, in turn, could lead to higher valuations, particularly through more bullish discounted cash flow models due to the retention of cash. However, what's even more significant is how these savings and accumulated cash could be passed along to customers, or \"users\", on the platform. This is a key factor behind Costco's success, where they leverage bulk products and membership fees to earn revenue, or Amazon's ability to offer competitive prices on its platform.\n\nFor GigaCloud, now focused on the furniture sector, the resulting lower unit economics could be passed on to partners, enhancing the platform's appeal. By offering better value to their customers, GigaCloud can potentially strengthen the overall ecosystem, by passing on the cost benefits.\n\nAs of the previous quarter’s presentation, the company has reached a significant milestone with 1,051 active sellers, manufacturers based in various countries, and 8,535 buyers, who purchase bulk goods at B2B prices and then mark them up for sale in markets like the U.S. and Europe.\n\n# AI Story\n\nComing from Palantir at the start of this year, to IonQ, and now Giga, the tech seems to deteriorate in the fastest fashion. However, while Giga is not a \"tech\" company in the traditional sense, the views on AI and Giga, especially from Wall Street, strike me as pretty amusing.\n\nBears focus on the platform’s chat capabilities and argue that Giga lacks AI features. I don’t think chat is that important, and LLMs would be better used for back-end logistics. Giga might not have the most advanced models or software stack, but they use what they have well for their industry. The company handles a lot of goods and, through their software and existing logistics systems, calculates the most efficient way to send them from other countries.\n\nManagement talks about AI, but not in the same way S&P 500 CEOs do. The tech’s been around for over 30 years, and a lot of companies have been quietly using it in the back end for things like pricing and routes. I get the bear argument that Giga’s trying to piggyback on the AI trend, but I disagree. The company’s been using those systems behind the scenes long before the current AI hype became mainstream and was used by every CEO.\n\n# Technicals\n\nGigaCloud's current P/E ratio stands at 6.9, which is notably low for a company with growing revenue and an expanding user base, in my opinion.\n\nThe most important fact is that [Cramer](https://www.youtube.com/watch?v=n4Au0PfFbc0) has raised concerns about the company and published a bearish video on it six months ago.\n\n# Closing Remarks\n\nAs mentioned earlier, many influential voices are bearish on the stock, citing concerns such as tariffs, potential China-related scams, and weakening consumer demand. However, I tend to buy when sentiment is negative, as long as the short-term fundamentals remain solid. While there's always the possibility that things could go wrong, I've incorporated this risk into my overall risk/reward analysis.",
        "created_utc": 1732038196.0,
        "subreddit_name": "investing",
        "comments": 5
    },
    {
        "title": "Is it possible that Tariffs could be good",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gv3778/is_it_possible_that_tariffs_could_be_good/",
        "content": "Don’t want to get into politics in this discussion. But could tariffs actually be a good thing for a bunch of US companies?\n\nIs there a way to structure tariffs to help domestic companies? \n\nPeople say the US gets hit by tariffs or sanctions by other countries. Wouldn’t it make sense to even the playing field? \n\nI’m seeing Apple has to pay a huge ‘tariff’ to sell phones in Indonesia now. Yet I doubt goods from Indonesia get charged a tariff in the US. \n\nCould tariffs be imposed based on the tariffs the US faces from that country? Wouldn’t it make sense if China imposes a 10% tariff on US goods that the US do the same?",
        "created_utc": 1732038565.0,
        "subreddit_name": "investing",
        "comments": 113
    },
    {
        "title": "Apple Releases iOS 18.1.1",
        "score": 1660,
        "url": "https://9to5mac.com/2024/11/19/ios-18-1-1-security-fix-update-details/",
        "content": "",
        "created_utc": 1732043425.0,
        "subreddit_name": "apple",
        "comments": 156
    },
    {
        "title": "iPhone 16 ban: Apple offers $100M to access 278M customers in Indonesia",
        "score": 731,
        "url": "https://9to5mac.com/2024/11/19/iphone-16-ban-apple-offers-100m-to-access-278m-customers-in-indonesia/",
        "content": "",
        "created_utc": 1732022696.0,
        "subreddit_name": "apple",
        "comments": 141
    },
    {
        "title": "Apple says Mac users targeted in zero-day cyberattacks | TechCrunch",
        "score": 727,
        "url": "https://techcrunch.com/2024/11/19/apple-says-mac-users-targeted-in-zero-day-cyberattacks/",
        "content": "",
        "created_utc": 1732060585.0,
        "subreddit_name": "apple",
        "comments": 40
    },
    {
        "title": "Apple Ends Butterfly Keyboard Repair Program for MacBooks",
        "score": 435,
        "url": "https://www.macrumors.com/2024/11/19/apple-ends-mac-butterfly-keyboard-service-program/",
        "content": "",
        "created_utc": 1732054395.0,
        "subreddit_name": "apple",
        "comments": 69
    },
    {
        "title": "Ongoing iOS 18 Bug Prevents Photo Edits From Being Saved",
        "score": 270,
        "url": "https://www.macrumors.com/2024/11/18/ios-18-photos-bug/",
        "content": "",
        "created_utc": 1731988840.0,
        "subreddit_name": "apple",
        "comments": 34
    },
    {
        "title": "Apple's 11/19/2024 minor OS updates' security details.",
        "score": 116,
        "url": "https://support.apple.com/en-us/100100",
        "content": "",
        "created_utc": 1732050678.0,
        "subreddit_name": "apple",
        "comments": 11
    },
    {
        "title": "Xogot: Godot on iPad now in Testflight",
        "score": 76,
        "url": "https://blog.la-terminal.net/xogot-godot-on-ipad-preview/",
        "content": "",
        "created_utc": 1732055020.0,
        "subreddit_name": "apple",
        "comments": 3
    },
    {
        "title": "Daily Advice Thread - November 19, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/apple/comments/1guuljc/daily_advice_thread_november_19_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1732014028.0,
        "subreddit_name": "apple",
        "comments": 50
    },
    {
        "title": "M4 Max MacBook Pro: I'm Convinced!",
        "score": 0,
        "url": "https://www.youtube.com/watch?v=9HQx5pgUoiY",
        "content": "Marques Brownlee video review.",
        "created_utc": 1732040084.0,
        "subreddit_name": "apple",
        "comments": 34
    },
    {
        "title": "Apple Confirms Zero-Day Attacks Hitting macOS Systems",
        "score": 620,
        "url": "https://www.securityweek.com/apple-confirms-zero-day-attacks-hitting-intel-based-macs/",
        "content": "",
        "created_utc": 1732055327.0,
        "subreddit_name": "technology",
        "comments": 43
    },
    {
        "title": "‘Surveilled’ Trailer: Ronan Farrow Investigates How Your Phone Is Being Used To Spy On You",
        "score": 233,
        "url": "https://deadline.com/video/surveilled-trailer-ronan-farrow-hbo-documentary/",
        "content": "",
        "created_utc": 1732030274.0,
        "subreddit_name": "technology",
        "comments": 45
    },
    {
        "title": "What color iMac is this?",
        "score": 661,
        "url": "https://i.redd.it/6gb1ch51ix1e1.jpeg",
        "content": "",
        "created_utc": 1732052730.0,
        "subreddit_name": "mac",
        "comments": 107
    },
    {
        "title": "Just updated to macOS Sequoia :)",
        "score": 535,
        "url": "https://i.redd.it/a5ot7ish0x1e1.jpeg",
        "content": "",
        "created_utc": 1732046854.0,
        "subreddit_name": "mac",
        "comments": 67
    },
    {
        "title": "How much does it cost to fix, is it worth? ",
        "score": 34,
        "url": "https://i.redd.it/qee3k5d7xu1e1.jpeg",
        "content": "This is a MacBook Pro 2019 Touch Bar \n",
        "created_utc": 1732021512.0,
        "subreddit_name": "mac",
        "comments": 48
    },
    {
        "title": "Longtime Windows & Linux user finally switching to Mac - here’s why. ",
        "score": 27,
        "url": "https://www.reddit.com/r/mac/comments/1gvafe7/longtime_windows_linux_user_finally_switching_to/",
        "content": "I recently purchased a 14\" MacBook Pro with the M4 Pro chip. \n\nIt's amazing. The build quality is solid, the battery life is impressive, and the performance in day-to-day tasks is absurd. \n\nI have been a longtime Windows and Linux user, have built my own PCs for years, and while I have used Maca in the past - I generally still prefer the interface of Windows and most Linux distros over MacOS. \n\nSo why did I buy a MacBook? In a sense, it was a protest to Windows 11's feature bloat, lack of privacy protections, and lack of innovation. Microsoft has had YEARS to clean up Windows and make it a presentable and modern OS. They continue to disappoint me year after year. Windows is easy to use but looks hideous and lacks customizability. Microsoft's track record with user privacy is also extremely questionable - and their push for more and more AI features like recall has me concerned. \n\nIn addition to that - x86-64 hardware configurations have become far too power hungry for day-to-day use. I have a desktop PC with a 5950x, 64GB of RAM, and a 6900XT. It plays any game I throw on it - at the cost of massive power consumption. Day to day tasks like streaming videos or creative tasks like editing music can easily take 100-300 watts of power or more and generates so much heat. I had to move my computer out of my bedroom just because of how hot it made things in the summer. Graphics cards have gotten massive and Intel CPUs in particular have become so power hungry. When it comes to laptops, both Intel and AMD just aren't competitive with Apple's M series of chips when it comes to performance and battery life. Intel made great strides with Lunar Lake but that is a one-off product that is mostly available in thin-and-light chassis that aren't quite as nice as a MacBook.\n\nWhile the selection of games running natively on ARM Mac's is limited, I've found that a decent amount of games that I want to play can run. Other games can be streamed over Steam Link (even on the go) from a Windows PC at home. Buying a Mac for gaming isn't that huge of a compromise for gamers if you have an existing Windows machine to do the heavy lifting. \n\nOverall, I'm super happy with my new MacBook. I still wouldn't call myself a massive Apple fan - I don't love all their business practices; but I trust them with my data and their mobile hardware is simply too good to be ignored. Maybe if AMD/Intel is able to make mobile chips that compete with Apple's silicon I will switch back to Windows/Linux in the future but time will tell. ",
        "created_utc": 1732056646.0,
        "subreddit_name": "mac",
        "comments": 11
    },
    {
        "title": "Switching from Windows 10 to macOS for a senior?",
        "score": 8,
        "url": "https://www.reddit.com/r/mac/comments/1gv6r0r/switching_from_windows_10_to_macos_for_a_senior/",
        "content": "Hello everyone :)\n\nSomeone in my family who already has an iPad and an iPhone (but doesn't really know what to do with the iPad because she already has the iPhone) has a Windows 10 PC and needs a new one.\n\nDo you think the switch to macOS would be great for her if she now uses Office 2016 and Chrome on her Windows device and would continue to use it on the mac?\n\nDo you think the new mac mini would be a good choice?\n\nThank you very much for your answers!",
        "created_utc": 1732047319.0,
        "subreddit_name": "mac",
        "comments": 21
    },
    {
        "title": "i want to switch to Mac, any reccomendations?",
        "score": 4,
        "url": "https://www.reddit.com/r/mac/comments/1gvb7yx/i_want_to_switch_to_mac_any_reccomendations/",
        "content": "well, only things i do in my current laptop (a Hackintoshed dell) is to watch some series and movies in streaming, videos on youtube and some works for the university, and also listen music while lurking in social networks, what mac will be good for me?",
        "created_utc": 1732058749.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "What Mac to get",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1guwsfd/what_mac_to_get/",
        "content": "So, I currently own a M3 MacBook Air, that is pretty much base model except for 16 gb ram. I have had it for a few months now, and it is amazing. The thing is, I do notice that sometimes, even 16gb of ram is a bit low. And the 256gb storage is also really low, but I am fine with using an external ssd as long as its not much slower.\n\nI have barely been using my desktop PC I had for about 2 years ever since I got this MacBook, so I will likely end up selling it. I only really use it whenever I need some more memory, or just heavier workloads in general. this got me thinking about my options for what to use for my heavier workloads *after* selling the PC. I expect that if I sell the PC, I will have enough money for a base model mac mini with m4, which seems to be a really good machine. but then I still have 16gb memory limition.\n\nThen I realised I could probably either sell or trade in my macbook air, depending on which ends up more beneficial where I live, and then maybe spend a bit more, to get a macbook pro with m4.\n\nSome more info about what I use my computer for:\n\n*  Programming and general software development workflows (often with compiled languages, which is nice if it happens fast).\n* Light gaming (think minecraft with friends).\n* and the general browsing of the web, keeping notes, etc.\n\nMy question is basically: should I get a base model mac mini, or should I sell my macbook and potentially spend a lot more money on \"one machine for everything\". and if I do end up getting a macbook pro, what upgrades are worth it and which arent, I assume the storage is the least valuable to me, because external storage isnt that expensive.",
        "created_utc": 1732021923.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Home WiFi on Macbook is not working but everywhere else works fine",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gvaht8/home_wifi_on_macbook_is_not_working_but/",
        "content": "Hello, i have problem with my macbook air 2019, wifi in my home is not working, i got upload speed like 1mb but on iphone, ipad etc. everythingh works fine with 600mb download. I tried everything but i dont know what to do more. If i create hotspot from iphone, macbook works fine also if i am at work wifi there is working, anny suggestions? I tried reinstall macbook, played with DNS settings, Wifi setting , renamed wifis in router (2,4 and 5ghz), also removed 2,4 and nothing works. Please help me i am desperate. Its uncomfortable to switch on hotspot from phone everyday to work. (Sorry for english=not native speaker :D ) ",
        "created_utc": 1732056823.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Did I get a good deal?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gv0kwp/did_i_get_a_good_deal/",
        "content": "I bought a 2019 MacBook Air, 8/128gb variant Intel i5\n\nIt's flawless and has seen very little use\n\n£175\n\nI'm new to MacBooks but using it primarily for browsing, music, documents and admin stuff for a football team I run among some other bits. \n\nAlso, while it still performs well enough, is there any way to make this thing fly?\n\nThanks ",
        "created_utc": 1732032186.0,
        "subreddit_name": "mac",
        "comments": 7
    },
    {
        "title": "What is the best remote desktop solution for macOS?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1guysgk/what_is_the_best_remote_desktop_solution_for_macos/",
        "content": "I would like to switch my desktop to a new M4 iMac. However, this requires me to be able to remotly control the iMac from my MacBook. I would like to be able to resume work on the desktop from my MacBook and keep my apps running. Windows RDP feels pretty much like sitting in front of the PC. So far, the desktop is a Windows machine and the Microsoft RDP client works like a charm on the MacBook. I really like that the connection is like a second desktop and you can use a gesture on the magic pad to swipe between the local desktop and the remote desktop. I am looking for something similar to control a Mac machine.  Therefore, the remote control solution for macOS should have:\n\n* Adapt screen resolution to client\n* Video aud audio forwarding\n* Clipboard sharing\n* Ability to lock the local screen of the host and resume session at host / from client (programs are kept open when connecting locally / remotely)\n\n",
        "created_utc": 1732027593.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Best way to transfer data off old MacBook Pro",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gumnt8/best_way_to_transfer_data_off_old_macbook_pro/",
        "content": "I have an old MacBook Pro from 2011 that was my high school computer, and it has at least 10k photos on it. Also lots of documents and other random things I don’t want to lose. Miraculously, it still turns on and runs and everything, it’s just SO slow. I tried putting the photos folder by folder on a USB, but it crashed the computer. I’ve been sorting them into smaller folders but it’s SO time consuming. \n\nWhat is the best way to get these off and put them somewhere safe? I have a different apple ID on this old laptop, and I’m worried if I log into my new apple account and try to put them on the cloud, I’ll lose everything. I do have an external hard drive I can use, but that might be just as time consuming. \n\nOpen to any and all tips! TIA! ",
        "created_utc": 1731983184.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "High-end Google Pixel laptop under development, may ditch Chrome OS for Android | Could a premium Android laptop rival Apple's MacBook Pro?",
        "score": 502,
        "url": "https://www.techspot.com/news/105630-google-could-developing-high-end-pixel-laptop-powered.html",
        "content": "",
        "created_utc": 1732031252.0,
        "subreddit_name": "gadgets",
        "comments": 183
    },
    {
        "title": "Meta thinks its Orion augmented reality glasses can be the AirPods of AR",
        "score": 0,
        "url": "https://9to5mac.com/2024/11/19/meta-thinks-its-orion-augmented-reality-glasses-can-be-the-airpods-of-ar/",
        "content": "",
        "created_utc": 1732027166.0,
        "subreddit_name": "gadgets",
        "comments": 24
    },
    {
        "title": "Microsoft is launching a $349 desktop PC that only runs Windows 11 by streaming it from the cloud — is this the future of desktop computing?",
        "score": 0,
        "url": "https://www.windowscentral.com/software-apps/windows-11/windows-365-link-desktop-cloud-pc-microsoft-announcement",
        "content": "",
        "created_utc": 1732024733.0,
        "subreddit_name": "gadgets",
        "comments": 31
    },
    {
        "title": "Microsoft's first ever Windows 11 desktop PC costs just 349 Dollars, but there is a catch ",
        "score": 0,
        "url": "https://www.ghacks.net/2024/11/19/microsofts-first-ever-windows-11-desktop-pc-costs-just-349-but-there-is-a-catch/",
        "content": "",
        "created_utc": 1732038220.0,
        "subreddit_name": "gadgets",
        "comments": 52
    }
]