[
    {
        "title": "We get it: you like the size of your SE. No, it's not coming back. Sorry.",
        "score": 4916,
        "url": "https://www.reddit.com/r/apple/comments/a68a1v/we_get_it_you_like_the_size_of_your_se_no_its_not/",
        "content": "Edit: Copying a reply to comment I made down below to fill in the body of this post:  \n\n\nHere's why I don't think the SE is coming back.  The iPhone SE was was created to utilize the existing manufacturing lines of the iPhone 5 and 5s during the 6 transition. It was a win-win: they could produce a modern phone at a much lower cost, without going through a full hardware and manufacturing design process.\n\nThe SE going away indicates that they've finished using those manufacturing lines, and to bring it back would require them to either a) Reintroduce a hardware form factor from 2010, or b) design a smaller phone from scratch. Both seem extremely unlikely. \n\nEven if they designed a new form factor, it's not it's not exactly easy to fit all the modern tech into a body with 30% less internal space.  There's a reason [iPhones have been getting bigger and thicker each year since the 6s](https://www.macrumors.com/2018/12/13/2019-iphones-thinner-samsung-displays/) - they need the internal space to fit this new tech.  So, a new SE would likely have outdated hardware, be riddled with compromises like poor battery life, and be very expensive to produce.  Not exactly a win for anyone.\n\nPart of the issue, and Apple knows this, is that selling larger phones decreases demand for smaller ones. **For most people,** once you get used to larger phone, a smaller one just feels tiny and isn't very appealing. Apple has essentially eaten all the potential demand for the SE by selling larger phones.\n\nUpdate: man, I really thought this was going to get downvoted/removed immediately.  Thanks for the mods for allowing this shitshow of a thread, and thanks for all the gold & silver.  Stay awesome everyone.\n\nUpdate 2: Lots of people seem to think that by saying Apple isn't bringing the SE back is a personal attack against them.  It's not.  I get it, you like smaller phones.  That's fine. The point of this post is to bring attention to the fact that *Apple* likely is never bringing this form factor back, and that it *wouldn't* be incredibly easy to do so like you think it would.\n\n[If you're sad you can't type with one hand, check out one-handed keyboard mode](https://9to5mac.com/2017/09/04/ios-11-how-to-use-one-handed-keyboard/)",
        "created_utc": 1544817606.0,
        "subreddit_name": "apple",
        "comments": 859
    }
]