[
    {
        "title": "My Personal Guide to Good Financial Health for People in their 20s/30s",
        "score": 53,
        "url": "https://www.reddit.com/r/investing/comments/1g6y5mo/my_personal_guide_to_good_financial_health_for/",
        "content": "A family member of mine asked for some financial advice today and my obsessive self sat for 9 hours and created an 18 page \"basic\" guide to establishing good financial health in your 20s and 30s. I am proud of it and thought I would share here. While the guide is a lot more than just investing and so may not be ideal for this subreddit, I definitely think it hits some investing FAQs. \n\nFor context, I am a 23 year old that became obsessed with personal finance at 17. I was able to hit a $100k net worth and 750 credit score at 22 prior to my peers' college graduation. Yes, I had some form of slight help from family, but I come from middle class and no money/inheritance was given to me. The point is not that I am some genius and successful. The point is that I learned some good advice online, actually followed a lot of it and want to share what I've learned. \n\nIMPORTANT DISCLAIMER: The advice contained is simply what I personally know. 99% of it I learned as a 17 year old in high school. The financial institutions/products I mention are simply what I have used and thus recommend. I understand that the companies/funds/credit cards are not perfect and there may be better options. Do your own research. I understand that what has worked for me will not work for everyone.  I understand that there are a lot of other great or better ways to go about things. I don't claim this to be a perfect guide by any means. I am 23 and not a financial advisor. It's just a guide I made initially for my cousin. It's not that deep.\n\nGuide TLDR: Live below your means, have an emergency fund, establish your credit safely and invest what you can in a Roth IRA. \n\nP.S. Sorry for any formatting issues. I copy and pasted this from a PDF version which is much easier to read and has a graph and a chart I made (DM me to get it - if that's easily possible)\n\n\\*Follow my advice at your own risk. This guide is for entertainment purposes only.\\*\n\nEdit: HERE IS THE LINK TO THE PROPERLY FORMATTED GUIDE: [Financial Health Guide](https://docs.google.com/document/d/184X3o59SovTJJXIuLW6XcRDEaww33Wf0K3lxinPGZzg/edit)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEvan's Basic Guide to Financial Freedom\n\nThis is my guide to have a good hold on your finances through saving and investing. This guide should give you a general idea of what to do, however it is mostly based on my own experience and what I have learned online. When it comes to what banks and brokerage accounts to use, I recommend that you do your own research and explore other options. The accounts I mention are simply what I use and so I recommend them. Different companies are always changing and improving so there may be better options out there.\n\nGuide Outline\n\n-5 Steps to Get Ahead in your 20’s\n\n1. General Bank Accounts 2. Emergency Fund  \n3. Early Debt Payoff  \n4. Credit Card\n\n5. Roth IRA Investment Account\n\n-Bonus Steps for your 20’s\n\n1. 401k\n\n2. Additional Credit Cards\n\n-Additional Steps for your 30’s\n\n1. Financial Advisor  \n2. Bonds  \n3. Additional Investments 4. Home Purchase\n\n-Money Saving Tips -Compound Interest -Roth VS 401k -Credit Score Guide -Resources\n\n-Video Library\n\n5 Steps to Get Ahead in Your 20’s\n\n\\*The following steps are generally in order of importance. Ideally, you should have the previous step accomplished prior to later steps\\*\n\nStep #1 - General Bank Accounts\n\n* ●  Open a checking and savings account with Capital One ○ Checking Account: “360 Checking” ○ Savings Account: “360 Performance Savings” (If names havechanged, make sure the account is a high yield saving’s account)\n* ●  Along with the checking account, you will receive a debit card to be able to\n\nmake purchases in person with\n\n* ○  You will also receive a checkbook with personal checks\n* ○  For your debit card and checks, you can only spend what is in yourdebit card account\n\n● Keep all of your savings in the savings account and keep $100-$500 in\n\nyour checking account  \n○ When making a purchase with debit card or checks, transfer from\n\nsavings to checking  \n● The savings account will usually generate 2% to 5% interest per year\n\nwhich will be paid monthly  \n○ Ex. If you have $10,000 in your savings, 3% would pay you $25\n\neach month ($300 for the year = 3%)\n\nStep #2 - Emergency Fund\n\n* ●  Maintain 3-6 months of living expenses in a savings account\n   * ○  Ex. $2,000/mo living expenses = $6,000-$12,000 minimum\n   * ○  A minimum regardless of living expenses is $5,000\n* ●  (RECOMMENDED) If you want to ensure you do not spend your emergency fund, open a second high interest savings account with a second bank, transfer the full emergency fund balance there and forget you have it!\n\n■ I recommend CitiBank or Discover since I recommend their credit cards\n\nStep #3 - Early Debt Pay Off  \n\\*Skip this step if you do not have bad debt or your debt interest rate is below 2%\\*\n\n● Determine if/how much you can pay extra towards your debt per month ○ I recommend 30% of your income to be for saving/investing (I\n\nconsider paying debt in the “investing” category  \n■ If you have your emergency fund saved in full, you should put\n\n30% of your income towards paying down bad debt  \n● Set up automatic payments (or reminders if not possible) to pay extra\n\ntowards debts  \n○ Ex. You have your emergency fund saved up and make $50,000/yr\n\nafter taxes. 30% of $50,000 is $15,000 to invest per year. You can set up an auto payment to pay an additional $1,250/mo towards your bad debt.\n\n* ●  Examples of bad debt to pay off early include credit card debt, student loans and private loans/payday loans\n* ●  When you have debt, you are losing money to negative interest. If you are able to pay that debt off and then invest the money you were paying towards the debt, you not only are no longer losing money to negative interest, but you are gaining money from positive interest\n\n○ Ex. You are paying $300/mo towards credit card debt. $150/mo of that money is towards the interest. After you save and pay off that debt early, you now invest that $300 into\n\nStep #4 - Credit Card\n\n\\*Skip this step if you are not disciplined with finances and may spend more than you have\\*\n\n* ●  Open a “Discover It Secured Card” with Discover Bank ○ You will be required to put down a deposit which you will receive in7-10 months so long as you pay all payments ○ You cannot spend more than your deposit so I recommend a depositof $500-$1,000 ○ Connect your general savings account and set up an auto paymentto pay off the full balance every month ○ Subscribe to email notifications and manually pay off your accountevery time you get an email that your new statement is ready inaddition to the auto-pay\n* ●  Use the credit card for all possible purchases to get cash back (2% on gasand restaurants, 1% on everything else)\n   * ○  To be safe and not spend more than you have in your savings,always check your savings account prior to making a purchase tomake sure you have enough money\n   * ○  NEVER SPEND MORE THAN YOU HAVE IN YOUR SAVINGS\n* ●  After 7-10 months, you will receive your full deposit bank and your card limit will increase from that amount to a higher amount\n\n○ As a bonus, go into the discover app and request a higher limit every 6-12 months\n\n■ Based on your income, monthly expenses and job, the bank may give you a higher limit, which can improve your credit score\n\n● With a secured card you can establish/improve your credit score ○ A breakdown of credit score is included later in this guide\n\nStep #5 - Roth IRA Investment Account\n\n\\*You can only invest in a roth if your income is below the maximum requirement ($160k in 2024) and you are investing taxed income (you must have a job and it cannot be cash under the table)\\*\n\n* ●  Create an account with Fidelity and open a “Roth IRA”\n* ●  Determine the maximum amount you can invest each month based onyour income\n   * ○  I recommend 30% of your income to be saved and invested (If youare not saving for a large purchase or your emergency fund, the full30% should be invested)\n   * ○  $7,000 is the current annual maximum for a ROTH IRA (2024)($583/mo)\n* ●  Connect your general savings account and set up automatic investing to purchase two different mutual funds or ETFs every month\n   * ○  75% of the monthly investment should purchase FXAIX or “Fidelity 500 Index Fund” (S&P 500 / the US Stock Market)\n   * ○  25% of the monthly investment should purchase FSPSX or “Fidelity International Index Fund” (the International Stock Market outside of the US)\n\n■ Make sure that dividends are reinvested automatically  \n○ Ex. Each month $400 is transferred from your general savings account with Capital one. $300 is invested into the US Stock Market (Fidelity 500 Index fund) and $100 is invested into the International Stock Market (Fidelity International Index Fund)\n\n* ●  Never ever withdraw funds from this account or any other investment account if possible (unless retired or for dire emergency after emergency fund is empty)\n* ●  Stick to investing in low cost Mutual Funds or ETFs (the funds mentioned above). Investing in individual stocks can result in a better investment, however usually investing in a large fund that represents many companies (such as the entire US stock market or international market) will be the safer bet that nearly ensures you will get a solid return over time\n   * ○  Investing in individual stocks is gambling\n   * ○  Investing looking to make money in the short term (less than 10years out) is not investing. It is trading. Trading is gambling.\n\nBonus Steps for your 20’s:\n\n1. If your employer offers a 401k match, always take it and invest the maximum match amount\n\n* ○  This is more important/better than your Roth IRA and if you cannot do both, do the 401k match instead of the Roth\n* ○  If you can do both, invest the full 401K match and then invest the remainder of your investment funds into your Roth IRA2. Additional credit cards\n* 2.   If you are very responsible with credit cards, will never spend morethan you have, and always pay them off each month in addition to autopay, you can receive some better benefits with more cards■ 2nd Card - Citi Double Cash: 2% back on everything ■ 3rd Card - Citi Custom Cash: 5% back on one category ofchoice (I do gas personally)\n* ○  If you are an independent contractor or business owner, designate acredit card for all of your business expenses (so you can easily trackexpenses for write offs)\n* ○  I never recommend getting any credit card that has an annual fee\n\nAdditional Steps for your 30’s\n\n\\*Move on to these steps in your 20’s if you can\\*\n\n1. Hire a financial advisor  \nIf you make enough to where you can invest more than the Roth IRA annual maximum, you should hire a financial advisor  \nMake sure they are a fiduciary advisor  \nA cheap option is to hire them only for flat fee based financial planning (general guidance instead of them doing the investing for you)\n\n2. Start investing in bond funds  \nChange your automatic investments in your Roth IRA so that your stock allocation is 120 minus your age\n\n* Ex. 30 year old is 120 - 30 = 90% stocks 10% Bonds\n* Ex. 50 year old is 120 - 50 = 70% stocks 10% Bonds With your new bond allocation %, set up your auto investment to purchase FXNAX or “Fidelity U.S. Bond Index Fund” Every 5 years, adjust the automatic investment to align with the 120 minus your age rule\n\n3. If you can afford to invest more than the Roth annual limit, contribute more to your 401K\n\n○ OR other great options include:\n\n* HSA: Pre and Post Tax Investment account that can only bespent towards healthcare and medical costs (Tax benefits ofROTH IRA and 401K combined)\n* 529 College Savings Plan: Post tax investment account (likeRoth IRA) that must be spent on a family member’s education costs (use to save for kid’s college)4. Save up for and purchase a home\n* ○  While still contributing to your investment accounts, start settingaside funds monthly to save up to purchase a home\n* ○  Use your emergency second savings account or a 3rd savingsaccount so that you don’t accidentally spend the money\n\nSaving Tips\n\nSaving is, in my opinion, the most important aspect to one’s financial health. You must save to establish your emergency fund. You cannot pay off debt without saving the money to pay it. You cannot safely use a credit card without having savings. You cannot invest without saving that money first.\n\nLiving below your means can allow you to have less stress in your life, choose a lower paying, but more enjoyable career path, spend money on “the big important things”, afford to cover emergency costs, pay for incredible experiences, retire at a reasonable/early age and actually afford to raise children.\n\nAs of 2024, 56% of Americans do not have savings to cover a $1,000 emergency (per CNBC and FOX). For many young people, in my eyes, making money isn’t the issue. It’s actually saving money. Saving money is very simple. However, it’s also very hard at the same time. If you spend less than you make, you will save money. We all know that, however, what makes it so difficult is the emotional side of it. You have to get out of your comfort zone and make changes to the way you think if you want to change your spending habits into saving habits.\n\nTactical Tips:  \nBefore you buy anything, ask yourself if you actually need it - You were\n\nliving before, weren’t you?\n\nWait to Buy Something - Impulse purchases are deadly. If you really want it that bad, you will still want it a week or month from now. The bigger the purchase, the longer you should wait.\n\nHave a spending account and a savings account - Only make payments out of your checking account and only transfer from your savings when you need to. An even better method is to open a second high yield savings account with another bank. Then you can put your savings there and forget about the money. That way you can keep your spending money in your general savings account and collect interest on both saving and spending funds.\n\nDon’t Window Shop - Window shopping can be a fun way to pass time, however if you are going into a store without the intention to buy a specific item you need, every single thing you end up buying is unnecessary. Or if you need a specific item, go straight to that item and straight to the register. Don’t browse!\n\nReview your Expenses - Simply take 5 minutes to review your bank or credit card statements once a month. You might be shocked at how much you are actually spending. You might also find old subscriptions you can cancel.\n\nSet up an automatic savings transfer from your spending account to your savings account - If possible, time this with your paycheck deposit. Just like with an automatic transfer to your investment account, you can just forget you have the money and you never even see it! You don’t miss the taxes taken out of your paycheck so you want to have the same setup with your saving/investing.\n\nMental Shifts to Tell Yourself Before you Spend Money:\n\n“Stop using material things to fight insecurity” - Everyone wants nicer cars, homes, clothes, the list goes on. Why? Mostly because of status. We put our own value in our material possessions. Be that confident 70 year old that wears what’s comfy, drives an old, reliable car, and lives in a quaint, outdated home. Don’t wait until you’re old to realize what’s really important. Work on that now.\n\n“The little things add up” - $2 here, $5 there, $13 here. Next thing you know, your credit card statement is $800.\n\n“Would I rather this small thing now or this big thing later?” - Would you rather an expensive gym membership or would you rather a second vacation each year? Would you rather go out to dinner and drinks every week or would you rather be able to save up and buy a house?\n\n“How many hours/shifts of work does this cost?” - Is buying that dinner worth it if it cost you an entire day’s work? Is spending an hour of work worth buying your lunch out vs bringing it from home? Is an expensive vacation worth 2 months of hard work or should you go the cheaper route? This also works great for commission jobs. How many cars/apartments/ect. would I have to sell to buy this?\n\n“Saving is a tax free way of “making” money” - You can either work to make $130 and get $100 after taxes or you can just save the $100.\n\n“What is more important to me, having nicer things or being stress free financially?” - Is that second vacation worth the stress of running up a credit card you cannot pay off? Is that daily starbucks coffee worth the stress of paying rent late? Is that nicer car worth the stress of not being able to afford to move out of your parents?\n\n“If I invested this money today instead of spending it, I would have X when I’m older” - Use a compound interest calculator to understand generally how much your money will grow until retirement. When you are a 20 year old, each dollar you invest now should grow about 20 times itself by age 65 (10 times itself as a 30 year old). If you are 20, ask yourself if you want to spend $1,000 on something you don’t need now or have $20,000 to spend on something when you are older.\n\n“I’m stealing money from the future me/family” - What do you value more, the novel item you don’t need right now or something you care more about in the future? Would you rather drive a nicer car now or would you rather be able to vacation every year after you retire? Would you rather spend money on yourself now or your family in the future?\n\n“Instead of buying this every day/week/month, I invested it, how much would I have later?” - How much money could you invest if you downgraded from a $100 gym membership to a $20 membership? How much money could you invest if you got a car with a $300 monthly payment instead of $500? How much could you invest if you split rent with a roommate to pay $1,000/mo instead of $1,800. Someone who buys a $6 coffee five days a week could instead invest that $30 per week to have over $350,000 extra at retirement.\n\nIf you like to gamble/buy scratch tickets: “Do I want an impossible chance to have $100,000 today or do I want an almost guaranteed $100,000 in 30 years” - A 30 year old who spends $20 per week on scratch tickets will very likely never win big even if their habit continues for life. However, if that person invested that $20/week starting at age 30, they would likely have $113,000 at 60.\n\nBrief Guide to a 750 Credit Score\n\nA credit score is extremely important, however it’s something that there is a lot of confusion about. While many know what a credit score generally is, most don’t know all of the factors that determine the score and thus how they maintain a high score.\n\nFirst off, a credit score or “FICO” score is how businesses and financial institutions like banks determine how qualified you are for certain services. Your credit score will be a factor in determining not only if you can get a loan for things like a car, house, ect. but also can determine what your interest rate will be on that loan. You also can be required to have a credit score to finance purchases like appliances and furniture or very commonly in order to rent an apartment. The higher your credit score, the higher the likelihood that a landlord will let you rent their apartment and later on, the cheaper your car and home will be.\n\nBuilding a good credit score can take a very long time, however ruining your credit score can happen in an instant and can often take many years to repair. The easiest and most common way to lower your credit score is by missing a payment. This is why it is so crucial that you have autopay setup on all of your loan payments and credit cards.\n\nIf you have a bad credit score, you may find yourself unable to rent an apartment, buy a home, or buy a car. This is because you are seen as risky and untrustworthy. If your score is fair but not good, you will find yourself paying high interest rates. Because of this, you want to maintain a score above 700.\n\nCredit Scores are typically seen as follows:\n\n300 - 579 = POOR  \n580 - 669 = FAIR  \n670 - 739 = GOOD  \n740 - 799 = VERY GOOD 800 - 850 = EXCELLENT\n\nWhen it comes to apartments, you generally need to fall into “good” or better to rent. In order to get the best interest rates on loans for cars/homes you generally need to fall into the “Very good” category or better.\n\nCredit scores are determined by the following categories below. The percentage represents how much this category makes up a score and so a higher percentage means a more important category.\n\nPayment History - 35%  \nCredit Utilization Rate / Amounts Owed - 30% Length of Credit History - 15%  \nNew Credit Opened - 10%  \nCredit Mix - 10%\n\nWhat each category means and how to do well in each:\n\nPayment History - How often have you made payments on time?\n\n1. Never miss a payment. Set up autopay AND manually pay off monthly.\n2. Open cards sooner. The longer a card has been on your history the morerecorded payments on your history.\n3. Have more cards/loans. The more lines of credit, the more on timepayments. Don’t close card accounts for this reason.\n\n\\*If you do miss a payment, #2 and #3 help. Having many total payments makes your percentage of late payments smaller.\\*\n\nEx. If you have one credit card for 10 months and miss one payment, you’re late 10% of the time. If you have 5 credit cards for 5 years and miss one payment, you’re only late 2% of the time (1/10 vs 1/60)\n\nCredit Utilization Rate / Amounts Owed - How much of your total credit limit are you spending? (credit cards) / How much do you owe? (Loans)\n\n1. Pay off your cards in advance of the statement date. Manually or with autopay, pay most or all of your current balances so that the balance is very low compared to your limit. Ex. If your limit is $1,000 and you have a $900 balance, your utilization rate on that card is 90%. If you pay $850 of the balance before the statement period ends, the statement balance will be only $50 which is just 5% of your limit.\n2. Have more credit cards. The more cards, the higher your total limit. This is another reason why you should not close a credit card.\n3. Ask for limit increases. You can easily do this right in your banking app or call from a phone. Income, expenses, and credit score will determine the increase\n4. For amounts owed, you really can only pay off debt. Save money so you can pay it off ahead of time. Don’t just make minimum payments.\n\nLength of Credit History - How long is your average line of credit?\n\n1. Open up lines earlier in life. If you know you will get a certain credit cardeventually, get it now.\n2. Be smart about timing of new lines. When possible, do not acquire newlines of credit prior to a life event that requires good credit.\n3. Have more lines. When you open a new line of credit it does not affect you as much with more lines since that line represents a smaller percentage ofthe total amount of lines. Ex. A second credit card is 50% of your lines, however a 10th line of credit is only 10% of your lines.\n\nNew Credit Opened - How recently have you opened a line of credit? 1. Follow the same first two tips above for “Length of Credit History”\n\nCredit Mix - Is the mixture of types of lines of credit diverse?  \n1. Have different types of lines of credit. There's mainly revolving (credit\n\ncards) vs installment (loans). Ex. It’s better to have a mortgage, car loan and two credit cards rather than just 4 credit cards\n\nPayment history is the most important by far and so it’s crucial to stay on top of all lines of credit and ensure payments are being made and made on time. If there is an accident and a payment is not made or made late you can actually call your creditor and potentially have them remove the late payment.\n\nKeep in mind that you should never make bad financial decisions in order to increase your credit score. You also don’t want to complicate your finances. With one or two lines of credit, you can easily get a good score after just a couple years of on time payments.\n\nCredit should not be taken lightly. If you are not financially responsible, do NOT get a credit card. The benefits are not worth the consequences of bad credit or even worse, snowballing credit card debt.\n\nCompound Interest Explained (Why you Should Invest)\n\nSaving is necessary in order to invest, however investing is much more powerful. When you invest, you are paid a percentage yield.  \nIn other words, your money grows. But the beautiful thing about the growth is that it is not linear. It is exponential.\n\nA simplified example of this can be with a high yield savings account and $100. Let’s say the savings account has an annual yield of 5%. That means after one year, the savings account would have given you $5. However, in year 2, you do not get $5. Why? Because you are no longer being paid 5% of $100, you are being paid 5% of $105. 5% of $105 is $5.25. The next year you are paid 5% of $110.25 which is $5.51. Each year you are paid more and more because the interest compounds on top of itself. Compounding interest!\n\nSaving on the other hand, is linear. Fortunately, high yield savings accounts do have compound interest, however the annual yield is typically much much lower than stocks and checking accounts don’t have any interest at all. If you were to save $100 every month, rather than investing it, it would look like the blue line on the chart above. However if you invested it, the growth would compound on top of itself and look like the red line.\n\n  \n\nExample - A $5,000 one time investment at 7% interest per year:  \n\\*The first number is the new amount and the second number is the amount gained in the 5 years\\* Year 5 - $7,012 (+$2,012)  \nYear 10 - $9,835 (+$2,823)  \nYear 15 - $13,795 (+$3,959)  \nYear 20 - $19,348 (+$5,553)  \nYear 25 - $27,137 (+$7,788)  \nYear 30 - $38,061 (+$10,924)\n\nIn the first 5 years, the $5000 would grow an additional $2,012. However in just the final 5 years (from year 25 to 30), the investment would grow an additional $10,924. That is over double the original $5,000 alone! Compound interest!!\n\nIf you contribute $7,000 annually to a Roth IRA from age 20 to 65, with an average annual yield of 7%, you would have approximately $2,140,262.34 by the time you reach age 65. Tax Free! (\\*7% is a decent inflation adjusted estimate of growth based on investing in the US Stock Market\\*)\n\nBecause of the fact that compound interest gets better and better the longer it works, the earlier you start investing the better. Not just better, but much better. The downsides of starting later are also exponential (same math but backwards).\n\nExample - $5,000 invested per year at 7% interest per year: (at different ages) \\*The amount next to the age is the total amount the fund would grow to by age 65\\*  \n18 Years Old - $1,881,579.00  \n20 Years Old - $1,633,771.07\n\n25 Years Old - $1,142,920.14 30 Years Old - $792,950.21 40 Years Old - $365,519.51 50 Years Old - $148,235.43\n\nEach year matters a lot. The difference between starting at 18 and 20 years old is $253,808 even though you would only invest $14,000 in those two years at 18 and 19. Start as early as possible! Even if it's only $100 a year.\n\nBy the way, if you start saving $5,000 a year at 18 instead of investing it, you would only have $235,000 instead of $1,881,579. Don’t just save!\n\nRoth IRA vs. Traditional IRA (401k)\n\nRoth IRA taxes income but not stock growth (“Post tax”)  \nStandard IRA (401k) taxes stock growth but not income (“Pre tax”)\n\nWhen you are young, your income is usually low, but the investments you make will grow a lot by the time you retire. You want the low income to be taxed and not the high stock growth.\n\nWhen you are older, your income is usually higher and since your investments do not have as much time to grow until retirement, the growth is low. You want the low stock growth to be taxed and not the high income. In conclusion, when you are in your 20’s and 30’s it is generally better to invest your money in a Roth IRA\n\n\\*remember that if your employer offers a 401k match, invest the maximum amount that will be matched by the company and invest the remaining money you can into a Roth IRA - The match is better than the tax savings of a Roth\\*\n\nExample #1 - Roth IRA\n\nIncome: $50,000  \nAge: 25 (40 Years of Stock Growth to Retirement) Amount Invested that Year: $5,000  \nAmount at Retirement: $74,872\n\nExample #2 - 401k\n\nIncome: $100,000  \nAge: 50 (15 Years of Stock Growth to Retirement) Amount Invested that Year: $7,000  \nAmount at Retirement: $19,313\n\nIn example #1, you want to be taxed on the $50,000 income and not the \\~$70,000 of tax growth. In example #2, you want to be taxed on the \\~$12,000 of stock growth and not the $100,000 of income.\n\n||\n||\n||**INCOME**|**STOCK GROWTH**|\n|**YOUNG**|**LOW**|**HIGH**|\n|**OLD**|**HIGH**|**LOW**|\n\nFree Resources: (all links removed)\n\n\\*Credit Karma - App/Website: (See your full financial picture on one screen)  \n-Net Worth Overview  \n-Free Credit Reporting\n\n-Expense Tracking\n\n\\*MoneyChimp’s Compound Interest Calculator - Website:\n\n(See how much money you will have invested in the future)  \n-Project out your current investing to see amount at retirement  \n-Understand how much each dollar will grow from your current age to retirement age (Ex. 20X from 20 to 65 and 10X from 30 to 65 (at 7%))\n\nNerdwallet - App/Website:  \n(Learn all about personal finance and find financial companies) -Articles/Resources for improving personal finances (budgeting, saving, investing)  \n-Research and compare financial institutions (bank accounts, trading accounts, credit cards, insurance, ect.)  \n-App is similar to Credit Karma (however does not work with Fidelity as of 2024)\n\nInvestopedia - Website:(Understand Financial Terms)  \n-Full dictionary of financial terms with detailed explanations and videos -Articles on all things finance and personal finance\n\n  \n\nVideo Library :\n\n1. Simple Guide to Investing - Graham Stephan\n2. Roth IRA Overview - Graham Stephan\n3. Index Fund (Mutual Fund / ETF) Overview - Graham Stephan\n4. How to Get a Perfect Credit Score - Graham Stephan\n5. How to Save Money - Graham Stephan\n6. Three Fund Portfolio Overview - Tae Kim\n7. Seven Baby Steps to Good Financial Health - Dave Ramsey\n\n\n\nBest Youtube Channels to Watch:\n\n1. Graham Stephan \n2. Andrei Jikh \n3. Nate O’Brien \n4. Dave Ramsey \n5. Humphrey Yang\n\n\\*The best thing to do with these channels is to go through their playlists about personal finances to find topics you want to learn about\\*\n\n\n\nTLDR: Live below your means, have an emergency fund, establish your credit safely and invest what you can in a Roth IRA. ",
        "created_utc": 1729301765.0,
        "subreddit_name": "investing",
        "comments": 27
    },
    {
        "title": "iPhone 16 Pro users face random freezes and repeated restarts",
        "score": 1043,
        "url": "https://appleinsider.com/articles/24/10/19/iphone-16-pro-users-face-random-freezes-and-repeated-restarts",
        "content": "",
        "created_utc": 1729355286.0,
        "subreddit_name": "apple",
        "comments": 276
    },
    {
        "title": "iPad Mini 7 Has Display Hardware Changes That Likely Fix Jelly Scrolling",
        "score": 877,
        "url": "https://www.macrumors.com/2024/10/18/ipad-mini-7-jelly-scrolling/",
        "content": "",
        "created_utc": 1729331289.0,
        "subreddit_name": "apple",
        "comments": 136
    }
]