[
    {
        "title": "Tesla passes $1T valuation on news of Hertz ordering 100,000 cars.",
        "score": 2436,
        "url": "https://www.reddit.com/r/investing/comments/qfr8l1/tesla_passes_1t_valuation_on_news_of_hertz/",
        "content": "https://www.reuters.com/business/autos-transportation/hertz-orders-100000-tesla-cars-bloomberg-news-2021-10-25/\n\n>Oct 25 (Reuters) - Tesla Inc (TSLA.O) surpassed $1 trillion in market value on Monday after landing its biggest-ever order from rental car company Hertz, a deal that reinforced the electric car leader's ambitions to top the entire auto industry in sales over the next decade.\n\n>Tesla shares surged as much as 14.9% to $1,045.02, making it the world's most valuable automaker according to Reuters calculations based on its latest filing.\n\n>Even Tesla Chief Executive Elon Musk expressed surprise at the velocity of the surge. \"Strange that moved valuation, as Tesla is very much a production ramp problem, not a demand problem,\" Musk tweeted in reply to a comment by Ross Gerber, co-founder of the investment fund Gerber Kawasaki and a Tesla shareholder.\n\n>\"Wild $T1mes!\" Musk wrote in a separate tweet.\n\n>Tesla is the first carmaker to join the elite club of trillion-dollar companies that includes Apple Inc (AAPL.O), Amazon.com Inc (AMZN.O), Microsoft Corp (MSFT.O) and Alphabet Inc (GOOGL.O).\n\n>Most automakers do not boast about sales to rental car companies, often made at discounts to unload slow-selling models. But for Tesla and its investors, Hertz's decision to order 100,000 Tesla vehicles by the end of 2022 showed electric vehicles are no longer a niche product, but will dominate the mass car market in the near future.\n\n>\"Electric vehicles are now mainstream, and we've only just begun to see rising global demand and interest,\" Hertz interim Chief Executive Officer Mark Fields told Reuters.\n\n>Tesla Chief Executive Elon Musk has set an annual sales growth target of 50%, on average, eventually reaching 20 million vehicles a year. That would be more than twice the volume of current sales leaders Volkswagen AG and Toyota Motor Corp (7203.T).\n\n>Consumer demand for electric vehicles is turning a corner in some major markets. The Tesla Model 3 was the best-selling vehicle of any kind in Europe last month, consulting firm JATO Dynamics reported Monday. read more\n\n>Tesla also appeared on Monday to be making progress resolving regulatory problems that threatened its business in China. The company said it had opened a new data and research center in Shanghai to comply with government requirements that data collected from vehicles in China stay in the country. read more\n\n>However, Tesla faced new U.S. regulatory pressure on Monday. The National Transportation Safety Board's new chief sent Musk a letter questioning why Tesla was rolling out its \"Full Self Driving\" software even though the company has not officially responded to the NTSB's questions about the automated driving system's safety.\n\n>\"It (the Hertz order) puts an exclamation point under guidance for 50%+ growth in deliveries,\" Roth Capital analyst Craig Irwin said. \"Another solid piece of evidence EVs are going mainstream.\"\n\n>Tesla now faces the daunting day-to-day challenge of becoming a high-volume automaker growing at a rate not seen since the early 1900s when demand exploded for Henry Ford's Model T.\n\n>Tesla is coping with an order backlog for its vehicles and extended supply chain disruptions. Tesla Chief Financial Officer Zachary Kirkhorn cautioned investors during a call last week that Tesla's near-term production goals will hinge on resolving those disruptions and ramping up two new, huge assembly and battery plants in Austin and Berlin. read more\n\n>\"There is quite an execution journey ahead of us,\" Kirkhorn said.\n\n>Rivals are not sitting still. Daimler AG's (DAIGn.DE) Mercedes-Benz brand, General Motors Co (GM.N), Ford Motor Co (F.N), and startups such as Lucid (LCID.O) and China's Xpeng (9868.HK) are all battling Tesla with new electric cars or trucks.\n\n>Investors and analysts, for now, are looking past the near-term challenges. Morgan Stanley boosted its Tesla price target by 33% to $1,200 as the brokerage expects the electric carmaker to surpass 8 million deliveries in 2030.\n\n>The Hertz deal also underscored the power of the Tesla brand, as the rental car company emerges from bankruptcy and aims to revive its once-dominant brand. Hertz's rescue is led by a group of investors including Knighthead Capital Management, Certares Opportunities and Apollo Capital Management.\n\n>\"We absolutely believe that this is going to be competitive advantage for us,\" interim Hertz CEO Mark Fields said of the Tesla order, due to be delivered by the end of 2022.\n\n>\"We want to be a leader in mobility. ... Getting customers experience with electrified vehicles is an absolute priority for us.\"\n\n>Tesla's cheapest Model 3 sedan starts at about $44,000, making this order worth about $4.4 billion, if the entire order were for its mass-market sedan.\n\n>Fields declined to say how much Hertz was paying for the order. Tesla was not immediately available for comment.\n\n>With the current order, Hertz said EVs will make up more than 20% of its global fleet. Fields cited the rising number of EVs for sale and consumer interest in electrified vehicles.\n\n>Hertz also said it was installing thousands of chargers throughout its network. Customers who rent a Tesla Model 3 will have access to 3,000 Tesla supercharging stations throughout the United States and Europe.\n\n>Tesla shares closed up 12.7% at $1,024.86.\n\n**Edit**: Imagine you time travel back to October 25th, 2019. Two years ago, TSLA stock was trading at **$59.64**, pre-split, and have the following conversation with someone:\n\nYou: I came from the future, in 2 years TSLA will be trading at $1,000 and is part of the S&P500.\n\nThem: An almost 20x increase? Hahahah right and what else? Bitcoin goes to $50k? LMAO.\n\nYou: Actually no, it went through a 5:1 split, so almost a 100x increase. And also let me tell you about this thing called Shibainu coin and a global pandemic...\n\nNow thinking about it, the past 2 years have been *wild* haven't they...",
        "created_utc": 1635198320.0,
        "subreddit_name": "investing",
        "comments": 640
    },
    {
        "title": "TSLA hits $1000. Makes it a first $1T Auto company",
        "score": 5486,
        "url": "https://www.reddit.com/r/stocks/comments/qfmugy/tsla_hits_1000_makes_it_a_first_1t_auto_company/",
        "content": "So yes, this just happened, not sure what to say other than congrats on the gains to all the holders\n\nThis is incredible achievement and I am still not sure what is causing this. It took tech companies decades and many many successful products to reach this milestone while TSLA just breeze through it. Seems like market will never trade TSLA sideway so it can grow into the valuation but rather expanding it at this level. \n\nWhat are your thoughts on this feat.?\n\nhttps://i.imgur.com/8kOZdYq.jpg",
        "created_utc": 1635185772.0,
        "subreddit_name": "stocks",
        "comments": 1227
    }
]