[
    {
        "title": "Even if you are extremely unlucky, you will be still ahead in 10 years",
        "score": 243,
        "url": "https://www.reddit.com/r/investing/comments/1fje4jn/even_if_you_are_extremely_unlucky_you_will_be/",
        "content": "I just did a small exercise to verify above claim.\n\nImagine that you are very poor at market timing, and always bought at the market top in the last 10 years. In the last 10 years (Sep 2014 - Sep 2024), there were 358 all time highs for SPY, and you bought $100 worth of SPY at every all time high prices of SPY. Guess what, in 10 years your total investment is $35,800, and your current portfolio value is \\~$73,000, total return of >100% in 10 years. This calculation does not include \\~2% of annual dividend. So, based on the rule of 72, annual average return is \\~9% even if you bought at the market top. I expect the next 10 years will produce the similar results.\n\nNote: This analysis applies to the general market index ETFs. This analysis MAY NOT apply to individual stocks even the likes of AAPL, NDVA or MSFT, etc. ",
        "created_utc": 1726615123.0,
        "subreddit_name": "investing",
        "comments": 136
    },
    {
        "title": "iPhone 16 firmware can now be restored wirelessly from another iPhone",
        "score": 2395,
        "url": "https://9to5mac.com/2024/09/17/iphone-16-firmware-restored-wirelessly",
        "content": "https://9to5mac.com/2024/09/17/iphone-16-firmware-restored-wirelessly",
        "created_utc": 1726596507.0,
        "subreddit_name": "apple",
        "comments": 169
    },
    {
        "title": "Apple Pulls iPadOS 18 for M4 iPad Pro After Bricking Complaints",
        "score": 1312,
        "url": "https://www.macrumors.com/2024/09/17/apple-pulls-ipados-18-m4-ipad-pro/",
        "content": "",
        "created_utc": 1726598506.0,
        "subreddit_name": "apple",
        "comments": 142
    },
    {
        "title": "Using the New iPhone Charging Limit Options in iOS 18",
        "score": 1227,
        "url": "https://www.macrumors.com/how-to/use-new-iphone-charging-limit-options-ios-18/",
        "content": "",
        "created_utc": 1726573789.0,
        "subreddit_name": "apple",
        "comments": 309
    },
    {
        "title": "Apple Pay now integrates with Affirm on iOS 18 following 'Apple Pay Later' discontinuation - 9to5Mac",
        "score": 998,
        "url": "https://9to5mac.com/2024/09/16/apple-pay-now-integrates-with-affirm-on-ios-18-following-apple-pay-later-discontinuation/",
        "content": "",
        "created_utc": 1726559106.0,
        "subreddit_name": "apple",
        "comments": 102
    },
    {
        "title": "Apple Talking With JPMorgan Chase About Potential Apple Card Partnership",
        "score": 638,
        "url": "https://www.macrumors.com/2024/09/17/jpmorgan-chase-apple-card-talks/",
        "content": "",
        "created_utc": 1726604242.0,
        "subreddit_name": "apple",
        "comments": 135
    },
    {
        "title": "RCS Now in iOS: a New Chapter for Mobile Messaging",
        "score": 627,
        "url": "https://www.gsma.com/newsroom/article/rcs-nowin-ios-a-new-chapter-for-mobile-messaging/",
        "content": "",
        "created_utc": 1726600162.0,
        "subreddit_name": "apple",
        "comments": 196
    },
    {
        "title": "The Importance of Repeating Patterns",
        "score": 67,
        "url": "https://www.reddit.com/r/Daytrading/comments/1fimizm/the_importance_of_repeating_patterns/",
        "content": "No matter your trading style or criteria for entry and exit, every trader should understand the repeating patterns of the Stock Markets. The main patterns are Intraday Patterns and Annual Patterns. They are important because they can be a guide for how you trade.\n\nhttps://preview.redd.it/8gz6baa6y9pd1.jpg?width=2110&format=pjpg&auto=webp&s=64eb7ab965f374f409468b166ba1349e520286b5\n\n**Intraday Daily Market Patterns**\n\nOne of the complaints I hear a lot from new traders is they sometimes take a lot of profit in the morning, only to give it up by over trading later in the day. Is this due to overtrading or just trading the wrong stock at the wrong time? In my opinion it has more to do with trading the wrong stock at the wrong time. The market has distinct intraday patterns that repeat pretty much the same way every day and if you know the pattern it can help you make trading decisions on which stocks to ride in the afternoon...or not. \n\nBelow is a screen shot of the NVDA chart for Monday June 3rd 2024 which I’ve divided into the various distinct time periods that mark a change in the trading pattern for any given day. Each trading day follows this general pattern. There are primary intraday patterns that divide the trading day into three main parts and several other time frames within the primary divisions. \n\n**Primary Intraday Pattern**\n\n1. **Morning**\n   * **High volume**\n   * **High volatility**\n   * Profit taking from overnight gains\n   * Selling from fear of loss\n   * FOMO buying pre market gap\n   * Buying in General\n2. **Midday**\n   * **Lower Volume**\n   * **Decreasing Momentum**\n   * Often Reverses\n   * European / London traders exit U.S. market\n   * NY Lunch hour\n   * Less traders in general after morning session\n3. **Afternoon**\n   * **Increasing Volume**\n   * **Increasing Momentum**\n   * Sometimes Reverses\n   * Bargain shoppers\n   * Investors grabbing new positions\n   * Losers finally sell\n\n**4**. 9:30 - 9:45: Market open which is often volatile as traders shed their positions after movement from the day or night before. This could be profit taking and is often seen when a stock gaps up in pre-market and traders sell their positions as the market opens. There can also be a frenzy of buying a stock that just became hot and the opening is often a combination of both in high volume and intensity. \n\n**5**. 9:45, 10:00 - 10:30 - There is often a reversal or big pull pack in volume at 9:45 and the following movement is the stocks trajectory for the morning. Usually around 10:00 the trajectory of a stock will become clear. If a stock posts new highs and lows, the stock will move up until at least 12:00 and could continue longer. If a stock is posting lower highs and lower lows, the stock will move down at least until 12:00 and could continue longer. \n\n**6**. 11:00 - 11:30 -Volume begins to slow considerably as European and London traders end their day and exit the U.S. market. Volume and momentum decrease and reversals often occur. \n\n**7.** 12:00 - 1:15 - Volume and momentum slows even more as the NY lunch hour begins. Reversals may happen. \n\n**8**. 1:15 - 2:00 - Volume begins to pick up. The contraction during lunch begins to expand and price breakouts can occur as NY traders return from lunch.\n\n**9.** 2:00 - 2:45 - Most stocks may see a reversal during this period. Any trends that developed during or just after lunch may reverse at 2:00 or between 2:15 and 2:45. \n\n**10.** 3:00 - 3:45 - There is often a momentum change this time with volume and momentum increasing. Often this is the last chance to take advantage of strong movement within a stock until the final selling and buying at the end of the day. Bargain hunters enter the market and grab low priced stocks at the end of the day or ride the momentum of upstanding stocks. If a stock is dropping, reluctant sellers shed loss positions and bargain hunters snatch them up. \n\n**11.** 3:45 - 4:00 - The final 15 minutes may see drastic price movements, price jumps or rapid declines. If you plan to close a position it’s probably best to do it before the last 5 minutes. \n\nA trader who understands these intraday market patterns will know when to wait before making a trade. If a market slow down is potentially going to happen, a trader may choose to wait a few more minutes before making a trade to determine the new trajectory our to ensure the momentum is still moving in the right direction. \n\n**Annual Repeating Patterns**\n\nThe chart below illustrates the general pattern of all the markets. You can see there are common repeating periods where the markets are rising or falling. These patterns can be seen in the overall performance of the markets and stocks for each month. If you look at the annual charts for the markets, they generally follow this pattern with variations. Some years like the pandemic years are anomalies, but for the most part, markets follow this pattern every year. Why is this important?\n\n[Annual Market Pattern](https://preview.redd.it/fh1z4ln0y9pd1.png?width=1188&format=png&auto=webp&s=2f0cb6deeca2120145d4c63bdbcf5d07ed49c3d3)\n\nFor me and especially because of my trading style which combines day trading and swing trading, I listen to how the markets breath. I trade more assertively during periods of upswing, less assertively during seasonal periods of decline. I generally day trade stock worth long term investing and only trade the stock when the stock has analyst Buy and Strong Buy ratings and the stock's price is below the average analysts price target. In other words the stock should go up so if I absolutely have to hold a losing stock, I will, if I'm trading in a seasonal upswing. If I'm approaching a seasonal downswing period, I will tend not to hold any stock and make it a point to move out of any Swing positions I have to be \"In Cash\" because I also try to buy Swing positions at a relative low during the worst market periods so I can ride them up during the next incoming good period.\n\nThe chart is a stacked chart to easily visualize the up and down of each of the markets and how they coincide. There is no significance for the numbers on the Y axis, except they are used to rank each month in relation to best, worst, good, or bad - historic data. This is a stacked chart and no significance to which market is on top or middle or bottom. They are stacked so you can easily see that all three follow the same annual pattern. This is only a guideline, and every year is different but influenced by the same pressures that create the general pattern.",
        "created_utc": 1726537507.0,
        "subreddit_name": "DayTrading",
        "comments": 15
    },
    {
        "title": "AAPL doing something good?",
        "score": 0,
        "url": "https://youtu.be/5cey7uMYRBI?si=Dr7DoDWckHdaeCge",
        "content": "r/CapConspiracyTrading",
        "created_utc": 1726545446.0,
        "subreddit_name": "AAPL",
        "comments": 1
    }
]