[
    {
        "title": "Data confirms Musk's destruction of the Tesla brand: He's driving away many of his core customers",
        "score": 9005,
        "url": "https://www.reddit.com/r/stocks/comments/1ca9qkq/data_confirms_musks_destruction_of_the_tesla/",
        "content": "📉 last Fall, the proportion of Democrats buying Teslas fell by more than 60%, precisely when Musk became most vocal on X\n\n📉 the mix of Democrats, who have been core constituents for the Tesla brand, had remained mostly steady up to that point\n\n📈 gains with Republicans and Independents haven't been enough to make up the loss\n\n**Source:** [Elon Musk Lost Democrats on Tesla When He Needed Them Most](https://archive.ph/kHNTB)",
        "created_utc": 1713789732.0,
        "subreddit_name": "stocks",
        "comments": 1692
    },
    {
        "title": "Tesla slides 3% in premarket, Li Auto sinks 8% as EV makers slash prices amid fierce competition",
        "score": 347,
        "url": "https://www.reddit.com/r/stocks/comments/1ca7th4/tesla_slides_3_in_premarket_li_auto_sinks_8_as_ev/",
        "content": "**Tesla slides 3% in premarket, Li Auto sinks 8% as EV makers slash prices amid fierce competition**  \n[https://www.cnbc.com/2024/04/22/tesla-shares-slide-li-auto-sinks-as-ev-makers-slash-prices.html](https://www.cnbc.com/2024/04/22/tesla-shares-slide-li-auto-sinks-as-ev-makers-slash-prices.html)\n\n  \n*KEY POINTS*\n\n* *Tesla reportedly cut the starting price of its Model 3 in China to 231,900 yuan ($32,000) on Sunday, a reduction of 14,000 yuan.*\n* *Chinese rival, Li Auto, also cut prices for its models, including the L7, L8, L9, and the newly launched MEGA SUV.*\n* *Hong Kong-listed shares of Li Auto plummeted to an 11-month low Monday.*\n\n  \n*Tesla shares sank in premarket trading on Monday, while China’s Li Auto plummeted to an 11-month low, after both companies slashed prices of their electric vehicles in various markets amid intense competition.*  \n*U.S. EV giant Tesla cut the starting price of its Model 3 in China to 231,900 yuan ($32,000) on Sunday, a reduction of 14,000 yuan, as reported by Reuters. The report also said it had slashed prices in other major markets, like Germany.*  \n*Meanwhile, Li Auto cut prices for its models, including the L7, L8, L9, and the newly launched MEGA SUV, it said on its Weibo account on Monday. The cuts for the models were reportedly up to 30,000 yuan.*  \n*Checks by CNBC of both Tesla and Li Auto websites on Monday showed their vehicles were listed at the updated prices.*  \n*Hong Kong-listed shares of Li Auto fell 8.3% to their lowest level in 11 months during the Monday session, while shares of other Chinese EV makers also fell — Nio was down 1.7%, Xpeng off 1.9% and BYD down 0.2%.*  \n*These price reductions come at a time when competition in China’s EV space has intensified, with local automakers pushing to outsell U.S. rival Tesla with fancy tech and competitive pricing.*  \n*Eugene Hsiao, head of China equity strategy at Macquarie Group, said in a research note over the weekend that all of China’s biggest EV makers have one goal in mind — “taking the crown from Tesla,” while noting that it is the most competitive domestic auto market in recent history.*  \n*Hsiao said the price discounts were just one facet of a variety of strategies that big EV players in China are using to survive “the coming wave of industry consolidation.”*  \n*Chinese smartphone maker Xiaomi launched its SU7 electric car earlier this month and priced it at about $4,000 less than Tesla’s Model 3. The company also claimed the new car would have a longer driving range.*",
        "created_utc": 1713783699.0,
        "subreddit_name": "stocks",
        "comments": 86
    },
    {
        "title": "New York Stock Exchange tests views on round-the-clock trading",
        "score": 230,
        "url": "https://www.reddit.com/r/stocks/comments/1cabi7o/new_york_stock_exchange_tests_views_on/",
        "content": "https://www.ft.com/content/31c3a55b-9af9-4158-8a49-4397540571bf\n\n> The New York Stock Exchange is polling market participants on the merits of trading stocks around the clock as regulators scrutinise an application for the first 24/7 bourse.\n\n> The survey by the NYSE, part of Intercontinental Exchange, was put out by its data analytics team rather than its management, but it highlights the growing interest in trading the likes of Nvidia or Apple overnight between 8pm and 4am Eastern time.\n\n> An overnight exchange, however, would be a step-change in how late trading is perceived because of its heavy regulatory oversight compared with dark pools. Exchanges are directly supervised by the Securities and Exchange Commission and tested for their stability and security as well as needing approval to alter any rules.\n\n> NYSE’s survey asked respondents whether they thought round-the-clock trading should take place at weekends as well as through a five-day week, how investors should be protected from price swings, and how respondents would staff any overnight session.\n\n> It also asked whether people agreed that “time spent thinking about overnight trading would be better spent on regular market hour trading”.",
        "created_utc": 1713794352.0,
        "subreddit_name": "stocks",
        "comments": 89
    },
    {
        "title": "Apple AirPods are designed to die: Here’s what you should know",
        "score": 7549,
        "url": "https://pirg.org/edfund/articles/apple-airpods-are-designed-to-die-heres-what-you-should-know/",
        "content": "",
        "created_utc": 1713794538.0,
        "subreddit_name": "technology",
        "comments": 1638
    },
    {
        "title": "Apple Acquires French AI Company Specializing in On-Device Processing",
        "score": 1155,
        "url": "https://www.macrumors.com/2024/04/22/apple-acquires-french-ai-company/",
        "content": "",
        "created_utc": 1713798772.0,
        "subreddit_name": "apple",
        "comments": 216
    }
]