[
    {
        "title": "Facebook Faces Legal Risk Similar to Big Tobacco or OxyContin, Analyst Says",
        "score": 2919,
        "url": "https://www.reddit.com/r/stocks/comments/q5y7in/facebook_faces_legal_risk_similar_to_big_tobacco/",
        "content": " [https://www.barrons.com/articles/facebook-faces-legal-risk-big-tobacco-oxycontin-51633956119](https://www.barrons.com/articles/facebook-faces-legal-risk-big-tobacco-oxycontin-51633956119)\n\n(PAYWALL)\n\nFrom the Article:\n\nRecent revelations and scrutiny from Congress over Facebook's(FB) role in society  could lead to major lawsuits against the social-media giant, according to new  research that drew comparisons with litigation faced by Big Tobacco or Purdue  Pharma. \n\nFacebook (FB) has been  under pressure following a series of reports by The Wall Street  Journal that made allegations covering Instagram's impact on teenagers'  mental health, whether its algorithm encouraged social discord, and how it  moderates elites. \n\nA company whistleblower who leaked internal documents to the Journal also  testified before Congress last week, as lawmakers turned their  attention to the renewed public debate over Facebook's(FB) prominent role in peoples' lives. \n\nFacebook (FB) co-founder  and CEO Mark Zuckerberg last week said that \"many of the claims  don't make any sense,\" pushing back against allegations that arose in the  Journal's reports and the whistleblower's testimony, in a post on social  media. \n\nBlair Levin, an analyst at London-based technology industry research  group New Street Research, wrote Sunday that \" while we have been  skeptical that past revelations would lead to government action, we think this  time is different and as a result, we think Facebook(FB) may now face a similar challenge from  increased litigation as tobacco, or more recently, OxyContin.\" \n\nLevin served as chief of staff to the chair of the Federal  Communications Commission in the 1990s. \n\nThe analyst said that while the facts and damages are different for Facebook(FB) than those faced by  the tobacco industry or Purdue Pharma -- the maker of opioid medication  OxyContin -- the fundamental legal framework is the same. \n\nThere is a product with problematic consequences for many people, management  knowledge of such, and actions by management \"that not only failed to mitigate  the harm but arguably increased those problematic consequences,\" Levin said. \n\nIn the same way that public outcry against tobacco and opioid makers led to  massive class action and state attorneys general-led lawsuits, Levin said the  recent revelations against Facebook(FB) creates similar incentives to bring  litigation against the company. \n\nWhile Facebook(FB) has  faced scrutiny before, there is far more attention on the company this time, in  part because of the role that harms to children plays in the recent allegations,  Levin noted. \n\n\"Discovery is likely to yield even more problematic evidence for Facebook(FB), and the dynamics  create an opportunity for a settlement that would address the issues more  quickly than legislation,\" Levin said. \"We think litigation is likely to be more  damaging to Facebook(FB)  than legislation.\" \n\nFacebook (FB) stock was  0.7% lower in U.S. premarket trade Monday. The stock is down 12.3% over the past  month. Facebook (FB) didn't  immediately respond to a request for comment.",
        "created_utc": 1633965750.0,
        "subreddit_name": "stocks",
        "comments": 351
    }
]