[
    {
        "title": "Grandparents left me Disney stock but never told me",
        "score": 2939,
        "url": "https://www.reddit.com/r/stocks/comments/mz2ue8/grandparents_left_me_disney_stock_but_never_told/",
        "content": "So I found out my grandparents purchased 8 shares of Disney stock for me in 1992 and 16 shares in 1998 and then completely forgot about them.  They were put in my parents name.  We found the actual stock certificates after going through some old boxes.   Apparently in 2016 the state I live in (Virginia) sold the stock as there are some laws that say(I'm terribly paraphrasing as I don't understand this at all) if nothing was done with the stock and it was deemed inactive, ownership of the stock is given to the state of the last known residence of the original owner.  We called the state office and they told us to fill out a bunch of paperwork and submit it to the state to see what can be done about recouping some of the funds from the sale.  \n\nSorry if this is not the right place for this post or if it doesn't make sense lol I'm just trying to find some answers.  Some friends of mine mentioned that with the Disney stock splits back in the 90s those 24 shares could have turned into a decent amount of cash.  I appreciate any insight you all could provide!\n\nEdit: I'm looking at them now.  The 8 shares bought in 1992 were purchased in December of that year so post split and the 16 shares purchased in 1998 were purchased on July 9th of that year.  So would that mean the 8 from 1992 would have turned into 24 in 1998 and the 16 bought in 1998 look like they missed the split by like 3 weeks (lol god dammit) for a total of 40 shares in 2016 when the state sold them?",
        "created_utc": 1619457657.0,
        "subreddit_name": "stocks",
        "comments": 292
    },
    {
        "title": "Privacy | App Tracking Transparency | Apple",
        "score": 5529,
        "url": "https://www.youtube.com/watch?v=Ihw_Al4RNno",
        "content": "",
        "created_utc": 1619460279.0,
        "subreddit_name": "apple",
        "comments": 475
    },
    {
        "title": "Apple unveils $1B investment to build east coast hub in Research Triangle Park in North Carolina, create at least 3,000 jobs",
        "score": 4079,
        "url": "https://abc11.com/business/apple-unveils-plans-for-east-coast-hub-in-research-triangle/10547896/",
        "content": "",
        "created_utc": 1619436230.0,
        "subreddit_name": "apple",
        "comments": 293
    },
    {
        "title": "Dividend rising?",
        "score": 4,
        "url": "https://www.reddit.com/r/AAPL/comments/mz1lw4/dividend_rising/",
        "content": "Is AAPL going to raise the dividend this time around?",
        "created_utc": 1619454424.0,
        "subreddit_name": "AAPL",
        "comments": 1
    },
    {
        "title": "What do you expect for aapl price this week ? Should we sell before 28th of April or not ?",
        "score": 3,
        "url": "https://www.reddit.com/r/AAPL/comments/myna3a/what_do_you_expect_for_aapl_price_this_week/",
        "content": "What do you expect for aapl price this week ? Should we sell before 28th of April or not ?\n\n[View Poll](https://www.reddit.com/poll/myna3a)",
        "created_utc": 1619403081.0,
        "subreddit_name": "AAPL",
        "comments": 24
    }
]