[
    {
        "title": "SoftBank is sitting on trading gains of about $4 billion after founder Masayoshi Son’s bets on equity derivatives,",
        "score": 1625,
        "url": "https://www.reddit.com/r/investing/comments/inyom9/softbank_is_sitting_on_trading_gains_of_about_4/",
        "content": " \n\n[SoftBank Group Corp.](https://www.bloomberg.com/quote/9984:JP) shares tumbled in Tokyo trading after reports that the Japanese conglomerate made substantial bets on equity derivatives amid the surge in technology stocks.\n\nSoftBank shares dropped as much as 5.4%, the most on an intraday basis since April. The stock had gained 33% this year before Monday.\n\nThe Financial Times, Wall Street Journal and [Zero Hedge](https://www.bloomberg.com/news/terminal/QG8ZJIMB2SJO) reported that SoftBank was making massive bets on technology stocks using equity derivatives. The FT labeled SoftBank the “Nasdaq whale” that “stoked the fevered rally in big tech stocks,” though it didn’t include details of any trading. The FT later reported that SoftBank is sitting on trading gains of about $4 billion after founder Masayoshi Son’s bets on equity derivatives, citing people with direct knowledge of the matter.\n\n The Japanese conglomerate [said in August](https://www.bloomberg.com/news/articles/2020-08-11/softbank-returns-to-profit-after-record-losses-on-startup-bets) that it was starting a new unit to trade public securities, pushing beyond its traditional base in telecommunications and private startup investments. Bloomberg [reported](https://www.bloomberg.com/news/articles/2020-08-11/softbank-is-said-to-target-over-10-billion-in-public-investing) in August that SoftBank was targeting investments of more than $10 billion, perhaps tens of billions, and would use financing structures that would allow the company to avoid showing up in public disclosures of shareholding. \n\n \n\nThe Japanese company’s derivatives strategy has been built over the past few months, the FT cited the people as saying, adding that SoftBank has spent about $4 billion on options premiums focused on tech stocks over that time. SoftBank now has large but unrealized profits, and the trades have been deeply controversial even within SoftBank, the newspaper reported.\n\nSoftBank declined to comment.\n\nThe Wall Street Journal reported that SoftBank spent about $4 billion buying call options on stocks, while also selling call options at higher prices.\n\n \n\nThe idea that options buyers [could drive extreme rallies](https://www.bloomberg.com/news/articles/2020-09-04/option-traders-flex-market-muscles-with-focus-on-very-few-stocks) in technology stocks -- and push benchmark indexes to record highs -- would have drawn skepticism in the past. But as call volumes have exploded in stocks such as Apple Inc., Amazon.com Inc. and Tesla Inc., analysts are beginning to embrace the theory. They point out that traders could have outsize influence by concentrating their bets on a narrow set of high-profile names while other trading activity is reduced.\n\n“In a world where volumes are distorted by the frantic trading of algos, any real order flows may have surprisingly large impact on prices,” Peter Tchir, head of macro strategy at Academy Securities, wrote in a note Tuesday. “By trading options, they leverage their position.”\n\n[https://www.bloomberg.com/news/articles/2020-09-06/softbank-s-4-billion-trading-gains-on-u-s-stock-option-bet-ft](https://www.bloomberg.com/news/articles/2020-09-06/softbank-s-4-billion-trading-gains-on-u-s-stock-option-bet-ft)",
        "created_utc": 1599443745.0,
        "subreddit_name": "investing",
        "comments": 215
    }
]