[
    {
        "title": "Apple loses EU court battle over 13 billion euro tax bill in Ireland ",
        "score": 867,
        "url": "https://www.reddit.com/r/stocks/comments/1fdcraa/apple_loses_eu_court_battle_over_13_billion_euro/",
        "content": "Europe’s top court on Tuesday ruled against Apple in the tech giant’s 10-year court battle over its tax affairs in Ireland.\n\nThe pronouncement from the European Court of Justice comes hours after Apple unveiled a swathe of new product offerings, looking to revitalize its iPhone, Apple Watch and AirPod line-ups.\n\nCNBC has reached out to Apple for comment. The company’s shares were down 1% in premarket trading at 09:07 a.m. London time.\n\nIn 2014, the European Commission, the European Union’s executive arm, opened an investigation into Apple’s tax payments in Ireland, the tech giant’s headquarters in the EU.\n\nThe Commission in 2016 ordered Dublin to recover up to 13 billion euros ($14.4 billion) in back taxes from Apple, at the time saying that the tech company had received “illegal” tax benefits from Ireland over the course of two decades.\n\nApple and Ireland appealed the Commission’s decision in 2019, and in 2020 the EU General Court sided with the U.S. tech giant. The EU’s second-highest court anulled the Commission’s 2016 decision and said that the executive arm did not prove that the Irish government had given Apple a tax advantage.\n\nThe Commission in turn appealed the General Court’s decision, sending the litigation up to the ECJ.\n\nThe case, which first began under outgoing competition chief Margrethe Vestager, highlights the continued conflict between U.S. tech giants and the EU, which has sought to tackle issues from data protection to taxation and antitrust.\n\nThis was not the last time that Apple found itself in the EU’s crosshairs. Most recently, the Commission hit the iPhone maker hit Apple with an antitrust fine of 1.8 billion euro ($1.99 billion) in March for abusing its dominant position in the market for the distribution of music streaming apps.\n\nSeparately, the EU’s sweeping Digital Markets Act has forced companies to change some of their practices in Europe. The Commission has opened various investigations under the DMA into tech giants, including Apple, Alphabet and Meta.\n\nSource: https://www.cnbc.com/2024/09/10/apple-loses-eu-court-battle-over-13-billion-euro-tax-bill-in-ireland.html",
        "created_utc": 1725956059.0,
        "subreddit_name": "stocks",
        "comments": 257
    },
    {
        "title": "Introducing the iPhone 16, the biggest innovation in losing your money since Robinhood",
        "score": 13741,
        "url": "https://i.redd.it/18ktr8i1qynd1.jpeg",
        "content": "",
        "created_utc": 1725965658.0,
        "subreddit_name": "wallstreetbets",
        "comments": 422
    },
    {
        "title": "Apple’s $3.3 Trillion Gamble on AI iPhone 16 Backfires as Stock Sinks and Investors Yawn",
        "score": 4644,
        "url": "https://www.forbes.com.au/news/investing/apples-ai-iphone-16-stock-slumps-at-new-launch-event/",
        "content": "",
        "created_utc": 1725926631.0,
        "subreddit_name": "wallstreetbets",
        "comments": 549
    },
    {
        "title": "My reaction at every iPhone release nowadays",
        "score": 4021,
        "url": "https://i.redd.it/9k477dndgynd1.png",
        "content": "",
        "created_utc": 1725962431.0,
        "subreddit_name": "wallstreetbets",
        "comments": 265
    },
    {
        "title": "Apple Watch blood oxygen detection won’t be available on the Series 10 in the U.S.",
        "score": 1490,
        "url": "https://techcrunch.com/2024/09/10/apple-watch-blood-oxygen-detection-wont-be-available-on-the-series-10-in-the-u-s/",
        "content": "",
        "created_utc": 1726000010.0,
        "subreddit_name": "apple",
        "comments": 329
    },
    {
        "title": "Apple Releases New AirPods Pro 2 Firmware With Support for iOS 18 Features",
        "score": 1344,
        "url": "https://www.macrumors.com/2024/09/10/apple-releases-new-airpods-pro-2-firmware-3/",
        "content": "",
        "created_utc": 1725994684.0,
        "subreddit_name": "apple",
        "comments": 179
    },
    {
        "title": "Apple loses EU court battle over 13 billion euro tax bill in Ireland",
        "score": 1168,
        "url": "https://www.cnbc.com/2024/09/10/apple-loses-eu-court-battle-over-13-billion-euro-tax-bill-in-ireland.html",
        "content": "",
        "created_utc": 1725961376.0,
        "subreddit_name": "apple",
        "comments": 298
    },
    {
        "title": "iPhone 16 USB-C Still Limited to USB 2, No Change for 16 Pro Either",
        "score": 1144,
        "url": "https://www.macrumors.com/2024/09/09/iphone-16-usb-c-usb-2-speed/",
        "content": "",
        "created_utc": 1725954980.0,
        "subreddit_name": "apple",
        "comments": 527
    },
    {
        "title": "Apple Watch cellular version no longer feature a red ring on the Digital Crown",
        "score": 743,
        "url": "https://www.reddit.com/r/AppleWatch/comments/1fdft93/cellular_variant_no_longer_feature_a_red_ring_on/",
        "content": "",
        "created_utc": 1725968841.0,
        "subreddit_name": "apple",
        "comments": 137
    },
    {
        "title": "iPhone 16/Pro Impressions: The Great Separation!",
        "score": 704,
        "url": "https://youtu.be/9lx11dy9J30?si=ygiyjws5SeE2QfuJ",
        "content": "",
        "created_utc": 1725975808.0,
        "subreddit_name": "apple",
        "comments": 768
    }
]