[
    {
        "title": "Reminder - Whether you own GME or not - CHANGE YOUR GODDAMN BROKER",
        "score": 9105,
        "url": "https://www.reddit.com/r/stocks/comments/lbzkbi/reminder_whether_you_own_gme_or_not_change_your/",
        "content": "Hello everyone,\n\nLast weekend I created a [thread](https://www.reddit.com/r/stocks/comments/l8rhr3/weekend_gme_thread_homework_for_all_lets_stop/?), in which I documented which brokers stopped people from purchasing specific securities, and which ones didn't.\n\nBefore it gets forgotten, I want to bring that list back again, and insist that you get a new broker if yours is one of the bad ones.\n\nThis is a much, MUCH bigger issue than you think, and this can and WILL affect you eventually, if you stay with a broker that decides that you cannot trade a security that they don't want you to trade. Note that the securities affected were not just meme stocks, several large stocks some of you might own or have heard about were restricted and their price was thus manipulated, including:\n\n- General Motors\n- Rolls Royce\n- Trivago\n- Workhorse Group\n- Jaguar Health\n\nAnd [many more](https://finance.yahoo.com/news/robinhood-expands-trading-restrictions-50-225241993.html).\n\nWhen boomer stocks get affected, this means the entire free market is at risk and the next time this happens you might be the one unable to trade your favorite stock if you continue using a bad discount broker. \n\n**Whether this is the broker's fault or their clearinghouse's fault is irrelevant, the result is your inability to engage in the free market.** This behavior needs to be punished to ensure other brokers don't start doing the same thing.\n\nHere is my list of brokers which I will continue to update, as per the [previous thread](https://www.reddit.com/r/stocks/comments/l8rhr3/weekend_gme_thread_homework_for_all_lets_stop/?):\n\n\n### Horrible Brokers - Restricted purchasing of certain tickets and lied/gloated about it\n\n* Robinhood - [Now Blocking 50 Equities](https://seekingalpha.com/news/3656437-robinhoods-50-stock-limit-list?mail_subject=bb-ino-robinhood-s-50-stock-limit-list-with-spacs-makes-mass-exodus-likelier-alpha-tactics&utm_campaign=rta-stock-news&utm_content=link-73&utm_medium=email&utm_source=seeking_alpha) - [CEO lying saying they have no liquidity issues, 1 day before getting a 1 billion bailout](https://www.youtube.com/watch?v=6fs_lyGn4YA) - [Join the lawsuit against them if you were affected](https://robinhoodgamestopclassaction.com/) \n* Interactive Brokers (US/CAN) - [Display visible contempt for Retail traders, wants GME to go to 17 before re-enabling trading](https://www.youtube.com/watch?v=7RH4XKP55fM) - [Blocked Trading212, as their acting intermediary](https://www.financemagnates.com/forex/brokers/trading-212-blames-interactive-brokers-for-trade-execution-delay/)\n* E-Toro - [Proof](https://markets.businessinsider.com/news/stocks/robinhood-webull-m1-reopen-gamestop-stock-trading-2021-1-1030019926) - [Forced stop-losses](https://www.etoro.com/posts/0__entry__df95e7f0-1772-4ec7-a271-69b13ca229dd?utm_medium=Direct&utm_source=55714&utm_content=0&utm_serial=SocialSharePostcopyLink_918269&utm_campaign=SocialSharePostcopyLink_918269&utm_term)\n\n### Bad Brokers - Restricted purchasing of certain tickers\n\n* E-Trade - [Proof](https://www.theverge.com/2021/1/28/22254863/etrade-gamestop-amc-stock-reddit-wallstreetbets-robinhood)\n* Ally - [Proof](https://www.wsj.com/articles/online-brokerages-restrict-trading-on-gamestop-amc-amid-frenetic-trading-11611849934)\n* Public.com -  [Proof](https://techcrunch.com/2021/01/28/webull-and-public-remove-restrictions-on-memestocks-after-citing-trade-settlement-firm-as-the-cause/)\n* Merrill Edge - [Proof](https://www.streetinsider.com/Momentum+Movers/Merrill+Edge+said+to+have+put+restrictions+on+trading+in+AMC+Entertainment+%28AMC%29%2C+GameStop+%28GME%29/17879212.html)\n* IG Broker - [Proof](https://finance.yahoo.com/news/gamestop-amc-uk-trading-platform-163546937.html)\n* Trade Republic - [Proof](https://www.tellerreport.com/business/2021-01-29-%0A---trade-republic-and-gamestop--patronizing-investors-%0A--.BJNYXthWl_.html)\n* Webull - [Admitted they were forced to by clearing firm](https://finance.yahoo.com/news/we-bull-ceo-explains-why-trading-was-restricted-amid-the-game-stop-market-mania-172539318.html) - [Clearing firm is Apex](https://www.youtube.com/watch?v=4RS4JIEVyXM&feature=youtu.be) - They'll be moved to neutral once they publicly confirm Apex was sole reason the trades were restricted.\n* Stake - [Proof](https://hellostake.com/au/stake-updates/understanding-trading-suspensions/)\n* Trading212 - [Proof](https://inews.co.uk/news/business/gamestop-uk-trading-robinhood-trading-212-gme-stock-restricted-legal-action-850465) - [re-enabled, caused by intermediary](https://twitter.com/Trading212/status/1355074914202628098) - [Intermediary is IB](https://www.financemagnates.com/forex/brokers/trading-212-blames-interactive-brokers-for-trade-execution-delay/) - [Restricted purchasing of other securities previous](https://community.trading212.com/t/gold-buying-restricted-in-larger-quantities/27987) - Based on them restricting securities before this, and countless complaints regarding other restrictions, I've put them back in the bad list.\n\n### Neutral Brokers - Restricted trading, publicly naming their intermediary\n\n\n* Freetrade - [Proof, blames Barclays](https://www.cnbc.com/2021/01/29/gamestop-saga-uk-trading-app-freetrade-halts-purchases-of-us-stocks.html) - [CMO Interview](https://www.youtube.com/watch?v=V76UGdYAdcI&feature=youtu.be) - [CMO Tweets](https://twitter.com/v18n/status/1355258696885030915?s=19)\n* M1 Finance - [Proof](https://markets.businessinsider.com/news/stocks/robinhood-webull-m1-reopen-gamestop-stock-trading-2021-1-1030019926) - [Blames Apex Clearing](https://twitter.com/m1_finance/status/1354837064072753152)\n\n* Tastyworks - [Proof, blame Apex Clearing](https://twitter.com/thetastyworks/status/1354879706991128578)\n* Stash -  [Proof, blamex Apex Clearing](https://twitter.com/Stash/status/1354839916761518083?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1354839916761518083%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.newsweek.com%2Fwebull-blocks-gamestop-amc-transactions-stock-market-robinhood-1565172)\n* TD Ameritrade/Canada - [Proof](https://www.cnet.com/news/reddits-amc-and-gamestop-stocks-swing-wildly-after-robinhood-td-ameritrade-restrict-trades/) - [Proof2](https://www.cbc.ca/news/business/robinhood-gamestop-1.5891363) - (Margin requirements increased, Covered call and short put orders may only be placed with a broker and support times are > 2h, other trades restricted) - Neutral because they didn't restrict the purchase of stocks with cash.\n* Revolut - [Proof](https://www.financemagnates.com/forex/brokers/gamestop-buyers-suffer-another-setback-as-revolut-bans-trading/) - Blames DriveWealth LCC\n\n### Good Brokers - Did not restrict trading\n\n* Most Canadian Brokers (Questrade, Qtrade, Disnat, BMO, HSBC, RBC, TD, etc.)\n* Most European Brokers (Swissquote, TradeStation, Degiro)\n* Fidelity \n* Vanguard\n* WealthSimple (CAN, US)\n* Schwab (Margin requirements increased)\n* You Invest (JP Morgan/Chase)\n* Capital.com\n* Wells Fargo - [allowed trades but banned its advisors from talking about GameStop](https://www.barrons.com/articles/wells-fargo-blocks-advisors-from-recommending-gamestop-amc-51611870929)\n* Nordnet\n* Citibank\n\n---\n\nAgain, get a new broker. \n\nThanks",
        "created_utc": 1612389635.0,
        "subreddit_name": "stocks",
        "comments": 1156
    },
    {
        "title": "GME short squeeze what comes next part 2",
        "score": 21908,
        "url": "https://www.reddit.com/r/stocks/comments/lbuhp0/gme_short_squeeze_what_comes_next_part_2/",
        "content": "**EDIT: Added a warning because people in the comments seem to think I’m trying to manipulate people**\n\n**WARNING: THIS IS AN EXTREMELY RISKY PLAY: THERE ARE NO METRICS OR CURRENT DATA TO PROVIDE SOLID DD TO HAVE A MORE “CERTAIN” OUTCOME. WHAT YOU ARE TRULY BETTING ON IS OTHER PEOPLE. I WONT TRY TO CONVINCE YOU WHAT TO DO WITH YOUR MONEY. THIS IS MY SPECULATION, MY OPINION  AND IT VERY WELL COULD BE WRONG**\n\nHello all, \n\nI wanted to post last night as many of you commenters have asked for however my building lost power and it was absolutely awful. I am currently a refuge and my ladies house and wanted to get this out to the world.\n\nDisclaimer: I am not a financial advisor, but more importantly this is all simply speculation. If anyone wants to make counter claims they are more than welcome but word of advice to all readers. If anyone is claiming that they know exactly what is going to happen...they are lying. There simply isn't enough current data to push this either direction. I am a bull, big time and I would like to explain why.\n\n**First let's talk about yesterday**\n\nThere are a lot of claims of short ladder attacks and the counter-claim is that it was MM's moving the price down. One thing appears certain, there is some sort of manipulation happening in an attempt to drive the price down. Whether this is MM's, HF's, or simply retail shorts and bears; there are a strange number of exchanges happening in a clear effort to lower the price. You can check out the real time quotes [here](https://www.nasdaq.com/market-activity/stocks/gme/latest-real-time-trades).\n\nAnother large thought about why the price should have gone **up** yesterday was because of the options thats expired Friday 1/29 ITM. The rule is T+2 meaning these individuals have two business days to cover. Well, we expected a surge of these individuals covering and it simply never came. Everyone was glued to the screen Friday ATH waiting to see the spike of covering...but it never happened. Monday again...never happened. Tuesday...oh boy this is their last day they have to cover! Yet...they didn't. So what does this mean? Well, I see two possibilities.\n\n1. They somehow timed it perfectly and covered throughout the dips and spikes\n2. They haven't covered yet\n\nI'm in the camp of number 2 hence why I am a bull. If they didn't cover that results in a Failure to Deliver which you can learn about [here](https://www.investopedia.com/terms/f/failuretodeliver.asp). So what does this mean for us? Well, that would explain the tremendous price drop as FTD's create \"phantom shares\" a problem GME is already facing. This will dilute the price tremendously and the amount of FTD's that probably occurred would greatly dilute the price. \"With [forward contracts](https://www.investopedia.com/terms/f/forwardcontract.asp), a party with a short position's failure to deliver can cause significant problems for the party with the [long position](https://www.investopedia.com/terms/l/long.asp). This difficulty happens because these contracts often involve substantial volumes of assets that are pertinent to the long position's business operations.\" From the earlier mentioned website regarding FTD's.\n\nNow this is truly fascinating. The 2008 crisis was largely in part due to a mass number of FTD's. In fact, FTD's sometime intentionally happen...just to drive the price down for FUD so they can then cover at a better price. \n\nSo if this is correct, what happens next? Well, either you can [read about it here](https://financialreview.poole.ncsu.edu/wp-content/uploads/2015/07/Fails-to-deliver_before_and_after_the_implementation_of_Rule_203_and_Rule_204.pdf). Simply put, the individual has to close out the positions after 13 consecutive settlement days of FTD. So all this logic about T+2 was actually just the logic to begin the FTD countdown, if it hasn't already started at the beginning of this.\n\nNow, I'm not saying \"nobody sold\" of course people did. But volume is key and the interest in buying outweighed the interest in selling 3-1 Monday and Tuesday. Of course trades are 1-1 but interest was on the buyer side. \n\nObviously, I don't even need to mention it but restricted trading really is what screwed this thing to begin with. My opinion? It wasn't to prevent a massive short squeeze, it was to buy them time.\n\n**Today**\n\nSo why the hell did it spike this morning? Two reasons.\n\n1. RH still has 100 shares limit on GME, now for those who don't realize, that doesn't mean that is 100 shares per day. No no. The restriction is you can own up to 100 shares of GME. If you already own over 100 shares that's fine, but anyone with less than 100 shares can only add up to that amount. This restriction has not changed and other companies such as Revolut are still imposing a 100% trading restriction on GME. So what did RH offer today? The ability to purchase fractional shares, which doesn't help a whole lot but the fact that buying pressure accelerated at the notion of fractional shares shows that there is still an immense amount of buyers out there.\n2. GameStop [adds new CTO to the roster, an ex AWS lead engineer.](https://www.globenewswire.com/news-release/2021/02/03/2169124/0/en/GameStop-Appoints-Chief-Technology-Officer.html) They added other executive positions as well. This further cements the change the company is taking.\n\nNow, before I get into the rest I want to address something: the fundamentals.\n\nThere is a disturbing echo chamber around the idea that GameStop is a dying brick and mortar retailer and there is no chance at survival. That is simply not the case. I don't want to do a full GME DD here because this is about the second incoming squeeze. However, let me put it to you this way:\n\nIf you were told that a new company was IPO'ing and it was coming to the market with an infrastructure, new talented team, 50 million customers and their plan was to become an e-commerce company to compete with Amazon; their plans for the physical locations was to be game-centric, a place for e-sports to compete, desktop building kiosks, and the newest systems and physical copies of games for those who still love having a physical copy. Not just that, but this company already has revenue share deals with Microsoft and other bigwig companies.\n\nKnowing all that information would you be interested in this company? My answer is an easy yes. The thing with digital transformation and companies changing direction is people get so lost in what the company used to be they can't see what the company is planning on becoming. If this was a brand new company that Ryan Cohen was leading with the same exact model people would be all over the concept. \n\nEnough of that. Let's talking about what is still going on today which is truly fascinating. \n\nSo the good news created a large uptick follow by a combination of people escaping with whatever gains they could salvage and some more clear manipulation regardless of the source. But then what? Well, after the bounce down a lot of people saw this as a fantastic buying opportunity which made it recover quickly...but then something interesting started happening. It started uptrending. Slowly. Steadily. Uptrending. Lower lows, higher highs; no sight more beautiful. \n\nMy interpretation? We found the bottom of the bears attack. The news has been consistently saying the squeeze is over but one and at time they are saying their might be a second surge and their reasoning is if retailors see this price drop as a buying opportunity instead of red flags, it will surely send the price up. The logic there is simple: if people are buying stock it goes up, if people are selling, it goes down. \n\nSo today is pure magic. It doesn't need to be a wild swing up to be promising. What it needs to be is slow, consistent buying pressure even during restricted trading. \n\nBut all the shorts covered! Simply not true. That is a fact. All we know is what people are telling us. Melvin says they covered. It will be the third time they have claimed that. Do I think they covered? Yes, I do. Does that matter? No. Now even if Melvin and others covered and the S3 figures are right that means the guess right now is that this stock is still 57% short. Based on their Twitter this isn't including newly opened positions which anyone in their right mind would certainly open a short position when it was 3-400. They thought this bubble would pop and they would make a quick buck. They saw it get down to $85 and started celebrating...but it starting climbing...uh oh.\n\nTruth is, no one will know the real numbers until the 9th. I think it's a little too much tin foil hat to says those numbers will be misconstrued but what we have witnessed over the past few days...it's possible. \n\nSo let's talk about who is currently holding GameStop. Well, a shit ton of degenerates that have lost millions of dollars and seemingly don't give a shit. They are here out of principle, truth be told, so am I. I absolutely refuse to give any shares to the shorts after the crap they pulled last week. So we have a ton of bag holders refusing to sell and a ton of people wondering if now is the time to get in for a potential epic second short squeeze. No one is going to sell at these levels. Some people here and there but it simply isn't worth it, not with so much potential for a second squeeze.\n\n**So when will this second squeeze happen?**\n\nIf the newest shorts are smart, it already begun. If I took up a short position and saw this start climbing again after everything it has been through, you better believe I would be covering now while I have profits. Not all of them are going to do this, which is why as the price gradually rises the potential for a larger and larger squeeze is exponential. There is no telling when it will happen. It could be a slow climb for the next couple of weeks before it pops. The 9th will be a huge indicator of what is to come, if that has anywhere above 50% short interest you better believe everyone is going to hop right back into it. It could happen as early as this week. It could be post earnings when Papa Cohen tells us his majestic plans during ER. It could be that ER will actually be fantastic on 03/05 because it will have the console cycle numbers. Look at GME charts in the past, the console cycle always makes the stock pop and with all this attention that very well could be the catalyst.\n\n**In summary**\n\nI wanted to do deeper analysis for you all but I knew some of you were really looking forward to the next post and my thoughts regarding the situation so I wanted to get something out there. In my opinion, a second surge, a second squeeze is bound to happen. This is a buying opportunity for those who missed the first one and I think the market and stock price is reflecting that sentiment. \n\nPositions:\n\n1100 GME @ $16 closed\n\n500 GME @ $20 closed\n\n50 GME @ $120 open\n\n236 GME @ $250 open\n\n&#x200B;\n\n**TL;DR:** I have yet to see any indication or good thesis to explain why the short squeeze would be over. Even if Melvin covered and even if S3 numbers are correct at a 57% short, these are indicators of another squeeze, potentially even more epic. The bleeding days of red on Monday and Tuesday I personally think was a combination of panic selling when premarket and ATH didn't blow up due to the ITM calls and phantom shares being created due to consistent FTD's diluting the share price. I do think these FTD's were intentional and what many are perceiving as a short ladder attack is in fact the creation and purchasing of phantom shares driving the price down. If you are a bagholder, I think it wise to hold, if you have already closed your position I would consider what we are witnessing as another buying opportunity.\n\nFinal disclaimer. I have already made a significant sum of money on this GME play. This post is not a hope that you will come rescue me from my bagholding status. The money I put back in was money I was willing to lose and I came back in out of principle to stick it to the man. Good luck everyone and be grateful to be alive during this time, this will go down in financial history quite possibly forever. Retail investors have more power than we think.",
        "created_utc": 1612377134.0,
        "subreddit_name": "stocks",
        "comments": 3805
    }
]