[
    {
        "title": "30 Seconds From Triggering Market Nuclear Bomb",
        "score": 68605,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l7bpf5/30_seconds_from_triggering_market_nuclear_bomb/",
        "content": "I'm glad this place has quieted down enough for some actual DD written by a monkey with a keyboard and Adderall.  \n\nDisclaimer: I am that monkey.  Let me explain to you what happened, play by play.  I will give you illiterates who hate reading a spoiler up front: \n\n__We were within approximately 30 seconds of triggering a nuclear bomb that would have blown up the market.__ Do I have your attention?  Here goes:\n\n1.\t⁠Yesterday, new call option strike prices were added all the way up to $570.  Do I have to go over gamma squeezes again?  Really?  We've been over this: when deep out-of-the-money call options start being gobbled up and the price starts moving towards being in-the-money, the call writers have to hedge their risk of having their sold calls exercised, typically by buying stock.  This creates upwards pressure on the market.  We've been seeing these movements all week.\n2.\t⁠Yesterday after market, you probably saw that coordinated effort to drive the price down and spook retail investors into a mass sell-off.  It didn't work.\n3.\t⁠Last night, Robinhood sent out a message to users: you could no longer enter into new options.  You could exercise them if you had the collateral (money in the account) to do so.  Very interesting and the first sign of pants-shitting fear.\n4.\t⁠Today, the market opened very strong.  It opened so strong that we were looking at a self-perpetuating gamma squeeze all the way up way past $570.\n5.\t⁠At approximately 9:58 am, the stock had reached $468 in a parabolic move.\n6.\t⁠Two minutes earlier, at 9:56 am, Robinhood tweeted that they were not allowing users to buy GME stock, but they would allow selling.\n7.\t⁠The trend instantly halted and started a collapse downwards, before picking up a bit, especially after some retail was allowed back in.\n\nOkay, now that you are clear on the facts, understand this: The market ran out of liquidity today, or was threatening to get close enough that they killed it.  What does that mean?  It means they ran out of shares and/or capital. They wouldn't let you buy new shares because we were burning through all the shares on the market.  \n\n__I saw an unsubstantiated post from a user ([u/zshub](https://www.reddit.com/r/wallstreetbets/comments/l7bpf5/30_seconds_from_triggering_market_nuclear_bomb/gl5vgof/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf&amp;context=3)) who said a market sell order executed at $2600 for him.  Also, someone else for over [$5,000](https://www.reddit.com/r/wallstreetbets/comments/l7em07/coworker_had_a_limit_executed_of_a_little_over/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) per share. Do you get the severity of the situation, if that's true?__ It means the buying was getting to the point where it was just about to put INFINITE pressure on the price of the shares.  It means virtually any ask was getting bid.\n\nHow do you get infinite upwards pressure?  A gamma squeeze triggering the mother of all short squeezes, just like we predicted.  The call writers need shares to hedge.  Retail is still buying more.  The short sellers need over 100% of the float back.  Add these together.  There were more shares needed than existed on the open market.  That's what a liquidity crisis is.\n\n[Listen to this ](https://youtu.be/7RH4XKP55fM)to this remarkable (if infuriating) interview where the chairman of Interactive Brokers admits that they didn't have the capital to pay out the winners (us), so they took their ball and went home.  DO YOU GRASP HOW INSANE IT IS THAT HE SAID THEY NEEDED TO SHUT DOWN BUY ORDERS TO \"PROTECT THE MARKET\"? Hello!  He's not talking about the market for GME shares.  He's talking about the entire market!  The New York Stock Exchange.  The NASDAQ.  All that.\n\nRemember the movie Snowpiercer?  Do you remember that scene where the lower class people realize the soldiers who oppress them have no bullets?  Go to the 1:00 minute mark of this link: https://www.youtube.com/watch?v=EH1EtiOhr6o\n\nIt kick starts a full blown rebellion.  They have no bullets.  It's the exact same in this market:  No capital.  No shares.  Infinite losses inbound.\n\n__TL;DR: For all you who will just skip to the bottom to ask, \"Do I get my tendies now?\" the answer is this: they NEED NEED NEED your shares.  Do you get that?  HOLD.  Like the guy in the movie, scream, \"They're out of bullets!\" and create a stampede.  That's how we win.__\n\nThey needed your shares so badly that they literally risked PRISON TIME to get them.  They tried robbing you, and I'm not even exaggerating.  They were within 30 seconds of all being wiped out today.",
        "created_utc": 1611874779.0,
        "subreddit_name": "wallstreetbets",
        "comments": 7860
    },
    {
        "title": "A dark part WallStreetBets history, and why it's important for you to know and remember",
        "score": 67269,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l7b1b7/a_dark_part_wallstreetbets_history_and_why_its/",
        "content": "Edit 02/04: not a week since this post was made, here we fucking go again. History rhymes and people don’t fucking learn. If 🅱️artek didn’t get away with it, you won’t either. \n\nEdit 02/04 #2: [We did it Reddit](https://reddit.com/r/wallstreetbets/comments/lcvluc/an_update_on_the_wsb_coup_d%C3%A9tat/)! \n\n\ntl;dr on tl;dr: Founder bad, greedy, got banned for being greedy. Being greedy again with new spotlight on the sub. \n\ntl;dr, in 2020 the original founder (after being gone for years and did nothing to contribute to the sub), along with a couple of mods, attempted to monetize the sub for personal gains. Users and other mods fought back. Hundreds of users got mass banned for speaking out, mods who spoke out got removed as mods. With some help from users, mods found precedent of another sub creator getting banned for trying to monetize a sub and sent plea to Reddit admins. Reddit admins banned offenders and gave sub back to the good mods. \n\nu/SpeaksInBooleans (RIP) investigated the circumstance of the events and made video exposing the offenders:\n\n[Part 1](https://www.youtube.com/watch?v=caoF3jH7yG4)\n\n[Part 2](https://www.youtube.com/watch?v=OIFI7YzmAVI)\n\n[Part 3](https://www.youtube.com/watch?v=UcgvEVyzFlE)\n\n[Part 4](https://www.youtube.com/watch?v=4oaA2MP1WD4)\n\n[Part 5](https://www.youtube.com/watch?v=ecmL9UOINH0)\n\n[Part 6](https://www.youtube.com/watch?v=5CUqskfiRIE)\n\n[Mega thread after the victory](https://www.reddit.com/r/wallstreetbets/comments/fx5zwf/ladies_and_gentlemen_we_got_him/) for reference. \n\nIt's important to know/remember this now, because the same person that got exiled for being a tyrant is doing a media circus, trying to ride the current spotlight for personal gain, again. Hey CNN and WSJ, stop interviewing that dipshit. The sub has always been about its people, and what you guys wanted to do (as retarded as you are). No single person speaks for the sub and controls its destiny. It is in good hands with u/zjz aka u/SwineFluPandemic\n\nEdit: He is spreading complete lies about the sub and the mods that got him removed:\n\n>\tDespite being its founder, Rogozinski was kicked out of the forum in April for trying to eliminate the hate speech plaguing the community.\n\n>“There were a handful of mods who were straight up white supremacists,” he said.\n\n>“I have really thick skin and people can say whatever they want to me, but at some point there’s a moral standpoint — like with my kids, I don’t want them to think, ‘Well, they can say whatever they want about you,’” he told the paper.",
        "created_utc": 1611873178.0,
        "subreddit_name": "wallstreetbets",
        "comments": 2425
    },
    {
        "title": "Apple deserves to be $150!",
        "score": 31,
        "url": "https://www.reddit.com/r/AAPL/comments/l79gkq/apple_deserves_to_be_150/",
        "content": "Why does apple keep dropping? Smoked the earnings expectations yet still dropping.",
        "created_utc": 1611869406.0,
        "subreddit_name": "AAPL",
        "comments": 19
    },
    {
        "title": "AAPL still a buy at $140. The first $3 trillion company in the making!",
        "score": 16,
        "url": "https://www.reddit.com/r/AAPL/comments/l6vgfn/aapl_still_a_buy_at_140_the_first_3_trillion/",
        "content": "",
        "created_utc": 1611837022.0,
        "subreddit_name": "AAPL",
        "comments": 11
    },
    {
        "title": "Let’s do this boys, AAPL down after solid earnings, let’s all other FAANG stocks up, time for aapl to rip",
        "score": 10,
        "url": "https://i.redd.it/98r7rk9xi3e61.jpg",
        "content": "",
        "created_utc": 1611849612.0,
        "subreddit_name": "AAPL",
        "comments": 11
    },
    {
        "title": "AAPL",
        "score": 5,
        "url": "https://www.reddit.com/r/AAPL/comments/l6j1ie/aapl/",
        "content": "No enthusiasm with the blowout quarter?",
        "created_utc": 1611793947.0,
        "subreddit_name": "AAPL",
        "comments": 15
    },
    {
        "title": "Buy AAPL at 140?",
        "score": 3,
        "url": "https://www.reddit.com/r/AAPL/comments/l6llcx/buy_aapl_at_140/",
        "content": "\n\n[View Poll](https://www.reddit.com/poll/l6llcx)",
        "created_utc": 1611800809.0,
        "subreddit_name": "AAPL",
        "comments": 1
    }
]