[
    {
        "title": "Nvidia shares spike 26% on huge forecast beat driven by A.I. chip demand",
        "score": 1362,
        "url": "https://www.reddit.com/r/investing/comments/13r52us/nvidia_shares_spike_26_on_huge_forecast_beat/",
        "content": "https://www.cnbc.com/amp/2023/05/24/nvidia-nvda-earnings-report-q1-2024.html\n\nNvidia reported first-quarter earnings for its fiscal 2024 on Wednesday, with a stronger-than-expected forecast that drove shares up 26% in extended trading.\n\nHere's how the company did versus Refinitiv consensus estimates for the quarter ended in April:\n\nEPS: $1.09, adjusted, versus 92 cents expected\nRevenue: $7.19 billion, versus $6.52 billion expected\nNvidia said it expected sales of about $11 billion, plus or minus 2%, in the current quarter, more than 50% higher than Wall Street estimates of $7.15 billion.\n\nPrior to the after-hours move, Nvidia stock was up 109% so far in 2023, mostly driven by optimism stemming from the company's leading position in the market for artificial intelligence chips. Nvidia CEO Jensen Huang said the company was seeing \"surging demand\" for its data center products.\n\nNvidia's data center group reported $4.28 billion in sales, versus expectations of $3.9 billion, a 14% annual increase. Nvidia said that performance was driven by demand for its GPU chips from cloud vendors as well as large consumer internet companies, which use Nvidia chips to train and deploy generative AI applications like OpenAI's ChatGPT.\n\nNvidia's strong performance in data center shows that AI chips are becoming increasingly important for cloud providers and other companies that run large numbers of servers.\n\nHowever, Nvidia's gaming division, which includes the company's graphics cards for PC sales, reported a 38% drop in revenue to $2.24 billion in sales versus expectations of $1.98 billion. Nvidia blamed the decline on a slower macroeconomic environment as well as the ramp up of the company's latest GPUs for gaming.\n\nNvidia's automotive division, including chips and software to develop self-driving cars, grew 114% year over year, but remains small at under $300 million in sales for the quarter.\n\nNet income for the quarter was $2.04 billion, or 82 cents a share, compared with $1.62 billion, or 64 cents, during the year-earlier period. Nvidia's overall sales fell 13% from $8.29 billion a year ago.\n\n*Personal take*: I don’t even know what to say, this is simply astonishing. The AFH price puts NVDA at 20% above its previous ATH. This jump would have been insane even for 2021, let alone the tech market of 2023.\n\nAI will be the main focus and the main buzzword for the entire tech industry for the next few years, and I expect many companies to pivot toward that one way or another (even if it’s just paying PR lip service) in order to catch the wind in the sail.",
        "created_utc": 1684980801.0,
        "subreddit_name": "investing",
        "comments": 371
    }
]