[
    {
        "title": "Sharing my top companies with you.",
        "score": 3030,
        "url": "https://www.reddit.com/r/stocks/comments/fyjaff/sharing_my_top_companies_with_you/",
        "content": "I just finished my watchlist after evaluating 300+ companies. It took me two weeks of full-time reading financials, calculate the maths and look up news around the companies for the last year. You don't have to take anything for granted, I'm not a professional analyst, just a guy with a lot of time and a decent look on financials. I'm not here for credit, I just think it might help some people and since it took a lot of time, it feels like a waste if I didn't share it.\n\nIt's a lot of tech, but I feel like it's also the way to go, especially during this crisis. I'm mostly staying away from the financial and real estate, but will invest more when there's a more clear image on the situation later this year. Healthcare, Industrial, Military and Energy are very dependent on political changes, so I'm also careful with those. Anyway, here we go.\n\n**- ALPHABET -A-.** Cash king, enough to pay off all their liabilities easily. Very nice growth over the years, even when they're so big. Most of the times, you see blue chips / market leaders stagnate, but not Google. Advertising will take a hit and there might be restrictions on online privacy in the upcoming years, but they are still very strong armed to take on those setbacks.\n\n**- ARISTA NETWORKS.** Same as Google, very strong financials, growth and cash position. Only negative, is that they had a growth setback in Q4 of last year, but nothing indicates it's gonna keep on decaying. They will keep on gaining market cap from Cisco. Very innovative management team with experience in networking. They create high performance cloud networks for big datacenters. Microsoft and Facebook are some of their biggest clients.\n\n**- FACEBOOK.** This is double, I feel like next two years is a make or break for Facebook. On one hand, they still need to improve a lot on AI and control on fake news. They had (and probably still have) privacy issues as well and they will lose a lot of advertising revenue this year. On the other hand, Facebook is expanding a lot to different parts of tech. They have Oculus coming out for VR and they just started with FB Gaming. It's also not only Facebook, but they own WhatsApp and Instagram as well. To me, those are great companies at the moment and have an insane amount of users. Their growth over the past 5 years was close to 300% and they are also cash heavy.\n\n**- GALAPAGOS.** To give you some numbers: in comparison to 2017, they increased revenue by 469%, while expenses only increased by 111%. In comparison to 2015, numbers are 1391% and 253%. Their cash position is double the total liabilities and 10 times their expenses in 2019. You might say they're very ready to take on this crisis. On the operational side, they have multiple medicines in later trial phases and they're backed by biotech giant Gilead Sciences.\n\n**- INCYTE GENOMICS.** Another biotech company with great financials. They even reduced expenses since 2017, while they generated 40% more revenue. This year, 25% more hedgefunds have bought into Incyte, making it a total of 46 hedgefunds who own shares in this company. There is also 17,10% of the company owned by insiders, which shows they strongly believe in their company as well. The average insider percentage of all companies in my watchlist will be 6-8%\n\n**- LULULEMON ATHLETICA.** Steady growth. Cult-like following with their fitness programs. It's a real millennial staple. Very strategic store openings as well. I see a lot of growth potential, especially when they can get some celebrity athletes to wear their clothing. That will make their young and hip image even bigger. Quality wise, they are way better than giants like Nike and Under Armour, which will also result in better image and growing customer fanbase.\n\n**- MASTERCARD.** Very big profit margins (57% last year). One of the least best on financials in this list, but indispensable with a heavy growing e-commerce. Some might rather look at Visa, but I feel like Mastercard is more innovative. They invested in AI-powered authentication and cybersecurity. They are also more used by fintech companies, which is a sector that also will only grow the next 5-10 years.\n\n**- MICROSOFT.** No brainer. Biggest company in the world. Since their new CEO, they're headed definitely in the right direction. Microsoft changed focus from hardware to cloud computing. The cloud services are still in their early year, I see an enormous growth potential. Also very big usage of Teams. It's a personal opinion, but with those quarantine restrictions, I feel like a lot of companies will realize letting their employees work from home has a lot of financial advantages, which will result in sale of more virtual working devices.\n\n**- NVIDIA.** Market leader on semiconductors, making chips that process AI mathematic operations. They didn't grow that much in the last 3 years, but they are very cash heavy and ready to invest in the future. They are invested in all the big things for the future. Cloud, data, AI, gaming,... Some say GPU's are the best investment for the next 5, 10, 25 years, since you will find them in literally everything. For example, it will become an essential part of self-driving cars.\n\n**- VEEVA SYSTEMS.** One of the youngest company in this list, specialized in cloud computing in the pharmaceutical and life sciences industry. Best of both world if you ask me. It's revenue is mostly based on subscriptions, so there are almost no surprised there. That's also the main reason why this stock is so expensive. They have beaten revenue expectations for 20 quarters in a row now. Innovative CEO, who will keep on searching to diversify and growing, getting more into data and programmatic advertising. Financial wise, they also have enough cash to pay off all their liabilities and to get through at least one year without any income.\n\nOne last thing: These companies are picked based on financials and future outlook, I didn't take value into account. I know companies like Lululemon Athletica and Veeva Systems are expensive, quite overvalued. I'm not buying into them right now, but maybe in the future.\n\nHope it helped at least one of you out there, enjoy the Easter weekend!\n\nTL;DR. Stonks only go up.",
        "created_utc": 1586536709.0,
        "subreddit_name": "stocks",
        "comments": 536
    }
]