[
    {
        "title": "The most discussed stocks across Reddit and Twitter Now. $WISH $AMC $GME $CLOV $SPY $CLNE $BB $TSLA $WKHS $PLTR",
        "score": 694,
        "url": "https://i.redd.it/ycayta4em1871.jpg",
        "content": "",
        "created_utc": 1624902029.0,
        "subreddit_name": "Daytrading",
        "comments": 129
    },
    {
        "title": "June Update, getting closer to Quit my day job",
        "score": 418,
        "url": "https://www.reddit.com/r/Daytrading/comments/o9w803/june_update_getting_closer_to_quit_my_day_job/",
        "content": "Edit: sorry guys, i just lost all my money thst i made in the month… super sad!\n\nHey day traders!\n\n\n\nI just wanted to do a follow up on my trading, a couple of weeks ago i posted about how my trading was going, I'm now 2 months green, i added a goal of 10k for the month of June, i already hit my goal, so that's good. Really thinking about making this my day job, i think i still need 2-3 more months to see if this is going to work out, need to pay a few of my debt to be in a better position to quit my job.\n\n&#x200B;\n\nhttps://preview.redd.it/09e5brm3e3871.png?width=903&format=png&auto=webp&s=a2d9e048924bd5dedec7767df6e69424f7d780a2\n\nI've been \"trading\" for almost 2 years, pandemic was a good opportunity to get more serious about it, It took me 2 years to get to this point, its not a race, trading is a journey. it will take time.\n\nI never really blew my account, got negative a few times in my margin but i got out of the whole. never paper traded, i personally think that is a waste of time just because there is no really emotions with paper trading and you will not know if you can handle the stress of seeing that you are losing money, but for a lot of people its fine and worked for them.\n\n[So Far so good!](https://www.reddit.com/r/Daytrading/comments/nviv7t/so_far_so_good/?utm_source=share&utm_medium=web2x&context=3) last post\n\nI had a bunch of PM's about how i trade and what i use, I'm going to post a few pics and things that i actually use to trade. English is not my first language by the way.\n\nHere is picture of how i have my monitors [Setup](https://imgur.com/a/2IX526D) my main monitor has the main TOS screen and i have SPY, QQQ, SMH and /ES in that screen, is super important for me to see how the market is doing before i enter a trade, always have these on one monitor. On the 2nd and 3rd monitor its just stocks, you can detach the chart from the main screen by clicking the 3 lines below the onDemand button, hit detach and you can get just a chart, then you just make 4-6 small charts and fit them in your monitor, please make sure to save your layout for next time.\n\nA day before, i looked for a specific setup, like today i will have TSLA on watch  for tomorrow, hoping it breaks out, really want this to get volume and pass 695 and the 700, round numbers are psychological numbers, if it breaks we can see 724, 50% in the Fibonacci. we will see tomorrow, but these are the types of plays that i look for a day before and then have them in my screen ready to play them, i also add alerts so if it breaks out, TOS will let me know and i can take the play.\n\n[TSLA](https://preview.redd.it/ajm9eau493871.png?width=1853&format=png&auto=webp&s=d583aa1c2218ef96935c037fc57a547d640fd7b0)\n\n**Time Frames**: i always look for trade in a 6 months 4  hours time frame, for intraday i like the 3 minute one for looking for setups and its the same setup i always look for, here is an example of the trade that i normally take, i draw my lines (red one) if it breaks you get in, now in this one is tricky, if you see closely, it broke out, pulled back, scared the longs and then pushed.\n\n**Drawing:** Super important to start drawing in your charts, start adding resistance and supports, add Vwap, pivot, previous day highs, previous day lows, EMA's 9,20,50. you can google how to add these, super easy. then follow the stock and see if its hitting your limits and try to maybe tweak it a little if you are off.\n\nThe other one i like and the only thing i use is my  [Volume indicator](https://youtu.be/l7JIXig608E), here is a video on how to add it.\n\nalso the different time  [frame buttons](https://youtu.be/uA8sdjutGqk), here is the video to add it.\n\n&#x200B;\n\n[COIN](https://preview.redd.it/wve3icf0b3871.png?width=1855&format=png&auto=webp&s=6d5b8913660504d08e1e62bb7f16d833d8e1a6c9)\n\nAnyways, that's what i have for now and no im not going to sell you a course or try to get you in a pay channel...\n\nI'm here to help, PM if you have any questions or whatever!!\n\n&#x200B;\n\nStay safe and no FOMO!!",
        "created_utc": 1624923369.0,
        "subreddit_name": "Daytrading",
        "comments": 95
    }
]