[
    {
        "title": "Apple Now Assembles 14% of iPhones in India",
        "score": 975,
        "url": "https://www.macrumors.com/2024/04/10/apple-assembles-more-iphones-in-india/",
        "content": "",
        "created_utc": 1712753323.0,
        "subreddit_name": "apple",
        "comments": 142
    },
    {
        "title": "They say it can't be done",
        "score": 274,
        "url": "https://i.redd.it/tplw2l6ebotc1.jpeg",
        "content": "This is my most successful run since I began day trading. I have 11 straight green trading days. \n\nI learned some stuff back in like October about trading around opening levels and pre-market highs and lows. I keep learning some news tricks here and there. I trade QQQ 0dte and 1dte options mostly. \n\nI see risk management as the most important aspect of all in this game. I've begun to really pay attention to my emotional and mental state. I withdraw money from my (cash) account when it gets much higher than what I require to do my thing. I also have taken note when I'm becoming delusional about my abilities and significantly size down my positions after days I consider to be remarkable. \n\nOne other thing is that I never dca losing trades. The truth is most of my losses in my account history have come from just a few days where I got mad about an ordinary loss and dca'd against it. So I have completely barred myself from doing this. \n\nI only keep about 4-5k in my account and aim to make 100-200 a day. If a trade is doing super well ill let it run a bit sometimes though, or just trim it down, and that's resulted in quite a few really good days recently. I'm totally confident I will have more red days, too. The goal is just to not let them be as large or much larger than a typical days gains though, and if they are I should stop. \n\nReally hoping to keep this up... it's a killer side hustle for now. Idk about making a career out of it cuz it could increase the pressure and force bad trades. ",
        "created_utc": 1712764222.0,
        "subreddit_name": "DayTrading",
        "comments": 156
    },
    {
        "title": "Here's how I used volume to spot that drop on SPY near the open this morning",
        "score": 92,
        "url": "https://www.reddit.com/gallery/1c09fjg",
        "content": "",
        "created_utc": 1712712733.0,
        "subreddit_name": "DayTrading",
        "comments": 49
    },
    {
        "title": "Apple Stock | BUY HERE?",
        "score": 12,
        "url": "https://youtu.be/MiNpSMlaipA",
        "content": "",
        "created_utc": 1712785460.0,
        "subreddit_name": "AAPL",
        "comments": 11
    }
]