[
    {
        "title": "Archer Aviation (ACHR) is going to explode this November!",
        "score": 991,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1go72sm/archer_aviation_achr_is_going_to_explode_this/",
        "content": "https://preview.redd.it/nn2l0w44940e1.png?width=491&format=png&auto=webp&s=c6f311d231e1d77d46013f0c2ad4f01bf105e70a\n\n[Source ](https://s202.q4cdn.com/174276461/files/doc_financials/2024/q3/Archer-Shareholder-Letter-Q324-FINAL.pdf)(p. 9)\n\nArcher is going to participate in different events in USA, Ireland and the UK during this November.\n\nSome additional catalysts I am waiting for:\n\n\\- [Palantir agreement](https://www.linkedin.com/posts/adam-goldstein-7b662121_had-an-inspiring-conversation-this-morning-activity-7191483218053718016-qOmP/?utm_source=share&utm_medium=member_android) (still unofficial, but they may announce something considering this picture).\n\nhttps://preview.redd.it/8r1pb6j7940e1.png?width=1536&format=png&auto=webp&s=1ff85bb000cf2f0002a33b66a08378e9e46dacad\n\n\\- Georgia facilities ready to start production in december.\n\nGreat opportunity to buy imo\n\nMy position:\n\nhttps://preview.redd.it/hdl9jpp5b40e1.png?width=1437&format=png&auto=webp&s=e941aca865f522f4cdfe5d2b4bcf40800be395a6\n\nBTW you really gonna like this Donald Trump words:\n\n>Another big opportunity is in transportation: dozens of major companies in the USA and China are racing to develop EVTOL vehicles for families and individuals. Just as the USA led the automotive revolution in the last century, I want to ensure that America, not China, leads this revolution in air movility.\n\n[Source ](https://www.youtube.com/watch?v=dJA_GBhCGgE)(min 01:38; video uploaded in 2023).",
        "created_utc": 1731262869.0,
        "subreddit_name": "wallstreetbets",
        "comments": 273
    },
    {
        "title": "Work has been slow so I jumped back into trading this week. Up 28k",
        "score": 499,
        "url": "https://www.reddit.com/gallery/1go7w2c",
        "content": "I gravitate towards momentum trading and scalping in the 20-50% range on trades. Nearly all my trades are with options 1 month to 6 months out, as i find that the added “breathing room” allows for better psychology when committing to a trade. Majority of gains came from SPY calls, RDDT Calls and shares, UPST Earnings Calls and Shares, and TSLA scalps. Completed 65 trades this week, 42 profitable, 23 losing money. ",
        "created_utc": 1731264956.0,
        "subreddit_name": "wallstreetbets",
        "comments": 114
    },
    {
        "title": "Best ETFs to avoid being to tech heavy ",
        "score": 11,
        "url": "https://www.reddit.com/r/investing/comments/1go42uh/best_etfs_to_avoid_being_to_tech_heavy/",
        "content": "What are the best performing ETFs against too much tech exposure?\n\nI’ve recently started investing and I’ve put 1000€ in CSPX and IUIT.\n\nI have another 6000€ to invest and I’m planning on putting most in CSPX and IUIT with GOOGL, AMZN, ASTS and GSAT getting 5% each.\n\nNow, I think that that is too much tech exposure so what are some good UCITS ETFs to diversify. \n",
        "created_utc": 1731255090.0,
        "subreddit_name": "investing",
        "comments": 16
    },
    {
        "title": "Reuters Exclusive: US ordered TSMC to halt shipments to China of chips used in AI applications",
        "score": 478,
        "url": "https://www.reddit.com/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/",
        "content": "https://www.reuters.com/technology/us-ordered-tsmc-halt-shipments-china-chips-used-ai-applications-source-says-2024-11-10/\n\nNEW YORK/SINGAPORE, Nov 9 (Reuters) - The U.S. ordered Taiwan Semiconductor Manufacturing Co (2330.TW), to halt shipments of advanced chips to Chinese customers that are often used in artificial intelligence applications starting Monday, according to a person familiar with the matter.\n\nThe Department of Commerce sent a letter to TSMC imposing export restrictions on certain sophisticated chips, of 7 nanometer or more advanced designs, destined for China that power AI accelerator and graphics processing units (GPU), the person said.\n\nThe U.S. order, which is being reported for the first time, comes just weeks after TSMC notified the Commerce Department that one of its chips had been found in a Huawei AI processor, as Reuters reported last month. Tech research firm Tech Insights had taken apart the product, revealing the TSMC chip and apparent violation of export controls.\n\nHuawei, at the center of the U.S. action, is on a restricted trade list, which requires suppliers to obtain licenses to ship any goods or technology to the company. Any license that could aid Huawei's AI efforts would likely be denied.\n\nTSMC suspended shipments to China-based chip designer Sophgo after its chip matched the one found on the Huawei AI processor, sources told Reuters last month.\n\nReuters could not determine how the chip ended up on Huawei's Ascend 910B, released in 2022, viewed as the most advanced AI chip available from a Chinese company.\n\nThe latest clampdown hits many more companies and will allow the U.S. to assess whether other companies are diverting chips to Huawei for its AI processor.\n\nAs a result of the letter, TSMC notified affected clients that it was suspending shipments of chips starting Monday, the person said.\nThe Commerce Department declined comment.\n\nA spokesperson for TSMC also declined to comment beyond saying it was a \"law-abiding company...committed to complying with all applicable rules and regulations, including applicable export controls.\"\n\nThe Commerce Department communication -- known as an \"is informed\" letter -- allows the U.S. to bypass lengthy rule-writing processes to quickly impose new licensing requirements on specific companies.\n\nIjiwei, a Chinese media site covering the semiconductor industry, reported on Friday that TSMC notified Chinese chip design companies it would suspend 7 nanometer or below chips for AI and GPU customers beginning Nov. 11.\n\nThe action comes as both Republican and Democratic lawmakers have raised concerns about the inadequacy of export controls on China and the Commerce Department's enforcement of them.\n\nIn 2022, the Commerce Department sent is-informed letters to Nvidia and AMD restricting their ability to export top AI-related chips to China, and to chip equipment makers like Lam Research, Applied Materials and KLA to restrict tools to make advanced chips to China.\n\nThe restrictions in those letters were later turned into rules that apply to companies beyond them.\n\nThe U.S. has been delayed in updating rules on tech exports to China. As Reuters reported in July, the Biden administration drafted new rules on some foreign exports of chipmaking equipment and planned to add about 120 Chinese companies to the Commerce Department's restricted entity list, including chipmaking factories, toolmakers, and related companies.\n\nBut despite plans for an August release, and later tentative target dates for publication, the rules still have not been issued.",
        "created_utc": 1731200267.0,
        "subreddit_name": "stocks",
        "comments": 144
    },
    {
        "title": "Just saw a post about Motley Fool",
        "score": 353,
        "url": "https://www.reddit.com/r/investing/comments/1gnrwn1/just_saw_a_post_about_motley_fool/",
        "content": "I signed up for their investment services in 2021. These were the stocks recommended by the service. I bought when I had an extra $1,000 to play with so I did not buy all of their picks every month.\n\nI will say that they recommended picks like AAPL, MSFT, GOOG, AMZN, etc as well... but like duh. \n\nAnyways, I'll just leave this here.\n\n[https://imgur.com/a/3uYNLCf](https://imgur.com/a/3uYNLCf)",
        "created_utc": 1731210549.0,
        "subreddit_name": "investing",
        "comments": 124
    },
    {
        "title": "US ordered TSMC to halt shipments to China of chips used in AI applications",
        "score": 1299,
        "url": "https://www.reuters.com/technology/us-ordered-tsmc-halt-shipments-china-chips-used-ai-applications-source-says-2024-11-10/",
        "content": "",
        "created_utc": 1731199050.0,
        "subreddit_name": "wallstreetbets",
        "comments": 224
    },
    {
        "title": "Bullish on Riot / Bitcoin miners ",
        "score": 93,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1goe5ux/bullish_on_riot_bitcoin_miners/",
        "content": "Let’s face it, prior to a month or two ago, it’s been pretty terrible for the Bitcoin mining industry. Across the board it almost all affected companies were down. RIOT in particular. \n\nBut here’s Why I’m Excited About This Stock. Some of which applies to Bitcoin mining in general. \n\n RIOT is on the move. The stock has surged to $12.64 this week with impressive trading volumes.\n\nKey Points:\n\n1. Massive Mining Infrastructure\n\nRIOT operates some of the largest bitcoin mining facilities in the world, including the Corsicana site (with 600MW still under construction) and Rockdale (700MW). While other miners like IREN are planning large-scale sites, RIOT's operations are already up and running, and they’re far ahead in terms of scale.\n\n2. Bitcoin Price Surge\n\nBitcoin is riding high, currently above $80,000 (and some analysts predict it could hit $100,000 by year-end). RIOT holds over 10,000 BTC, which means as bitcoin prices rise, so does RIOT’s asset base.\n\n3. Future Goals\n\nRIOT’s ambition to hit 100 EH/s by 2027 positions them as a leader in mining hash rate, further boosting their long-term potential.\n\n4. AI Potential\n\nWhat excites me even more is CEO Jason Les mentioning that RIOT is open to AI opportunities. With their massive mining facilities in Texas—close to key urban centers like Austin and Dallas, with access to cheap power and low latency—they’re perfectly positioned to pivot into AI workloads if the right deal comes along. The growing demand for GPUs in AI, paired with RIOT’s vast infrastructure, could make them a key player in this space as well. Jason has already mentioned they have received a lot of interest in this direction.\n\n5. Political & Market Factors\n\nWith Trump returning to office, there could be major benefits for U.S.-based miners. Increased support for domestic bitcoin mining and the likelihood of regulatory changes to ease production could propel bitcoin—and in turn, RIOT—to new highs. As bitcoin rises, so does RIOT's profitability.\n\nThe Big Picture:\nI’m not claiming RIOT is the only player to watch, but they’re certainly one of the biggest and in a strong position. With bitcoin price potentially reaching $100,000 in the near future, we could see RIOT’s stock easily hit $20-$25 by the end of the year, and $50+ if the market conditions continue to favor them.",
        "created_utc": 1731281358.0,
        "subreddit_name": "wallstreetbets",
        "comments": 79
    },
    {
        "title": "Best free/cheap ETF screener mobile apps?",
        "score": 1,
        "url": "https://www.reddit.com/r/investing/comments/1go7dhi/best_freecheap_etf_screener_mobile_apps/",
        "content": "What are the best free/cheap mobile apps for screening ETFs?\n\nI'm not a professional trader, I just want to occasionally look up funds with certain annualized returns over a period of time, yields, expense ratios, alphas, Sharpe ratios, etc. while I'm out walking or lying on my couch. I'm using Schwab's screener on my laptop and it works fine, but I already spend enough time sitting down at a computer. I've tried searching Google Play for screener apps, but they're all aimed at traders and/or have a subscription fee that I can't justify paying. The Schwab mobile app unfortunately doesn't have a screener.\n\nMy definition of \"cheap\": Doesn't require a $5+ monthly fee for something I can do for free on my laptop. I'm not opposed to paying, especially if it's a one time purchase and the UI is great.",
        "created_utc": 1731263637.0,
        "subreddit_name": "investing",
        "comments": 18
    },
    {
        "title": "Apple found a way to monetize Apple Intelligence without even charging for it",
        "score": 1973,
        "url": "https://9to5mac.com/2024/11/08/apple-found-a-way-to-monetize-apple-intelligence-without-even-charging-for-it/",
        "content": "",
        "created_utc": 1731273696.0,
        "subreddit_name": "apple",
        "comments": 224
    },
    {
        "title": "iOS 18.1 boosts security with inactivity reboot feature",
        "score": 939,
        "url": "https://appleinsider.com/articles/24/11/09/iphones-on-ios-181-will-automatically-reboot-and-lock-down-after-being-idle-for-a-while",
        "content": "",
        "created_utc": 1731279322.0,
        "subreddit_name": "apple",
        "comments": 75
    },
    {
        "title": "Apple’s Future Hinges on Smaller Bets, Rather Than Next Big Thing",
        "score": 674,
        "url": "https://www.bloomberg.com/news/newsletters/2024-11-10/apple-s-expansion-plan-glasses-home-devices-mixed-reality-headsets-airpods-m3bncxeo",
        "content": "",
        "created_utc": 1731246380.0,
        "subreddit_name": "apple",
        "comments": 200
    },
    {
        "title": "Apple to Announce Final Cut Pro Update This Week with New Features",
        "score": 443,
        "url": "https://www.macrumors.com/2024/11/10/final-cut-pro-update-coming-soon/",
        "content": "",
        "created_utc": 1731278157.0,
        "subreddit_name": "apple",
        "comments": 35
    },
    {
        "title": "M4 Mac Studio: Here's what to expect from Apple's upcoming high-end desktop",
        "score": 209,
        "url": "https://9to5mac.com/2024/11/10/m4-mac-studio-what-to-expect/",
        "content": "",
        "created_utc": 1731277831.0,
        "subreddit_name": "apple",
        "comments": 85
    },
    {
        "title": "Prototype Apple \"Vesica Piscis\" iPhone 14 Pro - Rare Haptic Button Development Model - Project Bongo",
        "score": 188,
        "url": "https://www.youtube.com/watch?v=MkDXU-h-KaY",
        "content": "",
        "created_utc": 1731239259.0,
        "subreddit_name": "apple",
        "comments": 29
    },
    {
        "title": "Task management meets paper sticky notes: the latest version of my productivity app is now out. Free Lifetime license for the next 24 hours",
        "score": 95,
        "url": "https://www.reddit.com/r/apple/comments/1go4kxj/task_management_meets_paper_sticky_notes_the/",
        "content": "Hey fellow Apple Redditors! 👋\n\nI’m a productivity nut and always wanted a fast daily planner that didn’t aggravate me after a few weeks of use. I’ve worked on **Finalist** for almost two years now and the latest version is the best one yet 😀 It’s heavily inspired by paper-based day planning methods:\n\n* **Tasks** (and **Reminders**) are front and center, each day gets a page\n* Integrated **iOS calendars** and **Apple Weather** for each day, no need for app switching\n* Adding tasks can automatically add calendar entries using **natural language**\n* **Nested lists** for tasks you’re not ready to schedule yet\n* Use **Shared Reminders Lists** and manage them through the app\n* **Pin** any list to Today to help you work through projects\n* Optional **Evening Prompts** to help you plan the next day\n* **Color tags** and **bookmarks** to categorize your tasks\n* Lists can automatically **sum** quantities or dollar amounts\n* **No accounts to create:** all native iCloud sync, with OPML backup\n* Fully **Swift/SwiftUI** app, with native versions for **iPadOS**, **macOS** and **visionOS**.\n* **Themes**, themes and more themes. **Widgets** and bunch of **Shortcuts** included.\n\nThe basic app will work for free, licensed it’s $39.99 per year or $69.99 for Lifetime but I’m trying something new today - **get Lifetime for free** for the next 24 hours, with Family Sharing. I’d love to get more feedback of what you like and dislike about the app so I can make it even better.\n\n**What’s next?** Tighter integration with Reminders, cooler macOS UI, more fun features for visionOS. It’s all underway and we have quite a community driving this forward 😀\n\n🌁 **Screenshot**: [https://www.finalist.works/2-1-screenshot/](https://www.finalist.works/2-1-screenshot/)\n\n**📼 Video**: [https://www.youtube.com/shorts/zTcs5a1B59I](https://www.youtube.com/shorts/zTcs5a1B59I)\n\n**📱 App Store**: [https://apps.apple.com/app/id6447014685](https://apps.apple.com/app/id6447014685)\n\n**🖥️ Web**: [https://finalist.works](https://finalist.works/)\n\nThanks for your time and have a great Sunday 🙏\n\nEdit: if the store is asking you to pay for Lifetime something's wrong, don't do it - just DM me instead.\n\nEdit 11:59pm: thanks all for playing, we gave away a LOT of lifetimes 😀",
        "created_utc": 1731256452.0,
        "subreddit_name": "apple",
        "comments": 122
    },
    {
        "title": "My two latest visionOS apps are now FREE in the App Store!",
        "score": 60,
        "url": "https://www.reddit.com/r/apple/comments/1go5pt6/my_two_latest_visionos_apps_are_now_free_in_the/",
        "content": "I have now changed my two latest visionOS apps to the whopping price of $0.00! I want to get them into more peoples hands to help keep the community enjoying spatial apps!\n\nThey are 100% free with an option to tip, if you would choose. Nothing is paywalled, so tipping is purely optional and not needed for any features.\n\nThe apps are:\n\n1.\tFanbience: Ambient Fan Sounds\n\nLink: https://apps.apple.com/us/app/fanbience-ambient-fan-sounds/id6670623502\n\nThis app was inspired by a friend and her love for the sound of fans. So instead of being a typical app with sounds like rain, or fire, I thought about fans and their various different kinds and sounds! So this app allows you to place realistic looking and sounding fans around your environment. You can adjust the sound and reverb of each fan. There are 8 different fan types to choose from:\n\n\t•\tBox Fan\n\t•\tStanding Fan\n\t•\tTower Fan\n\t•\tBladeless Fan\n\t•\tAir Conditioner\n\t•\tCeiling Fan\n\t•\tTable Fan\n\t•\tAir Vent\n\nLet the record show, I tried to call this “Only Fans: Ambient Sounds” but Apple (understandably) wasn’t allowing it since it was too close to the OnlyFans trademark, haha. They wouldn’t even allow a simple tagline of “The Only Fans You Need!” I understand and expected this, but hey, it was worth a shot!\n\n-–––––––\n\n2.\tVisionary: Earnings Tracker\n\nLink: https://apps.apple.com/us/app/visionary-earnings-tracker/id6692608433\n\nInspired by other similar earnings apps, I decided to take this motivating concept and flesh it out with some ideas and preferences of my own, and after much deliberation, polished it to release it to the world! This allows you to get a visual of the money you are earning while working. Whether it is for fun, motivation, or to track how much to bill a client, I personally found this concept super motivating! Having something tangible in front of you versus just a number really makes it feel rewarding, in my opinion.\n\nIt currently only supports USD and I am considering adding other currency in the future!\n\n-–––––––\n\nI hope you guys enjoy and these help make your lives a little better! Thanks for all the love and support!",
        "created_utc": 1731259367.0,
        "subreddit_name": "apple",
        "comments": 24
    },
    {
        "title": "[GIVEAWAY] To celebrate the release of my task manager/calendar app on 2 new platforms (watchOS and visionOS), the Lifetime IAP is free for the next 36 hours!",
        "score": 49,
        "url": "https://www.reddit.com/r/apple/comments/1go6zxg/giveaway_to_celebrate_the_release_of_my_task/",
        "content": "EDIT: If you are using an iPhone running iOS 17, and experience a crash when editing items, please try updating to version 4.0.2. I apologise for the bug!\n\nHi r/apple,\n\nAbout 4 months ago, I made a [post](https://www.reddit.com/r/apple/comments/1ejs8gv/i_spent_2_years_making_yet_another_todo_app_yata/) introducing [Yet Another Todo App (Yata)](https://apps.apple.com/app/yata-yet-another-to-do-app/id1631370175), and the positive reception was extremely motivating. As a result, my goal of making a native app on every Apple platform (well, almost--sorry Apple TV!) has been reached much earlier than I ever anticipated!\n\nTo express my gratitude for this subreddit, the **Lifetime IAP** will be free for the next 36 hours! To redeem it, simply follow the steps below:\n\n1.\tInstall [Yata](https://apps.apple.com/app/yata-yet-another-to-do-app/id1631370175) from the App Store\n2.\tOpen Yata.\n3.\tNavigate to the **Settings** tab on iPhone, or through the **(...)** more button in the sidebar on iPad.\n4.\tTap the banner at the top of the page to present the paywall.\n5.\tTap **\"All Plans\"** at the bottom-left, and select the **\"Lifetime\"** option.\n6.\tIf the deal has not expired, the price should be **$0.00**. Tap **\"Continue\"** to complete the purchase.\n\nPlease note that the IAP is only accessible on the iPhone and iPad apps.\n\nIf you are new to Yata, I've included parts of my previous post below to provide more details about the app:\n\n  \n\\---\n\n\n\n# Why should I try Yet Another Todo App?\n\nInstead of listing all the features you’d expect from a todo app (yes, it has lists/projects/tags/subtasks, natural language processing, shortcuts integration, interactive widgets, iCloud sync, and all that jazz), here’s what I think makes Yata unique:\n\n🗓️ **Unified Calendar**: View and manage your todos and calendar events in one place with the integrated Calendar view. You can manage your time at various resolutions by switching between the **List, Day, 3-Day, 5-Day, Week, and Month views**. You can also easily make plans and adapt to changes with intuitive drag and drop gestures to reschedule items on the Calendar.\n\n🎨 **Theming**: Yata takes theming to a new level, offering an intuitive and delightful experience for exploring, customising, and managing various aesthetics to make the app uniquely yours. Yata allows you to **customise the colours used throughout the app**, including the widgets!\n\n📥 **Captures**: Unlike many apps in this space, Yata allows you to **create, store and manage non-actionable items**. This encourages you to capture your thoughts in an unfiltered manner, without the cognitive burden of fleshing out the thought in the moment or the psychological effect of having \"incomplete\" tasks that aren’t actually completable.\n\n\n\n# Aren’t you going to be sherlock-ed soon?\n\nWhile it is true that the built-in Calendar app will integrate Reminders and Events in iOS 18, I believe Yata still offers significant advantages over the native option:\n\n* **Duration:** Unlike Reminders, Yata allows you to set a duration for your tasks, providing a more detailed time management approach.\n* **Differentiate Intent and Due Dates:** Reminders only support a single date/time, making it hard to distinguish between when you want to do a task and its actual deadline. Yata supports both intent and due dates, giving you greater flexibility in planning.\n* **Day Templates:** Yata's Routines feature allows you to create customisable day templates that can be easily loaded into your schedule to avoid repetitive setup and save time.\n\nWhile these missing features might still be acceptable for many users, I hope that you will consider giving Yata a try, especially since it offers a generous free tier and an inexpensive lifetime option!\n\n\n\n# Pricing\n\nYata offers a generous free tier and an inexpensive lifetime option. Currently, the bulk of the app is completely free to use, while certain Pro features are ***literally*** **free to trial** (no need to start a subscription and remembering to cancel). The catch here is that they can only be \"unlocked\" for 24 hours at a time. For example, custom themes will be reset after 1 day of applying it, upon which you can simply reapply the theme for another day of usage. \n\nUnlimited access to all Pro features can be purchased for just:\n\n* USD 2 per month,\n* USD 5 per year, or\n* USD 10 lifetime\n\nPlease do [check out Yata on the App Store](https://apps.apple.com/app/yata-yet-another-to-do-app/id1631370175), I'd love to hear your feedback and insights to help make the app even better!\n\n[📱 App Store Link](https://apps.apple.com/app/yata-yet-another-to-do-app/id1631370175)\n\n[🏡 Product Page](https://www.yata-gtd.com/)\n\n[📚 User Guide](https://www.yata-gtd.com/User-Guide/%F0%9F%93%9A-Getting-Started)",
        "created_utc": 1731262665.0,
        "subreddit_name": "apple",
        "comments": 54
    },
    {
        "title": "Daily Advice Thread - November 10, 2024",
        "score": 7,
        "url": "https://www.reddit.com/r/apple/comments/1gny8lh/daily_advice_thread_november_10_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1731236426.0,
        "subreddit_name": "apple",
        "comments": 91
    }
]