[
    {
        "title": "Microsoft closes $7.5 billion Bethesda acquisition, aiming to take on Sony with exclusive games",
        "score": 1756,
        "url": "https://www.reddit.com/r/stocks/comments/mdnzup/microsoft_closes_75_billion_bethesda_acquisition/",
        "content": "https://www.cnbc.com/2021/03/09/microsoft-closes-bethesda-acquisition-aiming-to-take-on-sony.html\n\nMicrosoft has closed its $7.5 billion acquisition of ZeniMax, the parent company of Bethesda.\n\nMicrosoft confirmed that some new Bethesda games would be exclusive to Xbox consoles and PCs.\n\nThe firm has often been seen as lagging behind Sony when it comes to major first-party releases.\n\nThis is a positive news as msft could improve the gaming business. It will be more competitive to sony and able to generate more subscription revenue. The stock is trading around $230 and it is an attractive entry point for long term investors.\n\nThanks for the awards.",
        "created_utc": 1616763318.0,
        "subreddit_name": "stocks",
        "comments": 297
    },
    {
        "title": "SoFi to give amateur investors early access to IPOs",
        "score": 1964,
        "url": "https://www.reddit.com/r/investing/comments/mdppti/sofi_to_give_amateur_investors_early_access_to/",
        "content": "https://www.cnbc.com/2021/03/26/sofi-to-give-amateur-investors-early-access-to-ipos-in-break-from-wall-street-tradition-.html\n\nOnline finance start-up SoFi is lowering the barrier for amateur investors to buy shares of companies as they go public.\n\nThese IPO shares have historically been set aside for Wall Street's institutional investors or high-net worth individuals. Retail traders don't have a way to buy into newly listed companies until those shares begin actually trading on the exchange. By that time, the price has often gapped higher.\n\n\"Main Street will have access to investing in a way they wouldn't have before,\" SoFi CEO Anthony Noto said in a phone interview. \"It gives more differentiation, and more access so people can build diversified portfolios.\"\n\nSoFi itself will be an underwriter in these deals, meaning it works with companies to determine a share price, buys securities from the issuer then sells them back to certain investors. It's common for brokerage firms to get a portion of IPO shares in that process. But they don't typically offer them to the everyday investor.\n\nNoto worked on more than 50 IPOs, including Twitter's debut, in his former role as partner and head of the technology media and telecom group at Goldman Sachs. Firms like Goldman generate revenue from Wall Street funds, which often choose to get in on an IPO \"based on the access they get to that unique product,\" he said.\n\n\"Individual investors don't generate those types of revenues, therefore they don't get access to the unique product,\" Noto said. \"The cost of serving retail, if they did decide to do that, would be too high.\"\n\nSoFi clients who have at least $3,000 in account value will be able enter the amount of shares they want as a \"reservation.\" The app will alert them when it's time to confirm an order.",
        "created_utc": 1616768452.0,
        "subreddit_name": "investing",
        "comments": 254
    },
    {
        "title": "AAPL stock deep fundamental analysis!",
        "score": 8,
        "url": "https://www.reddit.com/r/AAPL/comments/me03jn/aapl_stock_deep_fundamental_analysis/",
        "content": "[https://www.icloud.com/iclouddrive/0rVynjeCVeZ0VUBWcAiKju44A#2020\\_Intrinsic\\_Value\\_Calculator](https://www.icloud.com/iclouddrive/0rVynjeCVeZ0VUBWcAiKju44A#2020_Intrinsic_Value_Calculator)",
        "created_utc": 1616797581.0,
        "subreddit_name": "AAPL",
        "comments": 6
    }
]