[
    {
        "title": "Apple hits 3 trillion market cap, becoming the first company to hit the mark",
        "score": 4099,
        "url": "https://www.reddit.com/r/stocks/comments/rv92bv/apple_hits_3_trillion_market_cap_becoming_the/",
        "content": "https://finance.yahoo.com/news/apple-hits-3-trillion-market-cap-184825195.html\n\n“Apple (AAPL) officially has a market capitalization of $3 trillion. The tech giant passed the $182.86 mark Monday, making it the first publicly traded company in history to hit such a market valuation. Shares were bouncing above and below the number during the day.\n\nApple’s rise to a $3 trillion market cap, which is based on its stock price, comes less than two years after its market cap hit $2 trillion. Microsoft (MSFT) is also potentially on its way to the $3 trillion mark after topping $2 trillion in June.\n\nApple’s rise to $3 trillion comes on the back of the incredible success of its iPhone line, which has spawned accessories like the Apple Watch and AirPods, not to mention services like AppleCare, the App Store, Apple Music+, and Apple TV+.\n\nApple’s latest generation of hardware has, however, been struck by the same supply chain issues affecting everything from car manufacturers to home appliance makers. According to Bloomberg, the company previously cut its iPhone production goal by 10 million units in October due to supply constraints.\n\nAnd Nikkei Asia reports that Apple’s manufacturing partners in China were getting days off when they would normally be working full throttle to ramp up device availability for the holiday season.\n\nStay ahead of the market\nBut Apple has also shown off some major innovations in 2021 including the launch of its powerful M1 Pro and M1 Max chips for its MacBook Pro laptops. Those chips allow Apple to ditch Intel’s own processors, giving Apple far more control over design and performance.\n\nAnd then there are reports about Apple’s future devices including the obvious updates to stalwarts like the iPhone, Apple Watch, and AirPods, as well as entirely new product categories like augmented reality and virtual reality headsets.\n\nApple’s rise to $3 trillion hasn’t been without controversy, however. The company has repeatedly been called out for its cooperation with the Chinese government including its censorship policies and its need to store user data there. Apple, however, says it “complies with the laws pertaining to local entities that control customer data and provides data as legally required.”\n\nLike its Big Tech compatriots, Apple is also contending with antitrust issues. In August 2020, “Fortnite” maker Epic filed suit against Apple claiming it violates antitrust laws by requiring developers to use its in-app payment system, which automatically grants Apple a 30% fee for each purchase.\n\nWhile the company largely came out of suit unscathed, the judge in the case has called on Apple to allow third-party app developers to add external purchasing options to their apps. Apple is appealing the ruling.\n\nThe company is also reportedly staring down the prospect of an antitrust battle with the Department of Justice, which is said to be preparing its own case against the iPhone maker. That would likely focus on Apple’s control of the iPhone and its iOS operating system.”",
        "created_utc": 1641236280.0,
        "subreddit_name": "stocks",
        "comments": 572
    },
    {
        "title": "Apple Becomes World's First $3 Trillion Company",
        "score": 4982,
        "url": "https://www.macrumors.com/2022/01/03/apple-becomes-3-trillion-dollar-company/",
        "content": "",
        "created_utc": 1641235532.0,
        "subreddit_name": "apple",
        "comments": 568
    },
    {
        "title": "AAPL just hit $3T Market Cap 🎉",
        "score": 38,
        "url": "https://i.redd.it/qon7a1koqi981.jpg",
        "content": "",
        "created_utc": 1641235645.0,
        "subreddit_name": "AAPL",
        "comments": 16
    }
]