[
    {
        "title": "Made no money because I listened to my dad",
        "score": 1501,
        "url": "https://www.reddit.com/r/stocks/comments/1cyydwc/made_no_money_because_i_listened_to_my_dad/",
        "content": "This is my dad: [https://imgur.com/a/YsNBJRM](https://imgur.com/a/YsNBJRM)\n\nI began investing in 2017. I wanted to buy Apple and Microsoft, but he told me they were too high, and I should wait for a crash. And he wouldn't shut up about the coming crash. I guess I internalized what he was saying and ended up focusing on \"cheap\" stocks and \"value investing.\"\n\n7 years later, my portfolio is -5%.\n\nI didn't have enough money to buy the dip in 2020 because all of my money was tied up in stuff like $WBA, $SPG, and $SJM. Lol.\n\nOnly these past two years, I started to shift strategies and buy good businesses with actual prospects. That's why I'm down only -5% rather than -35%.\n\nI'm just ranting. I can't believe I wasted so much time researching \"undervalued\" companies and couldn't even beat cash interest. I'm only 29 at least, so hopefully I can still grow my portfolio. But I missed out on some of the best years of the S&P...\n\nOh yeah, I'm holding some NVDA and yesterday my dad was screaming at me to sell, and how it's too high, and \"it can't go up forever.\" I was really annoyed, so I created the image above and sent it to him.\n\nOh, he also lost hundreds of thousands of dollars over the past 30 years. I grew up watching my parents fight over money all the time. Don't know why I ever listened to him.\n\nI did make plenty of my own mistakes, of course. And it's ultimately my fault for following his advice. I think I've learned a lot so I don't feel as much of a need to rely on other people anymore. I guess I'm just really annoyed that he's still saying the same thing as he did back then.\n\nOK, thanks for listening to my venting. ",
        "created_utc": 1716485095.0,
        "subreddit_name": "stocks",
        "comments": 603
    },
    {
        "title": "macOS 15 will include new UI elements and reorganized system settings",
        "score": 1105,
        "url": "https://appleinsider.com/articles/24/05/23/system-settings-getting-shuffled-again-in-macos-15-among-other-ui-tweaks",
        "content": "",
        "created_utc": 1716495737.0,
        "subreddit_name": "apple",
        "comments": 282
    },
    {
        "title": "Apple elaborates on iOS 17.5 bug that resurfaced deleted photos",
        "score": 1023,
        "url": "https://9to5mac.com/2024/05/23/apple-deleted-photos-resurfacing-explanation/",
        "content": "",
        "created_utc": 1716508361.0,
        "subreddit_name": "apple",
        "comments": 204
    },
    {
        "title": "NVDA now worth more than TESLA and AMZN combined.",
        "score": 4823,
        "url": "https://i.redd.it/tx1mjdgtt32d1.jpeg",
        "content": "",
        "created_utc": 1716438806.0,
        "subreddit_name": "wallstreetbets",
        "comments": 384
    }
]