[
    {
        "title": "Messages via satellite provides lifeline to iPhone users in Hurricane Helene fallout - 9to5Mac",
        "score": 3564,
        "url": "https://9to5mac.com/2024/09/30/messages-via-satellite-provides-lifeline-to-iphone-owners-in-hurricane-helene-fallout/",
        "content": "",
        "created_utc": 1727969258.0,
        "subreddit_name": "apple",
        "comments": 205
    },
    {
        "title": "Apple might rely on China for iPhone parts after fire destroys Indian factory",
        "score": 1473,
        "url": "https://www.cultofmac.com/news/apple-might-rely-china-iphone-parts-fire-destroys-indian-factory",
        "content": "",
        "created_utc": 1727928965.0,
        "subreddit_name": "apple",
        "comments": 126
    },
    {
        "title": "Apple may bring a guest mode to your iPhone, helping to protect its secrets",
        "score": 1265,
        "url": "https://www.techradar.com/phones/apple-may-bring-a-guest-mode-to-your-iphone-helping-to-protect-its-secrets",
        "content": "",
        "created_utc": 1727972698.0,
        "subreddit_name": "apple",
        "comments": 135
    },
    {
        "title": "Apple Releases iOS 18.0.1 With Touch Screen Bug Fix and More",
        "score": 979,
        "url": "https://www.macrumors.com/2024/10/03/apple-releases-ios-18-0-1/",
        "content": "",
        "created_utc": 1727992766.0,
        "subreddit_name": "apple",
        "comments": 218
    },
    {
        "title": "iPhone SE 4 rumors",
        "score": 839,
        "url": "https://9to5mac.com/2024/10/03/iphone-se-4-modem-a18-camera/",
        "content": "",
        "created_utc": 1727986098.0,
        "subreddit_name": "apple",
        "comments": 283
    },
    {
        "title": "Daily Premarket Report. All the market moving news from premarket all summarised in one 5 minute read for you to get yourself up to speed. ",
        "score": 80,
        "url": "https://www.reddit.com/r/Daytrading/comments/1fv6edo/daily_premarket_report_all_the_market_moving_news/",
        "content": "**MAcro News:**\n\n* Swiss inflation rate comes in soft, at 0.8% vs 1.1% expected. \n* AS I KEEP MENTIONING, EVERY COUNTRY IS COMING OUT WITH SOFT CPI FOR SEPTEMBER. WE CAN EXPECT THE SAME FROM US. \n* German Services PMI in expansion in line with expectations. French Services PMI slightly better than expected. Eurozone same. Better than expected, in expansion. \n* JOBLESS CLAIMS. \n* ISM SERVICES PMI COMING OUT AFTER MARKET OPENS\n\nFOREX:\n\n* GBPUSD is lower as Bailey comes with dovish comments saying they are considering AGGRESSIVE RATE CUTS. \n* Meanwhile, most currency pairs against USD are lower as USD has risen following geopolitical escalations. This is because traders are seeking safe haven appeal of the dollar. \n\nMARKETS:\n\n* SPX: Fell to 5675 again but has recovered, now trading at 5700 again. \n* Nasdaq also just trading slightly down after paring some of earlier losses. \n* GER40: trading at 19k. \n* Oil: Slightly higher again on geopolitical escalations\n* UK100 slightly higher on dovish comments from Bailey. \n\nMAG 7 news:\n\n* GOOGL - IS CONSIDERING NUCLEAR POWER TO MEET AI ENERGY DEMANDS. \n* AMZN - will hire 250,000 workers for holidays, same as last year. This is to help scale up operations for the heightened holiday trade\n* AMZN - Rated overweight by Morgan Stnaley said they see tactical risk to Q4 EBIT guide as Amazon is investing to drive faster growth. But they see how Amzon can make these items profitable in long term. \n* AMZN - will increase ads on prime video in 2025. Plans to increase number of ads on prime video next year as it wants to push further into ad supported streaming services. \n* NVDA - Jensen’s comments yesterday. **\"Everyone wants to be the first to get their hands on it.\" \"We’re committed to reducing costs for customers every two to three years with Blackwell, or increasing throughput by 2-3x.\" “Blackwell is in full production\" \"demand INSANE\"**\n* Is still on track to ship its next gen Blackwell GPUs in high volume in Q4. \n* AAPL - Evercore IS rated 250, said that App Store revenue grew 14% in September, bringing growth rate to 13% from Sept quarter. This growth rate in App Store should support services revenue growth. China being more stable will also help. \n* AAPL - Tim Cook sells $50M worth of AAPL shares. Not worth looking too much into this. \n* TSLA - has discontinued its most affordable electric car, the $39k Model 3. Move can be linked to increase China tariffs. \n* We also got news of Tesla recalls of 27,185 US vehicles. \n* TSLA - JPM still raises target to 130 from 115. Stupid price target. Might as well totally ignore it. \n* Meanwhile, Truist raised price target ton Tesla to 236 from 215. \n* META - could use images and videos taken in Rayman Smart glasses to train its Ai. Used for model improvements. \n* MSFT - invests around $750M in openAi’s largest round. \n* ARK Venture Fund will also invest $250M in the funding round. \n\nOTHER COMPANIES:\n\n* UTILITY COMPANIES LIKE NEE, VST AND CEG ARE HIGHER AFTER GOOGLE SAYS IS CONSIDERING NUCLEAR ENERGY. \n* Uranium stocks higher also on this. \n* Chinese stocks and those rallying with China such as iron stocks are cooling off today. Makes sense as it has been on a crazy run of late, but the bullish tailwinds are still there. \n* AMD - Bank of America says that Next week’s advancing AI event on October 10 should be a catch up catalyst. Last year’s AI event produced 19% on 1 month basis, and 80% on 3 month basis. \n* CVNA - Citi rated at Neutral. Raised first PT to 195 from 125. Retail unit tracking data suggests Q3 unit sales are tacking 2% above consensus. Said impressed by exapanding gross profit per unit and margin expansion.\n* LLY - Truist rates buy with PT of 1000 following meeting with CFO. Said they dont expect major change to strategy but sees log term growth potential. \n* The Bigger news for LLY this morning was that FDA says that Lily’s weight loss drug is no longer in shortage. Some short term shortages can occur as supply moves through chain, but Lily has ramped up production to meet surging demand. \n* VKTX, HIMS is down on this as it is seen as a competitor of LILY. Nonetheless, I think the comment about Surging demand  is the key takeaway for this. \n* SAP - Department of Justice has broadened its investigation into SAP, and reseller Carahsoft Technology. Probe is apparently more extensive than first thought. \n* EVGO - upgraded to overweight from Neutral, PT of 7. Said unlike hardware software peers, EVGO’s fast charging owner operator model has been scaling well with high utilisation and charge rates. \n* HUM - was downgrade by BofA to underperform following losing its leading position in star ratings. \n* CHPT - JPM downgrade to underweight from overweight. Double downgrade. \n* RTX - Deutsche Bank upgraded to hold from Sell, 129 PT\n\nOther news;\n\n* Japan finance minister affirmed that Government and BOJ will continue to coordinate closely. This means that we can see more dovish bias as new PM is dovish and this comment implies he will have influence on BOJ policy. \n* Key comments from Bailey as he **sees a chance of MORE aggressive rate cuts according to Guardian article**\n* This has sent GBPUSD lower, due to the dovishness of the BOE stance. \n* Iran says he will give a stronger response if Israel retaliates. \n* 3 large cosnesuctive explosions heard in Beirut. \n* Libya to resume oil production today, says oil minister. \n* Emirates cancels flights to and from Iraq, Iran and Jordan. \n* Israel says they have killed head of Hamas government in Gaza Strip. ",
        "created_utc": 1727958151.0,
        "subreddit_name": "DayTrading",
        "comments": 10
    },
    {
        "title": "AAPL 10/3 5min chart ",
        "score": 2,
        "url": "https://www.reddit.com/r/AAPL/comments/1fvddtm/aapl_103_5min_chart/",
        "content": "I was looking at today’s 5min chart and at 9:05-9:10 pacific time the volume on TOS is 191,291 but on Webull it shows 1,139,148 and was wondering why there was such a big difference?",
        "created_utc": 1727977006.0,
        "subreddit_name": "AAPL",
        "comments": 0
    }
]