[
    {
        "title": "Super Micro shares plunge 35% as auditor resigns after raising concerns months earlier",
        "score": 547,
        "url": "https://www.reddit.com/r/stocks/comments/1gfm3zm/super_micro_shares_plunge_35_as_auditor_resigns/",
        "content": "**Super Micro shares plunge 35% as auditor resigns after raising concerns months earlier**\n\n[https://www.cnbc.com/2024/10/30/super-micro-auditor-resigns-after-raising-concerns-months-earlier.html](https://www.cnbc.com/2024/10/30/super-micro-auditor-resigns-after-raising-concerns-months-earlier.html)\n\n&#x200B;\n\nSuper Micro’s shares plunged as much as 35% Wednesday morning after the company disclosed its auditor had resigned following months of disagreement with the firm over its governance and board independence.\n\n&#x200B;\n\n&#x200B;\n\nSEC filing:\n\n&#x200B;\n\n**Changes to Registrant’s Certifying Accountant**\r  \n[https://d18rn0p25nwr6d.cloudfront.net/CIK-0001375365/76575d70-d149-4c81-a282-2b74b497f8c3.html](https://d18rn0p25nwr6d.cloudfront.net/CIK-0001375365/76575d70-d149-4c81-a282-2b74b497f8c3.html)\n\n\r  \n\r  \n*On October 24, 2024, Ernst & Young LLP (“EY”) sent the members of the Audit Committee a letter of resignation as the Company’s registered public accounting firm (the “Resignation Letter”).*\r  \n\r  \n*The Chair of the Audit Committee discussed with EY the reasons for EY’s resignation. The Company has begun the process of identifying a successor independent registered public accounting firm. The Company will authorize EY to respond fully to the inquiries of the successor independent registered public accounting firm, once selected. The Company does not currently expect that resolution of any of the matters raised by EY, or under consideration by the Special Committee, as noted below, will result in any restatements of its quarterly reports for the fiscal year 2024 ending June 30, 2024, or for prior fiscal years.*\r  \n\r  \n*EY was engaged on March 15, 2023 to perform an audit for the Company’s fiscal year ending June 30, 2024, and has not issued any report on the Company’s financial statements or the Company’s internal control over financial reporting. EY resigned while conducting the audit for the Company’s fiscal year ended June 30, 2024, EY’s first audit on the Company’s behalf.*\r  \n\r  \n*In late July 2024, EY communicated to the Audit Committee concerns about several matters relating to governance, transparency and completeness of communications to EY, and other matters pertaining to the Company’s internal control over financial reporting, and that the timely filing of the Company’s annual report was at significant risk. In response, the Board appointed an independent special committee of the Board (the “Special Committee”) to review the matters and certain of the Company’s internal controls and certain governance procedures (the “Review”). The Special Committee engaged Cooley LLP, and forensic accounting firm Secretariat Advisors, LLC to perform an investigation on behalf of and at the direction of the Special Committee. EY and the Board received updates with preliminary information relating to the Review. As of the date of this Current Report on Form 8-K, the Review remains ongoing and final findings and recommendations have not yet been communicated to EY or the Board.*\r  \n\r  \n*After receiving additional information through the Review process, EY informed the Special Committee that the additional information EY received raised questions, including about whether the Company demonstrates a commitment to integrity and ethical values consistent with Principle 1 of the COSO Framework, about the ability and willingness of the Audit Committee and overall Board to demonstrate and act as an oversight body that is independent of the CEO and other members of management in accordance with Principle 2 of the COSO Framework, and whether EY could rely on representations from certain members of management and from the Audit Committee. In the Resignation Letter, EY stated, in part: “we are resigning due to information that has recently come to our attention which has led us to no longer be able to rely on management's and the Audit Committee’s representations and to be unwilling to be associated with the financial statements prepared by management, and after concluding we can no longer provide the Audit Services in accordance with applicable law or professional obligations.”*\r  \n\r  \n*Although the Company recognizes EY’s decision is final, it disagrees with EY’s decision to resign as the Company’s independent registered public accounting firm – the Special Committee has not yet obtained all information relevant for the Review and has not concluded the Review. Nevertheless, the Company has taken the concerns expressed by EY seriously, and will carefully consider the findings of the Special Committee and any remedial or other actions recommended by the Special Committee following conclusion of the Review.*\r  \n\r  \n*Other than as described above, during the fiscal years ended June 30, 2024 and 2023, and the subsequent interim period preceding EY’s resignation, (1) there were no “disagreements,” as defined in Item 304(a)(1)(iv) of Regulation S-K, with EY on any matter of accounting principles or practices, financial statement disclosure or auditing scope or procedure, which if not resolved to EY’s satisfaction to our knowledge would have caused it to make reference to the subject matter thereof in connection with its report, and (2) there were no “reportable events” as described in Item 304(a)(1)(v) of Regulation S-K.*\r  \n\r  \n*The Company has provided EY with a copy of the disclosures required by Item 304(a) of Regulation S-K contained in Item 4.01 of this Current Report on Form 8-K and has requested that EY furnish the Company with a letter addressed to the Securities and Exchange Commission stating whether it agrees with the Company’s statements made in response to those requirements and, if not, stating the respects in which it does not agree. A copy of EY’s letter, dated October 29, 2024, is filed as Exhibit 16.1 to this Current Report on Form 8-K.*",
        "created_utc": 1730293730.0,
        "subreddit_name": "stocks",
        "comments": 141
    },
    {
        "title": "Microsoft Reports FY25 Q1 Earnings: Beat Across the Board",
        "score": 474,
        "url": "https://www.reddit.com/r/stocks/comments/1gfvz9i/microsoft_reports_fy25_q1_earnings_beat_across/",
        "content": "Microsoft Earnings Press Release: https://www.microsoft.com/en-us/Investor/earnings/FY-2025-Q1/press-release-webcast\n\n·        Revenue was $65.6 billion and increased 16%\n\n·        Operating income was $30.6 billion and increased 14%\n\n·        Net income was $24.7 billion and increased 11% (up 10% in constant currency)\n\n·        Diluted earnings per share was $3.30 and increased 10%\n\nBusiness Highlights\nRevenue in Productivity and Business Processes was $28.3 billion and increased 12% (up 13% in constant currency), with the following business highlights:\n\n·        Microsoft 365 Commercial products and cloud services revenue increased 13% (up 14% in constant currency) driven by Microsoft 365 Commercial cloud revenue growth of 15% (up 16% in constant currency)\n\n·        Microsoft 365 Consumer products and cloud services revenue increased 5% (up 6% in constant currency) driven by Microsoft 365 Consumer cloud revenue growth of 6% (up 7% in constant currency)\n\n·        LinkedIn revenue increased 10% (up 9% in constant currency)\n\n·        Dynamics products and cloud services revenue increased 14% driven by Dynamics 365 revenue growth of 18% (up 19% in constant currency)\n\nRevenue in Intelligent Cloud was $24.1 billion and increased 20% (up 21% in constant currency), with the following business highlights:\n\n·        Server products and cloud services revenue increased 23% driven by Azure and other cloud services revenue growth of 33% (up 34% in constant currency)\n\nRevenue in More Personal Computing was $13.2 billion and increased 17%, with the following business highlights:\n\n·        Windows OEM and Devices revenue increased 2%\n\n·        Xbox content and services revenue increased 61% driven by 53 points of net impact from the Activision acquisition\n\n·        Search and news advertising revenue excluding traffic acquisition costs increased 18% (up 19% in constant currency)\n\nMicrosoft returned $9.0 billion to shareholders in the form of dividends and share repurchases in the first quarter of fiscal year 2025.\n",
        "created_utc": 1730318940.0,
        "subreddit_name": "stocks",
        "comments": 191
    },
    {
        "title": "Meta beats on top and bottom lines but misses user growth expectations",
        "score": 216,
        "url": "https://www.reddit.com/r/stocks/comments/1gfw8dz/meta_beats_on_top_and_bottom_lines_but_misses/",
        "content": "Meta shares were down 2% after the company reported third-quarter earnings in which it posted lower than expected daily active people.\n\nHere are the results.\n\nEarnings per share: $6.03 vs. $5.25 expected by LSEG\n\nRevenue: $40.59 billion vs. $40.29 billion expected by LSEG\n\nThe company said it is expecting fourth-quarter revenue to be between $45 billion and $48 billion. The midpoint of that guidance is higher than the analyst consensus of $46.3 billion.\n\nMeta said daily active people grew 5% year-over-year for the third quarter to 3.29 billion, which was lower than analyst expectations’ of 3.31 billion.\n\nThe company said that guidance for its fiscal 2024 total expense will be in the range of $96 billion to $98 billion, which is lower than previous guidance of $96 to $99 billion.\n\nMeta said that capex guidance for the 2024 fiscal year will be between $38 billion to $40 billion, up from $37 billion to $40 billion.\n\nMeta said that it expects capital expenditures to continue to grow significantly in 2025.\n\nSource: https://www.cnbc.com/2024/10/30/meta-q3-earnings-report-2024.html",
        "created_utc": 1730319581.0,
        "subreddit_name": "stocks",
        "comments": 88
    },
    {
        "title": "Visa plans to fire 1,400 employees and contractors",
        "score": 130,
        "url": "https://www.reddit.com/r/stocks/comments/1gfso4m/visa_plans_to_fire_1400_employees_and_contractors/",
        "content": "Multinational payment card services corporation Visa has been planning to lay off nearly 1,400 employees and contractors by the end of 2024. \n\nAccording to sources familiar with the matter, Visa intends to fire around 1,400 employees and contractors to advance its strategy to simplify its international business. Initially reported by the Wall Street Journal, the announcement stated that approximately 1,000 of the cuts are projected to remove technology positions, with the majority of the layoffs being focused on Visa’s merchant sales and global digital partnership roles.\n\nThe report mentions that a part of the layoffs ensued a week before the news dropped, with Visa encouraging individuals to apply for open positions. However, Visa intends to maintain its workers in the global digital partnership teams employed in their positions through the end of 2024. According to a Visa representative cited by Reuters, the company works towards evolving its operational model to advance its growth, which can in turn lead to the elimination of some roles currently present. Despite this, Visa plans to employ more individuals each year for the foreseeable future, depending on its needs and demands.\n\nVisa’s legal issues\n\nRecently, Visa has been facing legal issues and was under scrutiny from regulators, as well as dissatisfied merchants. For example, in September 2024, The US Justice Department sued Visa for monopolising the debit card market, charging significant fees, and inhibiting competition. The civil antitrust lawsuit, which was filed in the US District Court for the Southern District of New York, charged the company with violating sections 1 and 2 of the Sherman Act due to more than 60% of debit transactions in the US running on its debit network.\n\nMoreover, Visa was alleged to unlawfully amassed the capability to extract fees that exceeded what it could charge in a competitive market. At the same time, merchants and banks transferred those funds to consumers by scaling prices or by minimising the quality of services. This led to Visa’s conduct negatively impacting the price of everything. The lawsuit was filed to reinstate competition in the market and to support the US public.\n\nSources:\nhttps://thepaypers.com/payments-general/visa-plans-to-fire-1400-employees-and-contractors--1270771\n\nhttps://www.wsj.com/business/visa-plans-to-lay-off-around-1-400-employees-and-contractors-cd278c71?msockid=30e79273349267d731268767356866d0\n\nhttps://www.bloomberg.com/news/articles/2024-10-29/visa-shares-reverse-earlier-gains-after-report-of-1-400-job-cuts",
        "created_utc": 1730310637.0,
        "subreddit_name": "stocks",
        "comments": 28
    },
    {
        "title": "$UBER - what do you think of impact of Waymo as its now doing 150,000 \"paid rides\" a WEEK!",
        "score": 99,
        "url": "https://www.reddit.com/r/stocks/comments/1gfet6o/uber_what_do_you_think_of_impact_of_waymo_as_its/",
        "content": "[https://www.forbes.com/sites/alanohnsman/2024/10/29/alphabets-waymo-logging-150000-robotaxi-rides-and-1-million-miles-a-week/](https://www.forbes.com/sites/alanohnsman/2024/10/29/alphabets-waymo-logging-150000-robotaxi-rides-and-1-million-miles-a-week/)\n\n  \n\"Waymo, Alphabet’s robotic taxi unit, is now providing over 150,000 paid rides per week, up by more than 50% since August\" \n\n“Waymo is now a clear technical leader within the autonomous vehicle industry and creating a growing commercial opportunity,” Pichai said. “Now each week Waymo is driving more than 1 million fully autonomous miles and serves over 150,000 paid rides, the first time any AV company has reached this kind of mainstream use.”\n\n\"In addition to new cash, Waymo is also adding a [vehicle production facility in metro Phoenix](https://www.forbes.com/sites/alanohnsman/2024/08/26/waymo-adding-a-second-robotaxi-assembly-facility/) to install sensors and its computing system into its robotaxis. It also plans to source [electric vehicles based on Hyundai’s Ioniq 5](https://www.forbes.com/sites/alanohnsman/2024/10/04/waymo-bulking-up-robotaxi-fleet-with-electric-hyundais/) model for its growing fleet starting next year. Waymo is also shifting to a new lower-cost sensor and compute system that it says is more powerful than the one currently in use and that will help it eventually become profitable.\"\n\n  \nAnd apart from having Google's tech & money power, it's raising crazy money - [https://www.nytimes.com/2024/10/28/business/waymo-investment-robot-taxis.html](https://www.nytimes.com/2024/10/28/business/waymo-investment-robot-taxis.html)\n\nAt this point it's hard to ignore its impact on Uber.\n\nYour thoughts ?\n\n",
        "created_utc": 1730263678.0,
        "subreddit_name": "stocks",
        "comments": 71
    },
    {
        "title": "Why SMCI's situation is a massive threat to Nvidia",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gfqlq2/why_smcis_situation_is_a_massive_threat_to_nvidia/",
        "content": "SMCI has faced allegations of accounting manipulation, which have escalated this morning when it was revealed that their auditor, Ernst & Young, resigned. The true extent of the situation is not yet known to the public\n\nSMCI is one of Nvidia's largest customers, accounting for 9% of their sales. If they go under, Nvidia will take a massive hit to their future earnings.\n\nSome may argue that it does not matter, because since Nvidia's production is sold out, any gap in orders would be filled by other customers. There are 2 problems with this assumption:\n\n1. This ignores the impact of a hypothetical liquidation of SMCI. If SMCI was faking orders, this would mean that they likely have a growing inventory of AI chips. These would then be auctioned off, creating a surge in supply, competing with new orders.\n\n2. The duration of Nvidia's lead times can impact their margins and pricing power. If you have a 12 month lead time due to immense demand, you can hike prices. If that lead time shrinks to 1 month due to losing a significant customer, you have less margin to raise prices without impacting sales.\n\nThis scandal could also draw attention to other \"round tripping\" arrangements in the tech industry, in which circular transactions are set up in order to fake revenue growth. This could very much be the start of the unraveling of a bubble.\n\nThis isn't going to bankrupt Nvidia, they still have incredibly successful products and other customers, but it could definitely lead to a case where earnings growth stagnates, or is not sufficient enough to justify their current share price.\n\nDespite this tremendous threat, Nvidia is down just 1% today, which is well within its normal volatility. The market is not responding to this new information appropriately.",
        "created_utc": 1730305479.0,
        "subreddit_name": "stocks",
        "comments": 89
    },
    {
        "title": "If $INTC Intel fuk up this quarter again, i think Gelsinger will likely forced to resign or retire",
        "score": 83,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gfiub2/if_intc_intel_fuk_up_this_quarter_again_i_think/",
        "content": "Looks like we’re bracing for another rough day for Intel tomorrow. The big question now is whether Pat Gelsinger might face the heat for three straight years of struggles. When the media starts spotlighting his “misleadership,” you know the pressure is building. If this quarter’s results disappoint again, expect those calls for a shake-up to get even louder. \n\nIntel isn’t just struggling with sales and aging tech—it’s dealing with a leadership crisis that might finally reach a breaking point.\n\nhttps://preview.redd.it/e7vpgups8vxd1.png?width=717&format=png&auto=webp&s=b0e1db6718769d34020f71ec7b6f4beeaa7ec29e\n\n",
        "created_utc": 1730282102.0,
        "subreddit_name": "wallstreetbets",
        "comments": 77
    },
    {
        "title": "INTC set for big drop in quarterly revenue as chipmaker struggles to bounce back",
        "score": 21,
        "url": "https://www.reuters.com/technology/intel-set-big-drop-quarterly-revenue-chipmaker-struggles-bounce-back-2024-10-29/",
        "content": "",
        "created_utc": 1730256040.0,
        "subreddit_name": "wallstreetbets",
        "comments": 22
    }
]