[
    {
        "title": "I'm a former Apple engineer and I build the Apollo Reddit client! Today for my birthday I'm donating 100% of Apollo's proceeds to my SPCA Animal Shelter who really need the help. If you've ever had a passing interest in Apollo (or even already have it, secrets inside) there's no better day! 🐶🐱",
        "score": 13198,
        "url": "https://www.reddit.com/r/apple/comments/huo3vx/im_a_former_apple_engineer_and_i_build_the_apollo/",
        "content": "EDIT: Over! I'm totaling up the donations! Will update shortly!\n\nHey r/Apple!\n\nI'm decently active in this community, but for those of you who I haven't said hi to, I'm an iOS app developer, I used to work at Apple and now for the last several years I've built [Apollo for Reddit](https://itunes.apple.com/app/id979274575), an awesome Reddit app for iOS that I built with the goal of \"what would it look like if Apple themselves built a Reddit app?\". \n\n### What's going on today?\n\nToday it's my 27th birthday, and I want to raise a bunch of money for the SPCA Animal Shelter and a bunch of animals that are going through some rough times. Heck, I want to go a step further and break the all-time single day donation record. **So for today, 100% of Apollo's proceeds are going to the SPCA.**\n\nIf you buy literally anything in the app like Apollo Pro, I'll donate 100% of the proceeds to the SPCA, so it's a great day if you even have a passing interest in Apollo. If you already have unlocked things in Apollo, boy do I have a treat for you! A lot of people have been asking for an \"animals/pets\" style homescreen icon option for Apollo, and today I released a \"stealth update\" that has an all new SPCA themed icon commissioned by the absolutely incredible [David Lanham](https://dlanham.com/). It's so gorgeous, [I love how it turned out](https://i.imgur.com/rCm1Sfz.png). Not only today, but literally for every day forever, 100% of the proceeds for this will go to the SPCA. You get the icon, some wallpapers, and even an exclusive Apollo Community Pets Photo Album included. There's even another Easter egg if you unlock it. \n\nIf you want to go the direct route instead (or in addition) that would be amazing too! I created a direct fundraiser page: https://www.canadahelps.org/en/pages/apollo-app-2020-spca-fundraiser/ This is doubly awesome if you have an employer who donation-matches to charities. Seriously, I know a lot of people are like \"hurr durr every dollar counts\" but no bullshit, it **really** does here. Think of the size of this community, 1.6 million people. If even a small percentage of them gave a single dollar we could make a massive difference. \n\n### What's an \"Apollo\"? It's a different Reddit app?\n\nIf you're happy with the official app and have no idea what Apollo is, that's totally cool. I wasn't really perfectly happy with any of the iOS Reddit app offerings out there (especially with Alien Blue's passing). The official app in particular (while built by some insanely smart people whom I have a ton of respect for) I think tries to toe the line between a single experience across their Android and an iOS apps more than I like, so I really wanted to create an iOS-first Reddit experience that felt at home on iOS, built for speed, power features, and insanely great media consumption. It's free to download and use!\n\nIt's kinda like a car, you might be perfectly happy with yours and wonder what's the point of another car, but you might drive in another car and just find it more fun and comfortable to use. On top of this Apollo has some really slick custom gestures, a Jump Bar for quickly bouncing between subreddits, color-coded comments for easy navigation, a really powerful media viewer, Smart Portrait Lock, and it was voted the best Reddit app for iOS by [John Gruber of Daring Fireball](https://daringfireball.net/linked/2018/08/24/apollo) as well as [The Sweet Setup](https://thesweetsetup.com/apps/the-best-reddit-app-for-ios/), with over 2 million downloads and over 100K 5-star reviews.\n\n### Why right now?\n\nThese warm months are dubbed \"[kitten season](https://spca.bc.ca/news/kitten-season/)\" by shelters, because it's the time of the year that all the cats like to give birth. So the shelters get a sudden massive influx of a ton of orphaned and surrendered (and sometime left to die) kittens and it massively drains their resouces like food. This is amplified by the COVID pandemic where a lot less people have been able to gets their pets neutered, and adoptions have lessened due to people staying inside. So it's a really, really hard time of the year and they (and the animals they're helping) are really in need of the help.\n\nThey're also special for me because it's where I rescued my two cats. Pet tax photo album: https://imgur.com/a/q9cL7t6\n\nSo yeah, if you enjoy my work at all, or like animals at all, or want me to have a good birthday, or just want some happiness in this otherwise crappy year, it would really mean the world to me if you could check out any of the above links and help out the shelter. The donation record for a single day [is $27,355 that we set last year](https://old.reddit.com/r/apple/comments/cg11x7/i_dont_even_know_how_to_title_this_typing_from/), but I really really want to beat it this year! I think with the combination of the new icon, Apollo having more users than ever, and the direct donation option, we can do it.\n\nI'll of course keep you all posted once I find out how much Apollo raised by tomorrow! In the meantime I'd love to hang around and talk if you have any questions or insights or just want to share pet pics haha.\n\n\\- Christian\n\nEDIT: Only a few hours left! When this post turns 24 hours old the donations will be totaled! If you're considering Apollo now is the perfect time! 9:30 AM PT is the time mark! Thank you so much everyone!\n\nEDIT: Over! I'm totaling up the donations! Will update shortly!",
        "created_utc": 1595261768.0,
        "subreddit_name": "apple",
        "comments": 669
    }
]