[
    {
        "title": "Twitter set to accept Musk's $43 bln offer - sources",
        "score": 1214,
        "url": "https://www.reddit.com/r/investing/comments/ubkklq/twitter_set_to_accept_musks_43_bln_offer_sources/",
        "content": "From the article:\n\n> NEW YORK, April 25 (Reuters) - Twitter Inc (TWTR.N) is poised to agree a sale to Elon Musk for around $43 billion in cash, the price the chief executive of Tesla Inc (TSLA.O) has called his \"best and final\" offer for the social media company, people familiar with the matter said.\n\n> Twitter may announce the $54.20-per-share deal later on Monday once its board has met to recommend the transaction to Twitter shareholders, the sources said. It is always possible that the deal collapses at the last minute, the sources added.\n\nhttps://www.reuters.com/technology/exclusive-twitter-set-accept-musks-best-final-offer-sources-2022-04-25/\n\nThis was a fast turnaround from their \"poison pill\", if true.",
        "created_utc": 1650891536.0,
        "subreddit_name": "investing",
        "comments": 382
    },
    {
        "title": "Stop asking what you should buy.",
        "score": 2331,
        "url": "https://www.reddit.com/r/stocks/comments/ub806p/stop_asking_what_you_should_buy/",
        "content": "If you are here asking what you should buy, how much you should allocate and to where, whether you should buy now or DCA over time, or if your post can be summated to “will this ticker(s) go up from here?”, then fuck off!  \n\nNobody knows anything.  \n\nPelosi bought $100 $RBLX LEAPs and the stock hit an all-time low last week. \n\nBurry’s $TSLA puts literally fucked him in front of his family. \n\nAckman just took a fucking $400mil loss on $NFLX.\n\nMunger doubled down on $BABA and then sold half his position at a loss.\n\nIf your post mentions the % off all time high, fuck off.\n\nIf your post mentions the metaverse, fuck off. \n\nIf you’re down on your investments and your post helps you feel good about bag holding, then fuck off!\n\nThe market will probably crash any day.  Or it will melt up for 2 more years.  I don’t know and neither do you. \n\nNobody knows anything.\n\nEdit:  Fixed Ackman’s loss on $NFLX",
        "created_utc": 1650845285.0,
        "subreddit_name": "stocks",
        "comments": 393
    },
    {
        "title": "Twitter accepts Elon Musk’s buyout deal",
        "score": 3864,
        "url": "https://www.reddit.com/r/stocks/comments/ubserg/twitter_accepts_elon_musks_buyout_deal/",
        "content": "Twitter’s board has accepted an offer from billionaire Elon Musk to buy the social media company and take it private, the company confirmed.\n\nThe announcement ends a weeks-long saga Musk kicked off when he disclosed a large stake in the company. Soon after, the company said he would join the board, only for Musk to reverse course on that plan several days later. Then, he offered to buy the company at $54.20 per share, his “best and final.” That offer valued Twitter at about $43 billion.\n\nLink: [CNBC](https://www.cnbc.com/2022/04/25/twitter-accepts-elon-musks-buyout-deal.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard)",
        "created_utc": 1650912775.0,
        "subreddit_name": "stocks",
        "comments": 801
    }
]