[
    {
        "title": "Richard Branson and Jeff Bezos are flying into space this month. If one or both of them don't survive, what happens to their companies?",
        "score": 2667,
        "url": "https://www.reddit.com/r/stocks/comments/ohms67/richard_branson_and_jeff_bezos_are_flying_into/",
        "content": "Virgin and Amazon are the only companies in history to have leaders to fly into outer space.  The risk of death is real for both men.  1.4% of astronauts die during their flight, based on all data from the 1960s to present.  \n\n* Challenger space shuttle explosion during flight, killing all 7 aboard\n* Columbia space shuttle explosion on re-entry, killing all 7 aboard \n* Apollo I caught fire on its launch pad, killing all 3 aboard. \n* Soyuz 11 experienced explosive decompression in space, killing all 3 aboard.",
        "created_utc": 1625937552.0,
        "subreddit_name": "stocks",
        "comments": 506
    },
    {
        "title": "Top Ten Mistakes I Made In My Career As A Day Trader",
        "score": 547,
        "url": "https://www.reddit.com/r/Daytrading/comments/ohrk8o/top_ten_mistakes_i_made_in_my_career_as_a_day/",
        "content": "Over the past year I have posted on different strategies one can use while Day Trading, told my story on how I got started, wrote about the importance of mindset and went into detail about how to Day Trade for a living.   \n\nSome of you have been cynical, refusing to believe that someone successful at this would be here helping others without either being a fraud or a shill.  Once again, I can assure anyone reading this, that while I will always recommend something that has worked for me, I am not employed by, contracted out from, own or run, any service or resource.  My suggestions are based on my personal experience and should be taken in that vein.  And plenty of people on here have seen me trade by now to know I am not a fraud.\n\nWhile I have been Day Trading for five years and successful for the past three, there are many others that have done this longer and have been more successful than I have.  I define success in Day Trading as being consistently profitable to the point where you can depend on it as income to support your daily life.  \n\nHowever, during that journey I have made many mistakes, and looking back at my post history there is a glaring omission in discussing those errors.  Mistakes are essential in the learning process - hopefully some of you can learn from mine before making them yourself:\n\n*All of these apply to Day Trading, read them in that context:*\n\n**1) Going on Tilt** \\- Far and away my biggest mistake.  I wouldn't just revenge trade, I would take it to the next level of abstraction.  I was so bad with this that even those on the WSB sub would be like,\"Damnnnn....this is NOT the way.\"  I was incapable of getting up and walking away, I could not set limits on daily losses, and as a result bad days turned into catastrophically bad days.  \n\n*You cannot trade if you’re not in the right mindset. If you find yourself breaking your own rules and trading emotionally, you need to get up and walk away.*   \n\n**2) Trying to Anticipate -** I thought I had figured things out, but I hadn't figured out shit. \n\n\"*SPY is due to retrace here\", \"AAPL is going to blow away earnings, going long!\", \"Bag Holders are going to take profit soon, going short!\"*  \n\nI did not want to \"miss out\", so I constantly tried to be early on trades.  When I look back, if had just waited for a basic 3/8 EMA cross to confirm before entering, that alone would have had a huge positive impact on my results.  What you are essentially doing is trying to anticipate what Institutions will do, not the stock, and Institutional traders have far more information than any us ever will.  \n\n*When I stopped trying to predict Institutional moves, and started following them after they occurred, my success rate went up dramatically.* \n\n**3) It's Not A Loss Until I Close The Trade -** Whenever I was bag-holding, I would look at my account and see that one stock with the huge red loss next to it and this stubborn belief grabs hold - the one that says \"you didn't lose that money until you closed the trade\".  That belief is total bullshit - yes, you did lose the money.  It is like how I used to think whenever I went to Vegas - \"It's not a loss until I cashed in my chips and left the casino.\"  You need to ask yourself, is there no better use for that money right now?  If you are still holding a stock because of technical reasons (i.e. I held **CARV** from two weeks ago as it never violated support) that is one thing - but holding a loser and thinking *that* stock has to be the one to make up for the loss is all mindset, not logic.  Find a better trade.\n\n*Don't stick with bad trades just because you think it isn't a loss until you close them.* \n\n**4) Too. Many. Indicators.** \\- My charts were an absolute mess in the beginning.  I had indicators, and then indicators for the indicators, trend lines, moving averages, etc.  Eventually I couldn't even see the actual price action because the chart was so cluttered.  At some point I was using several monitors just to look at the same stock, and with enough indicators and timeframes you could justify almost any decision.  It also took me awhile to learn that - indicators without confirmation is a losing proposition.  When I cleaned up my charts and waited for moves to be confirmed I stopped trying to find data to support my bad decisions, and started letting the data lead me to the right decisions.\n\n*Keep it simple.  Wait for confirmation and don't hesitate when you get it.*\n\n**5) If You Don't Get It, Don't Do It -** I remember in the beginning I saw some YouTube video and the guy in it was doing his weekly stock recommendations.  He suggested doing the Wheel strategy on **FB** and I thought, well that sounds easy enough.  So I looked up how to do it and executed the trade.  **FB** went up and I collected the premium.  That was my first time selling premium, and I immediately started looking for other trades like it - and of course for a time I was *all about The Wheel* \\- I mean, did other people know about this surefire strategy?!  At some point I did one on **AMD** and got assigned - no problem, all part of the strategy I thought, so I sold covered calls.  Well this was late 2018, and **AMD** kept dropping, and dropping - the premium I was getting was not nearly enough to offset the constant drops in the stock.  Finally, when **AMD** dropped below 20 I got frustrated (*see mistake #1 above*) and started selling calls close to ATM to get more premium.  And what happened?  **AMD** finally went up and up, and they got called away - it was a losing trade overall, by a lot.    The first time I did a Bullish Put Spread it was on **COST,** it dropped below my long Put and I had no idea how to leg out.  I lost money because I didn't truly understand what I was doing, and therefore I also did not understand how to get out of the trade.  \n\n*Don't enter a trade unless you have a clear understanding of the mechanics of the your position and have a plan for exit.*\n\n**6) Stop-Loss, Stopped Out, Stop Doing It -**  Most beginning traders are focused on Risk:Reward and so was I.  If I put my target at 50 cents profit and my max loss at 25 cents, I am getting a 2:1 return, perfect - so all I need to do is win at least 1/3rd of the time and I will be in profit.   The problem was that I *would* have reached my target 1/3rd of the time if I didn't keep getting stopped out.  When you set a tight stop, you now have two ways to lose that trade: 1) Stock just doesn't hit the target and drops, and 2) Stock hits the target but first it drops down to your stop.   \n\nI now use mental stops on all my trades, but I recognize that some traders prefer actual hard stops.  However, you need to give the trade some room to breathe - yes by moving your stop-loss out further you are reducing your Risk:Reward ratio, but you are also increasing your Win Percentage.  And every professional trader knows that in the end, Win Percentage is what matters (I know you can have a 95% win rate, but you can still lose it all on the 5%  - however, if you have consistency in your trades this will not happen).\n\nAt some point you will realize that a consistent win-rate is *the most important* thing - a repeatable, consistently winning strategy.  Setting tight stop loss are a quick way to drastically reduce your likelihood of having a winning trade.  Also (and I have a post dedicated to this entire topic) - stops should be based on the technical analysis and not your risk/reward ratio.\n\n*Don't give yourself more ways to lose by setting a tight stop on your trades.*\n\n**7) The First Two Hours Are NOT All That Matters -** I thought it would be great, I would learn this, work maybe 1 or 2 hours a day, and be done.  Hell, the guys on YouTube do it, seems simple, and then I have the rest of my day to do whatever I want.  Well, to start with, I actually enjoy trading.  Unlike most jobs, I have no desire to cut the day short.  More importantly I found out that this \"rule\" only applies if all you are doing is momentum trading.  Some of my most profitable trades comes in the middle or towards the end of the trading day.  This past Friday, I made my best trades on **SGOC** *after* the first two hours.  Plus, I was able to make trades on stocks like **AMZN** (shorted it), because I was able to watch how it responded to the market throughout the day.  I tend to avoid trading in the first thirty minutes now and use to the time to see how stocks perform relative to the market (SPY).\n\n*Great set-ups happen all throughout the day.  Keep scanning, keep setting alerts.*\n\n**8) Patience -** I remember when **SNAP** was a new stock and very volatile.   One day I started trading it and I believe it was around $14.50 at the beginning of the day (it gapped up by around $1).  I jumped in, bought around 5,000 shares and it dropped down to $13.75, so I sold it for a loss, which stung - down around $3,750.  About an hour later it started getting volume again and jumping back up, so I bought it again, same share size (I think it was under $14 when I bought it the second time), and it went up.  Instead of scalping it, I was looking to get even, so I didn't take profit right away.  Naturally, it dropped again, and this time I scratched the trade.  I must have traded **SNAP** 5 times that day, and by the end of it I was down around $6,500 overall - but **SNAP** finished the day over $15.  So I kept going long on a stock that finished the day up over 20% and I lost money!  If I would have either 1) waited for the first pullback and just bought it around 13.75 and then held until end of day or 2) just stayed in my original trade, I would have made money.  My constant impatience with the trade cost me.  As a new trader I didn't have enough confidence in my trades, and yet I was trading with big positions.  Basically, I was doing everything wrong - trading my P&L and not my charts, not having the patience or confidence in the trade, and not knowing when to stop.\n\n*Lack of confidence leads to lack of patience.  Don't trade out of fear, trade the price action.*\n\n**9) FOMO -** Every new traders worst enemy.  Whether you are seeing posts on social media, or people in a chat room talk about a ticker, we have all fallen victim to FOMO at some point.  When you see someone say, \"**PRPO** is going!\" and then right after that, someone else says, \"OMG **PRPO**! Who's in??\" It is really hard to not jump into **PRPO**.  In fact, our anxiety is so great that usually we are jumping in before even checking the charts or trying to find out what the catalyst was for the jump in price.  Even worse is when we have to liquidate another position to free up the buying power to take the trade.  The overall lesson I learned here is - never jump into a trade without having a good reason, and a good plan for exit.  Anything that causes you to bypass rational thought and trade purely on emotion is not a winning strategy.  \n\n*FOMO is not your friend.  FOFU should be instead (Fear of Fucking Up).*\n\n**10) Discounted Experience -** There is an \"X\" factor in Day Trading that can't be taught in a book, or through a post or video.  It can only be learned after doing thousands of trades yourself, and when I say trades, I mean *real* trades, not simulated ones.  As a former academic, I thought that if I just read the material, followed the rules, I could be successful.  Turns out that you do need to do all of that, you need to have a solid foundation of knowledge and you need to have a good strategy - but you also need experience.  It is a small edge, that is barely discernible, but it is what will make an experience trader perhaps stay in for a minute longer, or exit a trade a moment sooner than you might expect.  In every trade there are countless variables occurring - the current market conditions, the volume on the stock, the overall sector, areas of resistance and support, the pattern on the stock on that day and historically, the candlestick patterns, the trendlines - all of which paint a picture.  Experience allows you to see that picture more clearly.  What do this mean practically?  It means that the thing I wish I knew the most when I started out was - trade small - meaningful, but small.  You need to build that experience over time, and you don't want to risk too much while you do.\n\n*Experience matters, but it can be costly to learn, so start small and build over time.*\n\nAnyway, I hope these help you, I wish I knew them when I started out.  And I know that reading them is one thing, and actually putting them into practice is another - but if you manage to not repeat all of these mistakes (like I did), you will be well ahead of the game.",
        "created_utc": 1625953403.0,
        "subreddit_name": "Daytrading",
        "comments": 157
    },
    {
        "title": "WSJ shows targets for $AAPL at high of $180/ mid $160. As long as they keep innovating it should go to the moon🚀🚀🚀",
        "score": 24,
        "url": "https://www.reddit.com/r/AAPL/comments/ohsfai/wsj_shows_targets_for_aapl_at_high_of_180_mid_160/",
        "content": "",
        "created_utc": 1625956419.0,
        "subreddit_name": "AAPL",
        "comments": 12
    }
]