[
    {
        "title": "Here’s everything you should know about Apple’s rumored HomePod with display",
        "score": 702,
        "url": "https://9to5mac.com/2024/07/20/homepod-display-rumor-roundup/",
        "content": "",
        "created_utc": 1721511993.0,
        "subreddit_name": "apple",
        "comments": 154
    },
    {
        "title": "Don‘t overthink! (for beginners, unprofitable bros and people who think they are lost)",
        "score": 66,
        "url": "https://www.reddit.com/r/Daytrading/comments/1e7jryu/dont_overthink_for_beginners_unprofitable_bros/",
        "content": "Guys,\n\nI'm a lurker in this subreddit and I have recognized a pattern. People overthink irrelevant things. I will answer literally 90% of the daily asked questions on this sub.\n\n-How many monitors do I need?\n\nIf you have to ask this question, you literally need just one monitor. Profitable traders with multiple monitors use them because of their strategy or they have one monitor for a special purpose (e.g., one for futures, one for news, one for journaling). Look into the multi-desktop feature of Windows or even Mac to make better use of one screen.\n\n-Which Trading Platform is the best?\n\nTrading platforms are like cars. Everybody has different tastes. Some have more specialized features for charting, some for volume trading, etc. You can’t go wrong with any software. Pick one you like the most or find interesting and just use it. When you master one software, you can easily adapt to another since all of them work pretty much the same. I personally use NinjaTrader even though most people on this sub hate it. I think it's cool.\nIf you cant choose a software just pick TradingView, it has the most learning ressources and a huge community.\n\n-How long does it take to be a Profitable Trader?\n\nFrom 1 day to \"will never happen\"—it depends on how quickly you learn and apply your knowledge in real-life situations. Think of it like cycling. Some kids learn it literally in an hour, while others need several weeks.\n\nHow can I be profitable?\n90% Psychology, 9% Trading Management, 1% Strategy.\n\nWhat does that mean?\n\nPsychology:\n- Try to detach your emotions from your trading.\n- Don’t overtrade.\n- Don’t overleverage.\n- Don’t trade if your entry rules are not met.\n- Have a clear head.\n- Do not revenge trade (the market doesn’t care about you; just take your loss and move on).\n\nTrading Management:\n- Don’t risk too much money and set your stop loss properly (we all had a trade where we entered the market and got stopped out. 5 minutes later, the market moved in the direction we picked).\n\nStrategy:\n- There is no best strategy! Choose one of the following and learn everything you can:\n  - Price action\n  - Technical analysis with indicators\n  - Volume trading\n  - Order flow trading\n\n\nHow much capital do I need to live off trading?\n\nThere are too many variables to answer this question.\nA trading bro from New York who rents a penthouse suite next to Central Park will have higher capital requirements than a trading bro from a country with a lower cost of living. After extensive Research and training on Papertrading Account, you can have a feeling of how much capital you would need to sustain your lifestyle with just trading.\n\nCan i buy a Lamborghini with trading?\nYes\n\nTL:DR\nUse your current PC, \ndon’t spend money on fancy Hardware\nPick any Trading Software, \nany Trading Strategy, \nwrite the conditions for entry and exit and stick to it religiously, \njournal everything, \npapertrade till consistently profitable, \nUse real money,\nearn money, \nbuy Lambo\n\n",
        "created_utc": 1721437987.0,
        "subreddit_name": "DayTrading",
        "comments": 17
    }
]