[
    {
        "title": "7 years from $0 to $100k, 3 years from $100k to $200k",
        "score": 1690,
        "url": "https://www.reddit.com/r/investing/comments/17yaktc/7_years_from_0_to_100k_3_years_from_100k_to_200k/",
        "content": "I joined eTrade in 2013 a few years after graduating college. I had set up automatic monthly contributions to my accounts, which I slowly raised over time and mostly invested in blue chip stocks. \n\nOn December 1, 2020, the combined value of my Roth and Traditional Brokerage account was just over $100k. It took me over seven years to get there and was a major milestone.  In the past three years, I have raised my monthly contributions, continued to invest, and am now just shy of $200k at the age of 35. You read about the power of compound gains all the time, but to go from $100k to $200k in three years when the first $100k took seven years is a testiment to that fact.  My goal is $1 mil by 47 and eventually to hit $2.5 mil before I retire. \n\nFor all you youngins out there, stick with it! But also, don't rush the process and try to hit home runs every day. For the most part, I am a buy and hold investor after a year or two of trying my hand at day trading with options and futures. When you chase the money, you won't make it. But if you’re patient with a decent risk tolerance, anything is possible. \n\n\n\nEdit: Wow, thanks for the up votes everyone. It’s been fun reading the comments. Adding some context here based on some of the questions that have come in. Monthly contributions are at $1,000 a month now, but in the early years they were less. When I first started, it was $100 a month and I worked my way up from there. There was a good chunk of time where they were between $200-$500 a month. These accounts were set up on my own, no employer match. I’m not sure what my lifetime performance is, but the last three years I’m up 30% overall. All that in mind, I can confidently say that well over half of my account is due to investment gains. \n\nInvestments have been all individual stocks that I typically hold for a year or longer. I pick them based on both technical and fundamental factors. This is more risky than ETFs and index funds but it suits my investing style and risk tolerance. I try to stick to profitable companies with a stock price that has a history of moving in the right direction, however I also like to buy at a discount price. I keep my eyes on charts and when there’s opportunities to buy at historically undervalued prices I jump on it. There’s really nothing super special to it. Not going to share my current exact portfolio, but stocks I have owned in the past or currently include AAPL, GOOGL, META, COST, HD, MCD, DKNG, AMD, DIS, and BAC to name a few. There are many others I’m interested in buying that are on my watchlist.\n\nI will also add that I’ve made a ton of mistakes along the way. Bad investments, selling too soon when I should of just held, taking risky, over leveraged day trades that resulted in nasty losses and wash sales. However, I’ve learned from them and never done anything bad enough that blew an account or resulted in a draw down that couldn’t be recovered. You can read all the books you want but I’ve always found that the best way is to learn by doing and over time you develop your own skills and are able to trust your own analysis and decisions.",
        "created_utc": 1700326297.0,
        "subreddit_name": "investing",
        "comments": 282
    }
]