[
    {
        "title": "Apple says it uses no Nvidia GPUs to train its AI models, instead using Google's TPUs",
        "score": 700,
        "url": "https://www.reddit.com/r/stocks/comments/1efqut7/apple_says_it_uses_no_nvidia_gpus_to_train_its_ai/",
        "content": "Surprised to learn that Apple is using Google chips instead of Nvidia.\n\nI guess this is partially why Google is now the third largest datacenter chip designer and will be #2 before the end of the year.\n\nhttps://www.reuters.com/technology/apple-says-it-uses-no-nvidia-gpus-train-its-ai-models-2024-07-29/?utm_source=reddit.com&utm_source=reddit\n\nhttps://blog.svc.techinsights.com/wp-content/uploads/2024/05/DCC-2405-806_Figure2.png",
        "created_utc": 1722338628.0,
        "subreddit_name": "stocks",
        "comments": 178
    },
    {
        "title": "Bloomberg: Intel to Cut Thousands of Jobs to Reduce Costs, Fund Rebound",
        "score": 630,
        "url": "https://www.reddit.com/r/stocks/comments/1eg872p/bloomberg_intel_to_cut_thousands_of_jobs_to/",
        "content": "Intel Corp. plans to eliminate thousands of jobs to reduce costs and fund an ambitious effort to rebound from an earnings slump and market share losses.\n\nThe workforce reduction may be announced as early as this week, according to people familiar with the company’s plans, who asked not to be identified because the information isn’t public. Intel, which is scheduled to report second-quarter earnings Thursday, has about 110,000 employees, excluding workers at units that are being spun out.\n\nChief Executive Officer Pat Gelsinger is spending heavily on research and development aimed at improving Intel’s technology and helping it return to prominence in the semiconductor industry. The company’s once-dominant position eroded under Gelsinger’s predecessors as rivals, such as Advanced Micro Devices Inc., have caught up and taken market share. An Intel spokesperson declined to comment.\n\nIntel shares rose about 1% in late trading, reaching as high as $31.11, on the news.\n\nOther chipmakers led by Nvidia Corp. have sprinted ahead in the development of lucrative semiconductors tailored for demanding artificial intelligence-related tasks. Intel is also coming to grips with uneven demand for chips that run laptops and desktop computers, its main business.\n\nGelsinger, betting that Intel can improve its technology, embarked on a plan to build factories to manufacture semiconductors for other chipmakers. Last week, Intel hired Naga Chandrasekaran from Micron Technology Inc. as chief global operations officer, putting him in charge of the company’s overall manufacturing efforts.\n\nIntel reduced its workforce about 5% in 2023 to 124,800 by year’s end after announcing job cuts beginning in October 2022. It also has slowed spending in other areas. The company expected those cost reductions would save as much as $10 billion by 2025.\n\nAnalysts project that Intel will report that second-quarter revenue was flat, compared with a year earlier. Growth will pick up modestly in the second half of 2024, and total sales will increase 3% to $55.7 billion for the full year, according to Wall Street estimates. That would be the first annual revenue increase since 2021.\n\nhttps://www.bloomberg.com/news/articles/2024-07-30/intel-to-cut-thousands-of-jobs-to-reduce-costs-fund-turnaround",
        "created_utc": 1722382253.0,
        "subreddit_name": "stocks",
        "comments": 146
    },
    {
        "title": "Semiconductor, AI, and AI-adjacent companies have been getting pummeled the last few weeks. Are you buying, selling, or just waiting?  ",
        "score": 256,
        "url": "https://www.reddit.com/r/stocks/comments/1efv2qt/semiconductor_ai_and_aiadjacent_companies_have/",
        "content": "Although NVIDIA has been front and center during this selloff, many other companies in the space have been getting hammered as well. From July 10th (completely arbitrary cut-off date) to today:\n\n* Microsoft- Down 8.4%,\n* Google- Down 11%,\n* Amazon- Down 8.3%,\n* Nvidia- Down 20.3%,\n* Taiwan Semiconductor- Down 17.3%,\n* AMD- Down 24%,\n* Intel- Down 12.3%,\n* Dell- Down 24.3%,\n* Apple- Down 6%. \n\nAnd on and on.  Are you buying, selling, or just waiting?  ",
        "created_utc": 1722350419.0,
        "subreddit_name": "stocks",
        "comments": 229
    },
    {
        "title": "Apple says it uses no Nvidia GPUs to train its AI models, instead using Google's TPUs",
        "score": 1482,
        "url": "https://www.reuters.com/technology/apple-says-it-uses-no-nvidia-gpus-train-its-ai-models-2024-07-29/?utm_source=reddit.com",
        "content": "",
        "created_utc": 1722336944.0,
        "subreddit_name": "apple",
        "comments": 193
    },
    {
        "title": "Apple used Google's chips to train two AI models, research paper shows",
        "score": 4,
        "url": "https://www.reuters.com/technology/apple-says-it-uses-no-nvidia-gpus-train-its-ai-models-2024-07-29/",
        "content": "https://www.reuters.com/technology/apple-says-it-uses-no-nvidia-gpus-train-its-ai-models-2024-07-29/",
        "created_utc": 1722327053.0,
        "subreddit_name": "AAPL",
        "comments": 3
    }
]