[
    {
        "title": "U.S. Imposes Sanctions on 11 Chinese Companies Over Human Rights",
        "score": 1699,
        "url": "https://www.reddit.com/r/stocks/comments/hv82zt/us_imposes_sanctions_on_11_chinese_companies_over/",
        "content": " The move, which affects suppliers to major international brands such as Apple, Ralph Lauren and Tommy Hilfiger, could force companies to sever some ties to China.\n\n The list of sanctioned companies includes current and former suppliers to major international brands such as Apple, Ralph Lauren, Google, HP, Tommy Hilfiger, Hugo Boss and Muji, according to [a report](https://www.aspi.org.au/report/uyghurs-sale) by the Australian Strategic Policy Institute, a think tank established by the Australian government. The group cited the websites of the sanctioned Chinese companies, which mentioned their financial relationships with major American brands. \n\nThe blacklist only prevents U.S. companies from selling components or technologies to Chinese companies without a license, not from purchasing products. In practice, however, major international brands are unlikely to continue doing business with any firm named on a government list for forced labor or other abuses in Xinjiang.\n\n\n[NYT- ARTICLE](https://www.nytimes.com/2020/07/20/business/economy/china-sanctions-uighurs-labor.html)",
        "created_utc": 1595341001.0,
        "subreddit_name": "stocks",
        "comments": 306
    },
    {
        "title": "[Update on yesterday's Apollo SPCA Fundraiser] We raised $42,749.29 yesterday for the SPCA Animal Shelter. FORTY TWO THOUSAND DOLLARS. Thank you r/Apple! That's the historic RECORD for SPCA donations in a single day! We made such a difference to these animals, you're amazing. 🐶🐱🐰",
        "score": 4201,
        "url": "https://www.reddit.com/r/apple/comments/hvdd7p/update_on_yesterdays_apollo_spca_fundraiser_we/",
        "content": "Hey everyone! As promised I wanted to provide an update from [yesterday's Apollo fundraiser post I made here that people seemed to really enjoy](https://www.reddit.com/r/apple/comments/huo3vx/im_a_former_apple_engineer_and_i_build_the_apollo/).\n\nLong story short I work full time on making an awesome Reddit app for iOS called [Apollo for Reddit](https://itunes.apple.com/app/id979274575) that people ended up really liking and after over 2 million downloads I've been able to make it into my full time job. I love animals and our local SPCA shelter needed money due to an influx of orphaned kittens in these warm months (dubbed \"kitten season\"), made worse by the COVID pandemic and a decrease in adoptions and neutering, so the plan was to donate all my proceeds from the app for the day to the SPCA. So anyone who was interested in the Pro unlock in app could get the it AND support a good cause!\n\nWell yesterday blew away my wildest expectations. Seriously. To be clear I don't even make in the planetary orbit of this on a daily basis, the AMA and Apple subreddit post and support around the fundraiser amplifies it to a crazy extent and a lot of people support the app which is incredible and exactly what I want because this kind of amazing thing happens. I think the large amount of money was due to a lot of people meaning to unlock the Pro/Ultra version of Apollo (it's free download/use) but hadn't got around to it yet, plus [a new icon option](https://i.imgur.com/rCm1Sfz.png) giving existing users a fun thing to unlock and support, and Apollo's grown a lot over the last year with even more people enjoying it, so combined with the AMA and the post in r/Apple it had a lot of eyes on the fundraiser. Which I'm so happy and feel so fortunate for.\n\n**We raised a total of $42,749.29. Forty. Two. Thousand. Dollars.** That's a ton of money, that's like multiple cars. Or put another way, this bag of cat food is $5/pound. I'm sure the SPCA can get a better bulk/charity price than that, so let's say $4/pound. **That's over 10,600 pounds of cat food.** Adult great white sharks weigh around 1,250 pounds. That's the weight of over 8 great white sharks in cat food. \n\nHere's an image breaking down the figures for how the $42,749 came to be. ($39.6K from sales proceeds, $2.5K direct donations, $600 from responses): https://i.imgur.com/qA0Am8F.png\n\nThe previous record for donations in a single day to the Nova Scotia SPCA was coincidentally $27,355 [from our fundraiser last year](https://www.reddit.com/r/IAmA/comments/cg18r3/update_on_yesterdays_apollo_spca_fundraiser_ama/)! I so desperately wanted to beat that this year and we crushed it by over 50%! I'm now in the process of logistically figuring out how to transfer this much money over to them as cheaply as possible without losing much to credit card fees and whatnot, but as evidenced from the [SPCA Twitter account](https://twitter.com/NSSPCA) you can verify that the money will reach them, given their trust in me and the donations we've made in previous years. Speaking of which, the first year we raised $5,087 the first year, $27,355 the second year, and $42,749 this year (third year) which brings us to a lifetime total of $75,099. What a beautiful number to end up on this year, I'm really hoping we can pass $100,000 one day!\n\nAnyway, thank you so much for your support. I'll stick around to answer some more questions if anyone has any (I tried to answer every single one from yesterday), but other than that I'm going to get back to work on Apollo version 1.9 which I'm hoping to have out by the end of the month. If you'd like to check out Apollo I'd really love to know what you think, I crafted it with a ton of care toward really feeling at home as an iOS app, and being super fast and comfortable to use, and I really pride myself in listening to the community to build the best app I can. https://itunes.apple.com/app/id979274575\n\nOther than that, stay safe!!\n\n\\- Christian",
        "created_utc": 1595357712.0,
        "subreddit_name": "apple",
        "comments": 78
    }
]