[
    {
        "title": "Musk says robots could make Tesla $25 trillion company — more than half value of S&P 500 ",
        "score": 531,
        "url": "https://www.reddit.com/r/stocks/comments/1dfg8h3/musk_says_robots_could_make_tesla_25_trillion/",
        "content": "The entire value of the S&P 500 currently stands at $45.5 trillion, according to FactSet. Tesla CEO Elon Musk claimed on Thursday that his company’s Optimus humanoid robots could eventually make the automaker worth more than half of that.\n\nMusk, who characterized himself as “pathologically optimistic” at the 2024 annual shareholder meeting in Austin, Texas, said Tesla is embarking on not just a “new chapter” in its life, but is about to write an entirely “new book.” Optimus appears to be one of the main characters.\n\nTesla first revealed its plans to work on humanoid robots in 2021 at an AI Day event, trotting out a dancer in a unitard that looked like a sleek, androgynous robot.\n\nIn January, Tesla showed off Optimus robots folding laundry in a demo video that was immediately criticized by robotics engineers for being deceptive. The robots were not autonomous, but were rather being operated with humans at the controls.\n\nAt the shareholder event on Thursday, Musk didn’t divulge exactly what Optimus can do today. He suggested the robots some day will perform like R2-D2 and C-3PO in Star Wars. They could cook or clean for you, do factory work, or even teach your children, Musk suggested.\n\nAs for shareholder value, Musk said Optimus could be the catalyst for lifting Tesla’s market cap to $25 trillion someday.\n\nSpeaking to a crowd consisting mostly of fawning fanboys in an auditorium at the Gigafactory, Musk promised Tesla would move into “limited production” of Optimus in 2025 and test out humanoid robots in its own factories next year.\n\nThe company, he predicted, will have “over 1,000, or a few thousand, Optimus robots working at Tesla” in 2025.\n\nThis is all far-out stuff even for Musk, who is notorious for making ambitious promises to investors and customers that don’t pan out — from developing software that can turn an existing Tesla into a self-driving vehicle with an upload, to EV battery swapping stations.\n\nGetting to a $25 trillion market cap would mean that Tesla would be worth about eight times Apple’s value today. The iPhone maker is currently the world’s biggest company by market cap, just ahead of Microsoft.\n\nAt Thursday’s close, Tesla was valued at about $580 billion, making it the 10th most valuable company in the S&P 500.\n\nMusk didn’t provide a timeframe for reaching $25 trillion. He did say that autonomous vehicles could get the company to a market cap of $5 trillion to $7 trillion.\n\nMusk said he agreed with numbers from long-time Tesla bull Cathie Wood, the CEO of ARK Invest. This week, ARK put a $2,600 price target on Tesla’s stock by 2029, betting on a commercial robotaxi business that the company has yet to enter.\n\nWood’s price target equals a market cap for Tesla of over $8 trillion.\n\nMusk’s comments at the annual meeting followed the shareholder vote to reinstate the CEO’s $56 billion pay plan, five months after a Delaware court ordered the company to rescind the package. The crowd cheered when the proposal was read aloud, and when preliminary results were announced.\n\nTaking the stage following the readout of the shareholder votes, Musk said, “I just want to start off by saying hot d---! I love you guys.”\n\nTesla shares have dropped 27% this year as the company reckons with a sales decline that’s tied in part to an aging lineup of electric vehicles and increased competition in China. The company has also implemented steep layoffs. Musk has encouraged investors to look past the current state of the business and more toward a future of autonomous driving, robots and artificial intelligence.\n\nAmong his boldest claims on Thursday was Musk’s declaration that Tesla had advanced so far in developing silicon that it’s surpassed Nvidia when it comes to inference, or the process that trained machine learning models use to draw conclusions from new data.\n\nNvidia shares have soared almost nine-fold since the end of 2022, driven by demand for its AI chips. The company is now worth about $3.2 trillion.\n\nOne concern swirling around Musk is his focus on Tesla given all of his other commitments. He owns and runs social media company X, is CEO of SpaceX, and founded The Boring Co. and Neuralink. He launched another startup, xAI, in March last year and the company recently raised $6 billion in venture funding.\n\nMusk was asked by a shareholder at the meeting how important he is, personally, to the future of Tesla.\n\n“I’m a helpful accelerant to that future,” he said, emphasizing his role in innovation.\n\nHe said that, when it comes to humanoid robots, other companies, including tech startups, are going after the market. Competitors include Boston Dynamics, Agility, Neura and Apptronik.\n\n“What really matters is, can we be much faster than everyone else and our product be done a few years before theirs and be better,” Musk said.\n\nSource: https://www.cnbc.com/2024/06/13/elon-musk-says-optimus-robots-could-make-tesla-25-trillion-company-.html",
        "created_utc": 1718331774.0,
        "subreddit_name": "stocks",
        "comments": 455
    },
    {
        "title": "Is AMD actually a stock to hold for 10-20 years?",
        "score": 109,
        "url": "https://www.reddit.com/r/investing/comments/1dfj862/is_amd_actually_a_stock_to_hold_for_1020_years/",
        "content": "I have a broad portfolio and have been holding AMD since around $14.\n\nI now need to liquidate a considerable part of my portfolio for financial reasons. Only a part of the portfolio will remain. The question is whether AMD should be one of the select 4-5 stocks to hold for the long term, say 10-20 years - next to VUAA which will remain the major chunk of my portfolio.\n\nWhat are your thoughts on this - is AMD really a hold for the long term? Or should I take my gains and begone with it?\n\nJust for info: my other \"Hold\" stocks are MSFT, AAPL, MCD and maybe 1-2 others.\n\nEDIT: wow, thanks for all the answers so far, there were some amazing replies, truly appreciate it! Also makes me very uplifted and optimistic that not everyone is as obstructive as some ... But I guess every group has to have a few of those right?\n\nEDIT 2: after some further research and, yes, your inputs (thanks everyone!) I have decided to sell. Not putting this here to give everyone closure hahah... but to make it easier to check whether I made the right decision. Date of sale: June 17, 2024.",
        "created_utc": 1718342147.0,
        "subreddit_name": "investing",
        "comments": 168
    },
    {
        "title": "Cheating husband sues Apple after wife discovered ‘deleted’ messages sent to sex workers",
        "score": 21168,
        "url": "https://www.telegraph.co.uk/news/2024/06/13/cheating-husband-sues-apple-sex-messages/",
        "content": "",
        "created_utc": 1718378192.0,
        "subreddit_name": "technology",
        "comments": 1968
    },
    {
        "title": "EU Reportedly Planning to Charge Apple for Violating Digital Markets Act",
        "score": 789,
        "url": "https://www.macrumors.com/2024/06/14/eu-plans-to-fine-apple-over-dma-report/",
        "content": "",
        "created_utc": 1718382813.0,
        "subreddit_name": "apple",
        "comments": 493
    },
    {
        "title": "iOS 18 Adds These 5 New Features to CarPlay",
        "score": 721,
        "url": "https://www.macrumors.com/2024/06/13/ios-18-carplay-features/",
        "content": "",
        "created_utc": 1718337418.0,
        "subreddit_name": "apple",
        "comments": 167
    },
    {
        "title": "First 3 months of day trading - RESULTS",
        "score": 167,
        "url": "https://www.reddit.com/r/Daytrading/comments/1dfu6w2/first_3_months_of_day_trading_results/",
        "content": "Wanna start off by saying thanks to this community!\n\nI just finished my first 3 months (March 13 - June 13) of trading and I wanted to share my experience and PnL with you guys.\n\n**My Strategy**\n\nMostly scalp 0TDE SPY options for $.02 - $.10 on the premium, with a couple meme stocks thrown in as experimentation. I played around with what contracts to buy but ultimately settled on the 1st OTM contract that is around $.75 - $1.00. This is because I feel it has the best combo of Greeks for scalping after studying other people's findings with a similar strategy. I did not set S/L as instead I preferred to DCA a trade to try and get it green. If I DCA a trade it was manually when I felt it was right and if I exited at a loss it was also manually. This is just something I learned from BOT trading crypto a few years ago as my best PnL was DCA instead of S/L\n\n**My Results and Interesting Stats**\n\nPnL: **+138.5% | +$8,993.79**\n\nTotal Wins: **48**\n\nTotal Losses: **2**\n\nWin Percentage: **96%**\n\nTotal times DCA: **5 (4 wins, 1 loss)**\n\nTotal days I made trades: **28**\n\nAverage portfolio return per trade day: **4.95%**\n\nFavorite Win: **The 1 PUT I bought against AAPL because everyone said it would still go up but I knew better**\n\nFavorite Loss: **All of them because I learned something more valuable than the money I lost**\n\nBroker: **Robinhood**\n\n[https:\\/\\/app.stonkjournal.com\\/](https://preview.redd.it/y0296oryol6d1.png?width=2300&format=png&auto=webp&s=722667b04f88dd147f9b3b5d2df84c5e288ddad0)\n\n[https:\\/\\/app.stonkjournal.com\\/](https://preview.redd.it/d5dgezumuj6d1.png?width=2349&format=png&auto=webp&s=6057cfc76213b4ec181d168f7ab8968993c521bd)\n\n**What's next?**\n\nProbably just keep doing this as it seems to be working. Consider moving to another broker so I can do SPX instead. I also transferred 25% of my gains into a HYSA for taxes - I will be doing this every 3 months (assuming I stay profitable).",
        "created_utc": 1718380537.0,
        "subreddit_name": "DayTrading",
        "comments": 168
    },
    {
        "title": "Difference between r/AAPL and r/applestocks",
        "score": 2,
        "url": "https://www.reddit.com/r/AAPL/comments/1dfi8yb/difference_between_raapl_and_rapplestocks/",
        "content": "Is there an difference in the types of post that are appropriate for one or the other?\n\nOr are these just two subs about the same topic, but with different mods?\n\n(One obvious difference: 5K members here, but only 2K over at r/applestocks",
        "created_utc": 1718338568.0,
        "subreddit_name": "AAPL",
        "comments": 2
    }
]