[
    {
        "title": "Nvidia’s massive stock buyback",
        "score": 188,
        "url": "https://www.reddit.com/r/investing/comments/1f5dp17/nvidias_massive_stock_buyback/",
        "content": "From MarketWatch. \n\nhttps://www.marketwatch.com/story/nvidias-stock-buyback-plan-is-one-of-the-biggest-of-2024-is-that-a-good-thing-9beba5c5?mod=djem_mwnafterbell\n\n> The semiconductor company announced alongside its earnings on Wednesday that it has boosted its stock buyback authorization by $50 billion. That’s double the size of the $25 billion share-repurchase program announced a year ago\n\n> Looking beyond the year, Nvidia’s announcement is tied for the 12th-largest [stock buyback] on record. The company is one of only seven in the U.S. to have announced a buyback program of $50 billion or more. The buyback authorization is 1.7% the size of Nvidia’s market capitalization, which is about $2.91 trillion.\n\nI tend to like stock buybacks. I like them more than dividends. The company has enough faith in itself that it wants to secure more of its own profits.  If you’re spiraling down in the dumpster, there’s really no need to buy back— especially if you believe this is the High Point and it’s only going down from here.\n\nNvidia has a number of problems. One is that it has a gigantic amount of cash. It was estimated that within three years it might be able to turn out 270 billion in free cash flow\n\nBut as the big player in the market, both its own specific market and the broader market, it’s gonna have a real tough time making big deals. Meaning deals significant enough to affect the bottom line.\n\nIt’s in the old-school Microsoft phase where everything it does is gonna be examined for antitrust. Can you imagine if they tried to buy AMD or something like that? It’s never gonna happen even if it made sense and didn’t destroy competition. \n\nSo they’ve got infinite money and kind of very finite things to do with it. their purchases of other companies has been around 300 *million* this year. Which is entirely insignificant.\n\nHowever, I worry that the stock is insanely expensive. It’s noted that this gives them the option to pull the trigger whenever they want. So if there is a downturn, that’s good news for them because they’ll be able to spend triple digit billions buying themselves back.\n\nSo in one sense, you can look at this as potentially bad news. Meaning they expect enough volatility, including down swings, to make it possible and profitable to have the 12th largest buyback in history.  \n\nOR they feel they aren’t gonna drop and this is just a low point of a forever-climbing stock price.\n\nEither way it’s good for Nvidia, but it makes it tough for investors to predict. If this was anyone else, I think it would be a little bit easier, but there’s so much money and the scale is so vast that it’s hard to wrap my head around. \n\nIf they had been able to buy the dip a month or so ago, it’s astounding how much money they would’ve made. Not to mention securing more of their future profits.\n\nObviously, companies of this size don’t move that fast and they aren’t playing a shell game. So it’s merely just a thought experiment to see how much money they would’ve created out of a blip.\n\nLots of companies do buybacks, and lots of high-tech companies do buybacks. And the timing of it can generally illuminate a lot of things. But in this instance, I’m having a tough time seeing through it. \n\nIn the past, they haven’t been a really savvy financial company. They’re not doing all kinds of tricks and schemes and mergers and things to burn short sellers and whatever. They’ve just been “boring” R&D and managed to get ahead of at least three or four massive shifts in technology in the world economy. \n\nThe stock split. I had kind of considered it surprising. It just didn’t fit who they’ve been up to this point. Why does it matter if they’re 3000 or 100? I suppose it’s nice that more of the unwashed can get in on the purchase. But it seems to be a small distinction. Like how many people could afford a few hundred bucks but not a few thousand bucks? AND are buy and hold stock investors. I said at the time it wasn’t gonna move the needle whatsoever. But beyond that, I just don’t really see the point.\n\nAs I’ve said, there’s a lot of reasons to do a stock buyback. But this magnitude and at this price have left me guessing.\n\nI like to think it’s optimism of their future. And that two years from now the stock is going to be much higher. In which case it made perfect sense to buy now.\n\nThat’s my hope anyways. \n\nEdit: sorry for typos my phone won’t let me scroll back for some reason",
        "created_utc": 1725073931.0,
        "subreddit_name": "investing",
        "comments": 124
    }
]