[
    {
        "title": "Next-gen Apple Silicon 'M2' chip reportedly enters production, included in MacBooks in second half of year - 9to5Mac",
        "score": 7405,
        "url": "https://9to5mac.com/2021/04/27/next-gen-apple-silicon-m2-chip-reportedly-enters-production-included-in-macbooks-in-second-half-of-year/",
        "content": "",
        "created_utc": 1619513740.0,
        "subreddit_name": "apple",
        "comments": 1162
    },
    {
        "title": "Is AAPL going to pop or drop after earnings?",
        "score": 8,
        "url": "https://www.reddit.com/r/AAPL/comments/mzwsid/is_aapl_going_to_pop_or_drop_after_earnings/",
        "content": "\n\n[View Poll](https://www.reddit.com/poll/mzwsid)",
        "created_utc": 1619552585.0,
        "subreddit_name": "AAPL",
        "comments": 30
    },
    {
        "title": "APPLE and LUCID MOTORS HUGE RUMOR! Potential PARTNERSHIP TALKS? What you need to know.",
        "score": 0,
        "url": "https://youtu.be/F6RGfG7Na1E",
        "content": "",
        "created_utc": 1619496545.0,
        "subreddit_name": "AAPL",
        "comments": 1
    },
    {
        "title": "I analyzed 66,000+ buy and sell recommendations made by financial analysts over the last 10 years. Here are the results.",
        "score": 4651,
        "url": "https://www.reddit.com/r/stocks/comments/mznup5/i_analyzed_66000_buy_and_sell_recommendations/",
        "content": "**Preamble:** I suppose all of us have come across an analyst report while doing DD on a stock. Most of the reports that are freely available to the average investor are either dated or limited in access (we only have the buy/sell ratings and not the deep dive on the stock). According to [this](https://www.bloomberg.com/professional/blog/put-price-investment-research-2/) Bloomberg report, Goldman Sachs charges $30K for access to its basic research, JP Morgan $10K per report, and Barclays charging up to $455K for its equity research package.\n\nWhat I wanted to know was if you actually pay for the reports and then follow their recommendations, would you be able to beat the market in the long run? Surprisingly, there were no trackers following the performance of analyst picks over the long term and I decided to build one.\n\n**Where is the data from:** Yahoo Finance. I used yfinance API to pull all the analyst recommendations made from 2011 for S&P500 companies. While this is in no way a complete list of recommendations, I felt that the data I had was deep enough for the analysis. Both Bloomberg and Quandl provide richer data but costs more than $20K for their subscription and also won’t allow you to share the recommendations with the public. (I have shared all the recommendations and my analysis in an Excel Sheet at the end)\n\n**Analysis:** There were a total of 66,516 recommendations made by analysts over the last 10 years for S&P500 companies. Following is the split of recommendations. \n\n|Rating |\\# of records |% of total |\n|:-|:-|:-|\n|Buy|35,158|52.9%|\n|Hold|27,033|40.6%|\n|Sell|4,041|6.1%|\n|Others (Cautious, Speculative etc.)|284|0.4%|\n\n For the three sets, I calculated the stock price change across four periods.\n\na. One week after recommendation\n\nb. One month after recommendation\n\nc. One quarter after recommendation\n\nI benchmarked the change against S&P500 and also checked what percentage of recommendations increased in value compared to the benchmark. I limited my time horizon to one quarter since analysts usually create reports every quarter and I did not want to overlap different recommendations. Finally, I also checked which banks made the best recommendations over the last decade.\n\n**Results:**\n\n**Performance of Buy Recommendations** \n\n|Avg Change in Price|Stock|SPY|Change over SPY|\n|:-|:-|:-|:-|\n|One Week|0.5%|0.3%|\\+40.7%|\n|One Month|1.7%|1.4%|\\+23.2%|\n|One Quarter|4.9%|4.0%|\\+22.8%|\n\n Out of the 35K buy recommendations made by the analysts, the average increase in stock price across the time periods were better than the SPY benchmark with one week returns bettering SPY by more than 40%. Adding to this, I also benchmarked the percentage of times analyst made the call and the stock price went up vs the SP500 index. \n\n**Performance of Sell Recommendations:**\n\n|Avg Change in Price|Stock|SPY|Change over SPY|\n|:-|:-|:-|:-|\n|One Week|0.3%|0.3%|\\-7.3%|\n|One Month|1.8%|1.5%|\\+17.1%|\n|One Quarter|5.4%|4.0%|\\+36.0%|\n\nSell recommendations given by analysts definitely have a short-term impact on the stock price. As we can see from the chart, the one-week performance of stocks that were recommended as a sell was lower than that of the benchmark. But this trend does not hold over the long term with stocks having sell recommendations significantly outperforming the market over the time period of more than one month. Another thing to note here is that on average even after the sell recommendation, the stock price did not fall. (ie, the returns were not negative) \n\n **Which investment banks made the best recommendations?:** \n\nyou can find the chart [here](https://www.reddit.com/r/dataisbeautiful/comments/mznidl/oc_i_analyzed_66000_buy_and_sell_recommendations/)  \n\nI analyzed the returns of the recommendations made by different banks. The most number of recommendations were made by Morgan Stanley with them making more than 2300 recommendations in the last 10 years. From the above chart, you can see that overall, the best returns were made by Barclays with their recommendations beating SP500 by more than 125% in one-week gains and more than 30% in quarterly gains.\n\n**How much money should you be managing to profitably buy analyst reports?**\n\nI did a rough calculation on the amount of assets you need to be managing to make sense for actually paying for the reports. From the above analysis, we could see that the analyst reports beat the market by 23%, and on average full access to analyst reports of a bank will set you back by $500K per year. Putting in the above numbers, you need to have a whopping $19MM of assets under management just to break even. Going on a conservative side, to comfortably make profits and not to have the analyst report fee considerably impact your returns, you should be managing at least $100MM.\n\n**Limitations of analysis:**\n\nThe above analysis is far from perfect and has multiple limitations. First, this is not the full list of recommendations made by these companies and are just the ones that were updated on Yahoo Finance. I also could not get any information on price targets made by the analysts to supplement my analysis. Finally, even though this analysis covers the last 10 years, it had been predominantly a bull run and this can bias the results in favor of the banks. This aspect could also be seen by observing how poorly the sell recommendations made by the banks faired.\n\n**Conclusion:**\n\nI started the analysis skeptical of the returns generated by recommendations made by analysts. There has been a lot of rumors and speculations about whether analysts have access to information the public doesn’t. Whatever the case may be, the above analysis shows that if you have access to the analyst reports, you definitely can beat the market over the long run. Whether it's financially viable or not to access the reports depends on the amount of asset you have under management, in this case at least $100MM!\n\nExcel Sheet link containing all the recommendations and more detailed analysis: [here](https://drive.google.com/file/d/19Hd6xU4B4p0PmlpV3JULmChU1JQTVkOR/view?usp=sharing)\n\n*Disclaimer: I am not a financial advisor and in no way related to any investment banks showcased above.*",
        "created_utc": 1619528230.0,
        "subreddit_name": "stocks",
        "comments": 221
    },
    {
        "title": "Alphabet reports big earnings beat as revenue grows 34%",
        "score": 1743,
        "url": "https://www.reddit.com/r/stocks/comments/mzxfuj/alphabet_reports_big_earnings_beat_as_revenue/",
        "content": "https://www.cnbc.com/2021/04/27/alphabet-goog-earnings-q1-2021.html\n\nEarnings: $26.29 per share vs. $15.82 per share expected\n\nRevenue: $55.31 billion vs. $51.70 billion expected\n\nGoogle Cloud revenue: $4.05 billion $4.07 billion, according to FactSet estimates.\n\nYouTube ads: $6.01 billion vs. $5.70 billion, according to StreetAccount.\n\nTraffic Acquisition Costs (TAC): $9.71 billion  vs. $9.25 billion, according to FactSet estimates.\n\nThis is a good quarter for google. It is really the best reopening play. The stock performance ytd has been outperforming the entire Faang group.\n\nThanks for the awards.",
        "created_utc": 1619554333.0,
        "subreddit_name": "stocks",
        "comments": 309
    }
]