[
    {
        "title": "The iPhone 14 keeps calling 911 on rollercoasters",
        "score": 46728,
        "url": "https://www.theverge.com/2022/10/9/23395222/iphone-14-calling-911-rollercoasters-apple-crash-detection",
        "content": "",
        "created_utc": 1665335064.0,
        "subreddit_name": "technology",
        "comments": 2754
    },
    {
        "title": "How to Recover from a Blow Up Day - Every Failure is a Step to Success (Long Read)",
        "score": 386,
        "url": "https://www.reddit.com/r/Daytrading/comments/xzu0ji/how_to_recover_from_a_blow_up_day_every_failure/",
        "content": "This is going to be a lengthy post; estimated read time is **about 12 minutes**. I have a lot on my mind and can already sense that I'm about to go off. Just providing advance warning as a courtesy. Here goes...\n\n# The Dreaded Blow-Up Day\n\nA trading buddy of mine had a rough day last week. He **lost a month of hard-earned gains** on Friday. Four weeks of progress just vanished into thin air over an afternoon. His story was probably one of hundreds on any given trading day. Just another statistical casualty among 'us'—**The Retail Rabble**.\n\n*Why do you seem so cranky, Cranky?* Because this trader is somebody I've known for years and is extremely talented. When it comes to price action reading ability, he is much more skilled than I am. Intuition and execution is highly on-point. **His day is usually over before I've taken my first trade.**\n\nSo how could this happen then? Well, he has a very hard time stopping on red days. There's just some incessant urge to finish the day with green pixels on the monitor. That means how ever many trades it takes; how ever long in front of the screens. And his scalping skills are usually good enough to save him (whenever called upon). But not Friday afternoon. Not that $AAPL/$TSLA price action. He got **chopped to shit** in the sideways range. Desperation kicked in as he was faced with going into the weekend on a red note.\n\n# When Ego Overshadows Reason\n\nYou see: it's the degenerate gambling that he's never been able to overcome. I've been begging him for months to enable some sort of **daily max loss through his platform**. He refused. He took it offensively as an insult. Especially after putting together an amazing green stretch the past quarter.\n\n*'Look, Cranky, I'm way past that. Not a noob anymore. I don't need any nannies to protect me. They're too restrictive. I'm disciplined enough to know when to stop.'*\n\nRegardless of how experienced you are as a trader, there needs to be some sort of kill switch to prevent disaster. Even if the chances of it happening are next to zero, the damage a blow-up day can cause is very difficult to repair. **That means protecting your financial capital and emotional capital at all costs.** As traders, we will be put out business without both intact.\n\nI didn't have the heart to say '*I told you so'* but this day was coming and easily predictable. I know his trading character better than he does. From an external perspective, it is much easier to analyze and be critical of others' faults. He definitely knows my weaknesses, as well. That's just human nature—**we love to observe and judge others.** Just look at the toxicity on many trading subreddits!\n\nRather than berating him about his lapse in discipline, I tried to console him. I told him that many traders have gone through these trials and tribulations during their career. Leaving their trading account in tatters or outright blown to pieces after a bad day. **Never let it go to waste; chalk it up as a lesson learned.**\n\nIt's how we recover and pick ourselves back up that defines our character in this game. I told him, '*You're as resilient as they come. I know you can continue to persevere! Take it on the chin and move forward. You grew your account before, and you can do it again.'* His response was that I could never understand how he is feeling because I was 'so disciplined' and not a 'fuck-up' like him. **Oh boy, here we go...**\n\n# Trip Down Memory Lane\n\nI replied, *'Yeah, you sure of that? I've paid my dues. Market tuition or whatever you want to call it. I'm speaking from experience here, man. BRB, let me dust off an old USB drive.'*\n\n**Cranky sent a picture:**\n\n[u\\/Cranky\\_Crypto wiping out 3 months of gains in a single day; circa 2018 CE](https://preview.redd.it/9ca6v62xvts91.png?width=462&format=png&auto=webp&s=4c1a1a6ecad73cecd0408bc2b5644412b19b1282)\n\n*You don't think I felt like a failure? Demotivated. Depressed. In a dark place and having even darker thoughts?* The **guilty lump in my throat** was so massive that I struggled to eat or drink for days. Many of you reading this know the feeling I'm referring to. We've all been there before, my trading brothers and sisters.\n\n# Used to Revenge Trade with the Best of Degenerates\n\nThe above P&L curve was around **Year 2** of my trading journey. I was starting to get the hang of things. Becoming better at doing what works, while removing bad habits that I developed early on (it is harder to learn **how not to trade**, than it is to learn how to trade).\n\nI slowly scaled up my risk from $100, $150, $200, to $250. Then that one fateful day, **I relapsed and lost 30 R's in a single session.** 3 months of progress just gone. A full quarter of gains—poof!\n\n[Feb 21, 2018 - $2.5M worth of shares traded for a loss of $7.5K](https://preview.redd.it/t2mu78zxvts91.png?width=360&format=png&auto=webp&s=133e2200bf5ed78fc9c4b3a0134898cba4596727)\n\nThe trade log above is the definition of having an out of body experience. I must have taken over 50 trades based on the row count. **My trading system and rules were completely tossed out the window.** I tried digging myself out of a hole by continuing to dig deeper! When the Closing bell rang, I stared blankly at the screen for a good 5 minutes before getting up. I recall wanting to vomit after coming to my senses. **Why the hell did I just do that to myself...**\n\nI told my buddy that there are many **lessons in trading that we must learn for ourselves**. It's completely **up to you how much each one costs.** For me, the fee was $7500. I was that child who was told not to touch the hot stove. It wasn't until I **experienced the burn firsthand** that I realized what everybody was warning about. Now I know better. *And now you do, too.*\n\n# Know Your Triggers\n\nMy Achilles Heel was counter-trend trading. Thinking that I could time tops and bottoms and outsmart everyone else. Sometimes that meant **averaging down or bagholding**, or just being wrong 8 times in a row. Well, it didn't take very long for me to lose a lot of money and learn not to trade that way. Once I became friends with the trend, my trading did a complete 180.\n\nFor some reason, though, I would **subconsciously revert to those old ways** on days that I struggled. It was like opening Pandora's Box. Getting myself sucked into chop, zooming into the 1-minute chart and 'seeing', patterns that weren't there. Other times making an execution error would **make me lose my shit.** I'd just start being careless and a **DGAF** switch would flip on. **Bad trading always followed.**\n\nI had to learn to channel my persistent tendencies into something other than taking more trades. You can't prove anything to a damn chart. **Knowing when to stop for the day doesn't make you a quitter.** At some point I realized that revenge trading wasn't the answer. Each trade was a single tree. I had to zoom out and **view the forest.** I will prove myself over a period of weeks, not minutes. Admitting defeat is not quitting; **I'll live to trade another day.**\n\n# Absolute Power Corrupts Absolutely\n\nMost traders start out **undisciplined as a default state.** That is unless they have proper training (or a military background). Why is that—shouldn't traders begin their career as a blank slate? Well, think about the shift in environmental dynamics. **We live our whole lives with boundaries in place.** Rules. Laws. Social norms. The moment you step foot into the market, all of those barriers are removed. You can trade whatever you want, in whatever size you want, and in either direction. The possibilities are limitless. There is absolute freedom and absolute power. **For many, that means absolute corruption.**\n\nSimply put, many novice traders lack self-control. They are prone to impulse, FOMO, greed, and general compulsive behavior. That's what leads to irrational and often self-sabotaging actions in front of the screens—pure self-destruction in some cases. This is why many trading coaches recommend focusing on your mindset to counter our primitive urges. Mindfulness. Meditation. Exercise. Breathing. Routines. Hand-waving. Trading is really an internal struggle once you've found a working strategy. I repeat: **You won't overcome psychological issues without having a proven edge.**\n\nWhat if you can't overcome bad habits with sheer willpower? Ask yourself why you pursued trading in the first place. The money? The freedom? **Find something to leverage as motivation.** Do it for your loved ones. Research has shown that people are better at filling and properly administering prescription medication to their pets than to themselves. That's because **we tend to care about others more than ourselves.**\n\nIf you have family, try not to do things that would let them down. Don't trade in a way that makes it difficult to look in the mirror at the end of the day. If you're feeling ashamed, imagine what your peers would think if they found out. For many retail traders, **day trading is a dirty little secret.** Find an accountability partner if you have to.\n\n# Get Off My Lawn\n\nEvery time somebody posts about a disastrous day on this subreddit, it brings back memories of my journey. The early struggles. The countless painful lessons. The fact is, **I probably empathize too much with random internet strangers.** I'm not sure why that is. Perhaps it's because I'm new to social media? Shared experiences and goals? Maybe it's because I despise what the retail trading space has become.\n\nTimes have definitely changed. I come from a place that was about helping your fellow trader. **Before all the memes and Discords existed. Before the YouTubers and Gurus exploded onto the scene with their rented Lambos.** Everything is reduced to a pissing contest now. Who made more money in less time. Pure showboating.\n\nMy mentors taught me that there is an unspoken code among traders where money was rarely talked about. It was either '*I had a good day, an OK day, or a bad day.*' But money talks. And there are thousands of chatrooms who view each and every retail trader as a walking $99/month revenue source. **The more they are struggling, the harder they can be milked.** It's very sad so I'm going to stop talking about it.\n\n# Not a Hopium Dealer\n\nThis post is not meant to encourage folks who aren't cut out for trading. To put it bluntly: many people I see posting on this subreddit **have no business trading at all.** At some point you have to be honest with yourself. Do you have realistic expectations? Are your deficiencies correctable? Can you mitigate your weaknesses? Can you compensate by changing the way you trade? Do you realize your mistakes? Are you making progress, regressing, or stuck in a vicious cycle? **Are you trading because it's more convenient and more accessible than driving to the casino?** Is Risk Management a buzzword to you?\n\nI don't say these things to be mean. But too often I see people pitching the idea that *'anyone can become a consistently profitable trader in 2-3 years.'* **That's a lie.** I've met traders who've been failing for over a decade. Success from their primary profession allows them to keep funding their addiction. I've personally begged people I care about to put down day trading. To stop tormenting themselves after years of torture and agony. **I've witnessed these little candlesticks and hotkeys ruin people's lives.**\n\nDon't get me wrong—finding success in trading is definitely possible. It's an acquired skill like any other in life. But just like competitive sports, don't expect to watch some highlights and step onto the field. **You'll get your ass handed to you by the pros.** And for some people, trading is just not meant to be. **There's no shame in failing if you gave it your best shot.**\n\nI shared the following analogy with another trader recently regarding setbacks.\n\n>The journey starts off as **1 step forward and 2 steps back**. Eventually you take **1 step forward and only 1 step back**. Then you advance to **2 steps forwards and 1 step back**, until finally you're casually walking along and pausing to rest or run when you choose.\n\n# Back to My Trading Buddy\n\nAlmost forgot about him! I convinced him to **record a video recap of Friday's trades**, if only to let it out. You know—give the frustration a voice rather than bottling things inside. It helps to speak out loud and retrace your thoughts and feelings. **There's some healing component to doing a confessional.** I told him he is welcome to share it with me for accountability purposes.\n\nFirst thing Monday morning he will be requesting to put a daily max loss to prevent this from happening again. A safety net of sorts. After taking a short break to clear his mind, he'll be getting back in the saddle with **small size to rebuild his confidence.** This is the approach I recommended on a post from yesterday (which motivated me to write this novella).\n\nAs a final word of encouragement, I told him to **forget about the money for now.** The immediate goal is getting back in rhythm, rebuilding consistent habits, and then slowly sizing up. '*Eventually you will get to a point where you can recover that blow-up day in a single trade. It will take years of commitment and hard work. But your patience and dedication will be rewarded.'*\n\nHe replied, *Yeah right, Cranky. You're just saying that to make me feel better. It just seems impossible at the moment.* **Hold my USB drive...**\n\n**Cranky sent a picture:**\n\n[Exactly four years later, doubled my largest blow-up day in a single trade \\(Feb 2022\\)](https://preview.redd.it/s6whr87vvts91.png?width=1030&format=png&auto=webp&s=4ec87e693d071f6fca596dca27ef6160da3ed4e3)\n\n**Just forget about the money—that's not the point.** The key is surviving long enough and continuing to improve your craft. Once you reach a certain level of consistency, it's just a matter of scaling up. Execute the exact same way while adding 0's to the end of your Risk Unit. Eventually the account balance will reflect your growth as a trader. **Mistakes from your early career will barely register as a blip.** *Days like today may seem like a roadblock at the moment, but when you look back in the rearview mirror, they'll appear as tiny speed bumps.*\n\n# I Talk Too Much\n\nThat was an extremely long post. Not sure how many made it this far. If you have, then obviously I still have your attention. Please go through my post history because I've discussed many of the above points in great detail. **I must sound like a broken record at this point.** That's because trading is damn simple if we really break it down. **Find something that works and develop a process around it.** It's the human aspect, the degeneracy, and the ego that transform trading into a 10-headed monster, comprised of emotional and psychological nightmare-fuel.\n\n**P.S.** This is the only time I will ever show P&L or speak in dollar terms; doing so makes this story more tangible. I always prefer to talk shop in Risk Units (R's). It doesn't matter if you're trading 1 share or 10,000 lots. Everyone has a different account size with unique financial objectives. One trader lives off 50R a month, while another does 5R as a side-hustle. It's all personal and relative; size doesn't matter (despite what society wants you to believe).\n\nHave a great trading week, everybody :)",
        "created_utc": 1665343683.0,
        "subreddit_name": "Daytrading",
        "comments": 86
    }
]