[
    {
        "title": "Anyone getting AMZN at these levels?",
        "score": 152,
        "url": "https://www.reddit.com/r/stocks/comments/1g6ig7e/anyone_getting_amzn_at_these_levels/",
        "content": "Hey all, just curious if anyone is buying Amazon (AMZN) right now? The stock’s been dipping a bit, and I’m wondering if this is a good entry point for the long term or if there’s more downside coming. Thoughts on where it’s headed or just holding off for now? Would love to hear what you guys think!",
        "created_utc": 1729259195.0,
        "subreddit_name": "stocks",
        "comments": 145
    },
    {
        "title": "NHTSA opens probe into 2.4 mln Tesla vehicles over Full Self-Driving collisions",
        "score": 64,
        "url": "https://www.reddit.com/r/stocks/comments/1g6ek2a/nhtsa_opens_probe_into_24_mln_tesla_vehicles_over/",
        "content": "So FSD (unsupervised) will be launched by 2025Q1?????\n\n&#x200B;\n\n**NHTSA opens probe into 2.4 mln Tesla vehicles over Full Self-Driving collisions**\n\n\r[https://www.reuters.com/business/autos-transportation/nhtsa-opens-probe-into-24-mln-tesla-vehicles-over-full-self-driving-collisions-2024-10-18](https://www.reuters.com/business/autos-transportation/nhtsa-opens-probe-into-24-mln-tesla-vehicles-over-full-self-driving-collisions-2024-10-18)\n\n&#x200B;\n\n*The National Highway Traffic Safety Administration said on Friday it has opened an investigation into 2.4 million Tesla vehicles after one of them with Full Self-Driving (FSD) technology fatally struck a pedestrian.*\r  \n*The U.S. auto safety regulator's Office of Defects Investigation (ODI) has identified four reports in which a Tesla vehicle experienced a crash after entering an area of reduced roadway visibility conditions with FSD engaged.*\r  \n*The preliminary evaluation will assess FSD's ability to detect and respond appropriately to reduced visibility conditions, among other issues, ODI said.*",
        "created_utc": 1729246083.0,
        "subreddit_name": "stocks",
        "comments": 24
    },
    {
        "title": "Intel seeks billions for minority stake in Altera business, sources say",
        "score": 67,
        "url": "https://www.reddit.com/r/stocks/comments/1g66y0u/intel_seeks_billions_for_minority_stake_in_altera/",
        "content": "Intel is looking to sell at least a minority stake in its Altera subsidiary that would raise several billion dollars in cash for the struggling firm, according to people familiar with the matter. This move that would represent a sharp about face from its earlier public messaging about the larger company’s prospects.\n\nThe storied semiconductor firm has made overtures to a number of private equity and strategic investors this week, said the people, who requested anonymity to speak freely about confidential information. Intel has expressed to some of those investors that it would be possible to acquire a majority stake in the Altera business, which was valued at $16.7 billion when Intel acquired it in 2015, said one of the people.\n\nIntel is looking for a deal that values Altera at around $17 billion, said the people.\n\nA representative for Intel did not immediately respond to a CNBC request for comment. The sale process represents an abrupt about-face from Intel’s prior commentary on Altera, where as recently September its CEO said that Intel’s leadership considered the business to be a core part of Intel’s future.\n\nIntel has previously said that it could look to monetize its Altera business via an initial public offering, possibly as soon as 2026. But the idea of taking strategic or private equity investment would be a marked acceleration of those plans.\n\nCEO Pat Gelsinger and his leadership team have previously said that Intel understands its disadvantaged position and is working aggressively to remedy it. To be sure, the sale of a minority stake in Altera would allow Intel to more easily pursue its semiconductor fabrication ambitions and assuage investors that it has a strong path forward as an independent company.\n\nBut the sale process also comes as Qualcomm has expressed interest in acquiring its onetime rival, a deal which would face fierce regulatory scrutiny and reshape semiconductor industry. Intel has to grapple with a significant debt load, and has seen its stock plunge more than 50% year-to-date.\n\nSource: https://www.cnbc.com/2024/10/18/intel-seeks-billions-for-minority-stake-in-altera-business-sources-say.html",
        "created_utc": 1729215409.0,
        "subreddit_name": "stocks",
        "comments": 10
    },
    {
        "title": "Nebius set to resume Nasdaq trading after completing split from Russia’s Yandex",
        "score": 25,
        "url": "https://www.reddit.com/r/stocks/comments/1g6hrm7/nebius_set_to_resume_nasdaq_trading_after/",
        "content": "Oct 17 (Reuters) - AI infrastructure firm Nebius Group (NBIS.O), opens new tab said on Thursday its shares will resume Nasdaq trading on Monday after being halted following Russia's February 2022 invasion of Ukraine.\nAt that time, the stock traded under the ticker of Russian internet giant Yandex through its Amsterdam-based parent company.\nIn July, a Russian consortium finalized a $5.4 billion deal to acquire the Russia-based assets of Yandex, a move that marked the largest corporate exit since the invasion.\n\n\"We are pleased to have our shares trading again on Nasdaq, which opens a new chapter for our company as a publicly traded pure play in the fast-growing AI infrastructure space,\" Nebius CEO Arkady Volozh said.\nOther Russian companies were suspended and ultimately delisted from Nasdaq, but Nebius maintained a suspended listing during months of negotiations to secure an exit from Russia, provided it could decouple from Yandex.\n\nMany of the same Western shareholders have stakes in Nebius, but the company has undergone a significant transformation.\nOnce valued at over $30 billion as Russia's equivalent of Google, Nebius is now a fledgling European tech company focused on AI infrastructure, cloud services, and self-driving technology.\nAI-FOCUSED\n\nWith its Russian ties severed, Nebius is strategically positioning itself to capitalize on the burgeoning AI market, founder and CEO Arkady Volozh told Reuters in July. Nebius plans to invest more than $1 billion by mid-2025.b\n\n\"Our ambition is to build one of the world's largest specialist AI infrastructure businesses. This requires access to technological expertise, graphics processing units (\"GPUs\") and capital. These are exactly what we have\", Volozh said.\nNebius had annualized run-rate revenue of $120 million as of September 30, 2024, and it expects to be on track for $170 million to $190 million in annualized run-rate revenue by year end 2024, the statement said.\n\nNebius Group N.V. (“Nebius Group” or the “Company”; NASDAQ: NBIS) today announces that it has been informed by The Nasdaq Stock Market LLC (“Nasdaq”) that trading in the Company's Class A ordinary shares is scheduled to resume on Monday October 21, 2024.",
        "created_utc": 1729257249.0,
        "subreddit_name": "stocks",
        "comments": 5
    },
    {
        "title": "Games Workshop - Hold or Sell?",
        "score": 16,
        "url": "https://www.reddit.com/r/stocks/comments/1g6lt1l/games_workshop_hold_or_sell/",
        "content": "In late August I bought €450 of Games Workshop stock.  \nFor those who don't know, Games Workshop (GW) is a hobby shop based in the UK but with stores across a range of countries in Europe, NA, the Commonwealth and China. The shop is most famous as the designers and producers of the Warhammer franchise.\n\nTypically when I invest I just put money in funds because I don't think I can generally do a better job than professional traders. In this case, I came to the conclusion that the stock was undervalued for two reasons. (1) The stores had returned very healthy growth in the 2023/2024 financial year, including a healthy uptake in footfall (2) the market had underappreciated the impact of the Space Marine 2 game, set to come out in September, on future GW revenue. I'd seen some gameplay footage back in maybe July and was quite confident it was going to be a hit.\n\nMy plan was to buy the stock, hold until the half-year report in January and sell if I'm in profit.\n\nWell it looks like I was right...   \nGW have capitalized on the success of Space Marine 2 by selling a tie-in starter set.   \nThese have been selling like hot cakes according to folks I know who work in stores.  \nWeb chatter seems to agree that footfall is up.  \nThe markets seem to agree and the stock price has risen about 12% in a month.\n\nAll sounds good, right?   \nI should stick to my original plan, hold till the January report and then sell when good sales figures buoy the stock price.\n\nThe big question mark, however, is an ongoing deal (or lack thereof) with Amazon to produce a small-screen Warhammer 40K series with Henry Cavill as the creative director. Cavill, for reference, is a long-time fan of the IP and is widely expected to do a good job, if a deal were to come through. However, the project has been under a degree of uncertainty following the general contraction of the streaming industry and GW have put a limit of the end of the year to come to a deal, or they're pulling the plug.\n\nObviously, if the TV show is announced, it could drive the stock price nice and high.  \nBut if the deal falls through, I'm concerned that this could set the stock back and offset the gains I've made.\n\nSo what do you all think?  \n(1) Sell now. Bank a nice little return.  \n(2) Hold till the January report and hope that there's good news on the Amazon deal, and/or a good half-year report.\n\n",
        "created_utc": 1729267614.0,
        "subreddit_name": "stocks",
        "comments": 24
    },
    {
        "title": "r/Stocks Daily Discussion & Fundamentals Friday Oct 18, 2024",
        "score": 9,
        "url": "https://www.reddit.com/r/stocks/comments/1g6e1gc/rstocks_daily_discussion_fundamentals_friday_oct/",
        "content": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.\n\nExpect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nBut growth stocks don't rely so much on EPS or revenue as long as they beat some other metric like subscriber count:  Going from 1 million to 10 million subscribers means more revenue in the future.\n\nValue stocks do rely on earnings reports, investors look for wall street expectations to be beaten on both EPS & revenue.  You'll also find value stocks pay dividends, but never invest in a company solely for its dividend.\n\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia page](https://www.investopedia.com/fundamental-analysis-4689757/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp) and read [their PDF on the topic.](http://i.investopedia.com/inv/pdf/tutorials/fundamentalanalysis_intro.pdf)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1729243811.0,
        "subreddit_name": "stocks",
        "comments": 188
    },
    {
        "title": "What are your thoughts on Tesla's upcoming earnings? ",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1g6pg7k/what_are_your_thoughts_on_teslas_upcoming_earnings/",
        "content": "Some of the news I've seen so far has been negative: the company missing production target, horrors of cybertruck, increasing competition outside states due to cheaper Chinese cars, the recent disappointing cybercab event, and now FSD being investigated for killing pedestrians. The only bullish thing I saw were the increasing sales in China. What are your thoughts for the upcoming earnings and why? ",
        "created_utc": 1729276919.0,
        "subreddit_name": "stocks",
        "comments": 67
    },
    {
        "title": "I Flipped My Entire Portfolio of ETFs for AI Stocks",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1g6k31k/i_flipped_my_entire_portfolio_of_etfs_for_ai/",
        "content": "Yesterday, I made a major shift in my stock portfolio. I used to rely on ETFs like SPY, QQQ, and SCHD, but now I’ve sold most of them and focused on NVDA, MSFT, GOOGL, ISRG, AAPL, SCHG, and a bit of SOXX.\n\n - NVDA $237K\n\n - SCHG $121K\n\n - MSFT $105K\n\n - GOOGL $78K\n\n - AAPL $74K\n\n - ISRG $64K\n\n - SOXX $61K\n\n - BRK-B $47K\n\nHere’s why: Right now, AI might feel limited to things like ChatGPT, but its potential goes far beyond that. Over the next 3, 5, or 10 years, AI is going to transform industries in ways we can’t fully imagine yet. We’re talking about healthcare revolutionizing how we diagnose and treat patients, transportation with autonomous vehicles and drones making logistics smarter and more efficient, and manufacturing, where AI will optimize production processes and supply chains.\n\nNow, I know what you're thinking: 'What, you think the world is full of cave dwellers? Who doesn't know that?' and you're right. Everyone knows AI techonology will be advanced and utilized in so many ways in the near future.\n\nBut look, you can think of it like real estate. Sure, property values rise while new highways or shopping centers are being built, but the real surge in value happens once people start using them and see the full benefits. Right now, AI is still in its “under construction” phase—people can imagine the future potential, but the true value hasn’t been fully realized yet. The market has priced in expectations, sure, but once AI is fully integrated across industries and we start seeing its widespread, real-world impact, I believe we’ll see another major surge in stock prices. What’s priced in now is just the beginning—the real growth will come as AI starts transforming daily life and business on a much larger scale.\n\nBefore ChatGPT went mainstream, people assumed ‘just’ that level of AI technology would arrive soon enough, but they didn’t think it would have this much of an impact on stock prices once it came to life for the public. Everyone knew advanced AI was on the horizon, but the market didn’t price it like they do now. This shows just how much underestimation happens until we truly start experiencing the technology firsthand. And that’s why, despite what’s already been priced in, I think AI stocks are still undervalued given the game-changing growth ahead. Anyone else rethinking their portfolio with AI at the center?",
        "created_utc": 1729263552.0,
        "subreddit_name": "stocks",
        "comments": 65
    },
    {
        "title": "More and more highly capitalized stocks are reaching their ATH or yearly highs every day or every week... Are you selling those positions? Are you waiting for the momentum to slow down before shorting? Will you buy the dip when these stocks drop by -10% or -20%...?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1g6plnj/more_and_more_highly_capitalized_stocks_are/",
        "content": "Real Estate: SPG, O, DLR, WELL, EQIX, SBAC. **Opportunity? CSGP.**\n\nConsumer Disc. : MCD, LOW, TJX, HD, BKNG. **Opportunities? NKE, TSLA, CMG.**\n\nMaterials: NEW, ECL, CTVA, APD, SCHW, LIN, IFF. **Opportunities? DOW, NUE**\n\nConsumer Staples: KO, WMT, COST, PM, PEP, PG, MO, GIS. **Opportunities: EL**\n\nUtilities: XEL, WEC, EXC, ED, SO, SRE, NEE, PEG, PCG, D, DUK, CEG, AEP. **This entire sector is in a BUBBLE territory. ANY opportunities... haha**\n\nIndustrial: DE, UNP, HON,LMT, RTX, ADP, ETN, GE, CAT, MMM, UBER.  **Opportunities: UPS, BA**\n\nEnergy: WMB, OKE. **Opportunities: VLE, OXY, MPC, DVN, CVX, COP, PSX, SLB. This entire sector is oversold and unvervalued in my opinion.**\n\nCommunication: NFLX, TMUS, VZ, META, EA, CMCSA, CHTR. **Opportunities: DIS, WBD**\n\nHeatlh: ABT, DHR, TMO, NVS, UNH, JNJ, AMGN, ABBV, LLY, BMY. **Opportunity: MRK**\n\nFinancial: MS, SPGI, HSBC, MA, JPM, BLK, WFC, GS, V, BRK-B, PGR, BAC, AXP. **Interesting bubble, like Utilites haha.**\n\nTechnology: AAPL, NVDA, CRM, MA, CSCO, ACN, V, ORCL, AVGO. O**pportunities: INTC, ADBE, QCOM.**\n\nDow Jones: WBA (no comment). Opportunities: DIS, INTC, DOW, BA, MRK, NKE.\n\n*This is not financial advice, just my perspective.*\n\n",
        "created_utc": 1729277314.0,
        "subreddit_name": "investing",
        "comments": 1
    },
    {
        "title": "Trump tariffs would increase laptop prices by $350+, other electronics by as much as 40%",
        "score": 40533,
        "url": "https://www.tomshardware.com/news/trump-tariffs-increase-laptop-electronics-prices",
        "content": "",
        "created_utc": 1729274996.0,
        "subreddit_name": "technology",
        "comments": 3096
    },
    {
        "title": "iPhone15 and some iPhone 16 battery drains fast after IOS18.0.1 Update",
        "score": 972,
        "url": "https://www.macrumors.com/2024/10/17/iphone-16-battery-drain-complaints/?fbclid=IwZXh0bgNhZW0CMTEAAR2-WpcqqZ4Ac548Ks-U9c6b30ZDYyKHITQuCEoos9dMPilk8SNrdw1sm3U_aem_o1u0OfNTz-lFwASeDwF0_g",
        "content": "",
        "created_utc": 1729218900.0,
        "subreddit_name": "apple",
        "comments": 373
    },
    {
        "title": "First iPad mini 7 benchmarks reveal upgraded RAM and more.",
        "score": 917,
        "url": "https://9to5mac.com/2024/10/18/first-ipad-mini-7-benchmarks/",
        "content": "",
        "created_utc": 1729255391.0,
        "subreddit_name": "apple",
        "comments": 145
    },
    {
        "title": "Apple Discontinues Powerbeats Pro, New Model Launching Next Year With These Features",
        "score": 721,
        "url": "https://www.macrumors.com/2024/10/18/apple-discontinues-powerbeats-pro/",
        "content": "",
        "created_utc": 1729272612.0,
        "subreddit_name": "apple",
        "comments": 90
    },
    {
        "title": "Swing Trading Vs. Day Trading: F*CK Your Stop Loss",
        "score": 425,
        "url": "https://www.reddit.com/r/Daytrading/comments/1g6senk/swing_trading_vs_day_trading_fck_your_stop_loss/",
        "content": "UPDATE: \n\nSwing trade vs Day Trading + Hold Overnight Since October 14th Open to October 30 close - NVDA:\n\nSwing % up unrealized 2.06%.                                                   \n\nDay Trade % up realized 20.21%\n\n\nLong time investor, swing trader, and day trader. I've been doing all three for a while and my girlfriend, who's a swing trader, used to tell me day trading was a Fool's Errand until she saw how profitable I am. One of the ways I illustrated this to her was to compete with her over a period of time as she swing traded stock and I day traded the same stock. As it turned out, day trading was an order of magnitude better at reaping profits than swing trading. The exercise prompted me to experiment with day trading in slightly different ways to figure out profitable, easy ways to day trade and make profits. \n\nHere's what I've learned about stocks over the years. \n\n1. Almost all stocks of healthy companies and, especially ETF's (which cycle out bad stock and cycle in good stocks periodically),  trend net upward over time. Sure they go up and down, but overall they go up. \n\n2. Almost all stock and ETF's make their real gains overnight. [https://www.ccn.com/the-stock-markets-biggest-gains-always-happen-at-the-same-time-each-day/](https://www.ccn.com/the-stock-markets-biggest-gains-always-happen-at-the-same-time-each-day/)\n\n3. Although most gains are made overnight, stock prices swing considerably, up and down, during the intraday. \n\n4. The markets intraday have repeating patterns. [https://tradethatswing.com/stock-market-intraday-repeating-patterns/](https://tradethatswing.com/stock-market-intraday-repeating-patterns/)\n\n5. The markets also have annual patterns. [https://tradethatswing.com/seasonal-patterns-of-the-stock-market/](https://tradethatswing.com/seasonal-patterns-of-the-stock-market/)\n\n6. Stock with Buy and Strong Buy analyst ratings that are below their price targets tend to trade upward toward that target much more often than not.\n\nKnowing all this, we can infer a trading strategy: \n\nFind a good stock with lots of upside, high volume, strong buy ratings from analysts, and average analyst price targets above the stocks current price and day trade it aggressively without a stop loss during up trending seasons and hold the stock overnight, every night (well, almost every night). Then, never hold it when a down trending season is approaching.\n\nTake NVDA for example, which has increased 227% over the past year. If you day traded and held NVDA overnight, you'd have made considerably more than 227%. If you consider seasonal downturns which occur mainly in February, June, and September and you day trade without holding the stock overnight and accept any intraday loss - but try to avoid them - you'd make even more $$.\n\nhttps://preview.redd.it/8zbntxysskvd1.jpg?width=1284&format=pjpg&auto=webp&s=1c16ae98b361ef74c7bc126c989a58a93c16a7cc\n\nAnyway, I decided to quantify and collect evidence starting this week and I will continue for this Q4 up trending season. All U.S. markets have their best gains in Q4 from roughly the end of October to the end of December. Often, though, the market continues to make gains until March with a dip in February. \n\nThis week NVDA from Monday open to Friday's close gained -.01%. However, if you day traded NVDA as I did you would have made $$ instead of losing it like a swing trader or long term investor. Look at all those ups and downs on the NVDA chart for this week! Perfectly ripe for Day Trade pickin'!\n\nhttps://preview.redd.it/mv82q8k3ukvd1.png?width=1101&format=png&auto=webp&s=aa926cbdb63efe7f23aff5d2202c3c359082cb60\n\nSo, I day traded and held NVDA every night this week and am still holding it. Instead of losing -.01%, I earned over $900. I also day traded a lot of other stock for more profit than just $900, but this is what I earned from NVDA. I'll be continuing this probably until NVDA announced earnings in March 2025.\n\nhttps://preview.redd.it/8f1hqy7pukvd1.png?width=1628&format=png&auto=webp&s=d3862943df5ed00ad5eb402251843e66924e93fb\n\nDay trading is much more profitable than swing trading and long term investing. I often day trade and hold overnight during up trending seasons for the reasons illustrated above. Oh, yeah, I also do not use stop losses. So, F your stop loss.   \n\n\n",
        "created_utc": 1729284651.0,
        "subreddit_name": "DayTrading",
        "comments": 271
    },
    {
        "title": "Guy studying Daytrading at the Dr office today.",
        "score": 181,
        "url": "https://www.reddit.com/r/Daytrading/comments/1g6577s/guy_studying_daytrading_at_the_dr_office_today/",
        "content": "I had doctor's appointment today. Guy waiting next to me was reading a day trading training book on his phone.\n\nI didn't say anything, just silently wished him luck. ",
        "created_utc": 1729209844.0,
        "subreddit_name": "DayTrading",
        "comments": 54
    }
]