[
    {
        "title": "iPhone X survived 8 hours submerged on the sea floor. I was able to recover it later in the day using find my iPhone!",
        "score": 6713,
        "url": "https://www.reddit.com/r/apple/comments/9ox8jt/iphone_x_survived_8_hours_submerged_on_the_sea/",
        "content": "Crazy story.\n\nI was enjoying some water sports with my soon to be fiance who I was planning to propose to 2 hours after this happened. We decided to take the iPhone out to take some photos of us kayaking and stand up paddle boarding on the beach (yes probably a stupid idea). So I had my iPhone in my pocket as I got up on the stand up paddle board and I fell backwards into the water. That was when it struck me. My phone was no longer in my pocket.\n\nAfter desperately trying to relocate the phone using snorkeling gear lol it quickly dawned upon us that there was no way we were going to find the phone amongst all the rocks and debris on the ocean floor. Plus I figured that the phone will probably be water damaged before long being submerged in salty sea water. Furthermore, radiowaves can't penetrate water so my phone immedately lost reception meaning we weren't able to call it or use find my iPhone.\n\nThis was obviousy a massive downer for me but I brushed it off. After all I was planning on proposing.\n\nSo I went ahead with the proposal and it went really well :) had a celebratory dinner on the beach. I would occasionally look out to the ocean knowing that my iPhone was sitting on the ocean floor but I wasn't going to let that ruin the night for me.\n\nWhen we finally returned home I decided to try find my iPhone again. This was T+8 hours post fall into water. The tide had gone out a bit so I was hoping that the seas would part and my phone would get signal again.\n\nLo and behold I got a signal!\n\nSo we raced down to the beach and I played the sonar sound through find my iPhone and was able to locate it amongst the rocks. 66% battery left haha.\n\nTo my surprise it was in perfect working condition! We quickly took it back home and put it in some rice and I haven't had any problems with it since.\n\nThanks apple for creating such a sturdy product in the iPhone X and the amazing find my iphone app. It was the icing on the cake to a perfect day!\n\nTLDR:\n\nDropped phone in ocean 2 hours before proposal. Did said propsal anyway. She said yes! Used find my iPhone to relocate phone on the ocean floor once the tide had come out 8 hours after being submerged in water in perfect working condition. WINNING.\n\nEDIT:\nJust to clarify things... \n1. When I found it again it wasn’t underwater anymore as it was low tide and it had fallen in at high tide\n2. It was approx 1m underwater when it fell in \n3. Water sports means water sports lol ... \nedit again. omg did not realise it had another meaning after checking urban dictionary..... ",
        "created_utc": 1539770232.0,
        "subreddit_name": "apple",
        "comments": 553
    }
]