[
    {
        "title": "After the Bell: Nvidia clobbers earnings expectations as AI demand hits ‘tipping point’; stock up 6%",
        "score": 953,
        "url": "https://www.reddit.com/r/investing/comments/1awpej3/after_the_bell_nvidia_clobbers_earnings/",
        "content": "I haven’t seen this posted yet. So excuse me if it becomes a duplicate. But I figured this would be of interest to people because Nvidia has been the poster child for whether or not this is an AI bubble.\n\nI think everyone was taking wait-and-see on their earnings. And the naysayers would be able to point to missed expectations as a sign that this is a bubble. \n\nFrom MarketWatch :\n\nhttps://www.marketwatch.com/story/nvidias-stock-heads-for-biggest-drop-in-over-a-year-and-biggest-market-cap-loss-ever-6c617e9c?mod=djem_mwnafterbell\n\n> Revenue came in at $22.1 billion, up from $6.05 billion a year before, while analysts had been modeling $20.4 billion.\n\n> Data-center revenue at Nvidia NVDA rocketed more than 400% from a year before to hit $18.4 billion, while the FactSet consensus was for $17.06 billion.\n\n> Nvidia forecasts continued strong growth for the ongoing quarter, well above expectations. The company is calling for $24.0 billion in revenue, up from $7.2 billion a year prior, while analysts were modeling $22.2 billion.\n\n> Accelerated computing and generative AI have hit the tipping point,” Chief Executive Jensen Huang said in a release. “Demand is surging worldwide across companies, industries and nations.”\n\n> Nvidia posted fiscal fourth-quarter net income of $12.3 billion, or $4.93 a share, compared with $1.4 billion, or 57 cents a share, in the year-earlier period. On an adjusted basis, the company earned $5.16 a share, while analysts were projecting $4.59 a share.\n\nI own Nvidia, so I admit, I am biased. But I think anyway you slice those numbers, they’re pretty damn impressive. If it’s a bubble, it’s a bubble that people are buying into. And by people, I mean, giant, multinational companies. It’s amazing growth for a company so large. \n\nI’m hoping this brings some calm back to the markets. We’ve been pivoting between irrational exuberance and panic.\n\n**EDIT**: it is the next day, and the results are in. My personal account earned 27.9% TODAY. That is from 2 NVDA options and 1 SMCI option. My larger retirement account made 11.2% today based on NVDA stock SMCI stock NVDA option and lots of ETFs. Probably no one will see this edit. But as a normal investor, the reason I’m in this space is because of these returns. The reason a lot of people are here are because of these returns. And you can choose to ignore them if they are outside your risk and comfort level. That makes perfect sense. But there are compelling reasons to be here as well.",
        "created_utc": 1708554344.0,
        "subreddit_name": "investing",
        "comments": 357
    },
    {
        "title": "Apple releases Sports app for iPhone, featuring real-time scores, stats and more",
        "score": 2161,
        "url": "https://9to5mac.com/2024/02/21/apple-sports-app-realtime-stats/",
        "content": "",
        "created_utc": 1708524318.0,
        "subreddit_name": "apple",
        "comments": 721
    },
    {
        "title": "Meta and Microsoft ask EU to reject Apple's new app store terms",
        "score": 1476,
        "url": "https://9to5mac.com/2024/02/21/meta-and-microsoft-new-app-store-terms/",
        "content": "",
        "created_utc": 1708546905.0,
        "subreddit_name": "apple",
        "comments": 748
    },
    {
        "title": "New Sports App from Apple",
        "score": 856,
        "url": "https://www.apple.com/newsroom/2024/02/introducing-apple-sports-a-new-app-for-sports-fans/",
        "content": "",
        "created_utc": 1708524768.0,
        "subreddit_name": "apple",
        "comments": 358
    },
    {
        "title": "Does anyone use Apple Reminders, if so how's your experience?",
        "score": 646,
        "url": "https://apps.apple.com/us/app/reminders/id1108187841",
        "content": "",
        "created_utc": 1708478115.0,
        "subreddit_name": "apple",
        "comments": 473
    },
    {
        "title": "NVDA Results Q4",
        "score": 1477,
        "url": "https://www.reddit.com/r/stocks/comments/1awntpz/nvda_results_q4/",
        "content": "$NVDA RESULTS: Q4\n\n❖ Revenue $22.10B vs. $6.05B y/y, EST $20.41B  \n❖ Data center revenue $18.4B vs. $3.62B y/y, EST $17.21B  \n❖ Gaming revenue $2.9B, +58% y/y, EST $2.72B  \n❖ Professional Visualization revenue $463M vs. $226M y/y, EST $435.5M  \n❖ Automotive revenue $281M, -4.4% y/y, EST $272.1M  \n❖ ADJ gross margin 76.7% vs. 66.1% y/y, EST 75.4%.  \n❖ R&D expenses $2.47B, +26% y/y, EST $2.43B  \n❖ ADJ operating expenses $2.21B, +25% y/y, EST $2.23B  \n❖ ADJ operating income $14.75B vs. $2.22B y/y, EST $13.14B  \n❖ Free cash flow $11.22B vs. $1.74B y/y, EST $10.82B\n  \n❖ Sees Q1 Revenue $24B Plus Or Minus 2% (exp 21.9B)\n  \nhttps://s201.q4cdn.com/141608511/files/doc_financials/2024/Q4FY24/Q4FY24-CFO-Commentary.pdf",
        "created_utc": 1708550664.0,
        "subreddit_name": "stocks",
        "comments": 711
    },
    {
        "title": "I told my grandson I have 4000 NVDA shares so he'll wipe my ass",
        "score": 21962,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1awompn/i_told_my_grandson_i_have_4000_nvda_shares_so/",
        "content": "TL;DR: my gullible grandson wipes my ass to get into my will because I told him I bought 4,000 $NVDA shares (1,000 shares pre 4:1 split) in 2018/2019 and am now sitting on >$2.5 million in NVDA.\n\nI'm 87 and immobile in a wheelchair and don't know anything about semiconductors or anything else technology related. I cannot Google or text, and I currently have someone who lives in my home 24/7 and wipes my ass for me. However, I'm a damn intuitive savant when it comes to tricking gullible kids.\n\nI did grow up in the biggest bull market in human history with some Boomers printing money like Chuck E. Cheese bucks.. and everyone is a genius in a bull market.. Well almost everyone. I didn't invest so now I just scam Millennials and Zoomers.\n\nAnyway, I like talking stocks with my grandson because it’s something we could connect on, and I have a ton of experience selling worthless advice to idiots. So in 2018 we were talking about the market, and I casually brought up Nvidia. He thought I didn't guide him to that at all. He bought Nvidia in 2017 so he was familiar with it although he bought his shares at 18 yrs old with $2k he had saved up. Nothing insane although he kept 90% to this day. I said I saw NVIDIA in a newspaper article with someone recommending it for elderly’s retirement accounts. So I told my grandson I was an OGangster, called my broker and bought 1,000 shares on the spot because in my words: “I don’t buy a stock if I can’t afford 1,000 shares”. Something only the Zoomers dumb enough to buy meme stocks would fall for. \n\nHe was dumbstruck because here he thought he was doing great with his savings over the years, and I just humbled his ass with a completely made up sentence. Add in the 4:1 stock split, and now he thinks I'm sitting on 4,000 shares. (I \"confirmed\" it to him when he brought it up in the last month). I haven't sold a dime and don't even know what the price is doing day to day because I don't own any shares.  I'm just chilling in my wheelchair and letting him try to get a bigger share of the inheritance. He called and celebrated with me the other day because he transparently wants to get in my will. He thinks I'm already wealthy and dumb enough to drop 6 figures on a stock I know little about.\n\nHe hopes to inherit my wealth someday, but he’s also a scammy, golddigging SOB and he knows it! Told me “haha you're a genius investor and luck has nothing to do with”. Thought id share here because I’m not sharing this IRL, but I find it pretty ironic my dumb ass grandson is outwiping 95% of this sub. Wendy's boys included.",
        "created_utc": 1708552575.0,
        "subreddit_name": "wallstreetbets",
        "comments": 595
    },
    {
        "title": "I'm a full time trader and this is everything I'm watching and analysing in premarket 02/21",
        "score": 156,
        "url": "https://www.reddit.com/r/Daytrading/comments/1awc3a3/im_a_full_time_trader_and_this_is_everything_im/",
        "content": "**ANALYSIS:**\n\n* Firstly, NVDA earnings are today. \n* Bloomberg is showing an 11% predicted volatility on earnings, as shown below. \n* [https://imgur.com/a/C1nuTr6](https://imgur.com/a/C1nuTr6)  \n* NVDA is lower in premarket on continued profit taking, but we can notice a few things. Firstly, skew, which was pointing sharply lower has now reversed upwards, as IV in OTM calls increases. 680 was a key gamma level where traders tried to buy the dip from yesterday.   \n As we know earnigns are a risk. Earnigns when the stock is up 50% in the last quarter are an even bigger risk. We saw that in other earnings reports, like Google’s where good earnings were still punished based on valuation. \n* Bulls on NVDA are for the most part holding their positions.\n* This is the net gex profile for NVDA, skewed mostly to calls still on all expirations. \n* [https://imgur.com/a/IlFyzTE](https://imgur.com/a/IlFyzTE) \n* On the 1 week to expirations, we can see more hedging for the earnigns. This clears up and the profile is again biased to calls when you look at monthly expirations. So traders hedge into earnings s that makes sense, but outlook still bullish. \n* [https://imgur.com/a/hzs6fu8](https://imgur.com/a/hzs6fu8) \n* Key levels for NVDA are:\n* Call resistance at 700, although lots of calls on 750 too\n* Put support is at 640\n* Put support from 0dte options is at 650\n* These will be key levels going into the earnigns print. \n\n——\n\n* China points higher today as markets react to the cutting of 5 year rate yesterday. We noted on weekend that it seemed skew for Hong Kong was pointing higher and we could see calls building on 17k. It seems that traders are still expecting 17k to hit. \n\nA look at Oil:\n\n* Spot price falls at the moment, as volatility continues as traders buy ATM puts to hedge for volatility.\n* However, we can see from skew that there is a bullish divergence there on Brent. \n* [https://imgur.com/a/xtjaHfa](https://imgur.com/a/xtjaHfa) \n* Volatility continues due to the hedging and the evercahgning geopolitical landscape, as well as ever changing Fed expectations. \n* But overall, outlook still looks bullish. \n\nA look at BTC\\\\\n\n* Looks like we can be seeing a local top here. IV in OTM calls is reducing, block trade flows also reduce. Skew points lower. May see some correction. \n\nA quick look at indices then:\n\n* Volatility skew does point down as traders hedging with put options, but money flows from hedge funds hit new high yesterday. Funds are buying the dip, and not expecting it to last in medium term. A lot in the short term will depend on NVDA though. \n* Finally, if we look at Mag7 skew, we do see signs that market can continue to price correct. \n* We see Mag7 skew lower, which often leads the market. Traders are seeking some protection from the volatility in short term. \n\n**DATA LEDE:**\n\n* KEY IS FOMC MINUTES WHICH IS RELEASED 2 HOURS BEFORE MARKET CLOSE. \n* Japan tankan business survey gives first negative reading on business sentiment since April 2023. \n* Japan Balance of Trade Numbers:\n* Overall balance of trade was less negative than expected. \n* Exports grew more than expected up 12% YOY, ahead of expectations of 9.5%\n* Imports fell more than expected, by 9.6% vs 8.4% expected.\n* This means more exports and less imports, points to greater demand for JPY. Would expect JPY to rise on this. But JPY down on Japanese gov downgrades and business survey weakness. \n* Australia Wage Price index:FASTEST PACE OF RISE In 15 YEARS. \n* YOY comes 4.2% vs 4.1% forecast. Last quarter’s data revised up to 4.1% from 4%.\n* QOQ comes 0.9% vs 0.9% forecast. \n* Hotter than expected wage data points to stickier service inflation and thus, a more hawkish RBA. \n* UK Record budget surplus for January:\n* UK Chief secretary says that they still won’t speculate if tax cuts are affordable or not in the budget. \n* US mortgage demand numbers:\n* Mortgage demand takes a hit, interest rates cross back over 7% on reduced rate cut expectations pushing up bond yields. \n* EU Consumer Confidence NUmbers:\n* Later we have FOMC minutes - likely reveals more of what we know, continue to explain that we need to see more of the same data to be confident of cuts. Slight hawkish tone probably. \n* FED SPEAKERS: BOSTIC speaks, as does Bowman. \n\n**MARKETS:**\n\n* SPX - yesterday, found support around 4955, before recovering back to 4977. Before Europe opened, was trading at 4972, dropped slightly on European open as FTSE100 sold off. \n* Nasdaq: Slightly lags SPX and DJI. This is due to the big sell off in PANW. Low of day yesterday was 17,400, before recovery to 17,550. Lower in premarket,. \n* DJI - Trading at around 38,500 in premarket, slightly down, at the low of the day from yesterday. \n* HKG market higher today on cutting of loan prime rate. Was up almost 4%, as high as 16,800, before paring some gain to 16,460. \n* China meanwhile is up 2% to 11,890. Key level here will be the 12k level, which it was rejected off of. \n* GER40: low of yday was 17,020. Trading quite flat. Today got a bit of a boost at open and is up 0.42% to 17062. This comes as we are seeing higher open interest on 17.5k\n* UK market down 1%\n* Gold higher again on softer dollar and Middle East geopolitics - 5th consecutive green day in a row. \n* OIL: down 0.8%. Little bit of correction here, as was trading 78.5 yesterday. Volatility is persistent but skew keeps higher, just with more hedging. \n* Bond yields slightly lower ahead of FOMC minutes later. \n\n**FOREX:**\n\n* AUD was higher on hawkish wage data. \n* Dollar was lower into the FOMC minutes, pared slightly. \n* EURUSD and GBPUSD slightly lower back to 1.08. \n* GBPUSD fell and retested 1.26. \n* AUDUSD pushing up towards 0.66 but pared the gains. \n* USDJPY steady around 150\n\n**EARNINGS**:\n\n**PANW - cuts full year billings, and revenue guidance. All their revenue and billings guidance missed the mark.** \n\n* EPS of 1.46 beat by 12%\n* Revenue of 1.98B beat by 0.5% \n* FULL YEAR GUIDANCE:\n* Sees billings for 2025 at 10.1-10.2B, down 6% YOY. \n* Lowered sales forecast, expecting revenues to be 7.95-8B, down 3% YOY\n* Cut their full year revenue growth down to 15-16%. \n* Full year EPS to be 5.45-5.55, miss by 0.4%\n* Q3 GUIDANCE:\n* Revenue to be 1.95-1.98, miss by 3%\n* Billings to be 2.325B, miss by 12%\n* Initially this cut in guidance was attributed to softness in cybersecurity market.\n* CEO did later reassure investors that there’s been no drop in cybersecurity demand. Revenue and billings guidance was not because of this, but was because of a strategic shift for the long term. \n* This shift aims at platform migration, growth acceleration and AI leadership. \n\n**SEDG - Far lower revenue forecast. Really poor gross margins too**\n\n* Revenue was 316M, down 64% YOY, and missed expectations by 2.8%\n* Produced a loss in bottom line of 0.92, although this was smaller than last quarter. It also came in ahead of expectations of a loss of 1.34. \n* Gross margin was just 4% vs 23% last quarter, and 32% the year before. \n* Q1 outlook was for revenue to be 175-215. Sequentially, that will be down 40%. It also misses consensus expectations by 50%. \n* Expects gross margin to be -3 to +1%, which includes 8.5% of IRA manufacturing tax credit\n* Looking at the solar segment specifically, margins to be 1-5%. \n* Said overall year results for 2023 weren’t that bad, but challenges were in H2. H1 actually saw record installations and expectations for growth. \n* Higher interest rates and lower power prices continue to stem demand for solar. They have inventory build up. \n* Said their expanding portfolio is a plus for the future. \n* They have made cost reduction measures. \n\n**TDOC: Large revenue miss on current quarter, and both EPS and EBTIDA miss for next quarter guide.** \n\n* Current quarteR:\n* Revenue of 660m misses expectations by 1.7%\n* EBITDA of 114M, beats by 2.7%\n* Q1 GUIDANCE:\n* Revenue of 630-645M, missed expectations by 5.3%\n* EBITDA of 52-62M, missed by 15%\n* So big miss on guidance. \n\n**FLS - GUIDANCE missed the mark as a result of bookings down YOY, but current sales were strong.** \n\n* EPS of 0.68 beat by 13%\n* Revenue of 1.17B was up 13% YOY, beat by 2.6%\n* Original equipment sales up 13%\n* Aftermarket sales up 7%\n* bookings of 1.04B, down 5.7% YOY. On constant currency basis, bookings were down 7.1%. \n* Original equipment bookings were down 12% YOY\n* Aftermarket bookings was down 1.2%\n* Full year guidance was for revenue growth to be 4-6%, which was slightly short at the midpoint of consensus, by 6%\n* EPS of 2.4-2.60, was short of consensus at midpoint by 1.3%\n* Operational discipline. 3D stagey is the catalyst for accelerated growth\n* Expects aftermarket and MRO opportunities to remain elevated in 2024 and beyond. \n* Hopes to improve conversion percentage of $2.7B backlog. \n\n**JBT**\n\n* Had given a strong preliminary earnings announcement before, which pushed it up by 9% on Jan 19th. \n* There, they announced 2024 EPS of 5.05-5.45, ahead of estimates by 10%\n* Sees 2024 revenue of 1.765B, which was in line with estimates. \n* Today, they gave EPS of 1.4 which beat by 3%\n* Revenue of 444M was up 1% YOY, but missed by 0.3%. More or less in line. \n* Record full year highlights. \n* Continued margin expansion\n* Made progress on Elevate 2.0 strategy. \n\n**GPK Revenue missed expectation, and EPS guidance for next quarter was short by 2%**\n\n* EPS of 0.75 beats by 7.1%\n* Revenue of 2.25B was down 6% YOY, missed by 6.4%\n* Full year 2023 highlights:\n* Net sales were flat for 2023. \n* EBITDA was up 17% YOY\n* EPS was up 38% YOY\n* Net leverage was lower YOY\n* GUIDANCE:\n* EPS expected to be 2.5-3, which was short of consensus by 2%\n* Said 2023 was a transition year for consumer packaging. \n* Whilst 2023 brought 4% organic sales contraction, Said they are positioned to return to growth in 2024, which has started to amterlaise already when you look at volumes in the quarter so far. \n\n**WSC**\n\n* EPS of 0.44 missed by 17%\n* Revenue of 612M was up 4% YOY, but missed the mark by 1.3%\n* EBITDa was up 7% YOY\n* EBITDA margin was 47%, which was up 1.6% YOY. \n* Free cash flow was up 35% YOY\n* Made acquisiton of McGrath Rentcorp. \n* Consistent compound returns, irrespective of market conditions\n* Upgraded CRM system tog ive them more scalable tech\n* Strategy unchanged for 2024, immediate tailwinds including Value Added Products, margins and M&A. \n* ————\n\n**INSTITUTIONAL RESEARCH:**\n\n* Goldman say that Copper and gold stocks will get the largest immediate boost from Fed easing. \n\n  \n**MAG 7 News:**\n\n* NVDA - Goldman Sachs trading desk call it the most important stock on the planet. \n* NVDA earnings after close is the big one. \n* NVDA - down 2% in premarket as profit taking continues ahead of earnings report. \n* AMZN - Bezos sells 2.4B more stock. Bezos has now sold 8B worth of Amazon stock in 2024. \n* AMZN - Amazon will join Dow Jones, replacing WBA in the index. Index change was driven by Wlamarts decision to do stock split which caused rebalancing. \n* AAPL - shuffles leadership team respoble for audio products\n* AAPL - reportedly in developement of an apple ring to rival Samsung galaxy ring. \n* AAPL - Vision Pros on sale in Russia\n* MSFT - is developing AI server gear in order to lessen reliance on NVidia. \n* TSLA - Morgan Stnaley say that Tesla bears outnumber bulls by over 2 to 1. 3/4 of respondents of their survey think that the stock has yet to bottom. \n\n**COMPANY SPECIFIC NEWS:**\n\n* Uber eats launches self driving robot deliveries in Japan, in partnership with Mitsubishi and Cartken robot. Is trying to explore self driving robot deliveries in US too. \n* Chinese stocks higher as Hong Kong MARKET pumps. \n* UBER - joins Dow transports index. \n* Other cybersecurity names are falling on PANW earnings. Including CRWD, ZS, CHKP. \n* Housing stocks can be under pressure after mortgage demand numbers come weak. \n* Solar stocks will be weak on SEDG earnings. \n* Streaming companies, DIS, WBD, DIS - FuboTV sues ESPN, Warner Bros and Fox over their new sports streaming venture. Seeks to block the venture. This comes as FuboTV shares been taking. Beating after the new sports streaming service was announced. \n* OXY - considering sale of Western Midstream Partners in 18B+ deal. This sale is aimed to help reduce their debt. OXY owns 49% of Western midstream. Still in discussion phase. \n* AAL - increased bag fees and restricts mile earnings on 3rd party bookings. \n* ADBE - unveils AI assistant for efficient PDF summaries and interactions. \n* WBA - down after losing spot in DJIA.\n* F - yesterday, slashed mustang Mach E prices by up. To 8,100. Adds 0% financing. \n* ENPH - moving on SEDG earnings, but specific news for the company as they expand solargraf platform with new design\n* PLTR - CTO of Palantir sells 225k shares. \n* BA - a boeing 757-200 this morning reportedly had ton be diverted mid-flight to land after passenger noticed piece of wing was broken. \n* COF - DFS, Elizabeth Warren is urging regulators to block the deal. \n* Nokia - will enter new partnership with Nvidia. \n* ASML - Samsung sells off entire stake in ASML in order to advance in new areas. \n* IFF - slashes their dividend by around 51%\n* Rio Tinto said that China’s demand for steel is nearly nothing. \n* Profits drop 12%, but they returned more cash to investors. \n* Rio - signed Australia’s biggest renewable power deal for Gladstone operations. \n* SBSW - sees sharp drop in annual profit, takes $2.5B in impairments. \n* HSBC down on earnigns as they post record annual profit, but miss estimates due to China write downs. \n* Glencore was down 6% after posting steep drop in annual profits. \n\n**OTHER NEWS:**\n\n* Us gov to forgive $1.2B in student debt for over 150k borrowers. \n* Germany downgrades 2024 GDP growth forecast to 0.2% from previous 1.3%\n* A quick point on inflation taken from the Walmart report which I was reading more today, They said The average ticket— how much shoppers spent per trip — fell 0.3% in the quarter vs a year ago, even as the number of transactions rose 4.3%. This can be a sign inflation comes down. \n* With chinese stocks rising on the cut of the 5 year prime loan rate, China is tightening its grip on stocks by banning net sales at OPena nd close. \n* China commercial banks bad loan ratio falls slightly to 1.59%. This is good amid their real estate woes. \n* Japan’s exports to China were up 29% YOY. Thats a pretty good sign for Chinese demand. \n* Chinese banks have approved $17B of loans under whitelist project, says Housing authority there. More support for housings sector. \n* Nowcast model point to upside risk to US GDP but downside risk to German GDP in Q1. \n* Japanese governement cut its views on consumer sending. First time since 2022. Said the economy is recovering moderately but starting to stall. \n* Downgraded its view on industrial production too. \n* UBS now expects the US Fed to start cutting rates from June, vs prior forecast of first rate cuts in May. \n* Citi meanwhile say they see no soft landing for US and see recession signs b summer. Said the fed will ut in June which is when recession signs will become clear. \n* Semiconductor exports from South Korea continues to rise, now at the highest level since 2017. \n* US commercial real estate worries continue to exist and spread to German banks, as those with exposure to US see bonds suffer. \n* Nikki Haley says she has no plans to quit the nomination race. \n* German 10 year bund auction saw decent demand, with bid to cover ratio of 2.1 vs 1.8 previously. This made yields drop. \n* UK 4 year gilt auction went well too, with bid to cover of 3.34 vs 2.856 previously. This points to good demand. \n* Israel strike on Damascus. \n* Following better than expected Public borrowing numbers in UK, UK Chief secretary says that they won’t speculate if tax cuts are affordable or not in the budget. \n* Taiwan say that the limitary situation around Taiwan is normal. Denies increasing military precedes on offshore islands. \n* US say that Houthis launch 2 anti ship ballistic missiles at US owned bulk carrier ship, causing minor damage. Continued elevation in rates. \n* US reaper spy drone was also shot down yday by Houthis, over the Red Sea. \n* London’s BT tower sold to US hotel group for 350M. \n* India’s Zee down 10% after found accounting discrepancies amounting to $240M. ",
        "created_utc": 1708522279.0,
        "subreddit_name": "DayTrading",
        "comments": 28
    },
    {
        "title": "Introducing Apple Sports, a new app for sports fans",
        "score": 0,
        "url": "https://www.stocktitan.net/news/AAPL/introducing-apple-sports-a-new-app-for-sports-39ly13dikh04.html",
        "content": "",
        "created_utc": 1708524006.0,
        "subreddit_name": "AAPL",
        "comments": 0
    }
]