[
    {
        "title": "After the Bell: Nvidia clobbers earnings expectations as AI demand hits ‘tipping point’; stock up 6%",
        "score": 953,
        "url": "https://www.reddit.com/r/investing/comments/1awpej3/after_the_bell_nvidia_clobbers_earnings/",
        "content": "I haven’t seen this posted yet. So excuse me if it becomes a duplicate. But I figured this would be of interest to people because Nvidia has been the poster child for whether or not this is an AI bubble.\n\nI think everyone was taking wait-and-see on their earnings. And the naysayers would be able to point to missed expectations as a sign that this is a bubble. \n\nFrom MarketWatch :\n\nhttps://www.marketwatch.com/story/nvidias-stock-heads-for-biggest-drop-in-over-a-year-and-biggest-market-cap-loss-ever-6c617e9c?mod=djem_mwnafterbell\n\n> Revenue came in at $22.1 billion, up from $6.05 billion a year before, while analysts had been modeling $20.4 billion.\n\n> Data-center revenue at Nvidia NVDA rocketed more than 400% from a year before to hit $18.4 billion, while the FactSet consensus was for $17.06 billion.\n\n> Nvidia forecasts continued strong growth for the ongoing quarter, well above expectations. The company is calling for $24.0 billion in revenue, up from $7.2 billion a year prior, while analysts were modeling $22.2 billion.\n\n> Accelerated computing and generative AI have hit the tipping point,” Chief Executive Jensen Huang said in a release. “Demand is surging worldwide across companies, industries and nations.”\n\n> Nvidia posted fiscal fourth-quarter net income of $12.3 billion, or $4.93 a share, compared with $1.4 billion, or 57 cents a share, in the year-earlier period. On an adjusted basis, the company earned $5.16 a share, while analysts were projecting $4.59 a share.\n\nI own Nvidia, so I admit, I am biased. But I think anyway you slice those numbers, they’re pretty damn impressive. If it’s a bubble, it’s a bubble that people are buying into. And by people, I mean, giant, multinational companies. It’s amazing growth for a company so large. \n\nI’m hoping this brings some calm back to the markets. We’ve been pivoting between irrational exuberance and panic.\n\n**EDIT**: it is the next day, and the results are in. My personal account earned 27.9% TODAY. That is from 2 NVDA options and 1 SMCI option. My larger retirement account made 11.2% today based on NVDA stock SMCI stock NVDA option and lots of ETFs. Probably no one will see this edit. But as a normal investor, the reason I’m in this space is because of these returns. The reason a lot of people are here are because of these returns. And you can choose to ignore them if they are outside your risk and comfort level. That makes perfect sense. But there are compelling reasons to be here as well.",
        "created_utc": 1708554344.0,
        "subreddit_name": "investing",
        "comments": 357
    },
    {
        "title": "Apple releases Sports app for iPhone, featuring real-time scores, stats and more",
        "score": 2161,
        "url": "https://9to5mac.com/2024/02/21/apple-sports-app-realtime-stats/",
        "content": "",
        "created_utc": 1708524318.0,
        "subreddit_name": "apple",
        "comments": 721
    },
    {
        "title": "Meta and Microsoft ask EU to reject Apple's new app store terms",
        "score": 1476,
        "url": "https://9to5mac.com/2024/02/21/meta-and-microsoft-new-app-store-terms/",
        "content": "",
        "created_utc": 1708546905.0,
        "subreddit_name": "apple",
        "comments": 748
    },
    {
        "title": "New Sports App from Apple",
        "score": 856,
        "url": "https://www.apple.com/newsroom/2024/02/introducing-apple-sports-a-new-app-for-sports-fans/",
        "content": "",
        "created_utc": 1708524768.0,
        "subreddit_name": "apple",
        "comments": 358
    },
    {
        "title": "Does anyone use Apple Reminders, if so how's your experience?",
        "score": 646,
        "url": "https://apps.apple.com/us/app/reminders/id1108187841",
        "content": "",
        "created_utc": 1708478115.0,
        "subreddit_name": "apple",
        "comments": 473
    },
    {
        "title": "NVDA Results Q4",
        "score": 1477,
        "url": "https://www.reddit.com/r/stocks/comments/1awntpz/nvda_results_q4/",
        "content": "$NVDA RESULTS: Q4\n\n❖ Revenue $22.10B vs. $6.05B y/y, EST $20.41B  \n❖ Data center revenue $18.4B vs. $3.62B y/y, EST $17.21B  \n❖ Gaming revenue $2.9B, +58% y/y, EST $2.72B  \n❖ Professional Visualization revenue $463M vs. $226M y/y, EST $435.5M  \n❖ Automotive revenue $281M, -4.4% y/y, EST $272.1M  \n❖ ADJ gross margin 76.7% vs. 66.1% y/y, EST 75.4%.  \n❖ R&D expenses $2.47B, +26% y/y, EST $2.43B  \n❖ ADJ operating expenses $2.21B, +25% y/y, EST $2.23B  \n❖ ADJ operating income $14.75B vs. $2.22B y/y, EST $13.14B  \n❖ Free cash flow $11.22B vs. $1.74B y/y, EST $10.82B\n  \n❖ Sees Q1 Revenue $24B Plus Or Minus 2% (exp 21.9B)\n  \nhttps://s201.q4cdn.com/141608511/files/doc_financials/2024/Q4FY24/Q4FY24-CFO-Commentary.pdf",
        "created_utc": 1708550664.0,
        "subreddit_name": "stocks",
        "comments": 711
    },
    {
        "title": "I told my grandson I have 4000 NVDA shares so he'll wipe my ass",
        "score": 21962,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1awompn/i_told_my_grandson_i_have_4000_nvda_shares_so/",
        "content": "TL;DR: my gullible grandson wipes my ass to get into my will because I told him I bought 4,000 $NVDA shares (1,000 shares pre 4:1 split) in 2018/2019 and am now sitting on >$2.5 million in NVDA.\n\nI'm 87 and immobile in a wheelchair and don't know anything about semiconductors or anything else technology related. I cannot Google or text, and I currently have someone who lives in my home 24/7 and wipes my ass for me. However, I'm a damn intuitive savant when it comes to tricking gullible kids.\n\nI did grow up in the biggest bull market in human history with some Boomers printing money like Chuck E. Cheese bucks.. and everyone is a genius in a bull market.. Well almost everyone. I didn't invest so now I just scam Millennials and Zoomers.\n\nAnyway, I like talking stocks with my grandson because it’s something we could connect on, and I have a ton of experience selling worthless advice to idiots. So in 2018 we were talking about the market, and I casually brought up Nvidia. He thought I didn't guide him to that at all. He bought Nvidia in 2017 so he was familiar with it although he bought his shares at 18 yrs old with $2k he had saved up. Nothing insane although he kept 90% to this day. I said I saw NVIDIA in a newspaper article with someone recommending it for elderly’s retirement accounts. So I told my grandson I was an OGangster, called my broker and bought 1,000 shares on the spot because in my words: “I don’t buy a stock if I can’t afford 1,000 shares”. Something only the Zoomers dumb enough to buy meme stocks would fall for. \n\nHe was dumbstruck because here he thought he was doing great with his savings over the years, and I just humbled his ass with a completely made up sentence. Add in the 4:1 stock split, and now he thinks I'm sitting on 4,000 shares. (I \"confirmed\" it to him when he brought it up in the last month). I haven't sold a dime and don't even know what the price is doing day to day because I don't own any shares.  I'm just chilling in my wheelchair and letting him try to get a bigger share of the inheritance. He called and celebrated with me the other day because he transparently wants to get in my will. He thinks I'm already wealthy and dumb enough to drop 6 figures on a stock I know little about.\n\nHe hopes to inherit my wealth someday, but he’s also a scammy, golddigging SOB and he knows it! Told me “haha you're a genius investor and luck has nothing to do with”. Thought id share here because I’m not sharing this IRL, but I find it pretty ironic my dumb ass grandson is outwiping 95% of this sub. Wendy's boys included.",
        "created_utc": 1708552575.0,
        "subreddit_name": "wallstreetbets",
        "comments": 595
    }
]