[
    {
        "title": "Apple Launches New iPhones Tuesday. Wall Street Is Pumped",
        "score": 1554,
        "url": "https://www.reddit.com/r/stocks/comments/j9udf4/apple_launches_new_iphones_tuesday_wall_street_is/",
        "content": "Tuesday is the day. After many months of investor buildup, Apple is finally about to unveil the first generation of 5G iPhones, which likely will be called iPhone 12.\n\nThe details have been widely leaked. Apple ￼ (ticker: AAPL) is expected to unveil four models. Here’s how Raymond James analyst Chris Caso laid it out in a research note last month:\n\n• iPhone 12, with a 5.4-inch screen, priced at $699\n\n• iPhone 12 Max, with a 6.1-inch screen, priced at $799\n\n• iPhone 12 Pro, also with a 6.1-inch screen, plus higher end cameras, priced at $999\n\n• iPhone 12 Pro Max, with a 6.6-inch screen, priced at $1,099\n\nThere is also some speculation about new Apple-branded over-the-ear headphones called AirPods Studio, and perhaps a new product for tracking things with Bluetooth called AirTags. But there’s no question that this event is all about the iPhone, and the expectations are sky high.\n\nWedbush analyst Daniel Ives writes this morning that this will be the most important Apple iPhone product cycle since the iPhone 6 in 2014. That time, Apple finally moved beyond 4-inch displays—the iPhone 6 was 4.7 inches and the beloved iPhone 6s a whopping 5.5 inches.\n\nAll of the new phones will run on 5G networks. (No coincidence that the tag line for the event is “Hi, Speed.”) Ives notes that the Pro versions are expected to have Lidar sensor technology, useful for augmented reality applications, as well as enhanced rear-camera technology. Ives expects preorders to kick off in a few weeks, with two of the models shipping later this month and the other two in mid-to-late November.\n\nIves says the U.S. version of the phones will be capable of accessing speedy millimeter wave version of 5G, which he thinks “could be a game changer looking ahead as more infrastructure, technology and apps are built around this transformational 5G highway over the coming years.”\n\nIves is particular bullish on the prospect for the new phones in China—he thinks the country will account for 20% of upgrades over the coming year.\n\n“With 5G now in the cards and roughly 40% of [the]...iPhone installed base not upgrading their phones in the last 3.5 years, [Apple CEO Tim] Cook & Co. have the stage set for a supercycle 5G product release, which should drive shares further,” he writes. “Although the soft macro and Covid backdrop will clearly dent some demand, we believe the underlying growth drivers for iPhone 12 success are unparalleled for Cupertino.”\n\nIves maintains his Outperform rating and $150 price target.\n\nMeanwhile, RBC Capital analyst Robert Muller on Monday repeated his Outperform rating, while lifting his price target on Apple stock to $132 from $111. Muller writes that he thinks the new iPhone lineup will “kick off a significant replacement cycle which we believe will be a multiyear process as new applications and spectrum become available over time.”\n\nMuller is also bullish about Apple’s push into the fitness category with the pending launch of the Fitness+ service. “We view Apple’s upcoming Fitness+ offering as a worthwhile competitor within the Health and Wellness category, and expect the service will benefit from pandemic-related at-home spending trends,” he writes. “In addition to meaningful revenue/EPS contribution, we expect notable synergy opportunities across Watch/TV/iPad/Services and view the offering as one more way that Apple can drive customer loyalty and, importantly, repeat purchases.”\n\nAssuming a 20% adoption rate by Apple Watch customers, Muller estimates that Fitness+ could generate $3 billion in annual revenue by 2022. “Our revenue estimates are stand-alone for Fitness+; however, Apple Watch is a requirement and unit sales could benefit from interest in Fitness+,” he writes.  “In total, we view Fitness+ as an ideal candidate to drive additional Apple-related spend and, importantly, keep customers more engaged and immersed within the Apple ecosystem, which should drive future iPhone sales.”\n\nSource: Barron's\n\nThanks for the awards.",
        "created_utc": 1602520923.0,
        "subreddit_name": "stocks",
        "comments": 263
    },
    {
        "title": "Apple Removes Beats Landing Page From Website Ahead of Tuesday's Launch Event",
        "score": 4191,
        "url": "https://www.macrumors.com/2020/10/12/apple-removes-beats-landing-page/",
        "content": "",
        "created_utc": 1602500956.0,
        "subreddit_name": "apple",
        "comments": 286
    }
]