[
    {
        "title": "Google falls 3% pre-market as Microsoft gains 2% on reports that Samsung is considering Bing as default search engine across all devices",
        "score": 2993,
        "url": "https://www.reddit.com/r/stocks/comments/12pcfpt/google_falls_3_premarket_as_microsoft_gains_2_on/",
        "content": "[https://finance.yahoo.com/news/google-may-lose-search-samsung-014102604.html](https://finance.yahoo.com/news/google-may-lose-search-samsung-014102604.html)\n\n (Bloomberg) -- Microsoft Corp.’s Bing may replace Alphabet Inc.’s Google as the default search service on Samsung Electronics Co. devices, according to a New York Times report on Sunday. \n\nSuwon-based Samsung, the world’s leading smartphone maker, is considering making the switch, putting at risk roughly $3 billion in annual revenue for Google, the report said. Bing’s threat to Google’s search dominance has grown more credible in recent months with the addition of OpenAI’s technology to provide ChatGPT-like responses to user queries.\n\nSamsung shipped 261 million smartphones in 2022, according to IDC data, all running Google’s Android software. The Korean company has long-established partnerships with both Microsoft and Google, and its devices come preloaded with a library of apps and services from both, such as OneDrive and Google Maps. Negotiations are still ongoing and Samsung may yet decide to keep Google as its default provider, according to the report.\n\nGoogle is working on several projects to update and renew its search services to avoid losing ground. Those include adding artificial intelligence features to its existing offerings, under a project named Magi, which has more than 160 people working on it, the Times reported.",
        "created_utc": 1681730699.0,
        "subreddit_name": "stocks",
        "comments": 513
    },
    {
        "title": "Apple Card’s new high-yield Savings account is now available, offering a 4.15 percent APY",
        "score": 6135,
        "url": "https://www.apple.com/newsroom/2023/04/apple-cards-new-high-yield-savings-account-is-now-available-offering-a-4-point-15-percent-apy/",
        "content": "",
        "created_utc": 1681740293.0,
        "subreddit_name": "apple",
        "comments": 1330
    }
]