[
    {
        "title": "Child spends $16K on iPad game in-app purchases",
        "score": 14005,
        "url": "https://appleinsider.com/articles/20/12/13/kid-spends-16k-on-in-app-purchases-for-ipad-game-sonic-forces",
        "content": "",
        "created_utc": 1607890316.0,
        "subreddit_name": "apple",
        "comments": 1257
    },
    {
        "title": "Google Chrome slows down Macs even when it isn't running",
        "score": 4162,
        "url": "https://www.reddit.com/r/apple/comments/kc3rvl/google_chrome_slows_down_macs_even_when_it_isnt/",
        "content": "Short story: Google Chrome installs something called Keystone on your computer, which nefariously hides itself from Activity Monitor and makes your whole computer slow ***even when Chrome isn’t running***. Deleting Chrome and Keystone makes your computer way, way faster, all the time.\n\nLong story: I noticed my brand new 16\" MacBook Pro started acting sluggishly doing even trivial things like scrolling. Activity Monitor showed *nothing* from Google using the CPU, but WindowServer was taking ~80%, which is abnormally high (it should use <10% normally).\n\nDoing all the normal things (quitting apps, logging out other users, restarting, zapping PRAM, etc) did nothing, then I remembered I had installed Chrome a while back to test a website.\n\nI deleted Chrome, and noticed Keystone while deleting some of Chrome's other preferences and caches. I deleted everything from Google I could find, restarted the computer, and it was like night-and-day. Everything was instantly and noticeably faster, and WindowServer CPU was well under 10% again.\n\nThen something else hit me, my family had been complaining about the sluggish performance of a 2015 iMac since practically the day we bought it. I had tried everything I could think of – it had a Fusion drive and the symptoms were consistent with a failing SSD – but drive diagnostics always turned up nothing. We even went as far as to completely wipe and set up the computer fresh multiple times.\n\nThen I remembered, installing Chrome was always one of the first things we did when we set up the computer. I deleted Chrome, and all the files Keystone had littered on the computer, restarted, and it was so snappy it felt like a brand new computer.\n\nYeah, I realize this sounds like a freakin' infomercial, but it worked so well I spent $5 on a domain name and set up this website even if it makes me sound like a raving nut.\n\n**OK that’s weird, how do you delete Chrome and Keystone?**\n\n1.\tGo to your `/Applications` folder and drag Chrome to the Trash.\n2.\tIn the Finder click the Go menu (at the top of the screen), then click \"Go to Folder...\".\n3.\tType in `/Library` and hit enter. (Check the following folders: LaunchAgents, Application Support, Caches, Preferences. Delete all the Google folders, and anything else that starts with com.google... and com.google.keystone...)\n4.\tGo to \"Go to Folder...\" again.\n5.\tType in ~/Library and hit enter. (Note the \"~\") (Check the following folders: LaunchAgents, Application Support, Caches, Preferences.Delete all the Google folders, and anything else that starts with com.google... and com.google.keystone...)\n6.\tEmpty the Trash, and restart your computer.\n\n**Now what browser should I use?**\n\n[Safari](https://www.apple.com/safari/) is good and it's already on your Mac. It's fast and efficient. If you need a Chromium-based browser, use [Brave](https://brave.com/) or [Vivaldi](https://vivaldi.com/). [Firefox](https://www.mozilla.org/en-US/firefox/new/) has pretty noticeable pointer input latency which (I, the author) am pretty nitpicky about, but other than that it's fine. (Mozilla are a bunch of short-sighted dopes for firing the Servo team. If the Servo team regroups, I'd be inclined to recommend anything they make down the road).\n\n**What’s the deal with Keystone anyway?**\n\nWired first [reported on Keystone](https://www.wired.com/2009/02/why-googles-sof/) in 2009, when Google put it into Google Earth. It has a long history of crashing Macs by doing bizarre things that shouldn't be necessary for auto-update software to function.\n\nThe fact that it hasn't been \"fixed\" in 11 years might mean that it's not actually broken. Why would auto-update software need to take up a massive portion of CPU on a ton's of people's computers, all while hiding itself?\n\nTo all the good people at Google who work on Chrome: something is going on between the code you're writing and what is happening on people's computers. I hope you can track it down and give us an honest postmortem.\n\nSource : **[link](https://chromeisbad.com/)**\n\nVery interesting finds : **[Threads](https://twitter.com/lorenb/status/1337833697698066432?s=20)**\n\nEdit : I have not written this article. Thought it was worth sharing with others. You might face the issue , or you might not. Doesn’t mean that you should personally attack others. If the issue affects even 0.1% of users it should be fixed IMO. \n\nHave a good day!",
        "created_utc": 1607831973.0,
        "subreddit_name": "apple",
        "comments": 759
    }
]