[
    {
        "title": "If you’re young, you should be dumping every dollar you can afford into the stock market.",
        "score": 5488,
        "url": "https://www.reddit.com/r/stocks/comments/ulzleh/if_youre_young_you_should_be_dumping_every_dollar/",
        "content": "If you aren’t 10 years or less from retirement, you should be excited about the upcoming potential recession or market correction. These happen from time to time and historically speaking, every recession is a perfect time to get a decent position in whatever your favorite Blue chip companies are(that is of course if during the recession you have any spare money to begin with). Companies like Apple and Microsoft are recession proof and these current prices are at a great discount. Yes, the market could keep going lower, that’s why dollar cost averaging strategies exist, but please, don’t neglect to invest in this bloody red market. In 5 years, you will be thanking yourself.\n\nEdit: I’m not a boomer lol. Im 26. The whole idea that I was a boomer bag holder is ridiculous because even if it were true, are people here actually stupid enough to think that a post with 5k upvotes swings the market in any direction? Yes, this might not be the bottom but “time in the market beats timing the market.” I even got made of fun of for not giving individual recommendations yet had I gave recommendations it would have been people getting upset about that too. Lastly, I don’t literally mean eat ramen and invest every dollar you can lol. But whatever, Reddit mob.",
        "created_utc": 1652125768.0,
        "subreddit_name": "stocks",
        "comments": 2023
    },
    {
        "title": "Sub is full of hypocrites, time and time again people say \"don't trade on emotion\" \"buy the dip\" and then it's non-stop bitching on red days",
        "score": 2445,
        "url": "https://www.reddit.com/r/stocks/comments/ultg18/sub_is_full_of_hypocrites_time_and_time_again/",
        "content": "Yes, the market is red again and spy is dumping again. Something anyone who looked at a chart can tell you. Or maybe the fact when politicians started selling stocks essentially called the top. What's funny is look through post history of all the people who were freaking out and they were all like \"lol strong economy bears can't scare me\" \"Inflation will be irrelevant when supply issues are fixed\" \"buy the dip\" \"The bottom is here because I inverse reddit.\"\n\nWhat happened to conviction? What happened to dollar cost average? What happened to \"long-term\". You guys preach don't trade on emotion but then you post it?????",
        "created_utc": 1652109160.0,
        "subreddit_name": "stocks",
        "comments": 424
    }
]