[
    {
        "title": "Intel awarded up to $8.5 billion in CHIPS Act grants, with billions more in loans available",
        "score": 471,
        "url": "https://www.reddit.com/r/stocks/comments/1bjd2an/intel_awarded_up_to_85_billion_in_chips_act/",
        "content": "https://www.cnbc.com/2024/03/20/intel-awarded-up-to-8point5-billion-from-chips-act-with-loans-available.html\n\nThe White House said Intel has been awarded up to $8.5 billion in CHIPS Act funding, as the Biden administration ramps up its effort to bring semiconductor manufacturing to U.S. soil.\n\nIntel could receive an additional $11 billion in loans from the CHIPS and Science Act, which was passed in 2022. The awards will be announced by President Joe Biden in Arizona on Wednesday.\n\nThe money will help “leading-edge semiconductors made in the United States” keep “America in the driver’s seat of innovation,” U.S. Secretary of Commerce Gina Raimondo said on a call with reporters. Intel and the White House said their agreement is nonbinding and preliminary and could change.\n\nIntel has long been a stalwart of the U.S. semiconductor industry, developing chips that power many of the world’s PCs and data center servers. However, the company has been eclipsed in revenue by Nvidia, which leads in artificial intelligence chips, and has been surpassed in market cap by rival AMD and mobile phone chipmaker Qualcomm.\n\nEven with its slide relative to its peers, Intel is uniquely situated in the industry because it operates chip factories, or fabs, in addition to designing processors. AMD and Nvidia, are fabless, which means they design the chip, then send computer files and staff to Taiwan’s TSMC for the manufacturing of the device.\n\nTSMC has dominated the leading edge of semiconductor manufacturing in recent years, so all of the world’s fastest processors are physically built in Taiwan.\n\nThat’s a big reason why Intel was long expected to be one of the largest beneficiaries of the CHIPS (Creating Helpful Incentives to Produce Semiconductors) Act, which targeted the unlocking of nearly $53 billion in incentives for domestic chip technology. A key motivation behind the CHIPS Act was to encourage companies to build fabs on U.S. soil to prevent a supply disruption should China ever invade Taiwan.\n\nIntel said it would spend its CHIPS Act funds on fabs and research centers in Arizona, Ohio, New Mexico and Oregon. The company previously announced plans to spend $100 billion on U.S. programs and facilities. Intel has announced a plan to catch up in leading-edge manufacturing by 2026.\n\nIntel’s Ohio fab will cost more than $20 billion and Intel said it is expected to start production in 2027 or 2028. Intel is also expanding manufacturing operations in Arizona and New Mexico. Intel says the projects will create jobs for 20,000 people in fab construction and 10,000 people in chip manufacturing.\n\nThe Ohio fab will make AI chips for Intel as well as potentially fabricate AI chips for other semiconductor companies, Intel CEO Pat Gelsinger said on a call with reporters.\n\n“Go drive by the Ohio site,” Gelsinger said. “There are a whole lot of cranes and concrete job trucks that are building what we believe will become the premier manufacturing location, at scale, particularly for AI chips in America.”\n\nGlobalFoundries, Microchip, and BAE Systems have already received CHIPS Act money, according to the Semiconductor Industry Association. TSMC is expected to receive CHIPS Act funds for a fab in Arizona that will be used for Apple and AMD chips.",
        "created_utc": 1710940226.0,
        "subreddit_name": "stocks",
        "comments": 92
    },
    {
        "title": "Apple reportedly ’accelerating’ entry-level Vision Pro — and it could cost $2,000 less",
        "score": 2570,
        "url": "https://www.tomsguide.com/computing/vr-ar/apple-reportedly-accelerating-entry-level-vision-pro-and-it-could-cost-dollar2000-less",
        "content": "",
        "created_utc": 1710895453.0,
        "subreddit_name": "apple",
        "comments": 527
    },
    {
        "title": "Apple removed Alexei Navalny's app after Kremlin demand",
        "score": 1796,
        "url": "https://twitter.com/ioannZH/status/1770508878901280821",
        "content": "",
        "created_utc": 1710967547.0,
        "subreddit_name": "apple",
        "comments": 323
    },
    {
        "title": "Epic will take 12% cut of Epic Games Store sales when it launches on iPhone this year",
        "score": 1722,
        "url": "https://9to5mac.com/2024/03/20/epic-will-take-12-cut-of-epic-games-store-sales-when-it-launches-on-iphone-this-year/",
        "content": "",
        "created_utc": 1710967090.0,
        "subreddit_name": "apple",
        "comments": 506
    },
    {
        "title": "Justice Department to Sue Apple for Antitrust Violations as Soon as Thursday",
        "score": 853,
        "url": "https://www.bloomberg.com/news/articles/2024-03-20/doj-to-sue-apple-for-antitrust-violations-as-soon-as-thursday",
        "content": "",
        "created_utc": 1710971262.0,
        "subreddit_name": "apple",
        "comments": 470
    },
    {
        "title": "iPhone 16 to Adopt Ultra-Thin Bezel Technology to Maximize Display",
        "score": 794,
        "url": "https://www.macrumors.com/2024/03/20/iphone-16-ultra-thin-bezels-rumor/",
        "content": "",
        "created_utc": 1710932911.0,
        "subreddit_name": "apple",
        "comments": 273
    }
]