[
    {
        "title": "Intel awarded up to $8.5 billion in CHIPS Act grants, with billions more in loans available",
        "score": 471,
        "url": "https://www.reddit.com/r/stocks/comments/1bjd2an/intel_awarded_up_to_85_billion_in_chips_act/",
        "content": "https://www.cnbc.com/2024/03/20/intel-awarded-up-to-8point5-billion-from-chips-act-with-loans-available.html\n\nThe White House said Intel has been awarded up to $8.5 billion in CHIPS Act funding, as the Biden administration ramps up its effort to bring semiconductor manufacturing to U.S. soil.\n\nIntel could receive an additional $11 billion in loans from the CHIPS and Science Act, which was passed in 2022. The awards will be announced by President Joe Biden in Arizona on Wednesday.\n\nThe money will help “leading-edge semiconductors made in the United States” keep “America in the driver’s seat of innovation,” U.S. Secretary of Commerce Gina Raimondo said on a call with reporters. Intel and the White House said their agreement is nonbinding and preliminary and could change.\n\nIntel has long been a stalwart of the U.S. semiconductor industry, developing chips that power many of the world’s PCs and data center servers. However, the company has been eclipsed in revenue by Nvidia, which leads in artificial intelligence chips, and has been surpassed in market cap by rival AMD and mobile phone chipmaker Qualcomm.\n\nEven with its slide relative to its peers, Intel is uniquely situated in the industry because it operates chip factories, or fabs, in addition to designing processors. AMD and Nvidia, are fabless, which means they design the chip, then send computer files and staff to Taiwan’s TSMC for the manufacturing of the device.\n\nTSMC has dominated the leading edge of semiconductor manufacturing in recent years, so all of the world’s fastest processors are physically built in Taiwan.\n\nThat’s a big reason why Intel was long expected to be one of the largest beneficiaries of the CHIPS (Creating Helpful Incentives to Produce Semiconductors) Act, which targeted the unlocking of nearly $53 billion in incentives for domestic chip technology. A key motivation behind the CHIPS Act was to encourage companies to build fabs on U.S. soil to prevent a supply disruption should China ever invade Taiwan.\n\nIntel said it would spend its CHIPS Act funds on fabs and research centers in Arizona, Ohio, New Mexico and Oregon. The company previously announced plans to spend $100 billion on U.S. programs and facilities. Intel has announced a plan to catch up in leading-edge manufacturing by 2026.\n\nIntel’s Ohio fab will cost more than $20 billion and Intel said it is expected to start production in 2027 or 2028. Intel is also expanding manufacturing operations in Arizona and New Mexico. Intel says the projects will create jobs for 20,000 people in fab construction and 10,000 people in chip manufacturing.\n\nThe Ohio fab will make AI chips for Intel as well as potentially fabricate AI chips for other semiconductor companies, Intel CEO Pat Gelsinger said on a call with reporters.\n\n“Go drive by the Ohio site,” Gelsinger said. “There are a whole lot of cranes and concrete job trucks that are building what we believe will become the premier manufacturing location, at scale, particularly for AI chips in America.”\n\nGlobalFoundries, Microchip, and BAE Systems have already received CHIPS Act money, according to the Semiconductor Industry Association. TSMC is expected to receive CHIPS Act funds for a fab in Arizona that will be used for Apple and AMD chips.",
        "created_utc": 1710940226.0,
        "subreddit_name": "stocks",
        "comments": 92
    },
    {
        "title": "Apple reportedly ’accelerating’ entry-level Vision Pro — and it could cost $2,000 less",
        "score": 2570,
        "url": "https://www.tomsguide.com/computing/vr-ar/apple-reportedly-accelerating-entry-level-vision-pro-and-it-could-cost-dollar2000-less",
        "content": "",
        "created_utc": 1710895453.0,
        "subreddit_name": "apple",
        "comments": 527
    },
    {
        "title": "Apple removed Alexei Navalny's app after Kremlin demand",
        "score": 1796,
        "url": "https://twitter.com/ioannZH/status/1770508878901280821",
        "content": "",
        "created_utc": 1710967547.0,
        "subreddit_name": "apple",
        "comments": 323
    },
    {
        "title": "Epic will take 12% cut of Epic Games Store sales when it launches on iPhone this year",
        "score": 1722,
        "url": "https://9to5mac.com/2024/03/20/epic-will-take-12-cut-of-epic-games-store-sales-when-it-launches-on-iphone-this-year/",
        "content": "",
        "created_utc": 1710967090.0,
        "subreddit_name": "apple",
        "comments": 506
    },
    {
        "title": "Justice Department to Sue Apple for Antitrust Violations as Soon as Thursday",
        "score": 853,
        "url": "https://www.bloomberg.com/news/articles/2024-03-20/doj-to-sue-apple-for-antitrust-violations-as-soon-as-thursday",
        "content": "",
        "created_utc": 1710971262.0,
        "subreddit_name": "apple",
        "comments": 470
    },
    {
        "title": "iPhone 16 to Adopt Ultra-Thin Bezel Technology to Maximize Display",
        "score": 794,
        "url": "https://www.macrumors.com/2024/03/20/iphone-16-ultra-thin-bezels-rumor/",
        "content": "",
        "created_utc": 1710932911.0,
        "subreddit_name": "apple",
        "comments": 273
    },
    {
        "title": "I'm a full time trader and this is everything I'm watching and analysing in premarket ahead of FOMC meeting today.",
        "score": 159,
        "url": "https://www.reddit.com/r/Daytrading/comments/1bjc12e/im_a_full_time_trader_and_this_is_everything_im/",
        "content": "**ANALYSIS:**\n\n* Yesterday, we saw an early dip in the equity markets as SPX touched 5123, and QQQ touched 433.\n* However, as mentioned in the premarket report and continually mentioned in my commentaries, traders remain incredibly short volatility. \n* AS such, that created the usual vix crush as we see here, with VIX dropping below 13.\n* [https://imgur.com/a/KfchMYf](https://imgur.com/a/KfchMYf) \n* This fuelled market makers to add liquidity, which led to the usual intraday recovery back to 5180 and 438.5. \n* Today, we have the FOMC meeting which will be the key focus, as will the updated dot plot which will be released. \n* We are seeing low volume in options ahead of this, as traders are basically waiting for it. \n* On January and February CPI coming in ahead of expectations, and with Shelter and Core inflation remaining very sticky, there is some likely expectation that Powell will be less dovish. \n* I think that’s probably true, he will be more hawkish, but it appears traders are not expecting him to be outright hawkish as such. \n* Probably more neutral, pointing to the fact that inflation is coming down, and will affirm their intention to continue bringing inflation down. He will probably continue to say that they just need to see more of the same before moving to cutting. More of the usual data dependence commentary, but with hints that cuts will still be on the table. \n* Credit Default swaps don’t show any signs of major alarm, and continue to head lower. \n* [https://imgur.com/a/PTPNoBo](https://imgur.com/a/PTPNoBo) \n* Traders are hedging into today’s meeting. Dollar is increasing in premarket. Nonetheless, traders remain very short volatility still. Inflation swaps are still pricing inflation to come down later in the year, even if it appears that it is stuck for now. \n* I think that off the back of this, we do probably see dollar increase, hence why I haven’t averaged my positions against USD today and averaged with very little size yesterday. Looking at the equity market, we probably see some volatility, and a dip, but vol will probably crush again, so any VIX spike probably won’t last long, which should again fuel market makers to add liquidity to aid the recovery (not necessarily same day recovery, but short term nonetheless). \n* On next monthly expiry, we have seen 5300 accumulate gex quite a bit recently, so traders are still looking higher, but hedge for some volatility.\n* As mentioned previously, we can see traders open puts inr response to a possible hawkish Powell, and then get squeezed again and forced to short cover, as we have seen repeatedly over the course of this rally, and as we saw on Monday. Shorting probably not the way forward as traders are still bullish on medium expiries. \n\n**DATA LEDE**\n\n* China maintain their loan prime rate for 1 year and 5 year at current rates\n* UK INFLATION\n* Core inflation falls to 4.5%, below estimates of 4.6%. Previous reading was 5.1%, where it was stuck for the last 3 months. \n* Headline inflation came 3.4%, below estimates fo 3.5% and down from 4% where it was for last 3 months. \n* Largest downward contributions came from food, restaurants and cafes.\n* Biggest upward contributions came form housing and motor fuels. \n* This is an encouraging print, pointing to possible dovish BOE. Following the print, futures now point to 71 bps of BoE cuts by year end, vs 67bps before the print.  \n* EIA Crude Stock Data \n* Of course, the main focus of today is the Fed decision, and Powell’s press conference. \n* Dot plot will be released with the report. Could show we have taken another cut out of there. \n\n—————\n\n**MARKETS:**\n\n* SPX: Yesterday, we saw early dip to 5125 level, before big push higher to close at 5180. In premarket has been flat. \n* Nasdaq: Back above 18k, after dip to 17,810 yesterday. Closed yesterday above 18k\n* GER40: Above 18k. \n* Nikkei higher again today as JPY sells off. \n* Hong Kong: flat today\n* Oil hit multi month highs yesterday at 83 but retreated back to 82 today, on a stronger dollar. \n\n**FOREX:**\n\n* Dollar higher ahead of FOMC decision. \n* USDJPY hits 151.7, as traders move short on yen and are long USD into the Fed meeting. \n* They shift short on Yen as BOJ disappoint by maintaining bond buying and also pointing at not start of hiking cycle. \n* GBP temporarily dipped after soft inflation print, but recovered. \n* GBPUSD still down as DXY rises ahead of FOMC\n* USDJPY at 151.7\n* GBPUSD back below 1.27, trading at 1.2695\n* EURUSD at 1.08414, testing lows of yesterday\n* AUDUSD at 0.65182\n\n**MAG 7 News:**\n\n* NVDA - Goldman Sachs raises price target to 1000 from 875. NVDA stock price currently stuck below the 900 level, leading to volatility. \n* NVDA - Deutsche raise price target to 850 from 720. Said that they are continuing to deliver on their top notch suite of products. \n* NVDA - Citigroup raise target to 1030 from 820. \n* NVDA CFO says there may be supply constraints in meeting all their demand. They said they see annual market opportunity for data centres as $250B and foresee they will see bigger share of that than competitors. \n* TSLA - are up in premarket as they raise the price of China produced Model Y vehicles from April. \n* TSLA - a Canadian in China was arrested in New York for alleged theft of Tesla trade secrets, which he planned to sell.\n* NFLX up as Price target raised to 705 from 580 by Keybanc\n* NFLX - expanding its NFL universe with new project in conjunction with NFL films. Program will be called “receiver” which will follow 5 of the leagues best receivers. \n* MSFT - names DeepMind cofounder Mustafa Suleyman as its head of AI. \n* AAPL - CEO Tim Cook is in Shanghai, in focus as Apple struggle with declining China sales. \n\n**EARNINGS:**\n\n**GIS:**\n\n* ADJ EPS $1.17 vs. $0.97 y/y, EST $1.05 \n* ADJ gross margin 34% vs. 33.8% y/y, EST 34.4%\n* Net sales $5.10B, -0.5% y/y, EST $4.99B\n* North America Retail Net Sales $3.24B, +0.3% y/y, EST $3.14B\n* International net sales $680.1M, -2.9% y/y, EST $704.9M\n\n**COMPANY SPECIFIC:**\n\n* Samsung is up 5% as NVDA signals interest in using their memory chips for their GPUs. \n* Samsung said they expect 100m or more in sales from advanced chip packaging business. \n* Kering plunges 15% in europe after reporting declining Gucci sales in Asia\n* BA - will constrain 737 production below 38 a month. They said they won’t rush or go too fast. They do this to try to boost the quality. Said they will feel the impact of this constraint over next several months. Bearish for BA. \n* INTC - intel wins almost $20B in Chips Act incentives for US plants. \n* AIrlines - US airline passenger travel will set new record in march and April, up 6% over 2023 levels. \n* DIS - Disney+ eras tour film garnered 4.6M views in opening weekend. \n* DIS - ESPN secures college football playoff rights until 2031. \n* Coin - say that Bitcoin funds have not cannibalised their business. \n* CMG - announces historic 50-1 stock split. \n* PDD pops on earnings, after profits jump way ahead of estimates, and consumer sentiment improves. \n* JBLU - axes their routes from LA to Latin America and more in cost cutting strategy. Focusing on core markets. \n* Lonza will buy large biologics site from Roche in US for $1.2B\n* SMCI down as the company secures their $1.8B equity raise\n* PTCT up after announcement of key regulatory updates\n* MBLY and Volkswagen to work together to bring new automated driving functions to series production. Intensifies collaboration\n* RIOT - raised to overweight form Neutral by JPM, price target 15. MARA slightly up in sentiment\n* XPEV - analyst issues sell rating amid “mounting challenges”\n* BBY - raised to outperform at Telsey, price target 95\n* IP - raised to Buy at Citi, price target 46\n\n**OTHER NEWS:**\n\n* Bitcoin touched 2 week low of 61.5k before bounce higher. \n* Lagarde Speech:\n* Reinforced that June data is key for the rate cut decision. \n* Meeting by meeting approach\n* There are reasons to believe that disinflation can continue. \n* Even once we cut once, doesn’t mean we can predict the full rate cut cycle. \n* Wage data is encouraging. \n* UK chancellor Hunt: \n* As inflation comes down, it opens door for Bank of England to bring down rates. Dovish. \n* ECB’s Makhlouf: Rates are at top of the ladder and inflation is coming down. \n* AIrlines - US airline passenger travel will set new record in march and April, up 6% over 2023 levels. \n* Modi agrees to deepen and expand India-Russia partnership. \n* Space X CFO says Starlink IPO won’t occur in 2024. \n* Russia says reports that Musk’s SpaceX are making spy satellites for US military, tells them that now commercial satellites are now legitimate targets. \n* Argentinians are buying Bitcoin at highest level in 2 years, as they look to protect themselves from 276% inflation. Interesting that they are not rushing to buy USDs but are instead going for Bitcoin. \n* Macron launches crackdown on French drug gangs\n* Saudi Arabia will look for a $40B push into artificial intelligence. They want to invest in tech startups that are to do with AI. \n* FDA says there are widespread safety issues with China made syringes",
        "created_utc": 1710936992.0,
        "subreddit_name": "DayTrading",
        "comments": 18
    }
]