[
    {
        "title": "Last year I bought my 82 year old, Serbian grandmother an iPad.",
        "score": 4783,
        "url": "https://www.reddit.com/r/apple/comments/bibchi/last_year_i_bought_my_82_year_old_serbian/",
        "content": "As the title says, last year I bought my 82 year old grandmother an iPad. She never owned a smart device before, she never touched a computer and I don't think she knew what \"the internet\" was.\n\nIt was my fathers idea to get her that iPad. Thanks to me, my dad became a huge fan of Apple devices and since both he and I spend the majority of our time overseas he thought it would be a good idea to get my grandmother an iPad so they could face time and he could show her where he is etc.\n\nTBH I thought it was an incredibly stupid idea. My grandmother is an Eastern European, ex communist country simple, old woman. Imagine old grandmothers from funny \"a normal day in Russia\" clips and gifs, that's what she looks like. First 15 years of her life she spent in a village that had no electricity. Over the last 30 years we've spent more time talking about her inability to handle a tv remote than anything else. \n\nSo I made a deal with my dad that yes, I'll buy it and take it to her but I won't be involved in teaching her how to use it, that's on him.\n\nTo cut the story short, at first there were issues, she was pressing the screen in extremely awkward ways and it took her a week or two to simply learn how to touch the screen, how to drag the finger etc but she did learn.\n\nMy dad explained how everything works slowly, talking with her on the phone, patiently teaching her what to do step by step. A few months later she was texting me through iMessage, she was typing and sending messages, then she started using emojis. First time I got an emoji from her I had to call and make sure it was actually her who did it. \n\nThere were a few comical setbacks. Once she turned on \"airplane\" mode by accident and my dad couldn't explain to her how to turn it off so I had to travel 3 hours (we don't live in the same city) just to turn it off.\n\nThen she learned how to use the camera, she took and sent us pictures of her garden and the weather and the telephone bill and all kinds of other shit. She learned how to google different recipes, how to read local news, how to use google maps, youtube. It was all very clumsy but she made it work.\n\nLast week the iPad stopped charging, it's at the repair shop right now. She just called me and told me how much money she has and asked if that's enough for a new iPad because it's been days and she doesn't want to be without it anymore.\n\nAnd even though I did try to describe what my grandmother is like I think that out of respect and love towards her I still understated just how unlikely it is that a person like her managed to learn how to use a modern tech device. \n\nIt made me appreciate just how great of a product the iPad is. How great the design, the way the device works, is.",
        "created_utc": 1556458937.0,
        "subreddit_name": "apple",
        "comments": 198
    }
]