[
    {
        "title": "Tesla hits $1T Market Cap for the first time since 2021",
        "score": 609,
        "url": "https://www.reddit.com/r/stocks/comments/1gmkxwf/tesla_hits_1t_market_cap_for_the_first_time_since/",
        "content": "The recent rally this week has pushed it over $1T again.  \n\n\n1Mo: +28%  \n3Mo: +59%  \nYTD: +24%  \n\nThere are now nine $1T Market Cap companies: Nvidia, Apple, Microsoft, Amazon, Alphabet, Saudi Aramco, Meta, TSMC, Tesla. Honorable mention to Berkshire who's just under.",
        "created_utc": 1731079188.0,
        "subreddit_name": "stocks",
        "comments": 473
    },
    {
        "title": "r/Stocks Daily Discussion & Fundamentals Friday Nov 08, 2024",
        "score": 16,
        "url": "https://www.reddit.com/r/stocks/comments/1gmfiqh/rstocks_daily_discussion_fundamentals_friday_nov/",
        "content": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.\n\nExpect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nBut growth stocks don't rely so much on EPS or revenue as long as they beat some other metric like subscriber count:  Going from 1 million to 10 million subscribers means more revenue in the future.\n\nValue stocks do rely on earnings reports, investors look for wall street expectations to be beaten on both EPS & revenue.  You'll also find value stocks pay dividends, but never invest in a company solely for its dividend.\n\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia page](https://www.investopedia.com/fundamental-analysis-4689757/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp) and read [their PDF on the topic.](http://i.investopedia.com/inv/pdf/tutorials/fundamentalanalysis_intro.pdf)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1731061810.0,
        "subreddit_name": "stocks",
        "comments": 420
    },
    {
        "title": "MBLY is the next Trump / Elon stock. 10 bagger\n",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gms5yq/mbly_is_the_next_trump_elon_stock_10_bagger/",
        "content": "MBLY (Mobileye) is the leader in autonomous driving technology supplying automakers. Elon will push Trump to encourage the expansion of autonomous driving for his Tesla Full Self Driving and robotaxis. Only three companies can do full autonomous driving: Tesla, Google’s Waymo, and Mobileye. Automakers will have to respond and they aren’t going to use Tesla or Waymo since those are competitive threats. The only viable solution will be MBLY.\n\nMBLY already announced Volkswagen as their first main autonomous driving win. At their upcoming Dec 9th analyst day, we may get more announcements. A year from now, all of the big 10 automakers will have a plan for autonomous driving and most of them likely select MBLY.\n\nEach customer like Volkswagen is \\~$3b revenue a year (9m cars @ 25% attach rate @ $1500 ASP). MBLY’s current revenue is $2b. So by 2028, MBLY’s revenue could be $15b vs $2b today. Meanwhile the stock is on lows due to near-term noise around weak total auto units industry wide, etc, creating a great entry point.\n\n$MBLY is my next 10 bagger. In 2027, the stock will be $170.",
        "created_utc": 1731097553.0,
        "subreddit_name": "stocks",
        "comments": 14
    },
    {
        "title": "Biden Admin Rushing to Distribute CHIPS Act Funds Before Trump Enters Office",
        "score": 5335,
        "url": "https://www.bloomberg.com/news/articles/2024-11-08/trump-s-win-sets-off-race-to-complete-chips-act-subsidy-deals?embedded-checkout=true",
        "content": "$INTC",
        "created_utc": 1731106776.0,
        "subreddit_name": "wallstreetbets",
        "comments": 563
    },
    {
        "title": "Tesla hits $1 trillion market cap as stock rallies",
        "score": 2487,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gmn0xi/tesla_hits_1_trillion_market_cap_as_stock_rallies/",
        "content": "“Tesla shares surged more than 6% on Friday, pushing the company’s market cap past $1 trillion for the first time.\n\nThe stock has been on a tear this week as investors bet that Tesla and CEO Elon Musk will benefit from a potential Trump administration.”\n\nSource: https://www.cnbc.com/2024/11/08/tesla-hits-1-trillion-market-cap-as-stock-rallies-after-trump-win.html",
        "created_utc": 1731084498.0,
        "subreddit_name": "wallstreetbets",
        "comments": 776
    },
    {
        "title": "$TSLA 0DTEs $2850 -> $40,300",
        "score": 2012,
        "url": "https://i.redd.it/j0921dts9pzd1.jpeg",
        "content": "Bought last night before close. Expected a $300 breach today and knew all of those hedgies that were short would get their assholes blown apart. The instant gap from 299.9x to 301.xx+ when it happened I knew it was gonna run hard. Locked these fuckers in before they went to 0\n\ngg ez no re",
        "created_utc": 1731081411.0,
        "subreddit_name": "wallstreetbets",
        "comments": 280
    },
    {
        "title": "Intel Brings Back The Free Coffee",
        "score": 764,
        "url": "https://www.msn.com/en-in/money/topstories/intel-brings-back-free-coffee-to-boost-employees-morale-amid-massive-cost-cutting-efforts/ar-AA1tIMDj?ocid=finance-verthp-feeds",
        "content": "",
        "created_utc": 1731077108.0,
        "subreddit_name": "wallstreetbets",
        "comments": 174
    },
    {
        "title": "I (only) lost $32k shorting TSLA this month ",
        "score": 599,
        "url": "https://www.reddit.com/gallery/1gmllyz",
        "content": "Hello fellow degens, some of you may remember my earlier post about making $70k shorting TSLA this year (https://www.reddit.com/r/wallstreetbets/comments/1g9hus6/70k_profit_from_shorting_tsla/). \n\nAs you can guess this strategy has not worked well this month and my YTD profit from my favorite EV company is now down to $40k (see second pic)\n\nBut please indulge my big brain boast about not completely fucking it up because in an alternate universe, I would have completely wiped my portfolio. Instead, I had the audacity to do something unheard of in this sub: RisK MiTigAtiOn.\n\nBasically at the height of my profits I transferred most of my money out of my margin trading account and into another cash trading account (and into basic bitch ETFs). This saved my ass because I would definitely would have gone full regard and shorted TSLA with a position 3x larger than what I actually did = 3x larger loss.\n\nSo for you fellow degens who have mooned recently, congrats, fuck you, and consider implementing measures to curb your degeneracy. Lock your gains into ETFs, change your account from margin to cash, or transfer your assets to your wife or to her boyfriend since it’ll eventually go to him anyway.\n\nIn any case, see you at Wendy’s. ",
        "created_utc": 1731080933.0,
        "subreddit_name": "wallstreetbets",
        "comments": 139
    },
    {
        "title": "440% from Tesla calls pre and post election.",
        "score": 267,
        "url": "https://www.reddit.com/gallery/1gmt9ct",
        "content": "I was having trouble profiting due to election uncertainty. I had VRT calls and a TSLA calls before the election. I watched overnight as Trump won, and Tesla shot up and increased by $30. Lots of poll analyzation led me here and I sure am lucky. My account closed today at around $8,400, a 440% increase since the start of the week.",
        "created_utc": 1731100377.0,
        "subreddit_name": "wallstreetbets",
        "comments": 47
    },
    {
        "title": "You will always be my king",
        "score": 264,
        "url": "https://i.redd.it/0hlkz9642pzd1.jpeg",
        "content": "On Monday I made the decision to purchase my king (NVDA)\n\nI DD on it and I will always trust my king 👑 ",
        "created_utc": 1731078831.0,
        "subreddit_name": "wallstreetbets",
        "comments": 35
    },
    {
        "title": "TSLA Calls $1.1k -> $12.5K",
        "score": 227,
        "url": "https://i.redd.it/s4ytfasv0rzd1.jpeg",
        "content": "Bought 4 TSLA 11/8 calls 1 week ago and closed them the morning after the election. My best trade ever",
        "created_utc": 1731102629.0,
        "subreddit_name": "wallstreetbets",
        "comments": 9
    },
    {
        "title": "Taking my tesla profits yolo into Coin yolo 30k to the dream",
        "score": 163,
        "url": "https://i.redd.it/95uwy4hdxpzd1.jpeg",
        "content": "Started with 1k this last week. Made 50k on tesla this week. Decided that im going to risk profits to get to valhalla or die trying and spend rest of my life behind wendys. Withdrawing 20k profit from this week so at the worst wont lose it all but so much to gain right?",
        "created_utc": 1731089339.0,
        "subreddit_name": "wallstreetbets",
        "comments": 133
    },
    {
        "title": "Up $110k on TSLA LEAPs so far",
        "score": 97,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gmua3r/up_110k_on_tsla_leaps_so_far/",
        "content": "Entered most of these in the Spring time, buying at \\~$150 to low $200s. Mostly LEAPs, and 100 shares\n\nhttps://preview.redd.it/cs7ccvd52rzd1.jpg?width=1320&format=pjpg&auto=webp&s=d57cc19e407460316e79de156c99bd2045b7d8d3\n\nhttps://preview.redd.it/jvlp7n362rzd1.jpg?width=1320&format=pjpg&auto=webp&s=9356090bd38cd64259715716e1a3f3cb7bbf764e\n\n",
        "created_utc": 1731103060.0,
        "subreddit_name": "wallstreetbets",
        "comments": 9
    },
    {
        "title": "SPY calls for the win",
        "score": 57,
        "url": "https://i.redd.it/dff2tkr5wqzd1.jpeg",
        "content": "Got sick of having to do on individual stocks .. so liquidated a ton of aapl options and dumped into long dated SPY calls ",
        "created_utc": 1731101037.0,
        "subreddit_name": "wallstreetbets",
        "comments": 12
    },
    {
        "title": "Lost over 6k after trading options ",
        "score": 47,
        "url": "https://i.redd.it/9pdl7mjbdpzd1.jpeg",
        "content": "Decided to go into SMCI options but lost 6 in the past month due to selling too early. Hopefully Tesla or Nvdia can bring me back to life like they usually do. ",
        "created_utc": 1731082594.0,
        "subreddit_name": "wallstreetbets",
        "comments": 52
    },
    {
        "title": "What should i do?",
        "score": 44,
        "url": "https://i.redd.it/1h72x61wsozd1.jpeg",
        "content": "So i was very lucky when i bought Nvidia a while ago. I already sold half of my stock last year. But now i‘m not sure what the best move would be. Should i hold it for some more years and hope the price will increase? Or will the AI Hype slow down and bring Nvidia back to a \"normal\"price? Or should i put the money into Palantir?",
        "created_utc": 1731075724.0,
        "subreddit_name": "wallstreetbets",
        "comments": 81
    },
    {
        "title": "Lunr ",
        "score": 37,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gmruhb/lunr/",
        "content": "Shits dirt cheap rn I got in at 5$ a few months ago and averaged my way through below 8$ reloads up to 7.45 avg and they have contracts for a few missions with nasa and spacex in jan on the 5th which should bump the share price to 15-20 a share if I hold for 20 yrs I feel like lunr would hit Berkshire Hathaway prices whatchu all think ik long term investments aint really a thing on here lol y'all should buy and hold I feel like she's a diamond in the ruff\n\nhttps://preview.redd.it/zsvv9y4gjqzd1.jpg?width=1179&format=pjpg&auto=webp&s=3165650c87572391914d6f4fc14a03d57dce939f\n\n",
        "created_utc": 1731096723.0,
        "subreddit_name": "wallstreetbets",
        "comments": 15
    },
    {
        "title": "Bullish DAL – High Travel Demand to Continue Driving the Other AI (Airline Industry) Trade, 100k Options Position ",
        "score": 36,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gm64sx/bullish_dal_high_travel_demand_to_continue/",
        "content": "Previous DD on DAL ([DD1](https://www.reddit.com/r/wallstreetbets/comments/1fa29yp/first_dd_bullish_on_delta_dal_through_both/), [DD2](https://www.reddit.com/r/wallstreetbets/comments/1fka728/delta_airlines_dal_dd_reaffirmation_of_long/)) outlined how margin expansion is driven by premium, rational supply control, and falling oil prices, which will propel the premium brands of the airline business. This materialized as DAL and UAL continued their rally, with DAL up another 30% to 60 since my previous DD, primarily driven by US election results and the Trump Trade.  \n\nWith the upcoming holiday season, tourism and air travel are at the top of mind – DAL and UAL are two domestic airlines best positioned on international, premium, and holiday travel. While UAL offers more INTL, DAL leads in premium and reliability, which are essential for vacation trips. \n\nTo get ahead of the holiday season, we aim to gain insight and forecast holiday travel demand and color on air travel going into 2025. With the recent election, recent MAR, ABNB, and EXPE earnings, and shifting macro trends, this post will focus more on forecasting and market dynamics rather than idiosyncrasies within the AI and DAL. We will project air travel demand and other factors affecting air travel and justify a bullish position on DAL going into Investor Day 2024 on 11/20. \n\n \n\nOutline \n\n* US Election Impact on Travel Demand, the Airline Industry (AI) \n* Macro and industry trend implications for DAL \n* MAR, ABNB, EXPE earnings and guidance implications for the AI \n* Analysis of DAL's current positioning, performance, and upcoming catalysts \n* My Positions \n\nUS Election, Trump Trade Impact on Airline Industry (AI) \n\nLargely under the radar, the AI is part of the larger Trump Trade due to the following factors (https://www.wsj.com/livecoverage/fed-meeting-interest-rate-inflation-today-11-07-2024/card/heard-on-the-street-trump-makes-airlines-great-again-but-why--F7MJW5QDNenQ6RoKscio) \n\n* Green light for M&A (Spirit and JetBlue) to transform the AI landscape \n* Deregulation for AI, 2016 precedent \n* Falling energy and oil prices with increased US production, 2016 precedent \n* Ending wars in Ukraine, the Middle East part of 2024 campaign promise \n* Fiscal policy to boost economy and both consumer and corporate spending, driving air travel demand \n* Tariffs and other fiscal policy to strengthen the dollar, boosting INTL travel (https://www.marcus.com/us/en/resources/heard-at-gs/what-a-strong-us-dollar-means-for-travel) \n\n \n\nMacro and Industry Trends Continue to Favor Airlines  - FED, EXPE earnings, ABNB earnings\n\n* Cutting interest rates globally to boost economic activity continuing into the foreseeable future a tailwind for high-leverage industries such as the AI \n* EXPE air revenue up 4% YoY in Q3 compared to 0% in Q2 and 1.7% in Q1, highlighting positive trends \n* EXPE air bookings up 7.8% YoY in Q3, compared to 6.6% in Q2 and 1.4% in Q1 \n* EXPE cited strong air bookings as a main driver for Q3 performance \n* EXPE raises FY24 outlook, citing growth and opportunities abroad despite previous travel demand concerns \n* EXPE total B2C revenue down 1.4% YoY in Q3 more than offset by 18.4% B2B revenue increase YoY \n* Mild B2C Q3 revenue decrease does signal travel softness, but combined with air revenue increase strengthens thesis for increasing shift to longer distance, INTL vacation travel \n* ABNB earnings gives insight into travel demand, global \n* ABNB Q3 revenue up 10% YoY \n* Strong performance in core markets (US, Canada, Australia, UK, France) represents 75% of business \n* Sees strong opportunity in expansion into other global markets, bullish sign for INTL travel \n* ABNB performance less informative than EXPE on the AI \n\n \n\nCurrent DAL Performance, Positioning, and Upcoming Catalysts \n\nDAL and UAL are industry leaders well-positioned for the upcoming holiday travel season. I chose to gain exposure through DAL; here is a quick overview of DAL Q3 performance:\n\n* DAL YTD profitability to represent 50% of the AI total \n* Double-digit ROIC twice industry average (UAL comparison unknown) \n* Strong premium, loyalty, and co-spend program revenue representing over 50% of total revenue \n* Projected 30% earnings growth in Q4 on growing demand trends \n* Transatlantic benefiting from US strength likely to continue, transatlantic and domestic strongest trends \n* Corporate sales up 7%, corroborating EXPE B2B numbers \n* AMEX remuneration up 6%, lowering inflation backdrop \n* CEO to give more color on tightening domestic capacity, moat, strategic plan on Investor Day 11/20 \n* Volume growth following 2019 baseline rather than 2023, late summer peak travel shifting later into the fall due to weather trends \n* Less enthusiastic about promotional and marketing compared to UAL – is this the right move competitively? \n* Main cabin underperformance main driver of capacity cuts, premium/main spread increasing but both categories to enjoy expanding margins \n* Innovative technological solutions to drive value, including drones (govt. approved) for maintenance inspections  \n\nThroughout the Q3 earnings call, management emphasized Investor Day 2024 to analysts – signaling it to be a significant catalyst. Historically, DAL Investor Day has been a strong catalyst, with DAL rallying 5% on Investor Day in 2023. With all the mention of Transatlantic and domestic strength, airlines are already ahead of the curve by betting on NA-EU travel this upcoming holiday season (https://www.wsj.com/business/airlines/airlines-bank-on-americans-steady-love-of-european-travel-f64b51b3). As a tangent: potential upcoming trade opportunity will be comparing actual TSA check-in data during the winter months and trade off the spread between current AI optimism on Q4 travel and modeling what the actual data represents. \n\nMy Positions: \n\n* 45 Jan25 $55 Calls \n* 100 Jan25 $60 Calls \n* 150 Jan 25 $70 Calls \n* Total position: 100k in Jan25 options \n\ntldr; who needs NVDA when you have the secret AI (airline industry) trade, already turned 4 bagger trading airlines but I plan on riding this plane to the moon right behind Elon",
        "created_utc": 1731026958.0,
        "subreddit_name": "wallstreetbets",
        "comments": 16
    },
    {
        "title": "A Look at History: A Review of the 7 Bull Markets in U.S. Stocks Over the Past 50 Years",
        "score": 23,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gmlw0m/a_look_at_history_a_review_of_the_7_bull_markets/",
        "content": "Looking back at the history of U.S. stocks, all the bull and bear markets after the Great Depression, it is worthwhile for us to go like a history textbook to learn a little.\nTo rise 20% as the standard, the past 50 years a total of seven bull market, with the A shares of the bear long bull short different, U.S. stock history is a bull long bear short history, the following we review one by one.\n\n\n1. 1970-1973:\nStarting from the famous “Nifty Fifty”, the “ Pretty 50 ‘, the popular investment theme at that time was what we later knew as the ’Pretty 50”, which included a series of high-profile companies such as McDonald's, Coca-Cola, Procter & Gamble, Polaroid, etc. At that time, these stocks were characterized by high earnings growth and high PEs. These companies included McDonald's, Coca-Cola, Procter & Gamble, Polaroid, and a series of other high-profile companies, and at that time, these stocks were characterized by high performance growth, and at the same time, the PE was also very high. From a paper found online that specializes in the study of that time, we see that in 1972 Polaroid PE was 91 times, McDonald's was 86 times, and Coca-Cola was 48 times. Eventually, the bubble burst in 1973, when the PE of the S&P 500 was 18x\n\n2. 1974-1980:\nDuring that period in the 70's and 80's, inflation was stronger and interest rate levels went all the way up. in 1980, inflation was as high as 13.5% and interest rates were raised to 20%, a figure that might be unimaginable today. In the midst of all this raising of interest rates along the way, this last leg of the bull market came to an end when the PE of the S&P 500 was only 7.5\n\n3. 1982-1987:\nAnother new cycle began, inflation was curbed, interest rates began a long downward spiral that continues to this day, and with various tax cuts, a new bull market was up. The five-year bull market lasted until Black Monday in 1987, when the broad market fell 22% in one day. In fact, the PE of the broad market at that time was not too high, 15 times PE. This crash was rather sudden, and there are also claims that the computerized trading model introduced at that time led to this rapid plunge. However, since then, the meltdown mechanism has been invented\n\n4. 1987-1990:\nThe selloff brought on by Black Monday was quickly followed by a rally, a rallying bull of sorts as the broader market accumulated a 65% gain by 1990. By 1990, interest rates once again stayed high because of the rising oil prices at the time, and the 10% interest rate level was never seen again for 30 years after that. At that time, the broad market PE was 15 times, which was not too high, and the index decline lasted only three months before it was over\n\n5. 1990-2000：\nThe 90's were good and beautiful, and the 10-year-long bull market was about to kick off. This decade the U.S. economy is good, Windows95, Windows98, Yahoo, the Internet has brought unlimited imagination, the feeling is not immediately into the new century, but into the new world. Ten years, the general market rose more than 4 times, are epic. Eventually the internet bubble bubbled, Amazon went from a high of 100 bucks, down to a few bucks, while the S&P 500 lost 50% of its value\n\n6. 2002-2007:\nThe low interest rate level and zero down payment to buy a house, if you are interested, you can go and watch the movie “The Big Short” again, which describes it in a very easy-to-understand way. You can buy a house with no money, and when you do, home prices go up, and you feel happier to spend money when you have money, and the guys get high. Wall Street has repackaged these subprime zero-down mortgages into a product that is complicated for everyone to understand, but looks like an oxymoron, so how can you not make money? The farce had to end, and it did, with the 2008 subprime crisis, which left 8 million people unemployed, 6 million homeless, and the worst financial crisis since the Great Depression in the U.S. Between 2007 and 2009, the S&P 500 lost nearly 60% of its value, Citibank lost 97% of its market capitalization, and Lehman Brothers went bankrupt.\n\n7. 2009-Present:\nAfter the subprime mortgage crisis cleared up, U.S. stocks had one of the longest bull markets in history. It was also an era when large U.S. technology companies became stock market leaders. more than a decade after the release of the iPhone in 2007, Apple became the world's largest company by market capitalization. Microsoft, which had almost been forgotten, returned to the top of its market capitalization after transforming itself into cloud computing. And then there's Amazon, left over from the last Internet bubble, and Google, the Google created during the last Internet bubble, have grown to become giants with market capitalizations of over $2 trillion dollars\n\n The next time?",
        "created_utc": 1731081642.0,
        "subreddit_name": "wallstreetbets",
        "comments": 19
    },
    {
        "title": " Here we go again... back from 2021-2022. TSLA vs. Toyota, BYD, Xiaomi, Ferrari, GM, Porsche, Mercedes... ",
        "score": 14,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gmuh02/here_we_go_again_back_from_20212022_tsla_vs/",
        "content": "Here is the graph showing the market capitalization of Tesla (TSLA) on the left and the cumulative market capitalization of other companies (Toyota, BYD, Ferrari, etc.) on the right.\n\nTesla is represented by the blue bar, while the combined market capitalization of the other companies is represented by the green bar. \n\nhttps://preview.redd.it/5gi0xolh3rzd1.png?width=1979&format=png&auto=webp&s=4562044695d1d98e75caa7268270b849cf970f42\n\nhttps://preview.redd.it/p9uuirtj3rzd1.png?width=1979&format=png&auto=webp&s=5f07bb89178033326c5423d34346efcdd8328094\n\nThat was in 2022: \n\nhttps://preview.redd.it/6234hv7l3rzd1.png?width=1200&format=png&auto=webp&s=eca6f071efff45008c8ea09c8a10dc93972ca64d\n\n  \nAnd in 2021: \n\nhttps://preview.redd.it/drgx5xwm3rzd1.png?width=449&format=png&auto=webp&s=1c5849d50e1ad15e4da3c1e4f26d9d0d5c1c3cdc\n\n",
        "created_utc": 1731103553.0,
        "subreddit_name": "wallstreetbets",
        "comments": 36
    },
    {
        "title": "Nvda calls 11/15",
        "score": 3,
        "url": "https://i.redd.it/s85tx0l63qzd1.jpeg",
        "content": "Buying after the dip today, expecting a boom throughout the week continuing off election pump and rate cut. Thoughts?",
        "created_utc": 1731091292.0,
        "subreddit_name": "wallstreetbets",
        "comments": 14
    },
    {
        "title": "Partnership with MCSU Health and why it matters. ",
        "score": 3,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gmkmi6/partnership_with_mcsu_health_and_why_it_matters/",
        "content": "August 28th SH partnered with MCSU Health. This was part of last quarter ending Sept 30th. This was not “previously anticipated” and could be the factor that beats expectations on Nov 12th as the revenue from MCSU was not accounted for in estimates.\n\n“A deal with MUSC Health, a top South Carolina hospital, could boost SoundHound's earnings above expectations next quarter. The organization brought in over $8 billion in gross patient revenue in fiscal 2023. Given its massive size, SoundHound could generate significant revenue from the deal announced on Aug. 28 in the quarter ending Sept. 30. This was not previously anticipated.”\n\nhttps://investors.soundhound.com/news-releases/news-release-details/soundhound-ai-announces-partnership-musc-health-transform\n\nhttps://www.marketbeat.com/stock-ideas/is-nvidia-backed-soundhound-ai-a-buy-ahead-of-nov-12-earnings/",
        "created_utc": 1731078352.0,
        "subreddit_name": "wallstreetbets",
        "comments": 5
    },
    {
        "title": "$285k to invest, new to this! ",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gmlkbj/285k_to_invest_new_to_this/",
        "content": "Hi all, \n\nI have a Vanguard brokerage account that I invested in 10 years ago based on advice I received. I did okay with it. I was honestly not educated in investing in this way at all and it was too risky for me - so I didn’t look further into it besides putting some money in the stocks below and never looking at it. Stocks I’m in are VUG, QQQ, SPY, VXF, AAPL. \n\nI recently found out about this group and I’m ready to rework my personal investments. \n\nI have $160k in Vanguard brokerage. $125k in an HYSA at 5.05%. I also have a rental condo that I plan to sell next year and may just add the earnings to the brokerage account too. $500k condo (200k equity, 120k mortgage left, rest is profit). \n\nI’m able to freely invest that money and am thinking something along the lines of keep $15k in HYSA. (I have another $20k in personal savings that doesn’t really get touched.) Put $270k in VTI/VXUS (80/20) and just let it sit until my husband retires. (15 or so years)\n\nMy questions are based on not knowing how to work the platform, sell my current shares, are fees involved?, how to avoid any costly mistakes when selling and reinvesting, making sure dividends are reinvested, etc…\n\n1.) Can I use the brokerage account that I currently have for VTI/VXUS, VOO, etc.?\n\n2.) Can I sell my current positions and buy new ones tax/free? \n\n3.) Is there a new predicted dip to wait for since the market is up quite a bit due to the election? Is it worth waiting for anything to go down or is it best to get money into VTI/VXUS right now due to the long term strategy? \n\n4.) Can someone kindly give me a step by step on how to sell my current positions and then reinvest? Basically a dummy proof version that can tell me? Otherwise kindly advise me where to go to find this info. \n\n5.) I’m open to any constructive criticisms/advice here, so feel free.\n\nThank you for your advice and help - I very much appreciate it! \n\n\n\n",
        "created_utc": 1731080816.0,
        "subreddit_name": "investing",
        "comments": 18
    },
    {
        "title": "TSMC to suspend production of advanced AI chips for China from Monday",
        "score": 639,
        "url": "https://www.reddit.com/r/stocks/comments/1gmgd8v/tsmc_to_suspend_production_of_advanced_ai_chips/",
        "content": "(Reuters) -Taiwan Semiconductor Manufacturing Company (TSM) has notified Chinese chip design companies that it is suspending production of their advanced AI chips from Monday, Financial Times reported on Friday, citing three people familiar with the matter.\n\nhttps://finance.yahoo.com/news/tsmc-suspend-production-advanced-ai-110135233.html",
        "created_utc": 1731065242.0,
        "subreddit_name": "stocks",
        "comments": 138
    },
    {
        "title": "Axon with another blowout quarter, rises 30% mid day",
        "score": 145,
        "url": "https://www.reddit.com/r/stocks/comments/1gmqypm/axon_with_another_blowout_quarter_rises_30_mid_day/",
        "content": "Axon has exploded, notching about a 900% gain in the last 5 years with QoQ accelerated growth 11 quarters in a row. Expanding past their core TASER product and body cams include an arsenal of AI tools, upgraded TASER versions similar to Apples model for iPhones, drones, and their software to continue driving growth. Reoccurring and increasing revenue is also driving bottom line growth. Market cap is 35.5B. Anyone else in this beast of a company? Extremely competent CEO at the helm",
        "created_utc": 1731094438.0,
        "subreddit_name": "stocks",
        "comments": 71
    },
    {
        "title": "Department of Navy Set to Award $920M Sole-Source Contract to Palantir (PLTR) for Advanced Defense Software Solutions",
        "score": 83,
        "url": "https://www.reddit.com/r/stocks/comments/1gmmo2k/department_of_navy_set_to_award_920m_solesource/",
        "content": "The Department of the Navy, Naval Information Warfare Center, Pacific (NIWC Pacific), has issued a Notice of Intent to award a sole-source contract to Palantir Technologies for commercial off-the-shelf software products and services. Here are the key details:\n\nContract Number: N66001-25-R-0009\n\nContract Type: Indefinite Delivery/Indefinite Quantity (IDIQ) with firm-fixed pricing\n\nContract Duration: Five-year base period with a five-year option, totaling up to 10 years\n\nEstimated Value: $919.78 million, including options\n\nScope: Covers software licenses (perpetual and subscription), software maintenance and support, professional services, hardware, and hardware support\n\nEstimated Award Date: January 2025\n\nSource: https://sam.gov/opp/462a1d9ed13244e2a7089b4308216aa7/view#description\n\nSaw this originally posted by u/tke24 in the WSB subreddit.",
        "created_utc": 1731083594.0,
        "subreddit_name": "stocks",
        "comments": 37
    },
    {
        "title": "Are These Stocks Now Uninvestable? Swatch, Richemont, Kering, VW, BMW, Porsche, Mercedes and Pfizer.",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gmi6ao/are_these_stocks_now_uninvestable_swatch/",
        "content": "Swatch, Compagnie Financière Richemont, Kering, and even pharmaceutical giant Pfizer appear to have lost much of their investment appeal. The same could be said for automotive stalwarts like VW, Mercedes, BMW, and Porsche, which once symbolized industrial strength and innovation. The challenges they face, from shifting market dynamics to geopolitical tensions and sustainability pressures, raise significant doubts about their growth prospects. Have we reached a point where their decline is irreversible? Have we, as investors, already signed their death warrants? The future of these industry leaders seems more uncertain than ever.\n\nKering 24% Operating Margin.\n\nSwatch 14% Operating Margin.\n\n[https://finviz.com/quote.ashx?t=PFE&ty=c&ta=0&p=w](https://finviz.com/quote.ashx?t=PFE&ty=c&ta=0&p=w)\n\n[https://schrts.co/xnqmSpxm](https://schrts.co/xnqmSpxm) Swatch another -5% today !\n\n[https://schrts.co/EjXTGDnw](https://schrts.co/EjXTGDnw) Kering another -6% today !\n\n[https://schrts.co/vbrsTwJy](https://schrts.co/vbrsTwJy) Dr. F. Porsche AG, just destroyed...\n\n[https://schrts.co/UxqDTWEt](https://schrts.co/UxqDTWEt) VW...",
        "created_utc": 1731071514.0,
        "subreddit_name": "investing",
        "comments": 1
    },
    {
        "title": "Opinion of IG vs ETF for long-term investing? Numerical examples wanted!",
        "score": 2,
        "url": "https://www.reddit.com/r/investing/comments/1gmtoc6/opinion_of_ig_vs_etf_for_longterm_investing/",
        "content": "I'll try to keep this short.\n\nI (31M) am in Canada and have a steady job with a pension, own my house, no large debts (besides mortgage and car), and have 47K in cash that I've been sitting on for far too long. I have played with stocks in the past on Questrade and have basically only come out slightly positive because of investments in Apple and AMD. I was suggested a financial advisor and started talking with one at IG Wealth Management.\n\nLong story short: I'm getting cold feet at pulling the trigger with them. The portfolio they are suggesting is the iProfile Portfolio Global Equity Series F managed by Philip Petursson. Based on my aggressive investing stance, I'd be paying a 2.37% fee (MER of 1.01%). However this portfolio has nice returns after accounting for the fee (8.11 for 3YR, 28.01 for 1YR, 18.38 YTD).\n\nBut doing some quick maths it looks like the fees would cost me $300K over 25 years in fees (if I'm investing 10-12k a year). This does not account for a waived or decreased fee once you hit $250k, which would be around year 11 for me.\n\nWhen I asked about these numbers they said that These funds are actively managed and you're paying for the available advice, as well as dampening losses in bad years, and overall a better return in the long run compared to index funds. They also said an expected growth per year is 7%.\n\nI was also cautioned that ETFs have hidden fees that are not shown upfront...which from what I have read, is not true.\n\nI know these advisors are salesmen that want to gain more clients. But I'm also aware that anyone can post their financial advice on reddit and act like it is the gospel while having no credentials to back it up.\n\nSo my question is: What are people's experiences with IG vs ETFs and self investing? Would people be willing to share their experiences with either ETFs or IG and give numerical examples to back up their stance?\n\nThanks!",
        "created_utc": 1731101464.0,
        "subreddit_name": "investing",
        "comments": 3
    },
    {
        "title": "ASML will succeed despite China ",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gmrgm5/asml_will_succeed_despite_china/",
        "content": "Last week, we extensively discussed the potential monopoly of ASML. Inevitably, one of the risks that comes up is China, which we covered in depth in our premium analysis. However, we believe China alone won’t make or break this investment.\n\n# Let’s highlight three risks when we talk about China:\n\n**Risk 1:** ***“The U.S. or Dutch government can ban not only the export of EUV machines to China, but also that of DUV machines.”.***\n\nASML's largest customer in China is SMIC, the country’s most advanced semiconductor foundry. Due to export restrictions, SMIC is prohibited from using EUV machines, which prevents it from economically producing the most advanced chips (under 7 nanometers). Despite this, the U.S. is intensifying its pressure on the Netherlands to halt both the sale and maintenance of DUV machines to China. Fouquet has noted that these restrictions are \"economically motivated,\" suggesting they aim not only at security concerns but also at slowing China's economic ascent. \n\nFor now, ASML continues to supply and maintain DUV machines in China. However, if a future ban on DUV exports or maintenance is enforced, resulting in ASML losing all of its China-based revenue, the company stands to forfeit approximately 10-20% of its total revenue. While this represents a significant portion, it is unlikely to undermine the fundamental investment thesis for ASML.\n\n**Risk 2:** ***“China is investing heavily in developing its own chip industry, and it may eventually succeed in producing its own DUV or even EUV machines.”.***\n\nChina is investing hundreds of billions of dollars in building its own chip industry. \n\nSMIC, China's largest foundry, is heavily reliant on ASML’s DUV machines for production. Should China succeed in developing its own advanced lithography machine (a necessity given the export restrictions on ASML), this machine would likely only be used within China. The manufacturing processes of TSMC and other global manufacturers are so integrated with ASML’s machines that switching would not be feasible. Furthermore, it would be somewhat paradoxical for Taiwan (a country that China aims to occupy) to rely on Chinese-made machines for its most critical chip production processes. Also in this case, the total revenue loss for ASML would be 10-20% (all revenues from China).\n\n**Risk 3:** ***“If China were to occupy Taiwan, the impact would be significant, as ASML’s largest customer, TSMC, has the majority of its fabs located there.”***\n\nTo give you some background information: China views Taiwan as an apostate province. To understand this, we must go back to the Chinese Civil War between the communists and nationalists, which ended in 1949. The communists won the war, and the nationalists fled to Taiwan, which has since functioned as an independent entity, though not recognized as such by China. Despite the political and cultural differences between Taiwan and China, China considers Taiwan a part of its territory under the ‘One China’ policy. Chinese President Xi Jinping has declared it a national goal to reunify the countries, which Taiwan strongly opposes. The likelihood of China invading and annexing Taiwan in the future is significant, and such an action would have dramatic consequences not only for Taiwan and ASML, but also for the rest of the world. \n\nTSMC would no longer be able to produce chips in Taiwan, and ASML could remotely disable its machines in Taiwanese fabs through embedded software. Nevertheless, without a fully operational TSMC, the global economy would come to a halt, and ASML would also feel financial pain. \n\nThankfully, TSMC has not only fabs in Taiwan but also has an operational fab in Japan (with a second fab planned that will be operational by the end of 2027) and is heavily investing in fabs in the U.S. (Arizona) and Europe (Dresden). The fact is, and will be for quite some time, that most volume and the most advanced chips will be made in Taiwan. An attack on Taiwan will lead to significant problems in the value chain in nearly all electronic devices.\n\nBut electronic devices, such as a refrigerator, smartphone, laptop or sound speaker, must and will be made. For that, fabs in other countries will expand heavily or must be built from the ground up. In those expanded or new fabs must be placed a lithography machine of ASML. So our prediction is that if Taiwan gets attacked by China, it will be a short term (< 3 years) problem for ASML. In the longer run, capacity must be rebuilt and ASML will still sell its machines.\n\n**In our opinion:**\n\nAfter extensive research into ASML, including a two-part analysis for our members, we believe that while China could pose serious challenges for ASML, it won’t make or break the overall investment case. China might create short-term pressures on sales growth, which has averaged 20% annually since 2018, but we believe ASML’s future looks bright.\n\nAs always, thank you for reading. In this article, we only talked about a small part of our full ASML analysis. If you want to get access to Part 1 & Part 2 of the ASML analysis, we would love to welcome you on our TDI-platform.\n\nHave a wonderful day and happy investing.\n\nThe Dutch Investors",
        "created_utc": 1731095747.0,
        "subreddit_name": "investing",
        "comments": 3
    },
    {
        "title": "Review: M4 and M4 Pro Mac minis are probably Apple’s best Mac minis ever",
        "score": 1253,
        "url": "https://arstechnica.com/apple/2024/11/review-m4-and-m4-pro-mac-minis-are-probably-apples-best-mac-minis-ever/",
        "content": "",
        "created_utc": 1731091835.0,
        "subreddit_name": "apple",
        "comments": 221
    },
    {
        "title": "Variable Aperture Rumored to Bring Major Camera Upgrade to iPhone 18 Pro",
        "score": 937,
        "url": "https://www.macrumors.com/2024/11/08/variable-aperture-rumored-for-iphone-18-pro/",
        "content": "",
        "created_utc": 1731068380.0,
        "subreddit_name": "apple",
        "comments": 207
    },
    {
        "title": "Apple Drops Promised 'Sketch' Style Option From Image Playground",
        "score": 449,
        "url": "https://www.macrumors.com/2024/11/07/apple-removes-sketch-from-image-playground/",
        "content": "",
        "created_utc": 1731098321.0,
        "subreddit_name": "apple",
        "comments": 68
    },
    {
        "title": "Apple's Holiday Extended Return Policy Now in Effect: Orders from November 8 and December 25, 2024 may be returned through January 8, 2025",
        "score": 406,
        "url": "https://www.apple.com/shop/help/returns_refund",
        "content": "",
        "created_utc": 1731081460.0,
        "subreddit_name": "apple",
        "comments": 37
    },
    {
        "title": "苹果M4 Pro/M4 Max评测：很强！(Apple M4 Pro/M4 Max Evaluation: Very strong!)",
        "score": 39,
        "url": "https://youtu.be/2jEdpCMD5E8?si=V31a0ZnEh5hifSJw",
        "content": "",
        "created_utc": 1731086417.0,
        "subreddit_name": "apple",
        "comments": 6
    },
    {
        "title": "Daily Advice Thread - November 08, 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/apple/comments/1gmfynk/daily_advice_thread_november_08_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1731063631.0,
        "subreddit_name": "apple",
        "comments": 60
    },
    {
        "title": "Man sick of desktop crashes sues Intel for allegedly hiding CPU defect(s) — “Intel had a duty to disclose the defect because the defect is material and Intel possessed exclusive knowledge of it.”",
        "score": 2903,
        "url": "https://arstechnica.com/tech-policy/2024/11/man-sick-of-crashes-sues-intel-for-allegedly-hiding-cpu-defects/",
        "content": "",
        "created_utc": 1731033093.0,
        "subreddit_name": "technology",
        "comments": 47
    },
    {
        "title": "AMD's desktop PC market share skyrockets amid Intel's Raptor Lake CPU crashing scandal — AMD makes biggest leap in recent history",
        "score": 433,
        "url": "https://www.tomshardware.com/pc-components/cpus/amds-desktop-pc-market-share-skyrockets-amid-intels-raptor-lake-crashing-scandal-amd-makes-biggest-leap-in-recent-history",
        "content": "",
        "created_utc": 1731071057.0,
        "subreddit_name": "technology",
        "comments": 36
    },
    {
        "title": "AMD now commands 28.7% of consumer desktop CPU market, server chips also see significant gains | Continuing to erode Intel's dominance",
        "score": 225,
        "url": "https://www.techspot.com/news/105490-amd-now-commands-287-consumer-desktop-cpu-market.html",
        "content": "",
        "created_utc": 1731069436.0,
        "subreddit_name": "technology",
        "comments": 22
    },
    {
        "title": "The M4 Mac mini has an upgradeable SSD",
        "score": 4790,
        "url": "https://i.redd.it/qlnrfph97nzd1.png",
        "content": "I was fucking right on my previous post, as soon as i saw the screw and a card next to it in apple's video showing the cooling, i knew it had something upgradeable\n\nSource: https://www.ifixit.com/Answers/View/875970/How+is+the+SSD+installed",
        "created_utc": 1731056346.0,
        "subreddit_name": "mac",
        "comments": 582
    },
    {
        "title": "More old stuff found when I was digging around",
        "score": 188,
        "url": "https://www.reddit.com/gallery/1gmow5k",
        "content": "These are called Installation CDs young people lol. \n\nI have other OS versions but Snow Leopard is the only one I’ve a nice retail box. \n\nThose MacAdvocate were promotional stuff Apple sent out to enthusiasts and also including magazines like MacWorld or MacAddicts. \n\nI believe the MacAdvocate II is quite rare because that was the time Apple was in its lowest point and it wasnt bundled with magazines and given out amass like the first volume. You have to request for it. Iirc it came with a hand written note by Guy Kawasaki (or assistant) in the mail. ",
        "created_utc": 1731089122.0,
        "subreddit_name": "mac",
        "comments": 15
    },
    {
        "title": "*Best Steve Jobs impression* - Introducing, the brand new MacBook Air, the thinnest netbook in the world ",
        "score": 127,
        "url": "https://www.reddit.com/gallery/1gmhpao",
        "content": "Tried to replicate that iconic reveal segment from 2008",
        "created_utc": 1731070042.0,
        "subreddit_name": "mac",
        "comments": 21
    },
    {
        "title": "MX master 3 is horrible for macOS. ",
        "score": 97,
        "url": "https://www.reddit.com/r/mac/comments/1gmijll/mx_master_3_is_horrible_for_macos/",
        "content": "It seems like I might have a hot take here, but I feel like I'm the only one who hates the mx master 3. (for Mac)   \nEveryone always say its the best, but the scrolling and choppiness is so horrible.. Even with the 2.4 receiver and apps like steermouse or Mos.. I'm so confused as to why no one seems to be talking about that in their \"reviews\". Is it because everyone that recommends it is using the studio display with 60hz? So maybe the lag etc isn't that noticeable then? I can tell you that it sure is noticeable in 120hz. I'm seriously considering going back to using the trackpad. The gestures and scrolling in my pro tools and logic timeline is night and day difference. ",
        "created_utc": 1731072589.0,
        "subreddit_name": "mac",
        "comments": 187
    },
    {
        "title": "Retired authorized Apple tech. Can you guess what these items are used for?",
        "score": 87,
        "url": "https://www.reddit.com/gallery/1gmta44",
        "content": "I have an assortment of tools from my time as a service technician for Apple. I thought I’d share a few of them with you to see if you can identify their purposes.",
        "created_utc": 1731100429.0,
        "subreddit_name": "mac",
        "comments": 52
    },
    {
        "title": "How to get it fixed? And how much would it cost??",
        "score": 31,
        "url": "https://www.reddit.com/gallery/1gmgpe1",
        "content": "My sister’s MacBook M1 frame got damaged when she accidentally closed it on her AirPods, causing the frame to crack. Fortunately, the screen itself is intact, only the frame is affected.\n\nShe bought the MacBook in the UK (on Amazon) about a year ago. Could someone clarify the repair policy there and whether this type of damage might be covered under any repair policies?\n\nThank you!",
        "created_utc": 1731066571.0,
        "subreddit_name": "mac",
        "comments": 45
    },
    {
        "title": "Costco has M4 Macs",
        "score": 24,
        "url": "https://www.reddit.com/r/mac/comments/1gmmj63/costco_has_m4_macs/",
        "content": "I went this morning and they had two people replacing the M3 Macs with M4 Macs. There was a box with a bunch of Apple boxes in it and they had tools out to put in the new stuff. First time I've seen the M4 mini in person.\n\nI was at the Apple Store earlier in the morning and didn't see the M4 stuff out.",
        "created_utc": 1731083255.0,
        "subreddit_name": "mac",
        "comments": 18
    },
    {
        "title": "Screen replacement or other issue?",
        "score": 7,
        "url": "https://www.reddit.com/gallery/1gm59qo",
        "content": "A few days ago this started happening when I left my macbook closed for a while and then woke it up. It resolves usually if I close it again and open it, and it doesn’t happen if I just leave it open. \n\nI’m assuming it’s some sort of screen issue and I’ll need to get it replaced (I still have AppleCare+) but does anyone else have an idea what exactly causes this?",
        "created_utc": 1731024487.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Windows 11 on parallels on new M4 MacBook Pro - windows not playing…",
        "score": 6,
        "url": "https://www.reddit.com/r/mac/comments/1gmqbg6/windows_11_on_parallels_on_new_m4_macbook_pro/",
        "content": "Completed migration from my M2 MacBook Pro on the new M4 that arrived today (woohoo) and opened up parallels and windows 11, clicked the resume button and it all just crashed/shut down on me. Same thing several times. I’m running parallels 18 btw.\n\nUninstalled windows virtual machine then parallels and reinstalled from scratch.\n\nParallels all good, invites me to install windows. It downloads the 4gb file and then upon starting crashes and shuts down again (just the virtual machine).\n\nDo I need to upgrade to parallels 20? Or is it likely to be something else? Any ideas/suggestions to try?",
        "created_utc": 1731092738.0,
        "subreddit_name": "mac",
        "comments": 16
    },
    {
        "title": "I think thermals are the reason that the M4 Max is still a 16/40 config.",
        "score": 4,
        "url": "https://www.reddit.com/r/mac/comments/1gm6vd4/i_think_thermals_are_the_reason_that_the_m4_max/",
        "content": "Initially I was disappointed that the M4 Max is “only” a 16 core CPU and 40 core GPU setup, even though they are faster cores than before.\n\nThe thing is than I own a 16/40 M3 Max 16” MBP and I think it is one the verge of being thermally limited. When I use all of its power, and in my line of work it is often that I have to run codes that use 80-100% of the CPU and 100% of the GPU at the same time for hours, the M3 Max howls likes crazy. It is very very loud, and gets quite toasty.\n\nGiven the increase of the p-cores and total cores of the M4 Pro compared to the M3 Pro, I have a feeling that they didn’t do that on the M4 Max because of thermals.\n\nDo you think we have reached, or we are close, to the core count limit even for Apple silicon?\n\nPS: I also have a Mac Studio M2 Ultra and in the same workloads it doesn’t make a sound. Also, it is significantly faster, even on CPU only loads which make me think that the M3 Max might be throttling on extended all core loads. Based on the benchmark numbers there shouldn’t be much between them, but there is a noticeable difference. ",
        "created_utc": 1731029173.0,
        "subreddit_name": "mac",
        "comments": 12
    },
    {
        "title": "Any help is appreciated",
        "score": 4,
        "url": "https://i.redd.it/uzuawq2fvqzd1.jpeg",
        "content": "Working on resetting my Macbook and all of a sudden I can’t boot it anymore. My hard drive is not in it and I tried MacOs Recovery several times and it didn’t work for me. \n\nAny help will be appreciated. Thank you.",
        "created_utc": 1731100787.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "T7 Samsung SSD can't be ejected from Macbook Pro ",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gmu6sg/t7_samsung_ssd_cant_be_ejected_from_macbook_pro/",
        "content": "Hey everyone, I’ve been using a 4TB Samsung T7 SSD on my Mac for a year now. Last year, I lost a lot of data from a WD hard drive, and it was horrible, so I switched to the T7 SSD. I mainly use it to store heavy raw video files and photos since I’m a videomaker. This is my second one this year, and I haven’t had any issues until this week. I usually work with both SSDs connected to my Mac, and before I unplug them, I always eject them safely. However, every time I try to eject one of them, it says another program is using it. This only happens with one of the drives.\n\nI’ve tried everything (closed all programs, used ‘command + option + esc’ to relaunch Finder) but nothing works. I’ve searched here and on Google, and while others seem to have had this issue, I couldn’t find a solution. The only difference on my Mac now is that my company installed Norton antivirus. Could that be causing the problem?\n\nI’m honestly a little terrified of losing my data. I back everything up to the cloud now, but it would still be a huge pain to lose all my media, especially for my Premiere Pro projects.",
        "created_utc": 1731102813.0,
        "subreddit_name": "mac",
        "comments": 8
    },
    {
        "title": "MacOS 15.1 Battery Drain problem",
        "score": 3,
        "url": "/r/macbookpro/comments/1gmrri5/macos_151_battery_drain_problem/",
        "content": "",
        "created_utc": 1731096575.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Wireless display ",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gmo5vn/wireless_display/",
        "content": "Hello, \n\nI have a 2014 Mac mini. It is kind of my house computer though now we have a MacBook Air that seems to be doing to the trick. I have the mini hooked up to my tv system and is acting as my media server using plex. It also has my photos app and my photos are externally stored on a disk and backed up. The mini sits next to my tv and when I actually need to go on it, I remotely hook up to it from my MacBook. \n\nSo that is the background , we are considering upgrading to the new m4 but we really don’t use it much and have an m3 MacBook. I have my old monitor that I occasionally hook my MacBook up to and am now thinking about a wireless adapter that I could run for my Mac mini to display on my monitor rather than my tv or remote logging in because remote logging in makes a smaller screen etc…. \n\nAnyhow, has anyone used those wireless adapters? If so which one should I buy?\n\nThanks, \n\nMatt ",
        "created_utc": 1731087316.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Bypass unlock to use accessories?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gmatke/bypass_unlock_to_use_accessories/",
        "content": "Macbook Air 2022 trackpad and keyboard stopped working ive got an external mouse and keyboard i can use but i need to login to be able to use them",
        "created_utc": 1731041795.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Anyone else having connectivity issues on MacBook Pro after recent Sequoia update when transferring files from external sources?\n",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gm6fi5/anyone_else_having_connectivity_issues_on_macbook/",
        "content": "Hey all, I’ve got a 2021 MacBook Pro running Sequoia 15.1, and I've been having a weird issue lately. Anytime I transfer a bunch of files from my SD card to Google Drive, my internet connection randomly drops. I try turning WiFi off and on again, but it still won’t load any sites until I fully restart the laptop. And even then, it takes like 15 seconds just to start the restart process.\n\nI’m a real estate photographer, so I’m usually moving a lot of large files at once—like today, I was transferring around 600 RAW images from both the SD card slot and a USB-C reader, and it happened again.\n\nThis only started happening with these recent Sequoia updates. Never had any issues like this before, but I can’t find anyone else talking about it online. Is anyone else experiencing this, or have any idea what might be going on?",
        "created_utc": 1731027840.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Do apps like MS Teams and Zoom use efficiency or performance CPU cores?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gm585h/do_apps_like_ms_teams_and_zoom_use_efficiency_or/",
        "content": "I'm trying to understand Apple CPUs - I've read that \"background\" tasks employ Efficiency cores. So, are these sorts of collab apps like MS Teams more \"background\" or \"performance\" when looking at Apple's CPUs? ",
        "created_utc": 1731024367.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Additional uses for a Mac mini bought as an emulation console?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gmvzqn/additional_uses_for_a_mac_mini_bought_as_an/",
        "content": "So I am pretty keen to pick up a M4 Mac mini as an emulation console and hook it up to my 4K OLED Tv, but I'm wondering if Ic an have the little thing doing more than just gaming, can anyone think of any other uses for a device like this, not used as a desktop but doing something in the background? I don't really need it as a media server or to play TV/movies but any other ideas would be very welcome!",
        "created_utc": 1731107661.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Mac virgin here - thinking of M4 based mini, got a few questions (and a limited budget)",
        "score": 1,
        "url": "https://www.reddit.com/r/mac/comments/1gmnq92/mac_virgin_here_thinking_of_m4_based_mini_got_a/",
        "content": "Have never used a Mac for anything other than few hours, so can safely call myself a mac virgin (OS and the hardware). I'm was already looking for a desktop with a discrete GPU for some coding/programming, AI/ML experimentation and the new M4 based Mac mini (base version with 16GB RAM and 256GB SSD) perfectly fits the budget bracket, but I am willing to bump up to the version with 24GB RAM while keeping 256GB SSD. I'd typically be running software like VScode, LMstudio, podman-desktop w/ Lima VMs, python, golang in terminal, but occasionally might like to use Garageband, Reaper (DAW), kdenlive (video editing), gimp (photo editing) etc. or their MacOS native alternatives (but hopefully free and/or opensource ones). I plan to use a high speed external SSD, like a Samsung T9 (1TB) - thunderbolt variant, which is not as fast as the internal SSD, but still mighty fast for most work. Wondering if going with 256GB SSD is such a terrible idea (to help me stay in my budget range) ?",
        "created_utc": 1731086252.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Is my battery cycle normal?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gmdot5/is_my_battery_cycle_normal/",
        "content": "I bought my MBA M1 in October 2021, and I got an external monitor in September 2022. I just checked my system information, and the Maximum Capacity is at 80%, with 318 cycle counts. My laptop is almost always plugged in, and I use some tasking programs(adobe after effects, premiere pro, photoshop, etc).\n\n  \nJust wanna make sure if this is normal or not.",
        "created_utc": 1731053420.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Abnormally slow Thunderbolt 4 between iMac and M1 Pro. Any fix?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gm91c2/abnormally_slow_thunderbolt_4_between_imac_and_m1/",
        "content": "Connected my iMac 2020 5K to the M1 Pro with Thunderbolt 4. Connection when I used SSD Speed Test from iMac to check out the speed of M1 hovers at around 600 mbps write speed and upload at 1000. (I connected both devices through the Network tab in Finder).\n\nThis seems extremely slow for a thunderbolt connection. I have tried reversing cables, switching ports and reversing sides. They did not contribute much to improving the connection speed.\n\nMy end purpose is to improve the quality when screen sharing and it's not improving much if the speed is still the same as two extremely cheap Thunderbolt cables I bought.",
        "created_utc": 1731035812.0,
        "subreddit_name": "mac",
        "comments": 13
    },
    {
        "title": "i get this whenever trying to boot into recovery",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gm8uza/i_get_this_whenever_trying_to_boot_into_recovery/",
        "content": "https://preview.redd.it/sbpewsz5glzd1.jpg?width=2252&format=pjpg&auto=webp&s=2e7450524dd1d1e8cab0ae330643c40a2b2f3450\n\ni installed sequoia onto my MacBook with opencore because its not supported for my mac, but i cant boot into recovery anymore\n\nany help?",
        "created_utc": 1731035252.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Which MBP is better for me?",
        "score": 1,
        "url": "https://www.reddit.com/r/mac/comments/1gm7csp/which_mbp_is_better_for_me/",
        "content": "I'm upgrading to a new MacBook Pro, as my current MacBook Air (M3) SUCKS. It only has 8GB memory and can barely run Lightroom. It also freezes often in other simpler apps like Notes. I use the computer for work (I'm a professor), plus lots of photo editing with Lightroom and on occasion Photoshop. I also work with video files, but nothing too crazy.\n\n  \nThese two models of MBP are just $10 apart and I'm trying to pick between them. Will trade in my current computer for $615 trade in value. Which of these would be faster at doing Lightroom? Anything else I should consider?  \n  \n**Option 1: M4 chip w/32GB memory**  \n**Option 2: M4 PRO chip w/24GB memory**\n\n  \n\n\n  \n\n\nhttps://preview.redd.it/3za7drf42lzd1.png?width=2184&format=png&auto=webp&s=2c6889354fefa813bb64d85cdb17e7f64bf916f9\n\nhttps://preview.redd.it/w7lmtrf42lzd1.png?width=2040&format=png&auto=webp&s=453e71dace80d4ed52eb3b7ffe4ad8589bdf1e81\n\n",
        "created_utc": 1731030647.0,
        "subreddit_name": "mac",
        "comments": 12
    },
    {
        "title": "According to Apple analyst Ming-Chi Kuo, Apple is working on a significant camera upgrade for the iPhone 18 coming in 2026 / The analyst says the iPhone 18’s main rear camera will be upgraded to a variable aperture lens for the first time.",
        "score": 1,
        "url": "https://9to5mac.com/2024/11/08/iphone-18-main-camera-aperture/",
        "content": "",
        "created_utc": 1731080670.0,
        "subreddit_name": "gadgets",
        "comments": 42
    }
]