[
    {
        "title": "Netflix cancellations surge 'materially' in the wake of 'Cuties' controversy, data shows",
        "score": 10166,
        "url": "https://www.reddit.com/r/stocks/comments/ivrimz/netflix_cancellations_surge_materially_in_the/",
        "content": "https://finance.yahoo.com/news/netflix-cancellations-surge-following-cuties-controversy-data-shows-114312558.html\n\nAccording to subscription analytics firm Antenna, Netflix cancellations surged 5x the normal amount following the release of “Cuties.”\n\nMeanwhile, Data analytics firm YipitData reported a similar trend, with the company telling Yahoo Finance that Netflix’s U.S. churn “rose materially” last weekend in the wake of the controversy. As of last Saturday, disconnects were running at nearly 8x the daily levels observed in August — a multi-year high, YipitData added.\n\nStill, despite the downbeat data, the cancellations should not have much of a lasting impact on Netflix’s overall subscriber base. The platform has well over 182 million users worldwide and is the clear leader in the competitive streaming space — regardless of its recent controversies.\n\nThanks for the awards.",
        "created_utc": 1600517854.0,
        "subreddit_name": "stocks",
        "comments": 1646
    },
    {
        "title": "YouTube restricts iOS 14 picture-in-picture feature to Premium subscribers, 4K not available on tvOS 14",
        "score": 10026,
        "url": "https://appleinsider.com/articles/20/09/18/youtube-restricts-ios-14-picture-in-picture-feature-to-premium-subscribers-4k-not-available-on-tvos-14",
        "content": "",
        "created_utc": 1600506267.0,
        "subreddit_name": "apple",
        "comments": 1065
    },
    {
        "title": "[Self Promo Saturday] I just updated my Reddit app Apollo with a bunch of iOS 14 Widgets, the first Reddit app on iOS to do so. It also includes Picture in Picture video support, support for the new privacy-focused iOS 14 photo picker, and more. Would love to know what you think! 🎉",
        "score": 7420,
        "url": "https://itunes.apple.com/app/id979274575",
        "content": "",
        "created_utc": 1600533928.0,
        "subreddit_name": "apple",
        "comments": 382
    }
]