[
    {
        "title": "Amazon spends $2.75B on AI startup Anthropic, its largest venture investment",
        "score": 634,
        "url": "https://www.reddit.com/r/stocks/comments/1bp6rv9/amazon_spends_275b_on_ai_startup_anthropic_its/",
        "content": "Amazon is making its largest outside investment in its three-decade history as it looks to gain an edge in the artificial intelligence race. \n\nThe tech giant said it will spend another $2.75 billion backing Anthropic, a San Francisco-based startup that’s widely viewed as a frontrunner in generative artificial intelligence. Its foundation model and chatbot Claude competes with OpenAI and ChatGPT.\n\nThe companies announced an initial $1.25 billion investment in September, and said at the time that Amazon would invest up to $4 billion. Wednesday’s news marks Amazon’s second tranche of that funding.\n\nAmazon will maintain a minority stake in the company and won’t have an Anthropic board seat, the company said. The deal was struck at the AI startup’s last valuation, which was $18.4 billion, according to a source. \n\nOver the past year, Anthropic closed five different funding deals worth about $7.3 billion — and with the new Amazon investment, the total exceeds $10 billion. The company’s product directly competes with OpenAI’s ChatGPT in both the enterprise and consumer worlds, and it was founded by ex-OpenAI research executives and employees.\n\nNews of the Amazon investment comes weeks after Anthropic debuted Claude 3, its newest suite of AI models that it says are its fastest and most powerful yet. The company said the most capable of its new models outperformed OpenAI’s GPT-4 and Google’s Gemini Ultra on industry benchmark tests, such as undergraduate level knowledge, graduate level reasoning and basic mathematics.\n\n“Generative AI is poised to be the most transformational technology of our time, and we believe our strategic collaboration with Anthropic will further improve our customers’ experiences, and look forward to what’s next,” said Swami Sivasubramanian, vice president of data and AI at AWS.\n\nAmazon’s move is the latest in a spending blitz among cloud providers to stay ahead in the AI race. And it’s the second update in a week to Anthropic’s capital structure. Late Friday, bankruptcy filings showed crypto exchange FTX struck a deal with a group of buyers to sell the majority of its stake in Anthropic, confirming a CNBC report from last week.\n\nThe term generative AI entered the mainstream and business vernacular seemingly overnight, and the field has exploded over the past year, with a record $29.1 billion invested across nearly 700 deals in 2023, according to PitchBook. OpenAI’s ChatGPT first showcased the tech’s ability to produce human-like language and creative content in late 2022. Since then, OpenAI has said more than 92% of Fortune 500 companies have adopted the platform, spanning industries such as financial services, legal applications and education.\n\nCloud providers like Amazon Web Services don’t want to be caught flat-footed.\n\nIt’s a symbiotic relationship. As part of the agreement, Anthropic said it will use AWS as its primary cloud provider. It will also use Amazon chips to train, build and deploy its foundation models. Amazon has been designing its own chips that may eventually compete with Nvidia. \n\nMicrosoft has been on its own spending spree with a high-profile investment into OpenAI. Microsoft’s OpenAI bet has reportedly jumped to $13 billion as the startup’s valuation has topped $29 billion. Microsoft’s Azure is also OpenAI’s exclusive provider for computing power, which means the startup’s success and new business flows back to Microsoft’s cloud servers.\n\nGoogle, meanwhile, has also backed Anthropic, with its own deal for Google Cloud. It agreed to invest up to $2 billion in Anthropic, comprising a $500 million cash infusion, with another $1.5 billion to be invested over time. Salesforce is also a backer.\n\nAnthropic’s new model suite, announced earlier this month, marks the first time the company has offered “multimodality,” or adding options like photo and video capabilities to generative AI.\n\nBut multimodality, and increasingly complex AI models, also lead to more potential risks. Google recently took its AI image generator, part of its Gemini chatbot, offline after users discovered historical inaccuracies and questionable responses, which circulated widely on social media.\n\nAnthropic’s Claude 3 does not generate images; instead, it only allows users to upload images and other documents for analysis.\n\n“Of course no model is perfect, and I think that’s a very important thing to say upfront,” Anthropic co-founder Daniela Amodei told CNBC earlier this month. “We’ve tried very diligently to make these models the intersection of as capable and as safe as possible. Of course there are going to be places where the model still makes something up from time to time.”\n\nAmazon’s biggest venture bet before Anthropic was electric vehicle maker Rivian, where it invested more than $1.3 billion. That too, was a strategic partnership. \n\nThese partnerships have been picking up in the face of more antitrust scrutiny. A drop in acquisitions by the Magnificent Seven — Amazon, Microsoft, Apple, Nvidia, Alphabet, Meta and Tesla — has been offset by an increase in venture-style investing, according to Pitchbook.\n\nAI and machine-learning investments from those seven tech companies jumped to $24.6 billion last year, up from $4.4 billion in 2022, according to Pitchbook. At the same time, Big Tech’s M&A deals fell from 40 deals in 2022 to 13 last year. \n\n“There is a sort of paranoia motivation to invest in potential disruptors,” Pitchbook AI analyst, Brendan Burke, said in an interview. “The other motivation is to increase sales, and to invest in companies that are likely to use the other company’s product — they tend to be partners, more so than competitors.”\n\nBig Tech’s spending spree in AI has come under fire for the seemingly circular nature of these agreements. By investing in AI startups, some, including Benchmark’s Bill Gurley have accused the tech giants of funneling cash back to their cloud businesses, which in turn, may show up as revenue. Gurley described it as a way to “goose your own revenues.”\n\nThe U.S. Federal Trade Commission is taking a closer look at these partnerships, including Microsoft’s OpenAI deal and Google and Amazon’s Anthropic investments. What’s sometimes called “round tripping” can be illegal — especially if the aim is to mislead investors. But Amazon has said that this type of venture investing does not constitute round tripping.\n\nFTC Chair Lina Khan announced the inquiry during the agency’s tech summit on AI, describing it as a “market inquiry into the investments and partnerships being formed between AI developers and major cloud service providers.”\n\nSource: https://www.cnbc.com/2024/03/27/amazon-spends-2point7b-on-startup-anthropic-in-largest-venture-investment.html",
        "created_utc": 1711558495.0,
        "subreddit_name": "stocks",
        "comments": 46
    },
    {
        "title": "'Apple will prevail': US faces uphill slog in new antitrust battle",
        "score": 244,
        "url": "https://www.reddit.com/r/stocks/comments/1boymg5/apple_will_prevail_us_faces_uphill_slog_in_new/",
        "content": "Attorney General Merrick Garland made a bold statement last week when he announced a new antitrust lawsuit against Apple (AAPL): \"The United States normally wins the cases that it brings.\"\n\nBut not all legal experts agree federal prosecutors hold the upper hand in a legal battle that aims to dismantle the architecture of Apple’s marquee product, the iPhone.\n\n\"My guess is [Apple] will win,\" University of Chicago law professor Randy Picker told Yahoo Finance Live.\n\nEven if Apple does not prevail in New Jersey federal court where the case was filed, Picker expects the tech giant to succeed on appeals, possibly to the Supreme Court.\n\n\"Yes I think that Apple will prevail in the end.\"\n\nhttps://finance.yahoo.com/news/apple-will-prevail-us-faces-uphill-slog-in-new-antitrust-battle-080027800.html\n\n",
        "created_utc": 1711535526.0,
        "subreddit_name": "stocks",
        "comments": 58
    },
    {
        "title": "Apple \"Find My\" app led a Missouri SWAT team to raid an innocent family's home, lawsuit pending | \"Find My is not that accurate,\" says family lawyer",
        "score": 6324,
        "url": "https://www.techspot.com/news/102405-apple-find-app-led-missouri-swat-team-raid.html",
        "content": "",
        "created_utc": 1711537771.0,
        "subreddit_name": "technology",
        "comments": 397
    },
    {
        "title": "Apple's Phil Schiller Works 80 Hours a Week Overseeing App Store",
        "score": 1726,
        "url": "https://www.macrumors.com/2024/03/27/apple-phil-schiller-profile/",
        "content": "",
        "created_utc": 1711575468.0,
        "subreddit_name": "apple",
        "comments": 573
    },
    {
        "title": "I'm a full time news driven trader and this is everything I'm watching and analysing in premarket 27/03",
        "score": 196,
        "url": "https://www.reddit.com/r/Daytrading/comments/1bozvmv/im_a_full_time_news_driven_trader_and_this_is/",
        "content": "**ANALYSIS:**\n\n* Yesterday we saw SPX trading extremely rangebound all day, from 5225 to 5234, until the end of the day, when in the last 45 minutes, we saw 3 big red candlesticks, and SPX suddenly closed at 5203.\n* We see that here below:\n* [https://imgur.com/a/gsG42U8](https://imgur.com/a/gsG42U8) \n* Now the short of it, is that NVDA sold off from 950 to 925 at the end of the day yesterday, which dragged the market with it. However, that's not really the full explanation. Why did NVDA sell off like that and what was the market mechanism behind it?\n* To understand that, let's fully understand what we mean when we talk about skew. Skew tracks the ratio of the IV of Calls to the IV of Puts to give us an indication of trader sentiment. It's a very useful indicator.\n* What does it mean when skew is lowering, as we see happening in NVDA over last few days:\n* [https://imgur.com/a/i1V6Ghm](https://imgur.com/a/i1V6Ghm) \n* When Skew is lowering, it means that either the IV of calls is decreasing, or the IV in puts is increasing.\n* Because IV in calls was reducing in this case, it implied some short term downward pressure as it means that traders are lowering their exposure to the stock. In this case, because IV in call options OTM was lowering, but traders remain short vol, This meant market makers removed liquidity at the end of the day to hedge, once NVDA started dropping. When market makers remove liquidity, thats when we see downward movement.\n* This is what accelerated the sell off EOD to being a bit of a flush out.\n* Now is it a problem?\n* Not really. Traders remain very short vol. We saw vix jump, but it has now since sold off the gains pretty much. Because VIX remained low and is being shorted the shit out of, once it started to drop, market makers bought the dip again, and we see that in premarket we are back to 5225.\n* [https://imgur.com/a/OSVWwj6](https://imgur.com/a/OSVWwj6) \n* Regarding NVDA, positioning overall is bullish. But we do see IV in call options continue to lwoer as we see traders selling calls. This we can attribute to profit taking as not seeing massive OTM put gamma.\n* Gamma wall at 900 is still the support, and one at 920 before that and 950 has v high Delta on it so that's the wall to break to move higher towards 1000. Target in med term is still 1000 as positioning still bullish but with skew pointing lower towards profit taking we can see bit of volatility in the low 900 range.\n* Oil we saw headed lower as skew was pointing lwoer as was the crack spreads, but it holds the 80 level. Staying above 80 WTI is key as it will maintain the bullishness and liquidity. Below this we can see further volatility increase.\n* Gold positioning extremely bullish. \n* Markets are still v bullish. Not much signs of stress in the market. Just look at the European markets. GER40 is flying, every day just keeps increasing. This is a clear sign that markets are seeing low stress. \n* Traders continue to be very short volatility. This means that any VIX spikes we do get are likely to be sold off quickly as market makers will increase liquidity. This makes it much more likely for dips to be bought quickly.\n* I don’t see much cause for concern on PCE, yes we can see dollar increase from FX side, but traders in equity market are pricing hotter inflation in near term before it levels out in the longer term. That’s probably what we will see. \n* Chinese market looks volatile, that’s the only thing, but has strong support at 16k. \n\n**DATA LEDE:**\n\n* 01:30 Australia CPI index: Came in line with last month, slightly below the expectations for it to tick up slightly from 3.4% to 3.5%\n* Came in at 3.4% YOY\n* Spain inflation rate preliminary reading for March:\n* YOY at 3.2% in line with expectations, slightly higher than 2.8% last month\n* MOM comes slightly hot at 0.8%, vs forecast of 0.6%  \n \n* Note core came in lower than expected. \n* This isn’t really surprising. Forward inflation swaps in US is already pricing in a hot CPI next month for US, so we expect similar in Europe. \n* 10:00 Eurozone Economic Sentiment (Mar)\n* Comes in line with expectations at 96.3. Improved economic sentiment vs last month, as hopes of ECB rate cut rise. \n* 11:00 US MBA Mortgage Apps\n* 23:50 BOJ Summary of Opinions from BOJ meeting - expect more dovishness after their first hike in a decade was v dovish. \n\n—————\n\n**MARKETS:**\n\n* SPX: Recovered after yesterdays little end of day sell off, which took us to 5203. Almost imemdiate recovery as VIX got crushed again, and fuelled further by European session. \n* NDX: Similar picture, dropped to 18200 yesterday, but now recovered back to 18,308\n* DJI: Trading at 39500. Pushing up slightly in premarket. \n* GER40: Approaches 18500, up 0.6% again today. \n* Hong Kong market down 1%, trading at 16400. Has been unable to recover the uptrend which it dropped out of since this week. Trading quite flat. Support is at 16000. Skew points more negative so can see more pressure. \n* CHINA50: consolidating around the 12k level. Very sideways movement this month. Also down, but less so than HKG\n* JPN225 was higher initially as yen fell but then lowered as we saw Yen recover on FX intervention talks.\n* OIL: Lower, back at near 80. Holds this level and pushes slightly higher. \n* GOLD: Higher again, up 0.95% back to 2200. Bullishness on gold remains very strong in the positioning data. \n\n**INSTITUTIONAL:**\n\n* It’s quarter end and pensions funds may need to sell roughly $22 billion in global stocks and buy $17 billion of fixed income in order to return to prior asset allocation levels, according to an earlier estimate from Morgan Stanley.\n\n**FX:**\n\n* Swiss franc lower despite positive survey data from the ZEW survey. Showed that Swiss investors are optimistic about the economic outlook. Increase in sentiment for 2nd month in a row. \n* Yen jumps after hitting all time low at 151.97 as increased speculation of FX intervention. This is the key FX news. \n* Yen now at 151.2\n* Dollar flat to slightly higher. \n* AUDUSD lower as China session sell off. \n* CHFUSD approaches 1.10  \n EURUSD holds the 1.08 level. \n* GBPUSD pushes higher to 1.264\n\n**MAG7:**\n\n* Meta - paid out first dividend in its history yesterday. \n* AAPL - announced the WWDC conference returns on June 10, where main theme is expected to be AI. \n* NVDA - we did see Market makers hedge by removing liquidity yesterday, but NVDA green again in premarket as vix drops and bullishness resumes. \n* NVDA - Cathie Woods sells NVDA yesterday. This confirms NVDA to 1000 soon.\n\n**COMPANY SPECIFIC:**\n\n* Semiconductors generally are all green as NVDA higher. \n* Chinese stocks mostly red\n* Oil stocks like CVE, CPG, SU etc all red too on oil decline over last 2 days. \n* Gold stocks all higher as Gold pumps in premarket. \n* MRK - FDA approves a drug from Merck designed to treat a rare progressive and life threatening lung condition called pulmonary arterial hypertension\n* HOOD - unveiled a credit card which gives 3% cash back on all categories and has no foreign transaction fees. Up 5% on this news. They would also redesign app and include new advanced features. \n* SWAV - was pumping yesterday towards end of day and had to get halted on talks that JNJ were looking to acquire. \n* GME - terrible earnings, said they werent going to host an earnigns call, said they had cut an unspecified number of jobs to cut costs. All very bearish. \n* ADBE - yesterday announced a number of AI partnerships, one of which was partnership with MSFT to bring new generative Ai capabilities to marketers working in Microsoft 365 applications. \n* BA - yesterday, Moodys placed boeings BAA2 for review for downgrade. \n* GM said that Ev demand is much slower than what the industry forecasted. \n* DNUT continues higher after pumping 40% on news that MCD will include Krispy Kreme in all their national stores\n* ARM up again in pre market, after being down 8% yesterday. \n* S - JMP Securities maintained 33 price target on the stock yday which is bullish as gives 50% upside. \n* MRNA - rises today on 750m funding agreement with Blackstone Life sciences. Blackstone will fund Moderna’s Flue Research up to the amount of 750m\n* WDC - initiated outperform by Evercore, price target 80. Current price 68\n* SQ - maintained at overweight by Keybanc, price target 95\n* SPOT - up again as Keybanc maintains buy rating on Spotify\n* MU - Micron China breaks ground on Chip packaging facility expansion in Xian City. Expects new factory to operate in H2 2025\n* SNAP - Wells Fargo remains buy on SNAP\n* F - reaffirms their operating guidance at a BoA auto summit\n* IP was lower yesterday due to their buyout offer for DS Smith. Possible merger. \n* MRO down on oil related performance, but also prices offering of 600m of senior notes due 2029. \n* OTHER NEWS:\n* JPM say that oil can hit 100 following Russian output cuts. \n* Increasing speculation of BOJ FX intervention. This comes as yen hits lowest since 1990. Finance minister ramped up his emphasis that they are watching FX closely after USDJPy passed 151.97, above the level that triggered intervention in October 2022. \n* Kanda also said that he sees the FX move as v abnormal. Said won’t rule out any steps to respond to disorderly FX move. \n* Also, BOJ board member, Tamura says that financial conditions will remain ccomodative but this doesnt rule out a further interest rate increase. Said there’s no set formula till now. Said its unclear how much rates will be raised. \n* US consumer confidence yesterday came lower than expected, more or less in line with last month. \n* Case chiller home prices in US show that house prices continue to rise, here by 6.6% YOY, which was more or less in line with expectations. That was the fastest YOY increase in over 12 months. \n* ECB’s Cipollone says that if outlook holds they should be ready to ease soon. Said they are just waiting for more data before starting. \n* Swiss franc slightly higher after positive survey data from the ZEW survey. Showed that Swiss investors are optimistic about the economic outlook. Increase in sentiment for 2nd month in a row. \n* GM said that Ev demand is much slower than what the industry forecasted. - quite bearish commentary on EVs in general. \n* China’s Xi says China economy is healthy and sustainable. \n* Xi will meet with US business and academic representatives in beijing. \n* Founders of cryptocurrency exchange Kucoin charged with bank secrecy act and unlicensed money transmission offences. \n* BOE FPC says that uk major banks are well capitalised and maintain strong liquidity to support lending even if conditions get far worse than currently. \n* US gov is pursuing Tiktok over data practices. \n* Nat gas hits lowest since June 2020. \n* After collapse of Baltimore bridge, shipping companies are seeing delays and other nearby ports could see a 10% increase in volume handling as a result. \n* Federal government will pay for bridge construction costs. ",
        "created_utc": 1711540016.0,
        "subreddit_name": "DayTrading",
        "comments": 23
    },
    {
        "title": "Thoughts on AAPL?",
        "score": 2,
        "url": "https://www.reddit.com/r/AAPL/comments/1bp7e71/thoughts_on_aapl/",
        "content": "What do you guys think aapl will end the week at, personally I am bullish to 176 atm.",
        "created_utc": 1711560001.0,
        "subreddit_name": "AAPL",
        "comments": 12
    },
    {
        "title": "AAPL rebound part 2???",
        "score": 0,
        "url": "https://www.reddit.com/r/AAPL/comments/1bp6hbl/aapl_rebound_part_2/",
        "content": "I told you guys end of the week was going to be good for apple, and i expect 3/28 to be even better, what are your thoughts?",
        "created_utc": 1711557791.0,
        "subreddit_name": "AAPL",
        "comments": 3
    }
]