[
    {
        "title": "Amazon goes nuclear, to invest more than $500 million to develop small modular reactors",
        "score": 1186,
        "url": "https://www.reddit.com/r/stocks/comments/1g4zenu/amazon_goes_nuclear_to_invest_more_than_500/",
        "content": "https://www.cnbc.com/amp/2024/10/16/amazon-goes-nuclear-investing-more-than-500-million-to-develop-small-module-reactors.html\n\nAmazon Web Services is investing over $500 million in nuclear power, announcing three projects from Virginia to Washington State. AWS, Amazon's subsidiary in cloud computing, has a massive and increasing need for clean energy as it expands its services into generative AI. It's also a part of Amazon's path to net-zero carbon emissions.\n\nAWS announced it has signed an agreement with Dominion Energy, Virginia's utility company, to explore the development of a small modular nuclear reactor, or SMR, near Dominion's existing North Anna nuclear power station. Nuclear reactors produce no carbon emissions.\n\nAn SMR is an advanced type of nuclear reactor with a smaller footprint that allows it to be built closer to the grid. They also have faster build times than traditional reactors, allowing them to come online sooner.\n\nAmazon is the latest large tech company to buy into nuclear power to fuel the growing demands from data centers. Earlier this week, Google announced it will purchase power from SMR developer Kairos Power. Constellation Energy is restarting Three Mile Island to power Microsoft data centers.\n\n\"We see the need for gigawatts of power in the coming years, and there's not going to be enough wind and solar projects to be able to meet the needs, and so nuclear is a great opportunity,\" said Matthew Garman, CEO of AWS. \"Also, the technology is really advancing to a place with SMRs where there's going to be a new technology that's going to be safe and that's going to be easy to manufacture in a much smaller form.\"\n\nVirginia is home to nearly half of all the data centers in the U.S., with one area in Northern Virginia dubbed Data Center Alley, the bulk of which is in Loudon County. An estimated 70% of the world's internet traffic travels through Data Center Alley each day.\n\nDominion serves roughly 3,500 megawatts from 452 data centers across its service territory in Virginia. About 70% is in Data Center Alley. A single data center typically demands about 30 megawatts or greater, according to Dominion Energy. Bob Blue, its president and CEO, said in a recent quarterly earnings call that the utility now receives individual requests for 60 megawatts to 90 megawatts or greater. Dominion projects that power demand will increase by 85% over the next 15 years. AWS expects the new SMRs to bring at least 300 megawatts of power to the Virginia region.\n\n\"Small modular nuclear reactors will play a critical role in positioning Virginia as a leading nuclear innovation hub,\" said Virginia Gov. Glenn Youngkin in a release. \"Amazon Web Services' commitment to this technology and their partnership with Dominion is a significant step forward to meet the future power needs of a growing Virginia.\"\n\nAWS plans to invest $35 billion by 2040 to establish multiple data center campuses across Virginia, according to an announcement from Youngkin last year.\n\n\"These SMRs will be powering directly into the grid, so they'll go to power everything, part of that is the data centers, but everything that is plugged into the grid will benefit,\" Garman added.\n\nAmazon also announced a new agreement with utility company Energy Northwest, a consortium of state public utilities, to fund the development, licensing and construction of four SMRs in Washington State. The reactors will be built, owned and operated by Energy Northwest but will provide energy directly to the grid, which will also help power Amazon operations.\n\nUnder the agreement, Amazon will have the right to purchase electricity from the first four modules. Energy Northwest has the option to build up to eight additional modules. That power would also be available to Amazon and Northwest utilities to power homes and businesses.\n\nThe SMRs will be developed with technology from Maryland-based X-energy, a developer of SMRs and fuel. Along with Amazon's other announcements, Amazon's Climate Pledge Fund disclosed it is the lead anchor in a $500 million financing round for X-Energy. The Climate Pledge Fund is its corporate venture capital fund that invests in early-stage sustainability companies. Other investors include Citadel Founder and CEO Ken Griffin, affiliates of Ares Management Corporation, NGP and the University of Michigan.\n\n\"Amazon and X-energy are poised to define the future of advanced nuclear energy in the commercial marketplace,\" said X-energy CEO J. Clay Sell. \"To fully realize the opportunities available through artificial intelligence, we must bring clean, safe, and reliable electrons onto the grid with proven technologies that can scale and grow with demand.\"\n\nLast spring, AWS invested in a nuclear energy project with Talen Energy, signing an agreement to purchase nuclear power from the company's existing Susquehanna Steam Electric Station, a nuclear power station in Salem Township, Pennsylvania. AWS also purchased the adjacent, nuclear-powered data center campus from Talen for $650 million.\n\n",
        "created_utc": 1729085363.0,
        "subreddit_name": "stocks",
        "comments": 227
    },
    {
        "title": "Qualcomm Said to Wait for US Election to Decide Intel Move",
        "score": 186,
        "url": "https://www.reddit.com/r/stocks/comments/1g4nr8y/qualcomm_said_to_wait_for_us_election_to_decide/",
        "content": "Qualcomm Inc. (QCOM) is likely to wait until after the US presidential election in November before deciding whether to pursue an offer to buy Intel Corp. (INTC), people familiar with the matter said.\n\nSan Diego-based Qualcomm wants greater clarity on the new occupant of the White House before deciding its next move because of the impact any future administration would have on the antitrust landscape and America’s relationship with China, according to the people, who asked not to be identified discussing confidential information.\n\nQualcomm could opt to wait until after the inauguration of the new US president in January before deciding how to proceed, given the many complexities of a potential transaction involving Intel, some of the people said.\n\nA combination of Qualcomm and Intel, whose products are key to the digital framework supporting everyday life — from smartphones to electric vehicles — would almost certainly draw intense scrutiny from antitrust regulators in the US and around the world. That includes China, a key market for both Qualcomm and Intel.\n\nQualcomm made a preliminary approach to Intel on a possible takeover of its struggling rival in September. In the same month, the company made informal inquiries with antitrust regulators in China to gauge their stance on any potential deal, some of the people said. Qualcomm hasn’t received any feedback from Chinese authorities, which are waiting to see if the company actually makes a formal bid, they said.\n\nIntel is at the heart of the US government’s plan for a homegrown chipmaking renaissance, making the political backing for any deal crucial. The Biden administration has consistently framed the importance of its chipmaking policy in national security terms. Intel is in line to get the biggest allocation of funding under the 2022 Chips and Science Act, if it goes ahead with all of its factory building plans. Qualcomm has been speaking with US regulators and believes an all-American combination could allay any concerns, people familiar with the matter have previously said.\n\nMaking a bid after the election may bring other advantages for Qualcomm. Intel will report third-quarter earnings later this month. If that follows the pattern of the disappointing announcement of three months ago and the impact it had on the potential target’s stock price, it could make a deal considerably less expensive for Qualcomm. This time around, analysts are predicting another net loss in excess of $1 billion for Intel.\n\nQualcomm’s deliberations are ongoing and there’s no certainty that the company will decide to pursue an offer for Intel and the timing could change, the people said. Representatives for Qualcomm and Intel declined to comment, while the State Administration for Market Regulation in China didn’t respond to requests for comment.\n\nUnder Chief Executive Officer Pat Gelsinger, Intel has been working on an expensive plan to remake itself and bring in new products, technology and outside customers. As part of a recently announced shakeup, Intel intends to turn its programmable chip division into a standalone business and sell shares to the public or seek an investor for it.\n\nApollo Global Management Inc. has offered to make a multibillion-dollar investment in Intel, Bloomberg News reported last month, providing the chipmaker with a vote of confidence in its turnaround strategy and a possible alternative to any takeover by Qualcomm.\n\nhttps://finance.yahoo.com/news/qualcomm-said-wait-us-election-210030994.html",
        "created_utc": 1729041511.0,
        "subreddit_name": "stocks",
        "comments": 44
    },
    {
        "title": "Global chip stocks fall on ASML’s disappointing outlook, possible U.S. export cap",
        "score": 9,
        "url": "https://www.reddit.com/r/stocks/comments/1g538dr/global_chip_stocks_fall_on_asmls_disappointing/",
        "content": "**Global chip stocks fall on ASML’s disappointing outlook, possible U.S. export cap**\n\n[https://www.cnbc.com/2024/10/16/asian-chip-stocks-fall-on-asmls-disappointing-forecast-possible-us-export-cap.html](https://www.cnbc.com/2024/10/16/asian-chip-stocks-fall-on-asmls-disappointing-forecast-possible-us-export-cap.html)\n\n*Key Points*\n\n* *Asian and European chip stocks fell on Wednesday after Dutch semiconductor equipment maker ASML posted disappointing sales forecasts, driving down global stocks in the sector.*\n* *In Asia, Japan’s Tokyo Electron logged the biggest loses, dropping nearly 10%, while in Europe, ASML stock fell for a second day, losing 4% of its value.*\n* *ASML’s CEO Christophe Fouquet warned of cautiousness among customers in the company’s results — which were released a day early — saying a “recovery is more gradual than previously expected.”*\n\n&#x200B;\n\n*Global chip stocks fell on Wednesday, after Dutch semiconductor equipment maker ASML posted disappointing sales forecasts, driving down global stocks in the sector.Shares of ASML extended losses into the second day at the start of the European trading session, down 5%. The company’s stock dropped 16% Tuesday, losing 49.2 billion euros ($53.6 billion) from its market capitalization in a single day, according to CNBC calculations.ASML’s decline also dragged other European semiconductor firms in the red on Wednesday. ASMI — a Netherlands-based firm that supplies wafer processing equipment for the semiconductor manufacturing industry — fell 2.3%. Compatriot chip equipment maker BE Semionductor dropped 1.9%.Dutch-listed semiconductor firm STMicroelectronics lost 1.2%, while German chipmaker Infineon shed 1.1%. Soitec, French semiconductor materials manufacturer, fell 0.9%*\n\n&#x200B;\n\n*Asian declines*\n\n&#x200B;\n\n*In Asia, meanwhile, shares of Japanese semiconductor manufacturing firm Tokyo Electron logged the biggest loses, dropping nearly 10%. Renesas Electronics fell over 3%, and Advantest, a testing equipment supplier dipped 0.8%.Taiwan Semiconductor Manufacturing Company and Hon Hai Precision Industry — known internationally as Foxconn — fell as much as 3.3% and 1.6, respectively.South Korean chipmaking heavyweight SK Hynix, which manufactures high bandwidth memory chips for AI applications for Nvidia, traded 1.6% lower. While Samsung Electronics, the world’s largest maker for dynamic random-access memory chips, saw its shares drop 1.9%.Losses in the region’s semiconductor sector also dragged down major indexes. Japan’s Nikkei 225 lost more than 2%, South Korea’s Kospi dipped 0.6% and the Taiwan Weighted Index slid 0.7%.*\n\n&#x200B;\n\n*ASML reports early*\n\n&#x200B;\n\n*In a report on Tuesday, ASML, which is based in Veldhoven, Netherlands, said it expects net sales for 2025 to come in between 30 billion euros and 35 billion euros ($32.7 billion and $38.1 billion), at the lower half of the range it had previously provided.Net bookings for the September quarter were 2.6 billion euros ($2.83 billion), the company said — well below the 5.6 billion euro LSEG consensus estimate. Net sales, however, beat expectations coming in at 7.5 billion euros.The company’s CEO warned of cautiousness among customers and said a “recovery is more gradual than previously expected.”After ASML tanked 16%, other global chipmakers plunged. Nvidia fell 4.7% and AMD lost 5.2%.Also on Tuesday, Bloomberg reported that that Biden administration officials had discussed limiting sales of advanced AI clips from Nvidia to certain countries in the interest of national security, further dampening investor sentiment around the semiconductor sector.ASML has faced a tougher business outlook in China due to U.S. and Dutch export restrictions on its shipments.CFO Roger Dassen said Tuesday that he expects the company’s China business to show a “more normalized percentage in our order book and also in our business.”“So we expect China to come in at around 20% of our total revenue for next year,” he said. In its June-quarter earnings presentation, ASML said that 49% of its sales come from China.ASML’s business in Asia is likely to face continued headwinds, Eugene, Hsiao, head of China equity strategy at Macquarie Capital, said on CNBC’s “Squawk Box Asia” on Wednesday.While “it makes a lot of sense” for ASML to continue working with China from the “economic perspective”, he said, there are “broader issues between governments going into economic problems.”*",
        "created_utc": 1729095356.0,
        "subreddit_name": "stocks",
        "comments": 10
    },
    {
        "title": "baby’s first year trading options with prideful 250%+ YTD - AMA or roast me.",
        "score": 49,
        "url": "https://www.reddit.com/gallery/1g5c8cl",
        "content": "This got removed in options for being too noob so here I am with you fellow regards.\n\nI started trading options in March and smashed my previous ATH this week 🎉 \nI’ll summarize the last 6-12 months:\nFor most of 2022-2023 across three accounts, both taxable and IRAs, I had been middling around 15k and not doing very well trading. In the last 6 months since I started options, I’m up over 125% with only about $200 a month deposited. I’m also up 250% YTD and 340% the past 12 months, but those include a max Roth IRA $6500 contribution. It was a pretty good time to start playing semi/AI tech, and then space startups, but of course I wish I got in sooner! \n\nMy biggest successes have been with AAPL, TSM, and NVDA of course, then ASTS, RKLB, LUNR. \nLost on SOFI and DKNG while getting my feet wet, then played a series of TSM calls for big wins. I needed those wins to afford any NVDA options 😂 \nHad another big loss with MU, some on HIMS (I hate the stock). Have a little in OKLO shares but super pissed I didn’t grab some calls in the last few months.\n\n*I’ll post more in comments if people ask.* I did not have a disciplined strategy, just some loose principles putting guardrails on my emotional gambling mindset (vibe check sigma grindset). I think I got slightly past the “first run is free” phase and now I can clearly see I am the next Buffett. ",
        "created_utc": 1729118534.0,
        "subreddit_name": "wallstreetbets",
        "comments": 31
    }
]