[
    {
        "title": "My wife's 401K rollover- with Empower- is lost in bureaucracy!",
        "score": 293,
        "url": "https://www.reddit.com/r/investing/comments/1at0rcx/my_wifes_401k_rollover_with_empower_is_lost_in/",
        "content": "**UPDATE:  The money was finally moved to her IRA after complaining up the chain of command.  But read forward to understand how crazy 401K to IRA Rollovers can be.**\n\nMy wife had almost $300,000 in her Empower 401K.  When she lost her job she decided to roll over the funds in her 401K into an individual IRA.  (She could have kept the money in her 401K but had lots of fees and limited investment options.)\n\nShe looked into moving the money over to Fidelity where she had an investment account, but got nervous when they told her they (Empower) would mail her a check which she would then have to present to Fidelity. The Internet is full of horror stories of 401K Rollover checks being lost or stolen from the mail.  This happened to two different friends of ours and it took them nearly a month to get it all settled and the money was out of the stock market during a month the market was booming.\n\nSo my wife decided to keep the money with Empower and open an Empower IRA so she would simply do a direct 401K to IRA Rollover within the same company.  It was suppose to be easy with no paper check.\n\nSo two weeks ago the money was taken out of her 401K account and it now shows zero.  Every day she checks the Empower IRA Account and that shows a ZERO Balance.  The money is lost in computer bureaucracy and not getting any investment returns. The Empower Website says this should only take 2-3 business days!\n\nEvery three days she calls the Customer Service Number of Empower and after sitting on hold for 30-60 minutes an unhelpful person answers the phone and tells my wife the transfer (401K to Rollover IRA) **is in process.**  Yesterday, in total frustration, she talked to a supervisor and was told the same thing- the rollover is in process.\n\nThis could happen to any of us with any Investing/Brokerage Company doing a direct no check 401K to IRA Rollover.\n\nWhat would you do?  Should we contact an Attorney or work with some government agency to get our money?",
        "created_utc": 1708172539.0,
        "subreddit_name": "investing",
        "comments": 217
    },
    {
        "title": "Gruber: Apple was 'effectively forced' by China to bring RCS to iPhone",
        "score": 1582,
        "url": "https://9to5mac.com/2024/02/16/rcs-iphone-china/",
        "content": "",
        "created_utc": 1708141502.0,
        "subreddit_name": "apple",
        "comments": 406
    },
    {
        "title": "The NASDAQ 100's $QQQ performance each year since 1999",
        "score": 420,
        "url": "https://www.reddit.com/r/stocks/comments/1atcunf/the_nasdaq_100s_qqq_performance_each_year_since/",
        "content": "1999: +79%:\n\n2000: -36.1%:\n\n2001: -33.4%:\n\n2002: -37.4%:\n\n2003: +49.7%:\n\n2004: +10.5%:\n\n2005: +1.6%:\n\n2006: +7.1%:\n\n2007: +19%:\n\n2008: -41.7%:\n\n2009: +54.7%:\n\n2010: +19.9%:\n\n2011: +3.4%:\n\n2012: +18.1%:\n\n2013: +36.6%:\n\n2014: +19.2%:\n\n2015: +9.5%:\n\n2016: +7.1%:\n\n2017: +32.7%:\n\n2018: -0.1%:\n\n2019: +39%:\n\n2020: +48.6%:\n\n2021: +27.4%:\n\n2022: -32.6%:\n\n2023: +54%:\n",
        "created_utc": 1708205342.0,
        "subreddit_name": "stocks",
        "comments": 150
    },
    {
        "title": "$NVDA earnings next week",
        "score": 7317,
        "url": "https://i.redd.it/8mrz3ogrl6jc1.jpeg",
        "content": "",
        "created_utc": 1708191389.0,
        "subreddit_name": "wallstreetbets",
        "comments": 530
    }
]