[
    {
        "title": "$80,000 to $1.12M in 7 days. Thank you Elon Musk! $TSLA",
        "score": 9697,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gouy6r/80000_to_112m_in_7_days_thank_you_elon_musk_tsla/",
        "content": "https://preview.redd.it/5i2pyzrxja0e1.jpg?width=1098&format=pjpg&auto=webp&s=c2f04c7bed78f9c752e85e916ed65fb1503dccc2\n\nhttps://preview.redd.it/capdss2yja0e1.jpg?width=831&format=pjpg&auto=webp&s=7d7840950b254bfbef13d3c2bb56be8b2a0a005d\n\n(Repost from 30 minutes ago because my post wasn't clear enough according to the mods)  \n  \nSo, I wanted to bet on Tesla mooning as a result of Trump winning due to their new close relationship, and the deregulation that was coming for Tesla in the new administration. I'm not a political person, just trading off an idea!\n\nSo here's what I did:  \n  \nBought $15,000 on 3:1 Kamala bets to win $30,000 to hedge my $50,000 in TSLA weekly calls. If she had won, I'd lose $10K-15K Max. If Trump won, this happens... Rolled my weekly calls to 29 Nov/ 20 Dec and held till today. Closed 95%.",
        "created_utc": 1731339263.0,
        "subreddit_name": "wallstreetbets",
        "comments": 985
    },
    {
        "title": "NVDA Earnings 256.85%=173K For over a year it has allowed me to witness your greatness!🚀",
        "score": 40,
        "url": "https://i.redd.it/ffwaw4pj4b0e1.jpeg",
        "content": "For over a year now I have been quietly supporting you behind the scenes and you have shown me how great you are and hope you can do it again!",
        "created_utc": 1731345997.0,
        "subreddit_name": "wallstreetbets",
        "comments": 4
    },
    {
        "title": "Wild ride TSLA ",
        "score": 36,
        "url": "https://www.reddit.com/gallery/1gouq6s",
        "content": "$25k in 2018 >> $5k (nov 6th 2024) >> $32k (Nov 11th 2024)\n\nTSLA saved the day! Signing off.",
        "created_utc": 1731338717.0,
        "subreddit_name": "wallstreetbets",
        "comments": 3
    },
    {
        "title": "Time to inverse WSB, 50k puts on $TSLA",
        "score": 22,
        "url": "https://i.redd.it/f0dbekftrb0e1.png",
        "content": "You are all so bullish on TSLA. Time to do the opposite, this week we have CPI, multiple fed speakers and unemployment. See you all back at 250$",
        "created_utc": 1731353825.0,
        "subreddit_name": "wallstreetbets",
        "comments": 18
    },
    {
        "title": "TSLA what does your trend want us to do?",
        "score": 3,
        "url": "https://i.redd.it/s22owl1lzb0e1.jpeg",
        "content": "Over the past five trading days TSLA has accumulated a 46% gain.",
        "created_utc": 1731356444.0,
        "subreddit_name": "wallstreetbets",
        "comments": 5
    },
    {
        "title": "Today’s Gain 🚀",
        "score": 47,
        "url": "https://i.redd.it/ofqmri927c0e1.jpeg",
        "content": "Bought TSLA 285 call on Nov. 6th intraday\n\nBecause I knew that TSLA would undoubtedly be the biggest gainer after Trump's victory\n\nSo I bought TSLA calls and kept them until now, I was overwhelmed with excitement during the days of waiting and thankfully I stuck with it and got the gains I have now\n\nI'm considering whether to sell it for my gains or not",
        "created_utc": 1731358951.0,
        "subreddit_name": "wallstreetbets",
        "comments": 10
    },
    {
        "title": "Give your opinion on my DCF analysis on different companies",
        "score": 3,
        "url": "https://www.reddit.com/r/investing/comments/1gp1yu9/give_your_opinion_on_my_dcf_analysis_on_different/",
        "content": "I've done a Google Sheets table where I do valuation on different companies so that I am able to get to the intrinsic value. I use the TTM Free Cash Flow and project its growth. The assumptions required are Free Cash Flow growth for 2024-2032, discount rate which takes into account time value of money and risk, perpetual growth which means FCF growth after 2032 and lastly I get the intrinsic value. I'll show my table with it's assumptions so you can tell me whether they should realistic or I should adjust some variable to be more realistic. I understand that these assumptions are optimistic but I am also optimistic about the companies so the numbers make sense to me. Discount rate is always 7.75% and Perpetual 3% so I'll just show my assumptions on FCF Growth for 2024-2032 and Intrinsic Value/DCF Price and the current price. I'd love to hear your view and I'll adjust accordingly.\n\nHere it goes: Stock, Projected FCF Growth 2024-2032, **Intrinsic Value/DCF Price**, Current Price:\n\nMSFT: 12-13.15%, **370-404**, 420\n\nAMZN: 12.5-13.75%, **163-178**, 207\n\nMCO: 11.50-12.25%, **413-437**, 508\n\nBRKB: 10.50-11%, **443-461**, 468\n\nGOOG: 11.50-12.50%, **162-174**, 182\n\nMA: 11.50-12.00%, **477-495**, 531\n\nV: 11.00-11.50%, **318-330,** 310.63\n\nMSCI: 11.50-12%, **551-573**, 598.07\n\nFICO: 11.50-12.25%, **778-825**, 2344.13\n\nTPL: 10.50-11.50%, **661-707**, 1393.33\n\nBLK: 10.50-11%, **953-988**, 1049.58\n\nTSM: 12.75-13.25%, **133-137**, 192.9\n\nASML: 13.50-14.00%, **588-609**, 627.3\n\nEvery comment is greatly appreciated.",
        "created_utc": 1731356235.0,
        "subreddit_name": "investing",
        "comments": 0
    },
    {
        "title": "NVDA has become the largest position in retail portfolios in the first half of the year",
        "score": 43,
        "url": "https://www.reddit.com/r/stocks/comments/1gp0l4n/nvda_has_become_the_largest_position_in_retail/",
        "content": "Data on the 15 most widely held stocks and ETFs in retail portfolios and sorted by weight, NVDA tops the list with a 9.3% weighting over other popular stocks. Such as Apple, S&P 500 EFT, Tesla, Nasdaq 100 EFF, Meta, and others.\n\nThis compares to NVDA's 4.2% weighting in the average retail portfolio a year ago\n\nNVDA's popularity is largely due to its rapidly rising stock price, earnings reports that have repeatedly beaten expectations, and retail investors' preference for tech stocks - over the past year, NVDA's stock price has risen 203%, and in the second quarter, NVDA's revenues of $30 billion were up 15% sequentially and 122% year-on-year, well above the $28 billion estimate",
        "created_utc": 1731352880.0,
        "subreddit_name": "stocks",
        "comments": 29
    },
    {
        "title": "Thank you Elon! $TSLA $10k to $149k in under a week",
        "score": 221,
        "url": "https://i.redd.it/k519nqm4xc0e1.jpeg",
        "content": "Opened a lotto account last week after the elections and full send $TSLA FDs . Holding 49 contracts $450c for 3/22/2025 for now. ",
        "created_utc": 1731367715.0,
        "subreddit_name": "wallstreetbets",
        "comments": 39
    },
    {
        "title": "$TSLA Calls Closed +$400k",
        "score": 22,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gp6tf7/tsla_calls_closed_400k/",
        "content": "Haven't gotten any sleep holding these Tesla calls, but it finally paid off. Exited everything today for peace of mind and a good night's rest. Rolled the profits into Tesla shares targeting $400. It’s been a brutal yet humbling ride and now ready for the next chapter.\n\nHere’s to those who hold the line for the moon 🚀💎🤲\n\nhttps://preview.redd.it/zf9h5ghxyc0e1.jpg?width=1257&format=pjpg&auto=webp&s=ebac47352deb82b8e1976bdc32c6f45091d12175\n\nhttps://preview.redd.it/l2nhwagxyc0e1.jpg?width=1282&format=pjpg&auto=webp&s=31cf665a90f13ffb87532fe3ecb6a42cee602c59\n\n",
        "created_utc": 1731368338.0,
        "subreddit_name": "wallstreetbets",
        "comments": 8
    },
    {
        "title": "IonQ - The Hyperbolic Run Just Started",
        "score": 6,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gp6cnt/ionq_the_hyperbolic_run_just_started/",
        "content": "Ladies and Gentlemen, let me explain to you why IONQ, though up 84%YTD, is about to start an explosive bull run.\n\n**What is IonQ?** Backed by Industry Veterans from companies such as NVIDIA, Amazon, Dell, Microsoft: IonQ is a quantum computing hardware and software company, developing a general-purpose trapped ion quantum computer and software to generate, optimize, and execute quantum circuits.  Quantum computers will not take over traditional computers, but rather will exist alongside them.  For certain computational tasks, you currently need 2,500,000,000 GPUs worth of energy to solve what ONE Quantum Computer will be able to do near-term, an unbelievable saving in energy.  Explaining Quantum Computing as a whole would take several paragraphs, I encourage you to watch this beginner video if interested: [https://www.youtube.com/watch?v=B3U1NDUiwSA](https://www.youtube.com/watch?v=B3U1NDUiwSA) \n\nQuantum computers have just recently become more powerful than the worlds largest supercomputers for certain problems.\n\n**Energy** \\- With the rise in AI energy usage, we’re expected to double our energy consumption demands over the next few years.  Everyone seems to think building up a ton of nuclear reactors and power plants will be the solution to this new energy issue, but the CEO of IonQ disagrees.  He believes Quantum Computing can help AI drastically reduce its energy necessity. \n\n**AQ64, The Catalysts of all Catalysts** \\- A task ran with AQ64 will use 18 Kilowatts of power, comparatively to **multiple billions** of kilowatts for an equivalent task on a GPU.   IonQ says reaching AQ64 will be a “ChatGPT” moment for Quantum Computing, equating to the recent AI boom of just a few years ago.  AQ64 is expected to release towards the end of 2025, but they have consistently CRUSHED target dates, beating their 2022 target date in 2022 by 2 months, 2023 by 7 months, and 2024 by 12 months.  AQ64 is coming sooner than we think.\n\n**UAE x Quantum**: XPANSE QUANTUM is an exclusive forum taking place Nov 20-22 in Abu Dhabi, focusing on cultivating strategic relationships with 2,500 key global leaders in the UAE, and the GCC region.  Obviously they have a ton of money, and with the USA and China recently pouring billions into a new “Quantum Race”, it’s in their best interest to get involved.\n\n**Elise Stefanik, UN 2025 and the “year of quantum”** \\- Elise Stefanik was recently, as of 8 hours ago, appointed as UN Ambassador by Donald Trump.  Stefanik has close ties with IonQ [https://x.com/RepStefanik/status/1801346033902825524](https://x.com/RepStefanik/status/1801346033902825524) , and is a strong believer in the US beating China in the “Quantum Race”  Currently, the USA has only issued 1.2 Billion$ to be invested in Quantum over the next 5 years, while China has invested 15 Billion$.  So far, IonQ has received just 54.5M$ from the United States Air Force Research Lab… but that’s about to change…\n\nThe United Nations has proclaimed 2025 as the International “Year of Quantum Science and Technology”.  Elise Stefanik is the new UN Ambassador, wants to beat China in the “Quantum Race”, and the entire globe is about to accelerate Quantum development… Get it yet?\n\nThe last topic I will mention is Blockchain and Encryption being at threat due to Quantum Computing:  I don’t know enough of this, so I’ll quote one line and leave a link: “Quantum computers could potentially break current blockchain encryption, risking billions in cryptocurrency assets, according to a quantum policy expert.” [https://thequantuminsider.com/2024/09/08/blockchain-and-quantum-computing-are-on-a-collision-course-expert-warns/](https://thequantuminsider.com/2024/09/08/blockchain-and-quantum-computing-are-on-a-collision-course-expert-warns/)\n\n**Why not other quantum companies?** Compared to other companies Algorithmic Qubits (AQ), IonQ has achieved near to ideal fidelity, AKA, their methods actually work, whereas other companies fail.  On top of this, IONQ has recently begun a spree of not only partnering with, but also acquiring multiple companies in a strategic play to make themselves a defining leader in this emerging sector. \n\nFirst came the CPU, then the GPU, next up: the QPU.  So far Quantum Computing has found Value in potential Market Sizes of up to $220 Billion USD, expecting to be in the Trillions in a few years.  None of this is financial advice, and do your own research.\n\n**Positions:** 10,900 Shares, \\~25k$ in 4/17/25 $25c\n\n[https://s28.q4cdn.com/828571518/files/doc\\_financials/2024/q3/24-11-06-Investor-Updates-Q3-2024\\_vF.pdf](https://s28.q4cdn.com/828571518/files/doc_financials/2024/q3/24-11-06-Investor-Updates-Q3-2024_vF.pdf)\n\n[https://www.youtube.com/watch?v=dSVRPDrI8aI](https://www.youtube.com/watch?v=dSVRPDrI8aI) \n\n[https://www.forbes.com/sites/torconstantino/2024/10/02/is-quantum-computing-an-unlikely-answer-to-ais-looming-energy-crisis/](https://www.forbes.com/sites/torconstantino/2024/10/02/is-quantum-computing-an-unlikely-answer-to-ais-looming-energy-crisis/) \n\nhttps://www.xpanse.world/xpanse-quantum#:\\~:text=XPANSE%20Quantum%20is%20a%20milestone,UAE%20and%20the%20GCC%20region.\n\n[https://www.hpcwire.com/2023/08/15/ionq-says-reaching-aq-64-will-be-a-chatgpt-moment-for-quantum-computing/](https://www.hpcwire.com/2023/08/15/ionq-says-reaching-aq-64-will-be-a-chatgpt-moment-for-quantum-computing/)",
        "created_utc": 1731367085.0,
        "subreddit_name": "wallstreetbets",
        "comments": 6
    },
    {
        "title": "Bitcoin and AI sector ETFs?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gp764v/bitcoin_and_ai_sector_etfs/",
        "content": "Bitcoin & AI sector ETFs?\n\nDoes anyone know any ETFs that may capture bitcoin related stocks such as RIOT, MARA, MSTR, IBIT, etc?\n\nSame goes for AI such as NVDA, META, PLTR, etc.\n\nIt’s crazy to think these could keep going up and up, but mine as well try to capture this sector outside of the tradition SPY, VTI ETFs \n\nThanks ",
        "created_utc": 1731369301.0,
        "subreddit_name": "investing",
        "comments": 2
    },
    {
        "title": "Elon Musk’s Trump bet has paid off so well that Tesla is now worth more than most of the rest of the car industry combined",
        "score": 8917,
        "url": "https://www.reddit.com/r/stocks/comments/1gowwdj/elon_musks_trump_bet_has_paid_off_so_well_that/",
        "content": "[https://fortune.com/2024/11/11/elon-musk-donald-trump-election-tesla-auto-industry-carmakers-market-value/](https://fortune.com/2024/11/11/elon-musk-donald-trump-election-tesla-auto-industry-carmakers-market-value/)\n\n>Tesla CEO Elon Musk’s ‘all-in’ gamble to get Donald Trump elected president has proven so successful that a veritable chasm has opened up between his EV manufacturer and the rest of the auto industry. As conventional carmakers trade at rock-bottom prices amid a broad industry malaise brought on by China’s economic slowdown and growing fears of Trump tariffs, Tesla’s stock continues to soar, creating one of the biggest valuation gaps it’s ever seen.\n\n>On Friday, Tesla reclaimed its place in the elite club of companies worth more than $1 trillion after adding a full third in market capitalization since Election Day less than a week ago. The last time Tesla was worth this amount of money it was April 2022, Musk had just revealed his $44 billion plan to acquire Twitter.\n\n>Relative to its peers, Tesla is now worth more than the next 15 largest carmakers combined—from Toyota and General Motors all the way down to Jeep’s parent company Stellantis and Hyundai. Toss in lower ranked names like Kia and Renault, respectively worth $26.6 billion and $12.6 billion, and Tesla is still is still ahead, only drawing even once the $8.8 billion from Japan’s Nissan is thrown into the mix.",
        "created_utc": 1731344115.0,
        "subreddit_name": "stocks",
        "comments": 770
    },
    {
        "title": "ELF has unlimited potential and is up sharply today ",
        "score": 49,
        "url": "https://www.reddit.com/r/stocks/comments/1gov28j/elf_has_unlimited_potential_and_is_up_sharply/",
        "content": "U.S. e.l.f. Beauty was founded in 2005, mainly to do affordable fast-fashion makeup, but not until after the epidemic suddenly became very popular in the U.S., and make its market value wildly, from about 500 million in early 2020, to a maximum of 12 billion in March 2024, and because of the lower-than-expected earnings report, the management lowered its guidance, predicting that the 25-year growth slowed down to 25% (23 years for 80-percent), now November 2024 market cap of $7.3 billion;\n\nIn a nutshell: now $7.3B market cap, ELF has unlimited potential for future growth.\n\n Company business:\n\n1, the main category is color cosmetics, the latest signature product is Soft Glam Satin Foundation, also have skin care products, but the share is very low. The main focus is on cost-effective, light operation, U.S. design + China manufacturing (third-party production);\n\n2. Revenue by region, US market accounts for 85%, international market 15%; in the US, it mainly relies on Walmart, Target, CVS, Ulta Beauty, and other channels for sales; ELF is currently available in 14+ countries, and distributes globally mainly through eShopWorld;\n\nRevenue by channel, retailers occupy 85%, e-commerce channel 15%;\n\n3. Main reasons for its success:\n\n(1) By OEM in China, it reduces cost (70% gross margin) and creates cost-effective selling points; and it responds quickly, with new products taking only 13 weeks from R&D to launch;\n\n(2) Through new media and netizen cooperation, it is very influential on social media like Tiktok and Instagram, and develops marketing content and so on separately according to different social media attributes;\n\n(3) Pushing new products by cross-branding with many brands (jeans, fast food restaurants, etc.);\n\nNovelty, fast fashion, new media marketing approach, making it popular among teenagers represented by Generation Z. It ranks in the top three in terms of market share of cosmetics (may refer to the United States alone);\n\n4. Brand awareness is rising rapidly:\n\nWithin the U.S., ELF's brand awareness increased from 13% in 2020 to 26% in 23 and 33% in 24;\n\nIt is the fourth largest brand in the UK and Canada, compared to eighth and sixth respectively a year ago.\n\n Company strategy:\n\nCost-effective products + new media marketing + low-cost channels\n\n Executives and shareholdings:\n\n(1) All are predominantly institutional holdings and are relatively diversified; Pioneer Pilot 10-percent, BlackRock 9-percent, Berkey Investments 7-percent, and so on;\n\n2, CEO joined and served as CEO in 2014, with prior track record of experience in a variety of industries. cfo and VP joined the position in 19, also not previously in the beauty industry.\n\n3, As of March 31, 2024, there are just under 500 full-time employees, including 100 in China.\n\n Financial:\n\n1. Income Statement: revenue for fiscal year 2024 (2024.03) is $1.1 billion, gross profit is $800 million, selling and administrative expenses are $650 million, and net income is $120 million; revenue from fiscal year 2019 to 2024 is, in order, $27, $2.8, $3.2, $4, $5.8, $1.0, and $1.13 billion; revenue increases from FY21 to FY24 are, in order, 12%, 23%, 48%, and 77%; net income from 2019 to 2024 fiscal years in order: 0, 0.2, 0, 0.2, 0.6, 1.3, 120 million;\n\n2, cash flow statement: operating cash flow of 0.7 billion and free cash flow of 0.6 billion in 2024; it has basically no financing since its IPO, with 0.2 billion in buybacks, and in August '24 it said that the board of directors authorized up to $500 million in buybacks ;\n\n3, balance sheet: as of the end of March 24, total assets were $1.2 billion, total liabilities were $500 million, shareholders' equity was close to $700 million, and the debt ratio was 40%; among assets, cash assets were $100 million, inventory was $200 million, fixed assets were $0.07 billion, and goodwill + intangibles were $0.6 billion; on the liability side, interest-bearing liabilities were $260 million (short $1+long $16), and the financial position was good.\n\n4, valuation: the current (2024.11) market capitalization of 7.3 billion U.S. dollars, corresponding to the annual revenue of about 1 billion per year, after spending 700 million per year after the sale of the management costs, to get 100 million in profit and free cash flow; assets on the books of 100 million in cash, 250 million in liabilities, shareholders' equity of 700 million (most of the goodwill and intangible assets)\n\n Market views:\n\n1, the short side:\n\n(1) The U.S. and Canadian markets are very close to saturation, ELF is certain categories have been ranked one or two, like the previous substantial growth is unlikely;\n\n(2) The international market is a vast space for development, but it is estimated that the U.S. market can not be achieved as high-speed expansion;\n\n(3) industry EV / EBITDA valuation, for those with growth, generally at 25 times, ELF in 22, 23 years, respectively, 37, 46;\n2, multiple parties:\n\n(1) international market has great potential, by FY27, revenues will reach 1.8 billion (now 1 billion), should be given a valuation of 71 times the P/E ratio, the target share price is $250\n\n Summary:\n\nELF was founded in 05, fast fashion beauty brand, with the success of the new media marketing in the past few years, the brand influence has increased greatly, after 21 years, the average 50% increase in revenues, the market capitalization is also soaring, soaring from $500 million to $12 billion, back to $7.3 billion now.\n\nThe biggest problem with fast fashion brands is that they tend to rise fast and fall fast; to form a brand moat, they still need more than a decade of precipitation.\n\nSo the observation of ELF is mainly to see whether its hotness in the United States can be sustained, as well as the development of overseas markets;\n\nOverall, fast fashion beauty, because of its low technology and high profit, belongs to the products that need strong marketing, and it is considered a good idea to use new media + Netflix as the main marketing method.",
        "created_utc": 1731339560.0,
        "subreddit_name": "stocks",
        "comments": 23
    },
    {
        "title": "US Tech Stocks will push back against EU pressure as Trump signals tariffs and 'America First' policies",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1govegm/us_tech_stocks_will_push_back_against_eu_pressure/",
        "content": "Honestly, it feels like Apple and the whole US tech sector are finally standing up to the EU's Digital Markets Act (DMA) and all the over-the-top regulations. With Trump hinting at tariffs and pushing that \"America First\" vibe, the U.S. tech giants might finally have the leverage to say \"no thanks\" to a lot of the stuff Europe’s trying to force on them. The DMA is supposed to keep things competitive, but for companies like Apple, it’s just restrictive and honestly impacts their ability to innovate. If the U.S. government throws its weight behind them, these companies could really start pulling back from Europe’s grip and go about their business without being bogged down by EU red tape.\n\n\n\nEurope’s supposed to be an innovation hub, but it’s really starting to look like the opposite. For startups, the endless admin, complex regulations, and sky-high taxes make it pretty much impossible to thrive. You have great ideas coming out of Europe, but the bureaucracy and costs just suffocate them before they can take off. Compare that to the U.S., where taxes are lower and there’s way less red tape, and you can see why so many are ditching Europe altogether. It’s like the EU’s digging its own grave when it comes to tech innovation, and the U.S. might be there to pick up the pieces.\n\nit's time to heavily long US Tech Stocks imo ",
        "created_utc": 1731340427.0,
        "subreddit_name": "stocks",
        "comments": 61
    },
    {
        "title": "Hedge Funds Shorting Tesla Just Lost More Than $5 Billion\n",
        "score": 2259,
        "url": "https://finance.yahoo.com/news/hedge-funds-shorting-tesla-just-190000159.html",
        "content": "",
        "created_utc": 1731334410.0,
        "subreddit_name": "wallstreetbets",
        "comments": 234
    },
    {
        "title": "The Great Kohl's Catastrophe: Why Your Grandma's Favorite Store Is Doomed to Fail",
        "score": 70,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1goxkm0/the_great_kohls_catastrophe_why_your_grandmas/",
        "content": "Once upon a time, in the golden age of department stores, Kohl's was the go-to destination for anyone seeking a reasonably priced blender, a pair of socks, and perhaps a lawn gnome—all in one trip. But alas, those days are fading faster than the color on a clearance-rack shirt after one wash. Let's dive into the hilariously inevitable downfall of Kohl's.\n\n**1. The Amazonian Elephant in the Room**\n\nIn a world where you can order a drone to deliver your toothpaste within two hours, Kohl's seems as cutting-edge as dial-up internet. Amazon's meteoric rise hasn't just disrupted retail; it's drop-kicked it into a new dimension. While Kohl's has tried to cozy up to the giant by accepting Amazon returns in-store, it's basically like inviting a lion into your living room because you have a mouse problem.\n\n**2. The \"Treasure Hunt\" Experience**\n\nKohl's stores are designed with the aesthetic of a labyrinth meets garage sale. Shoppers are expected to embark on an epic quest worthy of Indiana Jones to find that one item they didn't know they needed. In contrast, competitors like Target have streamlined, organized layouts that don't require a compass and a flare gun to navigate. Perhaps Kohl's is secretly training the next generation of explorers.\n\n**3. Coupon Chaos Theory**\n\nKohl's is infamous for its mind-bending coupon strategies. With Kohl's Cash, percentage discounts, and mystery savings scratch-offs, checking out feels like filing taxes. According to Retail Dive, consumers are increasingly seeking straightforward pricing. But why make things simple when you can turn shopping into a Sudoku puzzle?\n\n**4. Fashionably Outdated**\n\nWhile other fashion retailers sprint to offer the latest trends, Kohl's appears showcasing styles that were all the rage when flip phones were cool. When was the last time you walked into Kohl's and seriously thought, \"God damn, this is fire\" Kohl's consistently presents a clothing line that can only be described as \"blah,\".\n\n**5. Stock Market Slapstick**\n\nKohl's stock performance has been about as stable as a Jenga tower in an earthquake. Over the past five years, their stock price has seen significant declines. In September 2018 the stock was trading at near $80, now trading at a measly $18.  But wait, it gets juicier! The short interest in Kohl's stock has been notably high, signaling that investors are betting on the company's misfortune. It's like the stock market equivalent of people lining up to watch a train wreck in slow motion. Over 30% of Kohl's float was sold short. When a third of your investors are essentially rooting for your downfall, it's a tad suspicious. \n\n**Conclusion**\n\nUnless Kohl's can reinvent itself faster than you can say \"super Saturday sale,\" it's headed for the retail graveyard, right next to Blockbuster and those weird mall pet stores. But hey, at least they'll have plenty of unsold inventory to keep them company.",
        "created_utc": 1731345682.0,
        "subreddit_name": "wallstreetbets",
        "comments": 76
    },
    {
        "title": "Tesla Gain",
        "score": 28,
        "url": "https://i.redd.it/j0s3tg7qca0e1.jpeg",
        "content": "Should I sell after the recent rise? Or hold the stock and loose it all? 👀\n(I know, I just took a screenshot…) 😬\n",
        "created_utc": 1731336640.0,
        "subreddit_name": "wallstreetbets",
        "comments": 5
    },
    {
        "title": "Novo Nordisk rose more than 2.9% during the session, and JPMorgan put it on its “Positive Catalyst List”",
        "score": 18,
        "url": "https://i.redd.it/a4bpz44ojb0e1.jpeg",
        "content": "Novo Nordisk rose more than 2.9% during the session, as JPMorgan put the company's stock on its “positive catalyst list” and gave it an “overweight” rating. JPMorgan's reasoning was bullish on Novo Nordisk's upcoming December disclosure of study data on its weight-loss drug CagriSema...\n\nJP Morgan's team of analysts, led by Richard Vosser, believe that the data will likely confirm that CagriSema has the “best in disease profile,” meaning that it has the best weight-loss effect of any weight-loss drug. They expect Novo Nordisk 's shares to rise at least another 10 percent if the drug really works that well.\nThe analysts predict that the market is most interested in the efficacy data from the REDEFINE 1 clinical trial, which will show that CagriSema has an average weight loss effect of up to 25.1%, which is better than the other two diet pills, Novo Nordisk Wegovy (14.9%) andEli LillyZepbound (20.9%). And, CagriSema's side effects (tolerability) would be about the same as Wegovy and Zepbound.\nIn addition, TD Cowen analyst Michael Nedelcovych has a Buy rating. In a report on Monday, he noted that CagriSema is well on its way to market and that the drug's main active ingredient, semaglutide, continues to be improved.",
        "created_utc": 1731351084.0,
        "subreddit_name": "wallstreetbets",
        "comments": 4
    },
    {
        "title": "Margin Debt",
        "score": 0,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gondu7/margin_debt/",
        "content": "Made a few bad calls on shit stocks including one where I took on about 2000$ in marginal debt at 13%.  \n\nI see no future in a recovery. \n\nHow should I go about paying it off?\n\nI have about 200$ liquid. I’m thinking I sell my NVIDIA shares to make up for it.  \n\nDo we see a future where NVIDIA makes 1000%+ gains again?  I think we’ve reached near the top around the 150$ price mark. \n\nI would rather hold onto my Tesla, Apple, Palantir shares. ",
        "created_utc": 1731312733.0,
        "subreddit_name": "wallstreetbets",
        "comments": 17
    },
    {
        "title": "The actual DD for puts on PLTR",
        "score": 46,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gp56b4/the_actual_dd_for_puts_on_pltr/",
        "content": "I know that I'm casting stones at your temples by making a real and reasonable case for PLTR not going to the moon, but I'll be goddamned if the 40% of my portfolio that I have in PLTR puts is gonna be disrespected like this.\n\n  \nPLTR is a defense contractor specializing in leveraging data modeling and machine learning algorithms in vaguely-disclosed ways to assist the active and counter-intelligence agencies of federated Western nations, but primarily for the US government. You'll note the absolute rockets around every time that there was a news story announcing PLTR going into a contract for the US govt, and just recently when they went into that deal with Anthropic and AWS. Honestly fucking hilarious that Anthropic has a mission statement about not using AI to enable harm to human beings as they do a deal with a defense contractor but I'm here to make money, not make moral judgements. They should probably change that page though. P  \n  \nPeople see \"defense contractor\" and proceed to fully regard the stock as much as one can be regarded here in WSB. Full regard, I must emphasize. The reason that defense contractors are so lucrative isn't just because Uncle Sam has deep pockets.   Defense contractors are valuable for:\n\n* Resale value: I can take an M16, a Humvee, or an AK-47 and sell it to some guy in some country that I can't pronounce, and he can go kill his nemesis with it. Is PLTR gonna resell their algorithms to General Butt-Naked? I seriously fucking doubt it.\n* As above, emphasizing the black market aspect: The US military pays a premium on some completely ass hardware because they buy way too much of it to compensate for the fact that quite a bit of it is gonna fall off the back of a truck into that Yugoslavian terrorist cell.\n* Long-term viability: I can kill you with a pistol made 100 years ago. A 20-year-old fighter jet is still a serious fucking problem for ground units. A 10 year old Humvee is still drivable and maintainable. But even a 2-year-old algorithm or model? The pace of software and model design is prohibitively expensive for the value you receive. You can't sell a 10 year old program, or most of the time even use the motherfucker with modern software.\n\n  \nAnd onto competition. Yes, right now PLTR has quite a lot of headway in the space of providing artificial intelligence leverage and data processing algorithms for intelligence communities, because that's their Brand, which is to say, digital blood money. More power to you, because christ knows that anybody who made enough money very quickly quit giving a fuck about the way they did it. But the assumption that PLTR has a huge moat is just flat fucking wrong. All the algorithms they use to predict behavior, or patterns in communication, or whatever-the-fuck else? ... literally just the same shit that digital ad providers are running.\n\n  \nYou notice in their Anthropic and AWS deal that AWS is a digital ad provider? PLTR is soon to be challenged by any company who thinks to generalize their ad-driving software for intelligence reasons. If you can predict the size of the cock ring I'm gonna buy, I can only assume you can predict my next act of terror by my google searches. Is PLTR using some data-driving secret sauce that nobody has heard of? I really fucking doubt it.\n\n  \nPLTR is a good company that has mad great headway into their space. But they are not a 450% fair market valuation from fundamentals good. When people lose their hype for AI and it becomes just another industry revolution the way computers were, PLTR's revenue is getting its head bounced off the concrete. It's a matter of digital ad companies and improvement of code-assistant agents challenging what little moat PLTR has in the current market.\n\n  \nI'm not gonna hold you that my PLTR puts are absolutely fucking menstrual right now, but I'm buying LEAP puts when my broke ass saves enough from the cubicle farm. Let me reiterate: PLTR is a good company, maybe even a great one, but their moat isn't big enough for a 450% fair market valuation, and even if their moat were bigger, they don't have the same inherent profitability that the other defense contractors do. You can't steal a PLTR algorithm off a truck, or trade the quartermaster some smack for a few dozen rounds of data processing.",
        "created_utc": 1731364082.0,
        "subreddit_name": "wallstreetbets",
        "comments": 92
    },
    {
        "title": "Need Suggestions on Implementing a Stock Market Database",
        "score": 1,
        "url": "https://www.reddit.com/r/investing/comments/1gol51z/need_suggestions_on_implementing_a_stock_market/",
        "content": "I run a small investment advisory/portfolio management business. I've been keeping data on Excel, but now, it's too big to process and update. I would like to setup a simple database where I keep my stock tickers, which will branch out into the following:   \n  \n*1. Price-Volume Data 2. Outstanding Shares 3. Market Capitalization 3. Market Index (into sector index and category index) 4. Financials 5. Dividend History 6. Company News 7. Management Details*  \n  \nI have no idea about database management but I am willing to learn about it. I have the following questions:  \n  \n1. Do I have to buy a big server PC or can I do it on a high spec ordinary PC?  \n2. Which platform do I use to setup this database? Like MySQL or Apache or others? Is it free or do I need a subscription?  \n3. Do I have to learn a specific programming language?  \n4. How versatile is it? Will I be able to create reports (i.e. weekly market report) or a stock screener from it later on?  \n5. How easy is it to update the database? Can I create forms so that I can add entries to the database? Or can I use excel to update this database?  \n6. Will my data be accessible all the time? Will I be able to access it from my home PC?\n\nThanks in advance. :)",
        "created_utc": 1731303603.0,
        "subreddit_name": "investing",
        "comments": 3
    },
    {
        "title": "Nuclear option in the face of AI?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gotw7z/nuclear_option_in_the_face_of_ai/",
        "content": "Kind of a halfbaked thought process, but bear with me.\n\nAs the development of \"AI\" continues to accelerate, we now see Microsoft investing in the reopening Three Mile Island. How much does this bode well for investing in companies within the nuclear energy industry? \n\nSeems to me like more companies would move towards utilizing nuclear to support the high energy consumption of \"AI\" projects. Additionally, this could help destigmatize nuclear as a power source and lead to further proliferation of reactors in the US.",
        "created_utc": 1731336573.0,
        "subreddit_name": "investing",
        "comments": 33
    },
    {
        "title": "Do you think the stock market is over valued and does my idea make sense?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1got6xt/do_you_think_the_stock_market_is_over_valued_and/",
        "content": "Been seeing some stories recently that the stock market is over valued.  With all the AI stuff it reminds me a bit of the dot com crash of the 90's.  Plus, the S&P has gone up 30% over the last year.  With that in mind I have trouble not thinking that there might be a correction in the near future.\n\nWith that being said, for the long term investor I know that this is irrelevant.  Few of us have the skill to figure out the timing of this stuff to really take advantage of it.  With that being said, my main source of income is my investments.  My original plan was to just sell off a chunk every year for my living expenses and what not.  With that being said, I'm now considering selling off enough stock for three years worth of living expenses and putting it in a savings account.  If we do happen to have crash I can take a chunk of it and reinvest it.  Otherwise I just continue with my plan for the next three year and hope that a crash doesn't happen after that.\n\nJust curious what people think of my strategy.",
        "created_utc": 1731334664.0,
        "subreddit_name": "investing",
        "comments": 57
    },
    {
        "title": "'Pure fiction' — Kremlin denies Putin and Trump discussed Ukraine by phone after election victory",
        "score": 14150,
        "url": "https://kyivindependent.com/pure-fiction-kremlin-denies-putin-and-trump-spoke-by-phone-after-election-victory/",
        "content": "",
        "created_utc": 1731322135.0,
        "subreddit_name": "worldnews",
        "comments": 787
    },
    {
        "title": "Apple illegally threatened workers over their talk about pay and remote work, feds charge",
        "score": 7208,
        "url": "https://www.spokesman.com/stories/2024/nov/06/apple-illegally-threatened-workers-over-their-talk/",
        "content": "",
        "created_utc": 1731288774.0,
        "subreddit_name": "technology",
        "comments": 168
    },
    {
        "title": "Apple illegally threatened workers over their talk about pay and remote work, feds charge",
        "score": 1288,
        "url": "https://www.msn.com/en-us/news/us/apple-illegally-threatened-workers-over-their-talk-about-pay-and-remote-work-feds-charge/ar-AA1tD6mm",
        "content": "",
        "created_utc": 1731320603.0,
        "subreddit_name": "apple",
        "comments": 108
    },
    {
        "title": "iPhone 17 'Air' May Not Be Much Thinner Than iPhone 6",
        "score": 604,
        "url": "https://www.macrumors.com/2024/11/11/iphone-17-air-may-not-be-much-thinner/",
        "content": "",
        "created_utc": 1731337717.0,
        "subreddit_name": "apple",
        "comments": 321
    },
    {
        "title": "Gurman: Apple Vision Pro 2 on track for release between Fall 2025 and Spring 2026 ",
        "score": 431,
        "url": "https://9to5mac.com/2024/11/10/apple-vision-pro-2-fall-2025-spring-2026/",
        "content": "",
        "created_utc": 1731288972.0,
        "subreddit_name": "apple",
        "comments": 173
    },
    {
        "title": "Apple Releases Third Betas of iOS 18.2 and More With Genmoji, Image Playground and ChatGPT Integration",
        "score": 420,
        "url": "https://www.macrumors.com/2024/11/11/apple-releases-ios-18-2-beta-3-and-more/",
        "content": "",
        "created_utc": 1731358833.0,
        "subreddit_name": "apple",
        "comments": 69
    },
    {
        "title": "Apple’s Find My enables sharing location of lost items with third parties",
        "score": 299,
        "url": "https://www.apple.com/newsroom/2024/11/apples-find-my-enables-sharing-location-of-lost-items-with-third-parties/",
        "content": "\"Now available in beta with iOS 18.2, users can share a secure link with the location of an AirTag or Find My network accessory with others — and soon, with airlines\"",
        "created_utc": 1731366483.0,
        "subreddit_name": "apple",
        "comments": 11
    },
    {
        "title": "Apple Music: 100 Best Albums Book",
        "score": 84,
        "url": "https://www.assouline.com/products/apple-music?app=music&ls=1&itscg=80005&itsct=room__100bestalbumsbookannounce_110624&source=pepperjam&publisherId=43737&clickId=4904982137",
        "content": "Limited to 1,500 copies 📖",
        "created_utc": 1731367524.0,
        "subreddit_name": "apple",
        "comments": 37
    },
    {
        "title": "The Weeknd \"Open Hearts\" - Official Trailer | Apple Vision Pro | Apple Immersive Video | 11/14 Release",
        "score": 24,
        "url": "https://youtu.be/RvxBS9ZeJLQ?si=i1gEnbb-T6TtlmIJ",
        "content": "",
        "created_utc": 1731345985.0,
        "subreddit_name": "apple",
        "comments": 16
    },
    {
        "title": "Daily Advice Thread - November 11, 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/apple/comments/1gopnlk/daily_advice_thread_november_11_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1731322837.0,
        "subreddit_name": "apple",
        "comments": 51
    },
    {
        "title": "Apple will let you share AirTag locations with others",
        "score": 110,
        "url": "https://www.theverge.com/2024/11/11/24293654/apple-ios-18-2-share-airtag-locations",
        "content": "",
        "created_utc": 1731342855.0,
        "subreddit_name": "technology",
        "comments": 5
    },
    {
        "title": "I wish the MacBook Air came in these colours.",
        "score": 1065,
        "url": "https://i.redd.it/egvnqxukz70e1.jpeg",
        "content": "I loved the red iMac. I wish they had a red version of the MacBook Air.",
        "created_utc": 1731308005.0,
        "subreddit_name": "mac",
        "comments": 64
    },
    {
        "title": "Every so often, someone on r/Mac and r/macOS asks why their Mac is 1080p and not 4K. I wrote and published a blog post to hopefully make it easier.",
        "score": 344,
        "url": "https://griffindavidson.com/blog/mac-displays.html",
        "content": "Let me know if I’m missing anything! And please share with future Redditors that ask this question inevitably again!",
        "created_utc": 1731284511.0,
        "subreddit_name": "mac",
        "comments": 86
    },
    {
        "title": "Why does my Mac not charge even though the charger is in",
        "score": 39,
        "url": "https://i.redd.it/a5wu5487r90e1.jpeg",
        "content": "",
        "created_utc": 1731329400.0,
        "subreddit_name": "mac",
        "comments": 60
    },
    {
        "title": "debated between purple and pink",
        "score": 33,
        "url": "https://i.redd.it/jklgrq8qv60e1.jpeg",
        "content": "I don’t like the color red at all so the fact that the back of the iMac is now truly pink I went with that color ! Also it’s going to take a week to arrive because I chose the Arabic/English keyboard 😊 ",
        "created_utc": 1731294605.0,
        "subreddit_name": "mac",
        "comments": 12
    },
    {
        "title": "How do you feel about Mac keyboards and mice?",
        "score": 30,
        "url": "https://www.reddit.com/r/mac/comments/1gp0l66/how_do_you_feel_about_mac_keyboards_and_mice/",
        "content": "This is semi related to yesterday's post. I bought a Mac Mini and I'm planning to just use the keyboard and mouse I already have, at least at first. I would like the Mac layout, but I understand the small differences, like the super key and ctrl situation on a standard keyboard. Do you enjoy using the first party keyboards, or did you upgrade to something like a mechanical keyboard with Mac layout? What's the advantage to Apple mice over others?",
        "created_utc": 1731352882.0,
        "subreddit_name": "mac",
        "comments": 223
    },
    {
        "title": "Should I get a Mac Mini?",
        "score": 7,
        "url": "https://www.reddit.com/r/mac/comments/1gowauy/should_i_get_a_mac_mini/",
        "content": "Should I go from an Ubuntu laptop to a Mac Mini? I really like the form factor because the only places I'll take it are hotels with TVs (I already have a wireless mouse and keyboard to pair it with). I'll be using it for pretty much working, like KiCAD and Blender, and for some gaming. My current PC isn't much powerful so I have to stream games online, and it has some serious problems. Also I can use it with my iPad with iCloud, I already have 50GB.",
        "created_utc": 1731342660.0,
        "subreddit_name": "mac",
        "comments": 13
    },
    {
        "title": "Right side of Macbook Air M1 is dimmer then the rest of the display",
        "score": 4,
        "url": "https://i.redd.it/xp2vvqavr70e1.jpeg",
        "content": "the screen goes dimmer a second after boot up so i’m thinking it maybe a software issue.",
        "created_utc": 1731305412.0,
        "subreddit_name": "mac",
        "comments": 13
    },
    {
        "title": "27 inch 4k or 27 inch 1440p monitor for mac?",
        "score": 4,
        "url": "https://www.reddit.com/r/mac/comments/1gokywc/27_inch_4k_or_27_inch_1440p_monitor_for_mac/",
        "content": "Which is the sweet spot for macos to not have any scaling issues anymore? I heard there's some scaling issue going on with 4k monitors. But many of you recommend 4k. So what's the matter with scaling? I am so confused as I am new to Mac🙂🙂help a brother out guys",
        "created_utc": 1731302981.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "Macbook Air M2 Accented Chars, how do I turn this off?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gp0l2t/macbook_air_m2_accented_chars_how_do_i_turn_this/",
        "content": "Quick question; I noticed after the recent OS update, I have accented chars turned on. I am not sure how it got turned on to begin with but before, I could type something like \"ooohhhhh\" by holding down both o and h, but now if I hold down any letter for longer than a few seconds, it brings up the accented chars to choose a letter from. How do I turn this off, or just get to what I had it as before? I don't use any bluetooth or plugged in devices either. ",
        "created_utc": 1731352876.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "About to buy my first Mac, former Windows user and current Linux user.",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gohzcj/about_to_buy_my_first_mac_former_windows_user_and/",
        "content": "So I've used Windows since I was a kid, had an already old iMac in the 00s, used eMacs in high school. Basically, I'm switching to escape Windows. I occasionally make music, and the main thing I miss from using Windows is Ableton. The only methods I've seen to run it through Wine are convoluted, and frankly don't seem worth it.\n\nI'm pretty set on buying the latest Mac Mini with 10 core GPU/CPU, 16 GB RAM, etc. It seems like the best option for my uses. I guess the point of this post is to just to start a discussion. What do you enjoy most about using Mac over other OS, or just general use and experiences?\n\nEdit: I brought up Wine because I switched to Linux last year.",
        "created_utc": 1731292871.0,
        "subreddit_name": "mac",
        "comments": 44
    },
    {
        "title": "HELP- I need the right adapter to use my monitor and charger my Macbook Air",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gozmlp/help_i_need_the_right_adapter_to_use_my_monitor/",
        "content": "Hi - Yes I'm dumb, but I know when I need to seek help. I have a work provided mac book air. They have a yubi key in one of my usb-c ports. I have a usb-c charger, and usb-c extra monitor plug that I need to use simultaneously. I've purchased two adapters, one was from amazon [https://www.amazon.com/dp/B0CH9JPNZM?ref=ppx\\_yo2ov\\_dt\\_b\\_fed\\_asin\\_title&th=1](https://www.amazon.com/dp/B0CH9JPNZM?ref=ppx_yo2ov_dt_b_fed_asin_title&th=1) and it didn't work. And just bought the Belkin USB-C Data + Charger Adapter [https://www.belkin.com/p/usb-c-data-charge-adapter/WCZ002btWH.html?utm\\_source=google&utm\\_medium=paid&gad\\_source=1&gclid=Cj0KCQiA88a5BhDPARIsAFj595g3TzPq2IWiVaMXJcffUefIX20MpquK2QV\\_ySuKS\\_lzQogoUr6OOGsaAic4EALw\\_wcB](https://www.belkin.com/p/usb-c-data-charge-adapter/WCZ002btWH.html?utm_source=google&utm_medium=paid&gad_source=1&gclid=Cj0KCQiA88a5BhDPARIsAFj595g3TzPq2IWiVaMXJcffUefIX20MpquK2QV_ySuKS_lzQogoUr6OOGsaAic4EALw_wcB) . This one charges the computer, but doesn't activate my extra monitor. What do I need to buy?",
        "created_utc": 1731350584.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "2015 macbook air not booting correctly?",
        "score": 2,
        "url": "https://www.reddit.com/gallery/1goy58r",
        "content": "I need to know if I'm totally screwed or if this is fixable\n\nI updated this old macbook air from El capitan to Monterey but now it isn't starting\n\nThe screen is damaged, so I have it displayed on my TV. It's been plugged into the charger for all of this. \nI can't get it to start in recovery mode (cmd+R) at all, and trying to boot in safe mode (hold shift on restart) doesn't do anything either.\n\nIf I let it try to boot regularly, it shows a default login page but never prompts a password, and I hit enter and it opens to my desk top, except it's just the image. No icons, no task bar, no menu bar. Nothing.\n\nI've tried the shortcuts to reset PRAM and SMC but that hasn't changed anything. \nThe only other thing I saw to maybe try is a Bootable usb but I believe I would need another Mac for that, and this one is the only one in the house. \n\nI only kind of know what I'm doing, I've been googling and reading a lot before trying anything, but I don't know what else I can do.",
        "created_utc": 1731347065.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Can't install Ubuntu 22.04 or 24.04 on Parallels Desktop 20 with M4 Pro.",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1goun8s/cant_install_ubuntu_2204_or_2404_on_parallels/",
        "content": "Hi,\n\ncan you install Ubuntu 22.04 or 24.04 ARM Desktop/Server with the latest version of Parallels Desktop 20 on your M4 (Pro)? I can't. The installer always states an error. Also Windows 10 LTSC does not work. I get a kernel panic.\n\nAnybody having the same issues?",
        "created_utc": 1731338516.0,
        "subreddit_name": "mac",
        "comments": 7
    },
    {
        "title": "macmini with 256 storage",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1golv3m/macmini_with_256_storage/",
        "content": "I thinking to but macmini with m4 chip and i will buy 2tb external ssd with it samsung t9 will the 256 gb variant enough for me in a web developer and also i do light video editing ",
        "created_utc": 1731306288.0,
        "subreddit_name": "mac",
        "comments": 14
    },
    {
        "title": "Disconnecting from NAS",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gojxn5/disconnecting_from_nas/",
        "content": "Picked up a new Mac mini M4 and a Synology 1522+ with the main purpose to run Plex. I’ve been having an issue with the volume disconnecting from the Mac seemingly randomly. Sleep is disabled and I even tried using the Amphetamine app feature “keep alive” but not having any luck. Has anyone else ran into a similar issue and have any solution or advice? I’m running macOS 15.1. \n\n*Update*\nI enabled NFS on the Synology and mounted it on the Mac using “ConnectMeNow v4”. It’s been 12+ hours and no issues so far. ",
        "created_utc": 1731299380.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "Best dual device docking station?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gohw7i/best_dual_device_docking_station/",
        "content": "For those of you who have a work MacBook Pro and a second mac personal device (mini but want to add the new mini pro) at home. Whats the bets docking station for jumping back and forth? I’ve got dual monitors - use same keyboard and mouse for both devices and I’m beyond ready to upgrade the docking. Whats the bets solution most use?",
        "created_utc": 1731292597.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Apple explains why the M4 Mac mini power button is located on the bottom",
        "score": 1471,
        "url": "https://9to5mac.com/2024/11/11/m4-mac-mini-power-button/",
        "content": "",
        "created_utc": 1731356662.0,
        "subreddit_name": "gadgets",
        "comments": 796
    },
    {
        "title": "Apple’s Strict Requirements Of Delivering A Stellar AR Experience To A Pair Of Smart Glasses Is At Least Five Years Away",
        "score": 323,
        "url": "https://wccftech.com/apple-smart-glasses-with-quality-ar-experience-five-years-away/",
        "content": "",
        "created_utc": 1731343477.0,
        "subreddit_name": "gadgets",
        "comments": 39
    }
]