[
    {
        "title": "Net neutrality day of action update: Twitter, Soundcloud, and Medium, have joined. Reddit, This could be as big as SOPA.",
        "score": 44680,
        "url": "https://www.reddit.com/r/technology/comments/6ivklm/net_neutrality_day_of_action_update_twitter/",
        "content": "Hey reddit, I wanted to give another quick update on the **[Internet-Wide Day of Action to Save Net Neutrality](https://www.battleforthenet.com/july12)** planned for July 12th that tons of major websites, subreddits, online communities, and Internet users are helping organize.\n\nThe momentum is continuing to build. In the past few days Twitter, Soundcloud, Medium, Adblock, Twilio, and some other big names [have joined.](https://www.fightforthefuture.org/news/2017-06-22-net-neutrality-day-of-action-gets-another-huge/) Since we announced earlier this month a ton of other high-traffic sites have signed on including Imgur, Amazon, Namecheap, OK Cupid, Bittorrent, Mozilla, Kickstarter, Etsy, GitHub, Vimeo, Chess.com, Fark, Checkout.com, Y Combinator, and Private Internet Access. \n\nReddit itself has also joined, [along with](https://www.reddit.com/r/technology/comments/6g9pkl/reddit_lets_get_organized_more_than_30_subreddits/) more than 80 subreddits!\n\nWe've started solidifying ideas for the types of messages that sites can display on the day of the protest, and you can [check those out here](https://www.battleforthenet.com/july12/#join) (feedback is welcome!) \n\nEDIT: A little more info about the plan: on July 12 websites will display a prominent message on their homepage, and apps and services will send push notifications or do whatever makes the most sense for them to reach as many people as possible. We'll direct people to [BattleForTheNet.com](https://www.battleforthenet.com), an optimized action site that easily allows anyone to submit a comment to the FCC and Congress at the same time, make a phone call, and sign up to participate in meetings with lawmakers. We'll also have video bumpers that YouTubers and other video creators can use. Basically, everyone should think about how they can use the power of the Internet to reach their audience with a message abotu net neutrality and make it easy for them to take action.\n\n**Important context from my previous update below.**\n\nNet neutrality is the basic principle that prevents Internet Service Providers like Comcast and Verizon from charging us extra fees to access the online content we want -- or throttling, blocking, and censoring websites and apps. Title II is the legal framework for net neutrality, and the FCC is trying to get rid of it, under immense pressure for the Cable lobby.\n\nThis day of action is an incredibly important moment for the Internet to come together -- across political lines -- and show that we don't want our Cable companies controlling what we can do online, or picking winners and losers when it comes to streaming services, games, and online content.\n\nThe current FCC chairman, Ajit Pai, is a former Verizon lawyer and seems intent on getting rid of net neutrality and misleading the public about it. But the FCC has to answer to Congress. If we can create another moment of massive online protest like the SOPA Blackout and the Internet Slowdown, we have a real chance of stopping the FCC in its tracks, and protecting the Internet as a free and open platform for creativity, innovation, and exchange of ideas. \n\nSo! If you've got a website, blog, Tumblr, or any kind of social media following, or if you are a subreddit mod or active in an online community or forum, please get involved! There's so much we as redditors can do, from blacking out our sites to drive emails and phone calls to organizing in-person meetings with our lawmakers. Feel free to message me directly or email team (at) fightforthefuture (dot) org to get involved, and **[learn more here.](https://www.battleforthenet.com/july12)**\n\n**EDIT:** Oh hai, everyone! Very glad you're here. Lots of awesome brainstorming happening in the comments. Keep it coming. A lot of people are asking what sites will be doing on July 12. We're still encouraging brainstorming and creativity, but the basic idea is that sites will have a few options of things they can do to their homepage to show what the web would be like without net neutrality, ie a slow loading icon to show they are stuck in the slow lane, a \"site blocked\" message to show they could be censored, or an \"upgrade your Internet service to access this site\" fake paywall to show how we could be charged special fees to access content. Love all your ideas! Keep sharing, and **[go here for more info about the protest.](https://www.battleforthenet.com/july12)**\n\n**EDIT 2:** It's worth noting that given the current chairman of the FCC's political orientation, it's extra important that conservatives, libertarians, and others to the right of center speak out on this issue. The cable lobby is working super hard to turn this technological issue into a partisan circus. We can't let them. Net neutrality protects free speech, free markets, innovation, and economic opportunity. We need people and sites from all across the political spectrum to be part of this. ",
        "created_utc": 1498157251.0,
        "subreddit_name": "technology",
        "comments": 1037
    }
]