[
    {
        "title": "A bug in Schwab caused my retirement account to go naked short GME.",
        "score": 2439,
        "url": "https://www.reddit.com/r/stocks/comments/loffqz/a_bug_in_schwab_caused_my_retirement_account_to/",
        "content": "This is a story that \\*involves\\* GME, but it is not \\*about\\* GME.\n\nThe events I'm describing here happened on January 28 in my cash retirement account.\n\nIn short, I had some GME shares, and used the interface to sell them immediately after I read that Robinhood announced the disabling of their buy button. A few minutes later, it did not appear to work, so I attempted to sell again. Subsequently, my account showed that both \"sells\" went through. Then my account had the cash from both sales, and a negative balance of shares that I was required to deliver in 3 days.\n\nAfter seeing the stock price dramatically rise and my apparent liabilities increasing (without limit), I freaked out and covered the short position at a huge loss (\\~$180k). If I was lucky and the price went down, I could have been able to cover the short at a huge gain, and could have kept my mouth shut (not that I would have). But instead I'm out a bunch of money in my retirement account that was a result of this bug, and Schwab owes me about $180k.\n\nHad I not covered this erroneous short position, the shorts probably would have become what we know to be \"Failures to Deliver\".\n\nI have attached the record of what happened below, which I sent to Schwab soon after the event, to try to get the situation undone. I eventually was able to call their support team and they said I would have to wait 30 days to resolve the situation.\n\nThe guy on the phone said they were having lots of problems with this bug, in other equities too. I can't recall the complete conversation.\n\nAnyway, I recently got a message in the system that I would have to wait \\*another\\* 30 days. So I flipped my shit and now I'm posting about it here. Please don't comment about how retarded I am for investing my retirement in GME. That's not the story. I do what I want, I like the stock, and there is a serious problem here completely unrelated to how retarded I am, and the general public absolutely needs to know what is going on.\n\nI have no information about how many other naked short positions were created by Schwab. I do know that it was more than just myself, and in other equities as well, based on my conversation with their support representative. I have no information about whether or not the bug still exists. I did not test it beyond what happened. It may very well be the case that the bug is still a problem, as far as I know.\n\nRelated: I recently posted something that made me suspicious to /r/stocks \\- [https://www.reddit.com/r/stocks/comments/lnvero/i\\_strongly\\_suspect\\_that\\_schwabameritrade\\_does\\_not/](https://www.reddit.com/r/stocks/comments/lnvero/i_strongly_suspect_that_schwabameritrade_does_not/)\n\nI didn't realize this until today, but I connected the dots between the details of this post and what happened to me in my Schwab retirement account. i.e. Schwab+TD are the same company, and these two things could be related.\n\nHere is the message I sent to Schwab (for a record of what happened). You might notice that it's a 401(k), which most people might note does not usually allow individual stock trading, but it is a self-managed fund, and individual stocks are actually allowed:\n\n\\------------------------------- START OF MESSAGE -----------------------------------\n\nTo whom it may concern:\n\nMy name is ####### #######, my account number is ####-####\n\nI attempted to call your 1-800 number several times, but I was unable to get through to your support. Here is a breakdown of what happened:\n\nThere is a bug in your system that caused my non-margin account to briefly become short GME shares. My account is a non-margin 401(k) account. In good faith, I spent $430k to cover the position that my account should not have been allowed to get into. Two trades need to be undone.\n\nAt market open, my position this morning was NNNN shares of GME.\n\nAt 11:09, I attempted to place a market order to sell NNNN shares: Order #AAAAAAAA\n\nThe order did not show up for about 10 minutes. My account balance still showed NNNN shares, so I attempted to make a similar order again. I placed a sell of \"Limit Or Better\" to sell NNNN shares at $125. Order #BBBBBBBB\n\nAbout 10 minutes later, I got confirmations for BOTH ORDERS, and a notice that the account was due securities. I DO NOT have a margin account, and it should not have gone short, the system should have rejected one of the orders because the shares were not in my account.\n\nOnce I realized what the system did, I saw the short position which your system erroneously put me in, and to protect from the potential infinite uncovered losses on my account, I did a market buy at 11:44AM for NNNN shares using the \"Buy to Cover\" button, which zeroed out my position in GME. Order #CCCCCCCC\n\nThe erroneous trade needs to be undone, and my buy to cover also needs to be undone, as both of these are not legal trades for my 401(k).\n\nOrders #BBBBBBBB and #CCCCCCCC should not exist on my account. #BBBBBBBB is a result of a bug in your trading system, and #CCCCCCCC  was a good faith attempt for me to prevent the issue from becoming a much bigger problem.\n\nI'm sending this in a timely manner so there is a record of what happened, and I will refer to it when I call again when your call volume is reduced.\n\n\\-------------------------------------------- END OF MESSAGE -------------------------------------\n\nDisclosure: My current positions in my 401(k) are as follows, ignoring what Schwab owes me:\n\nGME: \\~4500 shares\n\nCash & Money Market: \\~$180k.\n\nAgain please don't comment about the intelligence or stupidity of my investing strategies. None of this is advice. If you do anything related to what I'm talking about here, you're probably stupid. I'm only trying to point out a massive problem with Schwab that indicates to me a potential systemic risk in the markets (and Schwab investors).",
        "created_utc": 1613851547.0,
        "subreddit_name": "stocks",
        "comments": 432
    },
    {
        "title": "for you amateurs and WallStreetbets",
        "score": 18,
        "url": "https://www.reddit.com/r/AAPL/comments/lofqtt/for_you_amateurs_and_wallstreetbets/",
        "content": "AAPL\n\nscenario 1.) when big boys take a certain profits from a single company to balance their portfolios -- it's a good bullish thing! They're still keeping their large remaining $hares and let it ri$e in long term.\n\nscenario 2.) when big boys willing to sell most of their shares at a loss (like you amateurs options players) in a company, it's because they see a crack in its fundamentals -- it's bearish and time to dump your shares and run for the hill!\n\naapl is scenario 1!!!\n\n**WallStreetbets translation:**ask your wife's boyfriend for allowing, buy and accumulate at this level today! Becoming 💎 hands before it turns into stonk, you fckin retard!\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/0zigmsagywi61.jpg?width=1665&format=pjpg&auto=webp&s=76ad1ea1d132253d398c97ee2325c457f01b006a",
        "created_utc": 1613852414.0,
        "subreddit_name": "AAPL",
        "comments": 0
    },
    {
        "title": "Next week 23rd/24th...",
        "score": 7,
        "url": "https://www.reddit.com/r/AAPL/comments/lnz6fx/next_week_23rd24th/",
        "content": "A clearer views of where aapl is heading.\n\nLead indicators to watch are market conditions.  \nIf everything is normal, we're heading up, if not aapl going flat til March. This will kill options plays, again for the week!\n\nLong plays: aapl is fundamentally sound, nothing change.",
        "created_utc": 1613795368.0,
        "subreddit_name": "AAPL",
        "comments": 4
    }
]