[
    {
        "title": "Google wins court challenge to the EU's $1.7 billion antitrust fine over ad product ",
        "score": 228,
        "url": "https://www.reddit.com/r/stocks/comments/1fjup5y/google_wins_court_challenge_to_the_eus_17_billion/",
        "content": "The European Union’s second-highest court on Wednesday said a 1.5 billion euro ($1.7 billion) fine imposed on Google by regulators should be annulled, siding with the U.S. tech giant after it challenged the ruling.\n\nThe case stems from 2019 when the European Commission, the EU’s executive arm, said Alphabet owned Google had abused its market dominance in relation to a product called AdSense for Search. This product allowed website owners to deliver ads into the search results on their own pages.\n\nGoogle acts as an intermediary allowing advertisers to serve ads via search on third-party websites.\n\nBut the commission alleged that Google abused its market dominance by imposing a number of restrictive clauses in contracts with third-party websites, which ultimately prevented rivals from placing their search ads on these websites.\n\nThe commission fined Google 1.49 billion euros at the time. Google appealed, sending the case to the EU’s General Court.\n\nThe General Court said Wednesday that it “upholds the majority of the findings” but “annuls the decision by which the Commission imposed a fine of” nearly 1.5 billion euros.\n\nThe court added that the commission “failed to take into consideration all the relevant circumstances in its assessment of the duration of the contract clauses” that it had deemed abusive.\n\nA Google spokesperson told CNBC that it would review the full decision closely.\n\n“This case is about a very narrow subset of text-only search ads placed on a limited number of publishers’ websites. We made changes to our contracts in 2016 to remove the relevant provisions, even before the Commission’s decision. We are pleased that the court has recognized errors in the original decision and annulled the fine,” the spokesperson said.\n\nA spokesperson for the commission said it takes note of the judgement and will reflect on the possible next steps.\n\nThe commission could appeal this decision which would send it up to European Court of Justice, the EU’s top court.\n\nThere has been a slew of court cases involving the EU and U.S. tech companies reaching their conclusions recently.\n\nThis month, the ECJ upheld a 2.4 billion euro fine imposed on Google for abusing its dominant position by favoring its own shopping comparison service. And the same court ruled that Apple must pay 13 billion euros in back taxes to Ireland, ending a decade-long case.\n\nSource: https://www.cnbc.com/2024/09/18/court-backs-googles-challenge-to-the-eus-1point7-billion-antitrust-fine.html",
        "created_utc": 1726671030.0,
        "subreddit_name": "stocks",
        "comments": 29
    },
    {
        "title": "Apple iPhone 16 demand is so weak that employees can already buy it on discount",
        "score": 21856,
        "url": "https://qz.com/apple-iphone-16-pre-orders-sales-intelligence-ai-1851651638",
        "content": "",
        "created_utc": 1726690437.0,
        "subreddit_name": "technology",
        "comments": 2893
    },
    {
        "title": "Apple Mobile Processors Are Now Made in the USA. By TSMC",
        "score": 4448,
        "url": "https://timculpan.substack.com/p/apple-mobile-processors-are-now-made",
        "content": "",
        "created_utc": 1726644821.0,
        "subreddit_name": "apple",
        "comments": 278
    },
    {
        "title": "iPhone 16 Pro/Pro Max have a substantial battery life increase from the iPhone 15 Pro ",
        "score": 3614,
        "url": "https://www.tomsguide.com/phones/iphones/apple-iphone-16-pro-max-review",
        "content": "",
        "created_utc": 1726669744.0,
        "subreddit_name": "apple",
        "comments": 682
    },
    {
        "title": "Apple iPhone 16 Pro review: small camera update, big difference",
        "score": 1293,
        "url": "https://www.theverge.com/24247538/apple-iphone-16-pro-review",
        "content": "",
        "created_utc": 1726661948.0,
        "subreddit_name": "apple",
        "comments": 307
    },
    {
        "title": "Apple Says iPhone 16 and iPhone 16 Plus Batteries Can Be Removed With Low-Voltage Electrical Current",
        "score": 923,
        "url": "https://www.macrumors.com/2024/09/18/iphone-16-and-16-plus-9v-battery-removal/",
        "content": "",
        "created_utc": 1726667138.0,
        "subreddit_name": "apple",
        "comments": 54
    },
    {
        "title": "Apple Releases New AirPods Pro 2 and AirPods 4 Firmware",
        "score": 711,
        "url": "https://www.macrumors.com/2024/09/18/apple-airpods-pro-2-firmware-7a302/",
        "content": "",
        "created_utc": 1726687957.0,
        "subreddit_name": "apple",
        "comments": 95
    },
    {
        "title": "iPhone 16 Pro Camera Review: Kenya",
        "score": 697,
        "url": "https://www.austinmann.com/trek/iphone-16-pro-camera-review-kenya",
        "content": "",
        "created_utc": 1726692373.0,
        "subreddit_name": "apple",
        "comments": 131
    },
    {
        "title": "My \"High Tech\" Trading Setup",
        "score": 502,
        "url": "https://i.redd.it/ikrulje65jpd1.jpeg",
        "content": "I always see the Fancy setups with their 5 monitors but noone ever shows where it all starts. I'm a self-taught DayTrader that created my own trading method from Scrach (almost 2 years to develop) and this week I have been doing my trading in bed with an IPhone...\n\nI Just want to Motivate anyone that thinks you need all the fancy gadgets and screens and all this extra information, i have all that as well but still just prefer the simple Iphone/Ipad lol. \n\n\nWeekly Progress: +38% Monday. +5% Tuesday (forgot to set alarm).  +11% Today to put me at +60% for the week. Average trade time last between 1-10min. Today was literally 11% in 2 min. \n\nI know people will say I'm just getting lucky but idc anymore ill just let the Numbers speak for themsleves. GOOD LUCK today. ",
        "created_utc": 1726648735.0,
        "subreddit_name": "DayTrading",
        "comments": 58
    },
    {
        "title": "I saw a theory mentioned here and it’s been working. For now…",
        "score": 84,
        "url": "https://www.reddit.com/r/Daytrading/comments/1fk6z1b/i_saw_a_theory_mentioned_here_and_its_been/",
        "content": "Theory - On non-news days the trend is  set by 10:30 EST.\n\nThis has been the case on SPY for the most part over the past couple weeks. \n\nThoughts? ",
        "created_utc": 1726702632.0,
        "subreddit_name": "DayTrading",
        "comments": 86
    },
    {
        "title": "Apple Inc Q2 FY 2024 Balance Sheet",
        "score": 7,
        "url": "https://i.redd.it/n1juem6u7kpd1.png",
        "content": "",
        "created_utc": 1726661854.0,
        "subreddit_name": "AAPL",
        "comments": 0
    },
    {
        "title": "Yes, Your Apple iPhone Can Explode!",
        "score": 0,
        "url": "/r/StockLaunchers/comments/1fjwgag/yes_your_apple_iphone_can_explode/",
        "content": "",
        "created_utc": 1726675537.0,
        "subreddit_name": "AAPL",
        "comments": 0
    },
    {
        "title": "iOS 18 Flops and Apple’s Struggles in China",
        "score": 0,
        "url": "https://www.reddit.com/r/AAPL/comments/1fk0for/ios_18_flops_and_apples_struggles_in_china/",
        "content": "Hey guys, I posted about this settlement already, but since the deadline is in two weeks, I decided to post it again. It’s about Tim Cook's comments on China's sales issues.\n\n\n\nFor those who may not remember, back in 2018, Tim Cook said that though Apple had sales problems in a few countries with high inflation rates like Brazil and Russia, there were no such problems for China. But then, just a few days later, Apple cut production and requested it from the suppliers, so I think it was obviously otherwise.\n\n\n\nAnd, just two months later, Apple shocked everyone with its first announcement about the revenue cut since the iPhone establishment in 2007, causing AAPL to drop by 10% and resulting in 70B losses. This led to several lawsuits based on Cook's comments, but Apple denied that they had any wrongdoing in this case (and they continue to deny it to this day).\n\n\n\nSo, at this point, this whole story is going to an end because recently, Apple decided to pay $490M to investors due to the situation, even before the court hearing. And the deadline is in two weeks, so if you were one of those damaged investors, you should definitely [check it out](https://11thestate.com/cases/apple-investor-settlement).\n\n\n\nIn other Apple news, they just launched iOS 18 and other new updates — bringing key changes to how the company’s devices operate and setting the stage for generative AI features. So apart from the new pink iPhone, we may see some new things from them soon.\n\n\n\nAnyways, what do you think? Does that half a billion even come close to covering the $70 billion loss? And did you already regret about your ios updates?\n\n",
        "created_utc": 1726685397.0,
        "subreddit_name": "AAPL",
        "comments": 2
    }
]