[
    {
        "title": "Google wins court challenge to the EU's $1.7 billion antitrust fine over ad product ",
        "score": 228,
        "url": "https://www.reddit.com/r/stocks/comments/1fjup5y/google_wins_court_challenge_to_the_eus_17_billion/",
        "content": "The European Union’s second-highest court on Wednesday said a 1.5 billion euro ($1.7 billion) fine imposed on Google by regulators should be annulled, siding with the U.S. tech giant after it challenged the ruling.\n\nThe case stems from 2019 when the European Commission, the EU’s executive arm, said Alphabet owned Google had abused its market dominance in relation to a product called AdSense for Search. This product allowed website owners to deliver ads into the search results on their own pages.\n\nGoogle acts as an intermediary allowing advertisers to serve ads via search on third-party websites.\n\nBut the commission alleged that Google abused its market dominance by imposing a number of restrictive clauses in contracts with third-party websites, which ultimately prevented rivals from placing their search ads on these websites.\n\nThe commission fined Google 1.49 billion euros at the time. Google appealed, sending the case to the EU’s General Court.\n\nThe General Court said Wednesday that it “upholds the majority of the findings” but “annuls the decision by which the Commission imposed a fine of” nearly 1.5 billion euros.\n\nThe court added that the commission “failed to take into consideration all the relevant circumstances in its assessment of the duration of the contract clauses” that it had deemed abusive.\n\nA Google spokesperson told CNBC that it would review the full decision closely.\n\n“This case is about a very narrow subset of text-only search ads placed on a limited number of publishers’ websites. We made changes to our contracts in 2016 to remove the relevant provisions, even before the Commission’s decision. We are pleased that the court has recognized errors in the original decision and annulled the fine,” the spokesperson said.\n\nA spokesperson for the commission said it takes note of the judgement and will reflect on the possible next steps.\n\nThe commission could appeal this decision which would send it up to European Court of Justice, the EU’s top court.\n\nThere has been a slew of court cases involving the EU and U.S. tech companies reaching their conclusions recently.\n\nThis month, the ECJ upheld a 2.4 billion euro fine imposed on Google for abusing its dominant position by favoring its own shopping comparison service. And the same court ruled that Apple must pay 13 billion euros in back taxes to Ireland, ending a decade-long case.\n\nSource: https://www.cnbc.com/2024/09/18/court-backs-googles-challenge-to-the-eus-1point7-billion-antitrust-fine.html",
        "created_utc": 1726671030.0,
        "subreddit_name": "stocks",
        "comments": 29
    },
    {
        "title": "Apple iPhone 16 demand is so weak that employees can already buy it on discount",
        "score": 21856,
        "url": "https://qz.com/apple-iphone-16-pre-orders-sales-intelligence-ai-1851651638",
        "content": "",
        "created_utc": 1726690437.0,
        "subreddit_name": "technology",
        "comments": 2893
    }
]