[
    {
        "title": "What Stock Do You Think Is Just Waiting To Explode In The Coming Years And Dominate It's Market?",
        "score": 9637,
        "url": "https://www.reddit.com/r/stocks/comments/lu8orq/what_stock_do_you_think_is_just_waiting_to/",
        "content": "In my opinion TSM until 2023 is going to absolutely explode and dominate everything and one else in an unseen way. They will control the GPU and CPU markets in the desktop space (Nvidia Hopper is being made with them and Intel is rumored to go fabless in the next few years, they also manufacture all AMD products). They also control the console space with AMD so Xbox and Playstation and are manufacturing Apple's APU in their phone. I don't see how it doesn't become a 500-600$ stock in the coming years.\n\n&#x200B;\n\nEdit: Thank you for the awards, great comments and don't forget to do your own DD before buying or selling anything, good luck.\n\n&#x200B;",
        "created_utc": 1614492376.0,
        "subreddit_name": "stocks",
        "comments": 4126
    },
    {
        "title": "S&P 500 since 1950 - graph showing all crashes",
        "score": 4377,
        "url": "https://www.reddit.com/r/investing/comments/lujnvo/sp_500_since_1950_graph_showing_all_crashes/",
        "content": "[S&P 500 Since 1950 - 7 crashes](https://www.tradingview.com/x/v3WOgbWL/)\n\n\nHi guys just wanted to put things in perspective for you all since some of you seem to be quite nervous with the recent week of stock movement. \n\nI've summarised a list all stock market crashes since 1950. There has been 7 stock market crashes since 1950, averaging one every 10 years. \n\nThe stock market crashes ranges from inflation (10%+), to oil price rises (4x) due to war, dot com bubble, housing market collapse, covid-19 etc.\n\nThe graph is a log graph meaning that the space changes are proportional to the percentage change. This is useful for looking at long term charts since the % change for a dollar increase is smaller as the index value goes up.\n\nThe S&P 500 has averaged a compound annual growth rate of 8.22% since 1950. This is illustrated by the trend lines, and as you can see the S&P 500 is trading right in the middle of the range (the two blue trend lines). \n\nI noted a few reasons in the box for each crash for a brief understanding of why it had happened. Note, that the only one with a 'fear of overvaluation' was only the dotcom crash where the PE's were over 200 and many companies were just cash burning shells with massive negative free cash flows.\n\nI'm not saying a crash / correction won't happen, but i just wanted to put things into perspective and give a bigger picture of the overall stock market since pretty much before all of us were born. \n\nBy no means am i an economist but I didn't include anything earlier than 1950s because that was pre WW2/WW1 - before the US was a superpower / the global financial hub / USD = world trade currency etc.\n\nEdit: some of you noted that its only 8.22% if you bought at the start but I want to clarify that yes and no! Yes for the people that literally buy in once once at the beginning of 1950.\n\nNo because if you buy throughout the years (DCA every month let's say) you'll buy within the range - both lower and higher range! So it's more or less 8%! For example during 1960s-1980s the sp500 traded sideways! So if you constantly bought in those 20 years, the accumulation of money in this period would have a higher CAGR of > 8% because of where it is in the range. Just follow the lines! It makes it easier. There's roughly same amount of periods above and below the middle trend line.\n\nEdit: Changed enron scandal to lehman brothers as some pointed out my mistake.\n\nEdit: Further Log Graph explanation (why log is preferred) If the scale has a large range (i.e. 100 to 3000) then log should be used because its important to show the % changes as opposed to the point changes. A 1 point increase in the SP500 now is only 1/3811 = 0.02% whereas a 1 point increase 10 years ago was 1/1000= 0.1%. It's important to look at it in terms of % change because companies grow in terms of % as well. For example you don't quote apple has grown its business by 30 billion this year ( random number), instead you say apple grew its sales by 20% this year. Its so that its comparable.",
        "created_utc": 1614528943.0,
        "subreddit_name": "investing",
        "comments": 903
    }
]