[
    {
        "title": "TSMC second-quarter profit beats expectations as AI chip boom continues ",
        "score": 289,
        "url": "https://www.reddit.com/r/stocks/comments/1e68obp/tsmc_secondquarter_profit_beats_expectations_as/",
        "content": "Taiwan Semiconductor Manufacturing Company on Thursday beat revenue and profit expectations in the second quarter, as demand for advanced chips used in AI applications continue to surge.\n\nHere are TSMC’s second-quarter results versus LSEG consensus estimates:\n\nRevenue: 673.51 billion New Taiwan dollars ($20.82 billion), vs. NT$657.58 billion expected\n\nNet income: NT$247.85 billion, vs. NT$238.8 billion LSEG SmartEstimate weighted toward forecasts from analysts who are more consistently accurate\n\nTSMC reported net revenue rose 40.1% from a year ago to NT$673.51 billion, while net income increased 36.3% from a year ago to NT$247.85 billion. The firm guided second-quarter revenue to be between $19.6 billion and $20.4 billion.\n\nChairman and CEO C.C. Wei in an earnings call on Thursday said business in the second quarter was supported by strong demand for its industry-leading 3-nanometer and 5-nanometer technologies, though it was offset by continuous smartphone seasonality.\n\nExplosive demand for AI has stretched chip supplies. TSMC is the world’s main producer of advanced chips found in everything from smartphones to AI applications, though rivals such as Samsung and Intel have been trying to challenge its dominance. It counts Apple and Nvidia among its clientele.\n\n“I also try to reach the supply and demand balance, but I cannot. Today, the demand is so high I had to work very hard to meet customer demand,” Wei told analysts.\n\n“The supply continues to be pretty tight, all the way through 2025,” Wei warned, adding that the firm hopes the tight supply can ease in 2026.\n\nThe chip giant currently produces 3-nanometer chips and plans to commence mass production of 2-nanometer chips in 2025. Typically, a smaller nanometer size yields more powerful and efficient chips.\n\nDevelopment of 2-nanometer technology is “progressing well” and is on track for volume production in 2025, said TSMC. \n\nFor the third quarter, the business is expected to be supported by strong smartphone and AI-related demand, said Wei, adding that they continue to expect 2024 to be “a strong growth year for TSMC.”\n\nTSMC projects third-quarter revenue between $22.4 billion and $23.2 billion. This compares to $17.3 billion in revenue posted in the same period a year ago.\n\nFor its capital budget this year, the firm is narrowing the range to between $30 billion and $32 billion, versus a previous forecast of $28 billion to $32 billion. Out of this budget, 70% to 80% will go toward advanced technologies.\n\n“We are working very, very hard to get enough capacity to support customers,” Wei said.\n\nThe firm further added that it is not ruling out the possibility of converting more “N5” technology into “N3″ technology to meet the strong demand for 3-nanometer chips.\n\nTSMC shares closed 2.43% lower on Thursday, as Asian chip stocks tumbled on the back of a U.S. tech sell-off sparked by reports that Washington is considering tighter export curbs.\n\nBig AI demand\n\nSurging demand for advanced chips used in AI applications has boosted TSMC’s Taiwan-listed shares by nearly 70% so far this year.\n\n“The demand for generative AI is surging in the cloud and at the edge. TSMC’s N3 process boasts good yield rates and well-managed production lines. The market is well-funded, and regional political factors drive increased demand for advanced processes,” Brady Wang, associate director of Counterpoint Research, said on Friday ahead of the results.\n\nWang said the capacity of the 3-nanometer process is expected to more than double in 2024 compared to the previous year.\n\nNeedham analysts on Monday said they expect TSMC to raise its 2024 revenue growth target, reiterating a “buy” rating and raising the price target to $210 from $168 on the chip giant’s U.S.-listed shares.\n\n“We expect TSMC to raise its 2024 revenue growth outlook from ‘low- to mid-20s’ to ‘mid- to high-20s’ but maintain its 2024 [capital expenditures] target at $30 billion on the upcoming earnings call,” Needham said in a note.\n\nTSMC held 62% of global foundry market share in the first quarter, up from 59% in the same period a year ago, according to Counterpoint Research data.\n\nSource: https://www.cnbc.com/2024/07/18/tsmc-q2-2024-earnings.html",
        "created_utc": 1721300626.0,
        "subreddit_name": "stocks",
        "comments": 65
    },
    {
        "title": "CrowdStrike is not worth 83 Billion Dollars",
        "score": 24509,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1e6ms9z/crowdstrike_is_not_worth_83_billion_dollars/",
        "content": "**Thesis**: Crowdstrike is not worth 93 billion dollars (at time of writing).\n\n\n**Fear**: CrowdStrike is an enterprise-grade employee spying app masquerading as a cloud application observability dashboard.\n\n\n**OBSERVATIONS**\n\n* The 75th percentile retail investor has a tenuous grasp on “Cloud”, “Software Engineering”, and “Cyber Security”.\n* The median “Cyber Security Analyst” has a tenuous grasp on “Cyber Security”\n* The median “Software Engineer” has a tenuous grasp on “Cyber Security” and “Cloud”\n* The median retail investor has a tenuous grasp on “markets” and “liquidity pools”\n \n\n\n**CRITIQUES**\n\n* Corporations could buy CrowdStrike to spy on their own employees.\n\n* CrowdStrike’s utility is limited- they simply collect all of their customer’s data and display it on a dashboard. \n* CrowdStrike is dangerous in that they have root access to every device(i.e. endpoint) across thousands of firms.\n* CrowdStrike customers sign up to get their firm’s data added to a bank which CrowdStrike then has license to use for “correlation”\n* CrowdStrike is a sitting-duck datamine for the FBI/NSA to subpoena. \n* CrowdStrike could potentially behave as a propaganda arm of the US government by creating “fake hacking stories” which are un-disprovable.They are able to do this due to information asymmetries in society.\n* Properly built “cloud applications” have security baked in by virtue of separation of concerns in the \"software supply chain\". (e.g. containerization engine developer is different than the OS developer is different than the Cloud Infrastructure Provider). \n* CrowdStrike’s Falcon product contradicts their own guiding principle of “Zero-Trust Security”.\n\n\n**COMMENTARY**\n\n* CrowdStrike’s product includes a “client” which runs on every \"customer endpoint” (i.e. company issued laptop). Activity on the company issued laptop is reported to an internal dashboard which only an IT guy + a C-Suite admin have access to. They ALSO offer observability into each component of a business’s own “cloud application”.\n* These are 100% different lines of business which can be easily conflated.\n* CrowdStrike admits that they collect all of a business’ “endpoint data'' and they compare it to other data they have to \"draw insights\"; this means that every company that hires CrowdStrike is part of a DATA COMMUNE.\n* It’s prohibitively hard to hack into a “cloud system” due to few possible entry points\n* Exfiltrating data at scale is difficult; employees of the company pose a bigger threat than \"threat-actors\".\n* *Containerize Everything* + *Microservices Architecture* hampers \"lateral movement\". \n* Is CrowdStrike compatible with companies that run their IT systems on premises?\n\n\n\n\n\n\n*The CrowdStrike Story So Far…*\n\n\n\n**2020**\n\n* “Uses cloud technology to detect and thwart attempted cybersecurity breaches”\n\n* “Runs on your endpoint or server or workload”\n\n* “Signature based technologies don’t go far enough”\n\n* “We collect trillions of events” \n\n* “There hasn’t been a salesforce of security” \n\n—  FAST FORWARD — \n\n**2024**\n\n* Palo Alto Networks(100% different business line) is being pitted against CrowdStrike in the media. \n* Crowdstrike allegedly offers a poorly differentiated suite of generically titled products: **(Falcon Discover, Falcon Spotlight, Falcon Prevent, Falcon Horizon, Falcon Insight(EDR), Falcon Insight(XDR), Falcon Overwatch, Falcon Complete(MDR), Falcon Cloud Security)**. There is no way to confirm unless you schedule a meeting with their team though.\n* I spoke to a “Network Engineer” at CrowdStrike. He said that he “mostly tries to get bug bounties”. \n* “CrowdStrike сustomers: 44 of 100 Fortune 100 companies, 37 of 100 top global companies, 9 of 20 major banks & 7 of the TOP 10 largest energy institutions.”  This makes it a threat vector.\n\nMisleading videos on their site: \n\n* https://vid.crowdstrike.com/watch/P4xk1x3PaH1D6rR4MiW2F5? \n* https://www.youtube.com/watch?v=9x7eiznCfAg \n* https://www.crowdstrike.com/platform/cloud-security/cspm/ \n\n\n**My Position:**\n\n* CRWD $185 Put, 11/21/25 expiration date,.\n* 5 contracts @ $7.30, up 16.85% since 06/11/24 \n\n\n\n*First Draft/Final Draft: June 11th/July 18th*\n\nEdit: [Gains](https://imgur.com/a/Q09o7iY)",
        "created_utc": 1721338292.0,
        "subreddit_name": "wallstreetbets",
        "comments": 2586
    },
    {
        "title": "Cellebrite Unable to Unlock iPhones on iOS 17.4 or Later, Leak Reveals",
        "score": 1356,
        "url": "https://www.macrumors.com/2024/07/18/cellebrite-unable-to-unlock-iphones-on-ios-17-4/",
        "content": "",
        "created_utc": 1721305552.0,
        "subreddit_name": "apple",
        "comments": 218
    },
    {
        "title": "Apple is convincing Wall Street it knows how to market AI: Morning Brief",
        "score": 4,
        "url": "https://finance.yahoo.com/news/apple-is-convincing-wall-street-it-knows-how-to-market-ai-morning-brief-100056219.html",
        "content": "",
        "created_utc": 1721278860.0,
        "subreddit_name": "AAPL",
        "comments": 0
    }
]