[
    {
        "title": "Microsoft wins U.S. Army contract for augmented-reality headsets, worth up to $21.9 billion over 10 years",
        "score": 3976,
        "url": "https://www.reddit.com/r/investing/comments/mhj59m/microsoft_wins_us_army_contract_for/",
        "content": "[Microsoft wins U.S. Army contract for augmented-reality headsets, worth up to $21.9 billion over 10 years](https://www.cnbc.com/2021/03/31/microsoft-wins-contract-to-make-modified-hololens-for-us-army.html)\n\nNews broke maybe 4 hours ago. MSFT shot up 1% on that news, up more than 2% on the day.\n\nSome highlights from the CNBC article:\n\n>\"Microsoft will deliver to the U.S. Army over 120,000 devices based on its HoloLens augmented-reality headset.\"  \n\"The standard-issue HoloLens, which costs $3,500, enables people to see holograms overlaid over their actual environments and interact using hand and voice gestures.\"  \n\"A group of employees called on Microsoft to cancel the HoloLens contract. “We did not sign up to develop weapons, and we demand a say in how our work is used,” the employees wrote in an open letter regarding the HoloLens contract.\"\n\nThoughts on this news? What do you guys think about some employees opposing the decision? All I know is Microsoft is a monster of a company. Just another reason to continue holding I guess",
        "created_utc": 1617235429.0,
        "subreddit_name": "investing",
        "comments": 292
    },
    {
        "title": "I tried to predict the stock market every day in March. Here's how it went - and what I learned.",
        "score": 5290,
        "url": "https://www.reddit.com/r/stocks/comments/mhvteb/i_tried_to_predict_the_stock_market_every_day_in/",
        "content": "Every single day this month, I tried to do the one thing that everybody says you shouldn't try to do. I tried predict the exact daily movements of the stock market -- specifically, the daily direction, high, and low of the NASDAQ -- and posted my best guess in the daily discussion forum.\n\nI had to pay incredibly close attention to the stock market every day to do it. Every single morning, I did technical and market analysis to try to keep from publicly embarrassing myself. I learned more about the stock market this month than I have in my entire time trading.\n\nTo celebrate one month of predictions, I wanted to take a look back at the month of March and share some of the things I've learned.\n\nHere's the first one:\n\n**I can't predict the stock market.**\n\n*Damn it.* I really thought I'd be able to do it.\n\nYou can see my [full scorecard here](https://datastudio.google.com/reporting/944799e4-93a3-4aa3-9a1a-68059d06c4a2/page/MkMAC), but it isn't really anything to brag about. Here's how I did:\n\n* **Direction:** 65% correct\n* **Daily high:** Median error of 0.26%\n* **Daily low:** Median error of 0.36%\n\nI was always more interested in the highs and lows than the direction, but *damn* is 65% ever a bad score. I've looked into it -- if I'd just predicted whatever the premarket said, I would've been right 74% of the time.\n\nPart of the problem was this:\n\n**When J. Powell talks, there's a 66% chance the market will tank.**\n\nWhen J. Powell talked, my prediction was wrong more often than it was right -- and usually by a lot. On average, my prediction for the daily low was off by 1.37% whenever he spoke.\n\nI wanted to look into that, so I tested out some of the big narratives we heard this month\n\n[Click here to see that research visualized.](https://datastudio.google.com/reporting/944799e4-93a3-4aa3-9a1a-68059d06c4a2/page/HORAC)\n\nJ. Powell used to be able to pump the market -- but since 2020, I learned, the market has turned red on 66% of the days that he has either made a speech or a public testimony, with the market closing, on average, down 1.24%.\n\n**The NASDAQ is often a better predictor of a stock's price than the company itself.**\n\nI've seen a lot of posts here lately saying: \"Why is everybody talking about indexes? Isn't this supposed to be a stock forum?\"\n\nOne thing this month affirmed for me is that, if you want to know what AAPL or MSFT are going to do today, you have to look at the market itself first.\n\nAAPL, MSFT, GOOG, and AMZN were all extremely correlated with the NASDAQ this month, to the point that, statistically speaking, it can be said that 81% of the variations in Apple's price this month can be explained by changes in the NASDAQ.\n\nI saw a lot of people in the daily discussion asking: \"Why is AAPL tanking? What new is there?\" But -- unless there actually is company news -- that's often the wrong question to ask. \n\n**The market isn't always affected by what CNBC says...**\n\nOne of the biggest stories we heard this month was about the \"bond yield\". The 10-year bond yield went up today, CNBC would report, and so the NASDAQ was sure to tank.\n\nIt never really made sense to a lot of investors -- so I looked into whether that story held up.\n\nI'll let you draw your own conclusions, but here's what I can say for sure:\n\n* There was no statistically significant correlation between the 10-year bond yield and the NASDAQ's price in March\n* If there were one, it would be a positive correlation. When the bond yield went up, it was more likely that the NASDAQ would go up with it than down.\n* There was more of a correlation on days when the bond yield reached a new 12-month high -- but only if the new yield was heavily reported. If it went unmentioned, the NASDAQ went up.\n* The days when the bond yield did significantly go up and the NASDAQ did significantly go down were all days when J. Powell gave a speech\n\n**... but sometimes it is.**\n\nThat doesn't mean everything CNBC said was a lie this year.\n\nAnother huge story this month was the rotation out of tech into value stocks -- and then, at the end of the month, the rotation back.\n\nThis story *totally* holds up. If you plot a tech stock like AAPL's price against JP Morgan's (which I've done for you [here](https://datastudio.google.com/reporting/944799e4-93a3-4aa3-9a1a-68059d06c4a2/page/HORAC)), you'll see that, 61% of the time, these stocks went in the exact opposite direction.\n\nPeople really were rotating out of tech and into value -- and they really are starting to come back.\n\n**I still think the stock market can be predicted**\n\nWhen I started doing this, I got a lot of hate from people who said that only an idiot would try to predict the market. But after a while, those hate messages stopped -- and, instead, people started sending me hate messages saying that they could predict the market better than I can.\n\nThey probably can. I didn't do as well as I'd like this month, but, when I was right, I knew *why* I was right. And when I was wrong, I knew *why* I was wrong -- and had a pretty good idea of how to do better next time.\n\nEverything is *not* priced-in, I've learned this month. Take Biden's speech last night. The market didn't even budge while he was talking. Sure, we were in afterhours, but even Robinhood users were allowed to invest -- and his plan had been laid out weeks in advance. But the Wall Street traders were off work, so the market didn't budge until the morning -- when it absolutely mooned.\n\nIf you pay close enough attention, you *can* get ahead of Wall Street. I'm increasingly convinced of that, and I believe that my predictions will get better as time goes on.\n\n[You can see today's prediction here.](https://datastudio.google.com/reporting/944799e4-93a3-4aa3-9a1a-68059d06c4a2/page/kHRAC)",
        "created_utc": 1617285307.0,
        "subreddit_name": "stocks",
        "comments": 460
    }
]