[
    {
        "title": "Visa, Mastercard block Russian financial institutions after sanctions",
        "score": 4404,
        "url": "https://www.reddit.com/r/stocks/comments/t438zp/visa_mastercard_block_russian_financial/",
        "content": ">U.S payment card firms Visa and Mastercard have blocked multiple Russian financial institutions from their network, complying with government sanctions imposed over Moscow's invasion of Ukraine.  \n>  \n>Visa said on Monday it was taking prompt action to ensure compliance with applicable sanctions, adding that it will donate $2 million for humanitarian aid. Mastercard also promised to contribute $2 million.  \n>  \n>\"We will continue to work with regulators in the days ahead to abide fully by our compliance obligations as they evolve,\" Mastercard said in a separate statement late on Monday.  \n>  \n>The government sanctions require Visa to suspend access to its network for entities listed as Specially Designated Nationals, a source familiar with the matter told Reuters. The United States has added various Russian financial firms to the list, including the country's central bank and second-largest lender VTB\n\n [Visa, Mastercard block Russian financial institutions after sanctions | Reuters](https://www.reuters.com/business/mastercard-blocks-multiple-russian-financial-institutions-network-2022-03-01/?utm_source=reddit.com)",
        "created_utc": 1646123394.0,
        "subreddit_name": "stocks",
        "comments": 292
    },
    {
        "title": "Apple stops all product sales in Russia as RT and Sputnik removed from App Store",
        "score": 1984,
        "url": "https://www.reddit.com/r/investing/comments/t4iokb/apple_stops_all_product_sales_in_russia_as_rt_and/",
        "content": "Apple has paused all product sales in Russia in response to the invasion of Ukraine.\n\nThe tech company said it has also limited Apple Pay and other services in Russia, and that it has removed state-backed news outlets RT and Sputnik from its App Store in other countries.\n\nIn a statement, Apple said: \"We are deeply concerned about the Russian invasion of Ukraine and stand with all of the people who are suffering as a result of the violence.\n\n\"We are supporting humanitarian efforts, providing aid for the unfolding refugee crisis, and doing all we can to support our teams in the region.\n\n\"We have taken a number of actions in response to the invasion.\n\n\"We have paused all product sales in Russia.\n\n\"Last week, we stopped all exports into our sales channel in the country.\n\n\"Apple Pay and other services have been limited.\n\n\"RT News and Sputnik News are no longer available for download from the App Store outside Russia.\n\n\"And we have disabled both traffic and live incidents in Apple Maps in Ukraine as a safety and precautionary measure for Ukrainian citizens.\n\n\"We will continue to evaluate the situation and are in communication with relevant governments on the actions we are taking. We join all those around the world who are calling for peace.\"\n\nhttps://news.sky.com/story/apple-stops-all-product-sales-in-russia-as-rt-and-sputnik-removed-from-app-store-12555128",
        "created_utc": 1646169621.0,
        "subreddit_name": "investing",
        "comments": 87
    }
]