[
    {
        "title": "Apple to Debut Passwords App in Challenge to 1Password, LastPass",
        "score": 2739,
        "url": "https://www.bloomberg.com/news/articles/2024-06-06/apple-to-debut-passwords-app-in-challenge-to-1password-lastpass",
        "content": "",
        "created_utc": 1717705598.0,
        "subreddit_name": "apple",
        "comments": 650
    },
    {
        "title": "Craig Federighi ignited Apple's AI efforts after using Microsoft's Copilot",
        "score": 1537,
        "url": "https://appleinsider.com/articles/24/06/06/craig-federighi-ignited-apples-ai-efforts-after-using-microsofts-copilot",
        "content": "",
        "created_utc": 1717673008.0,
        "subreddit_name": "apple",
        "comments": 319
    },
    {
        "title": "iOS 18 Beta Available Next Week With These 25 New Features Expected",
        "score": 1310,
        "url": "https://www.macrumors.com/2024/06/04/ios-18-beta-next-week-with-these-new-features/",
        "content": "",
        "created_utc": 1717699672.0,
        "subreddit_name": "apple",
        "comments": 460
    },
    {
        "title": "Apple Commits to At Least Five Years of iPhone Security Updates",
        "score": 1004,
        "url": "https://www.macrumors.com/2024/06/06/apple-iphone-security-updates-five-year-minimum/",
        "content": "",
        "created_utc": 1717669473.0,
        "subreddit_name": "apple",
        "comments": 145
    },
    {
        "title": "The bubble is upon us",
        "score": 6160,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1d98x32/the_bubble_is_upon_us/",
        "content": "I was taking the elevator in my apartment. The other passengers, a couple with a border collie, were discussing options trading. \n\ngirl: \"I don't even know what an option is, is it a stock?\"\n\nguy: \"It's really complicated, do you use Robinhood?\"\n\ngirl: \"Yeah I buy lululemon every paycheck.\"\n\nguy: \"Just buy some NVDA options, it can't go tits up.\"\n\n\nThis is a true, paraphrased story. \n\nAlso the dog was really cute.\n\nedit: Forgot to add, the dog said \"Woof\", I'm not sure if that was investment advice or something else.\n\nedit: Can't believe this low-effort post is on the top. I was literally just buzzed on some double IPAs and foolin. f o o l i n",
        "created_utc": 1717645026.0,
        "subreddit_name": "wallstreetbets",
        "comments": 730
    },
    {
        "title": "Apple AI strategy next week / the next few months",
        "score": 10,
        "url": "https://www.reddit.com/r/AAPL/comments/1d9jiep/apple_ai_strategy_next_week_the_next_few_months/",
        "content": "Hi folks. Long time Apple investor here. For some reason, a long walk with my dog this morning got me putting some things together in my head. Happy to hear alternatives, but most important is how something like this would affect the stock in the short and long term.\n\nI get the feeling after reading several reports that Apple could use WWDC to talk up the inclusion of AI in their OSs in this way:\n\nSimilar to how you can choose Google or Bing or DuckDuckGo for search, you'd be able to choose OpenAI or Copilot (or as we are hearing, no AI at all). That choice would tie into search, the OS and core apps, and finally third party apps when they are updated to allow that integration. So Apple as usual is the gatekeeper and has a big hand in security.\n\nSince Apple \"buying time\" and playing \"catch-up\" seem to be pretty strong themes lately, this would give developers the next few months to update apps, while Apple readies more M4 (\"great for AI\") devices than the lone new iPads (for the fall and winter perhaps). It also gives Apple time to improve and finally release their own AI integration, which could then be one more choice (TBD on if or when they'd drop the others).\n\nTo me, that strategy wouldn't be a big wow, but it would be solid and not concern me much stock-wise in the long term.\n\nI'm not sure if Apple would talk up OpenAI etc, while in the same breath also saying \"we've got our own (even better) thing coming soon\". Stock-wise however, I feel if they somehow can hit that last point, the short-term effect on the stock is better than if they don't.",
        "created_utc": 1717684062.0,
        "subreddit_name": "AAPL",
        "comments": 4
    }
]