[
    {
        "title": "What is your #1 your best/worst market decision?",
        "score": 2906,
        "url": "https://www.reddit.com/r/stocks/comments/gp4yrz/what_is_your_1_your_bestworst_market_decision/",
        "content": "Back in 1996-ish, I was a senior in college taking a marketing class. Discovered the internet. Asked my teacher “who owns the internet?” He said “no one, but AOL and Microsoft seem to be the most involved. My parents had put away some bonds for me, so I used that money to buy 100 shares of both companies (I believe they were $10 or under). \n\nMade about $60,000. Sold stock and bought a house a block from the beach in Southern California for $500,000 in 2000. Sold that two years later for $600,000. Everyone celebrate.\n\nGot married, continued to buy houses and make money. Got divorced in 2006, lost about 50% of equity in the crash. \n\nThat first beach house is now worth $2+ million. And I don’t even want to do the math on profit if I had kept the stocks. \n\nMoral: keep stocks and real estate for 25 years and spend all extra money on marriage therapy!\n\n*Edit: for all of you blaming “the wife” for the loss, you should know I was the wife. Surprise, it’s a girl.",
        "created_utc": 1590240698.0,
        "subreddit_name": "stocks",
        "comments": 898
    },
    {
        "title": "FBI cannot even look at your phone lock screen without a warrant, rules judge",
        "score": 84854,
        "url": "https://9to5mac.com/2020/05/22/phone-lock-screen/",
        "content": "",
        "created_utc": 1590229849.0,
        "subreddit_name": "news",
        "comments": 2421
    },
    {
        "title": "[Self Promo Saturday] I released a really big update to my Reddit app Apollo for Reddit, featuring a supercharged Media Viewer, Smart Rotation Lock, Portrait Lock Buddy, GIF conversion, Reddit video downloading, Share as Image, new icons, awards, polls, iPad trackpad support, and more!",
        "score": 5840,
        "url": "https://www.reddit.com/r/apple/comments/gpevga/self_promo_saturday_i_released_a_really_big/",
        "content": "Hey r/Apple, I build a Reddit app for iOS called Apollo, you all have been really nice in the past and provided great feedback when I've posted, so I wanted to update you about a really big update I just released that I've been working on for months: Apollo 1.8! \n\nI don't want this to be one of those recipe blog posts where you have to scroll through a ten page story to get to the good stuff, so I'll cut right to the point and list the features. I'll hang around the thread for as long as you want to answer questions/suggestions as well!\n\n(I like to do thorough changelogs because it makes me feel good about myself, but if this is tl;dr for you here's a quick feature list blast for the update: **media viewing upgrades, Reddit video downloading, on the fly GIF conversion, faster sharing, Smart Rotation Lock, Portrait Lock Buddy, 5 new app icons, share post/comment as an image, Reddit polls, new Reddit awards, fast comment parent previewing, more iOS 13 context menus, iPad pointer/trackpad support.**)\n\n(Oh and if you view the changelog in Apollo I embedded images for extra clarity.)\n\n### Media Viewer\n\n- I've always really prided in Apollo having a best in class media viewing experience, cleanly supporting Imgur, Gfycat, Reddit, Streamable and more directly inline, and very quickly. This update brings that to the next level, with even better support for videos and GIFs, where they transition elegantly from playing inline in the feed to a really slick experience in the media viewer, with full controls, GIF scrubbing, GIF pausing, mute controls, playback speed, downloading, sharing, and more. \n\n### Media Sharing\n\n- Save/share as GIF! Long story short, GIFs are an old format, so behind the scenes most sites just store them as MP4 videos with their audio removed, since videos are a more modern, efficient format. This is great, but GIFs are still more compatible everywhere. So I rewrote the engine and now Apollo can convert the video on the fly into a GIF super quickly, so if you want that nice, old school GIF format to share or save, you can have the best of both worlds. I'm gonna open source this engine, it was a lot of fun.\n- Download/share Reddit videos! Reddit videos are in a weird format that can make them hard to work with, essentially the audio and video streams are separate, so to download them you normally need like a weird website that'll handle it for you, but Apollo will automatically download and stitch the audio and video together for you now!\n- Sharing even normal videos is better too, since Apollo now integrates even better with the Messages app, Apollo adds custom metadata to the video to enable the Messages app to autoplay (muted) and autoloop the videos, so your friends don't have to tap on the video and open the player to make it start playing. \n- Fixes a longstanding bug where when playing music in the background Apollo sometimes wouldn't resume the audio if it interrupted it because you wanted to play a video. Now it'll properly resume your audio and leave you right where you were in your song/podcast.\n- Sharing is more streamlined too, now when you long-press on the content it'll jump *directly* into the share sheet allowing you to do what you please with it, without having to do any intermediary steps. If you want the link versus the image itself, you can choose so right from the share sheet. Same with sharing Reddit links, no more confusion about if you're sharing the image the Reddit post is about, or the link to the comments, etc. Just hold down on the post and you get the post, hold down on the image/video/GIF and you get the video. Bam.\n- On iOS 13 and later you can use haptic touch to long press on an image/video/GIF to preview it quickly, and even download/save/share directly from there. It uses those fancy new context menus from iOS 13. Kinda reminds me of a supercharged version of the old media preview from Alien Blue.\n\n# Smart Rotation Lock\n\n- Ever wish your Twitter/Reddit/whatever app would only rotate media like videos, but leave everything else like post feeds alone so they're not rotating all over the place when you just want to watch a video? Apollo now supports this, intelligently allowing rotation for the media viewer but blocking it for everything else if you turn on this feature.\n\n# Portrait Lock Buddy\n\n- That above feature is great, but I found a big catch: if you use the iOS \"Portrait Orientation Lock\" (like from Control Center) there's not much the app can do because *all of iOS is locked to portrait*. Portrait Lock Buddy seeks to solve this dilemma by using CoreMotion to manually detect rotation events and offer you the option to rotate the media if you so choose. So you can have portrait everywhere, but still enjoy a good widescreen video, GIF, or image in Apollo landscape style if you want. :)\n- If you're more of a visual learner, I made a short 24 second (no audio) YouTube video that shows how Portrait Lock Buddy works: https://youtube.com/watch?v=EK5sDrpS6Sg\n\n# Share Comment/Post as an Image\n\n- Another way of saying this is kinda like \"convert a comment/post to an image\". This one's great for when you want to screenshot a funny comment or post and send it to a friend. Normally you have to screenshot it, then if you want it to look nice you have to crop it to get rid of the extra parts, kind of a hassle. Worse, what if the comment is really long, or there's multiple, you then have to stitch a bunch of photos together like a 17th century tailor.\\n\\nApollo 1.8 adds Share as Image, with a quick tap it'll generate an image of the comment or post ready to be whisked off to a friend or saved. You can even tell it to include parent comments that it's replying to, or even the main post as well for context, and it'll automatically stitch long comments together into a single image. And it also works for sharing a post, like a weird creepypasta, or even sharing an image post with the title included as a single image! It's really, really convenient.\n\n# Five New App Icons\n\n- Apollo's always been about making Reddit really customizable, and ever since Apple added the ability to change an app's homescreen icon way back in iOS 10.3 Apollo's been all over it. This update brings 5 new icons you can choose from (in addition to the existing dozens). Here's a picture of the new ones with the original/default icon at the start: https://i.imgur.com/mhFJoVu.png\n\n# New Reddit Awards\n\n- Reddit recently updated the award system to evolve from just Silver, Gold, and Platinum, to now offer a ton of different and cool awards you can choose from with some really neat artwork and themes. Apollo now supports both gifting these new awards if you have the coins already on your account, and of course viewing the awards a post or comment has been given.\n- Of course, if you're not a fan of awards there's an option to hide them!\n\n# Reddit Polls\n\n- Reddit recently added the ability for posts to have polls which ask a question and let users vote and see the results. Apollo now supports this, showing the poll inline, with the options available, and once you've voted in the poll or the poll concluded, what the results are.\n\n# Comment Parent Previewing\n\n- On iOS 13 and later comments now get a nice context menu when you use haptic touch on them, but beyond just having some nice options it'll now actually show you the parent comment to the comment you selected, which can be really handy when you're deep in a thread and want to see what the comment is replying to without losing your place. \n\n# iPad Pointer/Trackpad Support\n\n- iOS 13.4 added a ton of awesome functionality around iPads and mouse/trackpad cursor support across the entirety of iOS. Apollo prides itself in being a first class iOS citizen so it now adopts iOS' pointer support super well. If you have one of the new Magic Keyboards, or even a normal trackpad or mouse, Apollo now interacts with your mouse with awesome hover states and interactions across the app, in a way that makes it feel really at home on iOS and so nice to scroll and flick around with. I'm talking full support for gestures too. It also even improves keyboard support!\n\n# Other\n\n- Improved iconography across the app to be a little more refined, nice, up to date, and pretty. :)\n- Added a permanent \"Coin Sale\" button in the top right corner of every screen. Just kidding.\n- Select Mode is available in more places (calling it “Select Text” now just to be more clear) and selects all by default to make it even faster/friendlier.\n- Apollo now has enough features that it's moving its payment model to a full-time subscript— just kidding, all the features above are either free or can be unlocked via \"Apollo Pro\" for a few bucks if you want to support the app's development!\n- If anyone's familiar with Sublime Text I did take a note from their book with how the app is completely free with no ads, but once a month now Apollo will show you a little popup about Pro and how it helps a ton with supporting the app's ongoing development. I'm just one guy building Apollo and not everyone even knows about Pro so I thought this would be a nice balance that isn't too annoying, it'll show a little under twelve times a year, and you can close it in 0.6 seconds, so it's a total of 7.2 seconds a year in minor annoyance that you can get rid of just by supporting the app for a few dollaroonies.\n- Context menus from iOS 13 are now used extensively across the UI to make Apollo feel even more like the iOS/iPadOS first class citizen it is. :)\n- I designed the \"Apollo Pro\" and \"Tip Jar\" screens with some fun treats so you should definitely check those out hehe. Tips from this update are going toward \"replace my aging MacBook\" fund\n- Fixed a lot of small bugs and improved performance in some other areas. :)\n\n# I ran out of things to say\n\nWell that's the update folks! I've got lots of great new features planned for the coming months, plus a really awesome, completely revamped from the ground up iPad app, but I'll take a break from those to answer questions or feedback in this thread as long as you want! I'm going to make cinnamon rolls to celebrate the update going out!\n\n– Christian",
        "created_utc": 1590275940.0,
        "subreddit_name": "apple",
        "comments": 464
    }
]