[
    {
        "title": "Underestimating AAPL",
        "score": 294,
        "url": "https://www.reddit.com/r/stocks/comments/1dct1uw/underestimating_aapl/",
        "content": "I'm not at surprised at the knee-jerk small sell-off is happening after the Apple Intelligence announcement.  \n\nHowever, I think Cook et co nailed it.  They are  bringing AI to day to day activities, to the masses.\n\nApple makes AI capabilities available and  attractive a way that Microsoft, google, and fail to do so as well.   I think it's going to add a lot of Apple over the next couple years, especially as they continue to add features.  Smart to make privacy a priority from the beginning. \n\nAs it will take a while to implement, and apple is under DOJ scrutiny, and people underestimate apple, it'll be a while til it's reflected in share price, but  this implementation I think will pay off long term.  \n\nUntil then, some buying opportunities, I'd wager.",
        "created_utc": 1718045016.0,
        "subreddit_name": "stocks",
        "comments": 207
    },
    {
        "title": "AAPL took dip after WWDC. ",
        "score": 50,
        "url": "https://www.reddit.com/r/investing/comments/1dcwasi/aapl_took_dip_after_wwdc/",
        "content": "Not a huge dip, but not insignificant, I don’t think. It seems like the announcement has a lot of good stuff that would encourage people to invest more. \n\nAre there explanations or theories why this happens?\n\nTo be clear: I’m not even invested in AAPL, aside from what might be found in my index funds. I’m just trying to learn. ",
        "created_utc": 1718052797.0,
        "subreddit_name": "investing",
        "comments": 70
    },
    {
        "title": "Apple’s AI promise: “Your data is never stored or made accessible by Apple”",
        "score": 6309,
        "url": "https://arstechnica.com/ai/2024/06/apples-ai-promise-your-data-is-never-stored-or-made-accessible-by-apple/",
        "content": "",
        "created_utc": 1718047415.0,
        "subreddit_name": "technology",
        "comments": 1031
    }
]