[
    {
        "title": "Peloton (PTON) Recalls Its Tread and Tread+ Treadmills After They Were Linked to Serious Safety Hazards",
        "score": 1479,
        "url": "https://www.reddit.com/r/investing/comments/n5jtkv/peloton_pton_recalls_its_tread_and_tread/",
        "content": ">**The company will no longer sell either product and is offering owners full refunds**  \n>  \n>Peloton recalled its Peloton Tread+ and Peloton Tread treadmills today, according to an [announcement from the Consumer Product Safety Commission](https://www.cpsc.gov/Newsroom/News-Releases/2021/CPSC-and-Peloton-Announce-Recall-of-Tread-Plus-Treadmills-After-One-Child-Death-and-70-Incidents-Recall-of-Tread-Treadmills-Due-to-Risk-of-Injury), the government agency that oversees most household products, citing safety hazards.  \n>  \n>The Peloton Tread+ has been linked to dozens of injuries to children, including one death. The recall notice states that “Peloton has received 72 reports of adult users, children, pets and/or objects being pulled under the rear of the treadmill, including 29 reports of injuries to children such as second- and third-degree abrasions, broken bones, and lacerations.”  \n>  \n>**The company also notified the CPSC that its newer Peloton Tread’s touch screen can detach and fall, posing a risk of injury to consumers.**  \n>  \n>**Consumers should immediately stop using the treadmills and** [**contact Peloton for a full refund**](https://www.onepeloton.com/)**.**  \n>  \n>**The Peloton Tread+ (previously named the Peloton Tread) has been on the market since 2018. A smaller treadmill, also named the Peloton Tread, was slated to go on sale May 27, with 1,000 units already sold in the U.S. as part of a friends-and-family presale.**   \n>  \n>The recall comes after the [CPSC, in April, took the unusual step of warning consumers](https://www.consumerreports.org/product-safety/peloton-plus-tread-treadmill-urgent-safety-warning-cpsc/) with small children or pets at home to immediately stop using the Peloton Tread+. The company initially refused to recall its popular $4,300 exercise machine, according to a CPSC spokesperson, stating that the product was safe as long as users followed operating instructions.  \n>  \n>**The warning was based on reports of 39 incidents in which a person, a pet, or an object, such as an exercise ball, was sucked under the machine, leading to injuries in both children and adults, many of them serious. “These are more severe injuries than you would imagine with a treadmill,” the CPSC spokesperson told Consumer Reports at the time, adding that the agency had not seen these types of injuries with other treadmills.**  \n>  \n>In light of the CPSC’s warning and the severity of the injuries, [CR removed the Peloton Tread+ from its ratings](https://www.consumerreports.org/product-safety/safety-concerns-prompt-consumer-reports-to-remove-peloton-tread-plus-from-ratings/) and stopped recommending the product while the investigation was ongoing.   \n>  \n>The treadmill’s safety risks first became apparent in March after [Peloton CEO John Foley wrote to](https://support.onepeloton.com/hc/en-us/articles/360058677091-A-Note-from-Peloton-CEO-John-Foley-about-Tread-) users of the exercise machines regarding an incident with the Peloton Tread+ that led to the death of a child. Foley advised consumers to “keep children and pets away from Peloton exercise equipment at all times” and to “remove the safety key and store it out of reach of children” when the treadmill was not in use.  \n>  \n>The widely publicized fatality prompted the CPSC to request information from Peloton, and the company disclosed to the agency that there were additional injuries and incidents tied to the Peloton Tread+.  \n>  \n>**As the CPSC investigated the reports, including disturbing** [**home video footage of a child being sucked underneath the Peloton Tread+**](https://www.youtube.com/watch?v=onXNnlCYJ4Y) **(and escaping without serious injury), the agency asked Peloton to recall its treadmills. But Peloton refused.**  \n>  \n>Shortly before the CPSC’s public warning, Rep. Jan Schakowsky, D-Ill., asked for details about the CPSC’s investigation and Sen. Richard Blumenthal, D-Conn., urged Peloton to issue a recall.  \n>  \n>The standoff with Peloton illustrates that the CPSC cannot force companies to issue a recall without taking them to court, even when the agency’s safety experts have tied a hazardous product to deaths or serious injuries.  \n>  \n>“The CPSC took a strong and principled stance for safety, and clearly that’s what made Peloton come to the table and agree to offer a full refund,” says William Wallace, CR’s manager of safety policy. “It shouldn’t have required so much time and effort to get this product recalled. This episode underscores why we need to overhaul our outdated laws, so the CPSC has the ability to take quicker, forceful action when a product is putting people at risk.”  \n>  \n>Acting CPSC chairman Bob Adler said in a statement today that he is pleased that the agency and Peloton have ultimately agreed on recall terms. He added that the recall “is the result of weeks of intense negotiation and effort, culminating in a cooperative agreement that I believe serves the best interests of Peloton and of consumers.”  \n>  \n>**Peloton CEO Foley apologized for the company’s initial response to the safety issues, and stated that “the decision to recall both products was the right thing to do for Peloton’s Members and their families. I want to be clear, Peloton made a mistake in our initial response to the Consumer Product Safety Commission’s request that we recall the Tread+. We should have engaged more productively with them from the outset. For that, I apologize.”**\n\n[Source](https://www.consumerreports.org/home-product-recalls/peloton-tread-tread-plus-treadmills-recalled-serious-safety-hazards/)\n\n[PTON stock price](https://finance.yahoo.com/quote/PTON?p=PTON&.tsrc=fin-srch)",
        "created_utc": 1620231575.0,
        "subreddit_name": "investing",
        "comments": 294
    },
    {
        "title": "Apple's iMac predicted to overtake HP and lead the All-in-One market",
        "score": 5128,
        "url": "https://appleinsider.com/articles/21/05/05/apples-imac-predicted-to-overtake-hp-and-lead-the-all-in-one-market",
        "content": "",
        "created_utc": 1620215360.0,
        "subreddit_name": "apple",
        "comments": 718
    },
    {
        "title": "Apple Capital return program",
        "score": 4,
        "url": "https://www.reddit.com/r/AAPL/comments/n5rqvp/apple_capital_return_program/",
        "content": "So i stumbled upon it and it says they purchased 19 billion worth of shares for Q2. That is much lower than their then sanctioned 50 billion. Now that it is 90 billion availability for shares, should we expect more purchasing? Secondly, there is a blackout period for buybacks around repurchasing, unless company does it on a regular basis. Now i am confused whether that applies to insider buying or company returning capital. \nTA by some suggests that Apple needs to touch the trend-line at 125 to bounce back up. So do you believe that Apple is buying shares back already or in a few days? Thanks!",
        "created_utc": 1620251867.0,
        "subreddit_name": "AAPL",
        "comments": 18
    }
]