[
    {
        "title": "WOO $TSLA ",
        "score": 2,
        "url": "https://i.redd.it/typa7unghd0e1.gif",
        "content": "$TSLA carrying $SPY.",
        "created_utc": 1731374553.0,
        "subreddit_name": "wallstreetbets",
        "comments": 3
    },
    {
        "title": "What Should We Really Learn From Market Crashes?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gp9u28/what_should_we_really_learn_from_market_crashes/",
        "content": "There's this video on YouTube explaining every major financial crash (I'll link the video). It goes through in brief detail every crash that happened in history.  \n  \nVideo link: [Every Major Financial Crash Explained in 5 Minutes](https://www.youtube.com/watch?v=ulzeBijeLSY) \n\nI'm curious to know everyone's thoughts about the lessons we should learn from marketing crashes. What are the typical downfalls mainly seen when there are bad market cycles?\n\nIs it that we should avoid the heard mentality and \"be fearful when others are greedy\" as Warren Buffett puts it?",
        "created_utc": 1731376917.0,
        "subreddit_name": "investing",
        "comments": 0
    },
    {
        "title": "If Berkshire Hathaway suddenly spent all cash on hand on equities, how much do you think the market would move?",
        "score": 135,
        "url": "https://www.reddit.com/r/stocks/comments/1gp7be7/if_berkshire_hathaway_suddenly_spent_all_cash_on/",
        "content": "Berkshire Hathaway has the largest pile of cash on hand of any company (or if I'm mistaken is at least in the top 10). If they suddenly bought as much stock as they could, in this environment, how much movement do you think we would see? Would this drive a bullish sentiment in stocks enough across the board to see significant changes? If so, couldn't Buffet essentially start his own stock market surge at any moment by choosing to do this? Not to say this is true of any mega cap company, but specifically for buffett since he is both one of the wealthiest in the world, and is possibly the most sought after voice in the investing world",
        "created_utc": 1731369693.0,
        "subreddit_name": "stocks",
        "comments": 110
    },
    {
        "title": "Waymo opens robotaxi service to anyone in Los Angeles, marking its largest expansion yet",
        "score": 107,
        "url": "https://www.reddit.com/r/stocks/comments/1gpoc5u/waymo_opens_robotaxi_service_to_anyone_in_los/",
        "content": "Alphabet-owned Waymo is removing the waitlist for its self-driving service in Los Angeles, marking its largest expansion yet.\n\nStarting Tuesday, anyone in LA will be able to use the Waymo One app to hail a self-driving robotaxi throughout nearly 80 square miles of Los Angeles County, the company said. That includes the 300,000 Angelenos who have been on Waymo’s waitlist.\n\nWith more than 3.8 million people, LA marks the third and largest city where the company’s robotaxi service is now fully available. It follows San Francisco, where Waymo One opened citywide in June. The company opened the service in Phoenix in 2020.\n\n“Now is an exciting time to welcome everyone in Los Angeles along for the ride,” Tekedra Mawakana, co-CEO of Waymo, said in a news release Tuesday. “Our service has matured quickly and our riders are embracing the many benefits of fully autonomous driving. We’re so grateful to all of our first riders in LA, and we can’t wait to serve more riders soon.”\n\nThe company has been rapidly expanding its operations over the last year thanks to additional funding.\n\nWaymo closed a $5.6 billion funding round in October to expand its robotaxi service across the U.S. The autonomous vehicle venture is owned by Google parent Alphabet, which led the series C investment in Waymo, alongside earlier backers including Andreessen Horowitz, Fidelity, Perry Creek, Silver Lake, Tiger Global and T. Rowe Price.\n\nThe robotaxi company now sees more than 150,000 paid rides per week across its three markets via the Waymo One app, the company said Tuesday. That’s up from 100,000 in August.\n\nWaymo in September announced that it partnered with Uber to launch its robotaxi service in Austin, Texas, in 2025. The next-generation robotaxi from Waymo is a Geely Zeekr that’s equipped with custom sensors and an AI “driver.” Waymo also recently agreed to a multiyear strategic partnership with Hyundai that will add the South Korean automaker’s Ioniq 5 electric vehicle to its robotaxi fleet.\n\nThe Waymo One service has been embraced by some women who have safety concerns about riding with unknown human drivers. It has also been used by parents to send their teens to school.\n\nSource: [https://www.cnbc.com/2024/11/12/waymo-opens-robotaxi-service-to-anyone-in-los-angeles.html](https://www.cnbc.com/2024/11/12/waymo-opens-robotaxi-service-to-anyone-in-los-angeles.html)",
        "created_utc": 1731428027.0,
        "subreddit_name": "stocks",
        "comments": 34
    },
    {
        "title": "Netflix ad-supported tier has 70 million monthly users two years after launch",
        "score": 54,
        "url": "https://www.reddit.com/r/stocks/comments/1gpodss/netflix_adsupported_tier_has_70_million_monthly/",
        "content": "Netflix’s cheaper, ad-supported tier has reached 70 million global monthly active users two years after it was launched.\n\nThe company said Tuesday that more than 50% of its new sign-ups are for ad-supported plans in countries that offer the option. Netflix said it continues “to see positive momentum and growth across all areas of the business,” adding it has seen “steady progress across all countries’ member bases.”\n\nNetflix launched the option in November 2022 as one of its responses to a slowdown in subscriber growth.\n\nRecently, subscriber growth hasn’t been an issue. Last month Netflix reported it added 5.1 million subscribers during the third quarter, beating Wall Street estimates. In total, Netflix counts 282.7 million memberships across all of its pricing tiers.\n\nBeginning next year, Netflix said it will no longer update investors on its subscriber numbers as it shifts focus toward revenue and other financial metrics as performance indicators.\n\nWhen Netflix launched its ad platform two years ago, the company said Nielsen would rate its content.\n\nNetflix in May announced it would air two National Football League games on Christmas Day this year as part of a three-year deal. On Tuesday it said it sold out of its ad inventory for the two live games.\n\nNetflix also said it’s brought on FanDuel and Verizon as advertisers for the games. FanDuel will become the exclusive pregame sportsbook betting partner, Netflix said, and will have a sponsored in-show feature.\n\nMedia companies have been focusing on ad-supported strategies for their streaming options that woo customers with cheaper plans and also offer advertising revenue that can help move the streaming businesses toward profitability. While the ad market has been slow for traditional TV, it has grown for streaming and digital businesses.\n\nNetflix offered its last update on its ad-supported tier in May, when it said it reached 40 million global monthly active users, nearly doubling the figure it had shared in January. That announcement came during Upfronts, when media companies make their pitches to advertisers.\n\nNetflix also announced in May it would launch its own advertising platform, ending a partnership with Microsoft for that technology. It’s rolled out the platform in Canada and plans to launch it in the U.S. by the end of the second quarter next year. It plans to set the platform live everywhere by the end of 2025.\n\nSource: [https://www.cnbc.com/2024/11/12/netflix-ad-supported-tier-70-million-monthly-users.html](https://www.cnbc.com/2024/11/12/netflix-ad-supported-tier-70-million-monthly-users.html)",
        "created_utc": 1731428139.0,
        "subreddit_name": "stocks",
        "comments": 24
    },
    {
        "title": "Disney - what am I getting for $100?",
        "score": 6,
        "url": "https://www.reddit.com/r/stocks/comments/1gpp6qs/disney_what_am_i_getting_for_100/",
        "content": "Starting a new conversation on DIS, as the last one is almost 3 month old. My tone will be neutral, because I'm just contemplating my decision about DIS stock. Don't know Long or Short? \n\nSo, what does $100 buy me:\n\n* Disney+ streaming service with 130M subscribers. That's half of NFLX. You do the math. Punish Disney for \"meh\" content quality in comparison to NFLX, but then, not everyone needs _edge of chair, nail biting_ content. Think about boomers who just want to look at a glowing TV screen with drama soaps on.\n\n* Top notch studios like Marvel, Pixar, 20th century, ABC. Sports network of ESPN. \n\n* Theme parks in US, Paris, China, Tokyo. Cruise line (probably a cash burner).\n\n* New CEO in early 2026, meaning.. plenty of time for Iger to look for a new job, leverage, armtwist whatever he has in mind.\n\n* PE of 38 against 12 of Comcast.\n\nAll things considered, I'll pass. Stock price movement too is so \"meh\" that it's not even worth shorting 🤣 What say?\n\n",
        "created_utc": 1731430112.0,
        "subreddit_name": "stocks",
        "comments": 30
    },
    {
        "title": "Out of the “Big 7” any you’d recommend buying over others?",
        "score": 4,
        "url": "https://www.reddit.com/r/stocks/comments/1gpmrel/out_of_the_big_7_any_youd_recommend_buying_over/",
        "content": "Wanna buy 2-3 of the big 7 stocks, atm thinking of google, Nvidia, and maybe another.\nAll these stocks are at the highest they’ve ever been basically so maybe not best to buy but who knows if the market will keep climbing so I’ll buy and hold for probably 2 years at least. If I need to hold longer for that I probably can. I’m somewhat new to investing so just wanna see y’all’s thoughts. Should I just wait? That would be timing the market and seems like a bad idea haha. Buying now and averaging my price down if need be sounds smarter.",
        "created_utc": 1731423941.0,
        "subreddit_name": "stocks",
        "comments": 43
    },
    {
        "title": "Deep dive into eBay - The Rise, The decline and The Reality Check",
        "score": 2,
        "url": "https://www.reddit.com/r/stocks/comments/1gpqebe/deep_dive_into_ebay_the_rise_the_decline_and_the/",
        "content": "**1.0 Introduction**\n\neBay was originally called “AuctionWeb” when it launched in 1995. Its founder, Pierre Omidyar, created it as part of his website to experiment with online auctions. He listed his broken laser pointer for sale and sold it for **$14.83**. When he asked if the buyer understood the laser pointer was broken, the buyer responded that he was a collector and was still interested.\n\nIn 1997 the name was changed to eBay, and the rest is history.\n\nThe most expensive item ever sold on eBay is the **Gigayacht**, a 405-foot luxury yacht designed by Frank Mulder. It was purchased for **$168 million** by the Russian billionaire Roman Abramovich.\n\nThe auctions for a lunch with Warren Buffett also took place on eBay, with the 2022 auction being won by a bid of $19 million.\n\n\n\n**2.0 Competition**\n\neBay has been primarily known as the auction go-to-place, as well as the place to go for 2nd hand items. Although there is an overlap with its competitors, there is no doubt that it dominates the 2nd hand market, especially for trading cards and collectibles and it can be labeled as the market leader in Recommerce and auctions.\n\nIts competition comes in different forms:\n\n* **Amazon & Walmart Marketplace** \\- Global eCommerce platforms focused on new products sold by businesses and third-party sellers.\n* **Facebook Marketplace & Craigslist** \\- Local Recommerce platforms enabling individuals to buy/sell used items within their communities.\n* **Etsy** \\- Global eCommerce with a focus on handmade and unique products, though it includes some Recommerce elements for vintage goods.\n\neBay supports eCommerce, but that is a more crowded market, where Amazon is king.\n\n  \n**3.0 Its business model**\n\neBay’s revenue comes in many forms:\n\n* Final value fees\n* Listing fees\n* Feature fees\n* Store subscription fees\n* Sale of advertisements\n* Revenue sharing arrangements\n* Shipping fees, etc.\n\nUltimately, they can be grouped into 2 buckets: Transaction revenue (\\~85%) and advertising (\\~15%).\n\n\n\n**3.1 The key metrics that do not add up**\n\nIn companies of this kind, two important metrics are:\n\n* The **Gross Merchandise Value**, also known as “GMV”, represents the value of all products sold through the website.\n* The **take-rate** represents their share of the GMV.\n\nLet’s have a look at both of them.\n\nThe GMV increased from $73b in 2019 (prior to the pandemic) to $87b during the pandemic and is not back to $74b. However, if you follow their take-rate, it went up from 9% to 14% between 2019 and LTM. But this is slightly misleading. eBay changed the definition of their \"take-rate\" in 2022.\n\nIt used to be calculated as **net transaction revenue** divided by **GMV** and it changed to **net revenue** divided by **GMV**.\n\nSo, I opted for an alternative take-rate, which is definitely not a generally accepted definition. That is: **operating profit** divided by GMV. The outcome is the % of the GMV that is kept by eBay after covering all the operating expenses. There, the increase is minimal, and this adjusted take rate fluctuates around 3%.\n\n\n\n**4.0 Historical Financial Performance**\n\nAlthough its revenue is flat (\\~$10 billion), eBay is a cash-generating machine, bringing **\\~$2 billion** in free cash flow per year *(\\~1.4 billion if SBC is subtracted)*. \n\nBehind the scenes, there’s something else worth noting. Not only has the revenue not been growing, but the composition has changed.\n\n\n\n|Revenue by geography (in $m)|2021|LTM|Change (in %)|\n|:-|:-|:-|:-|\n|U.S.|$5.048|$5.185|3%|\n|U.K.|$1.913|$1.588|\\-17%|\n|China|$856|$1.124|31%|\n|Germany|$1.249|$967|\\-23%|\n|Rest of the world|$1.354|$1.402|4%|\n|Total|$10.420|$10.266|\\-1%|\n\nUK and Germany are contributing significantly less, and this decline is being compensated by growth primarily coming from China. Given that China comes with its additional risks (and competition), it can be argued that the revenue today is of lower quality than the revenue back in 2021.\n\nThis could indicate that the penetration rate in the U.S. and Western Europe is at its peak and the average long-term growth that can be expected is around the 3% historical inflation rate.\n\n\n\n**5.0 Capital allocation**\n\nA huge focus of the management has been returning cash to the shareholders.\n\nSince 2019, the company returned almost $28 billion ($25b via buybacks and $3b via dividends). A lot of this came from the company’s free cash flow, but part of it came from divestitures:\n\n* Sold 80% of eBay Korea to eMart.\n* Reduced ownership in Aurelia (the privatized Adevinta entity).\n\n  \nThis led to a reduction of the number of shares outstanding by 40%. This is also a very impressive number if it is presented in isolation. However, half of the repurchases were done in 2020 and 2021, when the share price was quite elevated. In hindsight, that might not have been the best decision.\n\nOne notable long-term investment of theirs is Adyen, where they own 404k shares due to the warrants based on processing volume criteria. Given Adyen’s share price, these are worth around half a billion dollars.\n\n  \n**6.0 Valuation**\n\nThis is the time to put all the pieces of the puzzle together.\n\nThe key question to answer is - **Given what is known today, how much is the company worth?**\n\nBased on everything mentioned above, my best estimate for revenue growth is in line with inflation, as this is a mature market with a high penetration rate in the developed countries.\n\nSimilarly, I do not see any levers that the company can pull to significantly increase its profitability. For that reason, I keep its operating margin at 21%.\n\nBased on my assumptions, the fair value of the company is $20.7b (**$43/share**), significantly below today’s share price of $62.\n\nHere’s how the valuation (per share) changes if you have different assumptions than mine regarding the revenue growth & the operating margin:\n\n\n\n|Revenue / Operating margin|19%|21%|23%|\n|:-|:-|:-|:-|\n|0% ($10.3b)|$29|$31|$33|\n|34% ($13.8b)|$40|$43|$47|\n|65% ($17.0b)|$47|$50|$54|\n\n\n\nIf the DCF model is reversed, for eBay to be fairly valued today, it needs to **double in size over the next decade** (average annual revenue growth of 7%) and **increase its operating margin to 23%.** Although this isn’t impossible, there’s no evidence that eBay’s growth will re-accelerate.\n\nI hope you enjoyed this post, feel free to share your thoughts.",
        "created_utc": 1731433092.0,
        "subreddit_name": "stocks",
        "comments": 3
    },
    {
        "title": "For TSLA is next options move ",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gpmvzw/for_tsla_is_next_options_move/",
        "content": "Last Friday's surge was clearly the result of an options Gamma Squeeze, in which a large number of people purchased call options, forcing the options market maker to buy shares, pushing the stock price further up, and then more people bought call options, and the options market maker was forced to buy more shares, and the process repeats itself!\n\nGamma Squeeze can make the stock price surge quickly in a short period of time, but this kind of increase is often unsustainable, because options market makers to buy a large number of shares, due to the stock price in a very high position, holding the risk is quite large, the options market makers will be the IV of the call options continue to raise, so that the operation of buying the call options become less lucrative\n\nAt this time, once someone sells a call option, the options market maker will sell shares to hedge, the stock price in a short period of time, the biggest buying momentum will disappear, the compression effect is lost, the stock price will turn down, a large number of profitable call options will also be closed, which in turn will lead to options market maker to sell more positive shares\n\nFor the next half month, we may try to move up and down first this week, but then I think TSLA is about to have a pullback close to 15%~20% or so.\n\nOf course, these ups and downs due to the Gamma Squeeze won't change a company's long-term fundamentals, and with a share price below $300 TSLA is certainly a position to add to",
        "created_utc": 1731424284.0,
        "subreddit_name": "stocks",
        "comments": 0
    },
    {
        "title": "Hertz Share Price Close To Half Book Value After Hitting an Expensive Undo Button",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gpnduu/hertz_share_price_close_to_half_book_value_after/",
        "content": "Hertz made a big bet when it bought a ton of Tesla EVs for its fleet. The bet has not paid off in the slightest with higher maintenance costs than expected, an overstock of the EVs (especially considering how much they are rented out), and lower than expected resale value. \n\nThis decision has put the company in a hole, where it’s now trading at close to half of its book value. \n\nDo you see Hertz as an Opportunity, or do you believe its risk of bankruptcy is too high at the moment? If it is an opportunity I’d think the recovery is years down the line. ",
        "created_utc": 1731425576.0,
        "subreddit_name": "stocks",
        "comments": 8
    },
    {
        "title": "Anyone else getting nervous about an impending recession?",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gposos/anyone_else_getting_nervous_about_an_impending/",
        "content": "Prices feel inflated.  Tomorrow's prices are priced in today and as that continues every day at some point that logic ceases to be \"investing\" but rather \"speculation\" and thats the key-word behind every bubble.\n\nIf you've listened/read anything from the most successful investors, all the red flags they bring up are being seen now.   When EVERYONE is so optimistic is now whats making me most nervous.  If you read about major crashes and recessions of the past, they are always precipitated with quotes from investors about how if you're not in the market you're losing out and everythings looking great, future is great,\n\nTariffs will be inflationary.  Tax cuts will disproportionately favor big businesses.  Interest rates are going down because the fed is reactionary. All of these have the recipe for inflation to increase again but this time squeezing americans to the point where buying stops.  It will also induce a panic in the market that might trigger a large correction.   Trump wants to increase local production which will help in the short-run, but his foreign policy is unpredictable so hard to say what oil imports will do.\n\nI think most people have some cautious optimism, but at what point does it become more caution than optimism?\n\nI'm thinking of liquidating and just holding treasuries or safe stocks like berkshire.  In essence, I'm becoming fearful when almost everyone seems greedy.  The timeframe what I'm talking about is maybe 1 to a few years. What are your guys' thoughts?",
        "created_utc": 1731429157.0,
        "subreddit_name": "stocks",
        "comments": 49
    },
    {
        "title": "HIMS: One Stock to rule them all (in telehealth) (PART 3 DD Nov. 11)",
        "score": 86,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gpa3l1/hims_one_stock_to_rule_them_all_in_telehealth/",
        "content": "My last HIMS DD, Part 2 available here: [**https://www.reddit.com/r/wallstreetbets/comments/1g4c8z9/hims\\_dark\\_patterns\\_part\\_2\\_up\\_47\\_since\\_last\\_post/**](https://www.reddit.com/r/wallstreetbets/comments/1g4c8z9/hims_dark_patterns_part_2_up_47_since_last_post/)\n\nThe price was $21 then and is up 35% now to $28 and flirting with $30 today.\n\nIt is still criminally undervalued, but why do we see the recent jump and what do we have to look forward to?\n\nTirzeptide is next up; there was a LEAKED instagram ad this past weekend that was quickly taken down that showed HIMS old ads with Semaglutide replaced on the bottle....with TIRZEPTIDE!  Much easier to customize this drug...bullish for compounding. HERE WE GO.\n\nHIMS CFO confirmed on their earnings call last week; if NOVOs drugs come off shortage they will no longer sell compounded doses equivalent to NOVOs doses...but they WILL still compound tailored doses.  He also stated they will continue to sell branded GLP1 copy of ozempic, as well as Liraglutide compounded which will be off patent soon.  The key point here is:  HIMS will ALWAYS have some sort of GLP1 and the cross sell is accelerating, new customers are spending more and more on their subscriptions!\n\nThis means a double down on GLP1 with a caveat to dodge lawsuits.  Dark Pattern tactics will ensure they maintain and grow sales in weight loss category.\n\nFDA reconsidered removing the GLP1s from shortage in response to a compounder letter to FDA, decision will be next week but it's bullish that it was even taken seriously vs. big pharma's counter letters.  Most think this is going HIMS way.\n\nRFK and Trump admin is historically anti FDA reg (announced policy) and specifically, ANTI NOVO (RFKs tweets have been slamming NOVO's profits on GLP1 constantly).\n\nHIMS is projecting 90%+ growth in Q4...with now 2M users, 72% gross margin, and capturing 54% of all new telehealth customers...\n\nHIMS IS what Teledoc could have been if they had ever been profitable and didn't flush $25B down the toilet.\n\nHIMS is the future of telehealth.  This is AMAZON when they were just selling books.  The most operationally efficient platform (using AI to reduce cost of doctors with MedMatch) with the best customer experience.\n\nAs we reach escape velocity, price target is $60-100 EOY given the excellent macro environment, and this would only put HIMS at a pathetic 20B mkt cap or 10x PS ratio for a company that might be growing 100%+ rev. per year, with well over $2B rev next year...\n\nWe haven't even seen their reveal of testosterone replacement therapy yet, but adds being focused around low test means its coming.  Maybe Q4.\n\nI have about 40k in Jan 26 leaps 30strike.  Happy to share position with a mod for proof.\n\nIf you want a speculative play does it get any better?  If it does PLEASE share with me I still have some cash ready for my next play.",
        "created_utc": 1731377707.0,
        "subreddit_name": "wallstreetbets",
        "comments": 69
    },
    {
        "title": "I Profit at Tesla $144K—742%",
        "score": 33,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gpqqt6/i_profit_at_tesla_144k742/",
        "content": "https://preview.redd.it/xjj4v8v3ei0e1.png?width=3000&format=png&auto=webp&s=c5a147df0abc635882476be2ec3ac3c9df93ea63\n\nThe TSLA hype didn't start last Tuesday, it started in July.\n\nThe stock price over the past four months, if you look at the results, pretty much went through a surge from $170 to $330, and actually nearly doubled, with a lot of volatility in between.\n\n\n\nLuckily, I made the right bet, and I've been outperformed.\n\nA lot of times, a sharp rise is often followed by a sharp fall; on July 19, 2023, TSLA tried to break through $300 unsuccessfully, and immediately came to a wave of turnaround and plummeted from $300 to $212 in one fell swoop; on July 11, 2024, TSLA tried to break through $270 unsuccessfully, and soon fell from $270 to $182 in one fell swoop. These are some typical cases",
        "created_utc": 1731433965.0,
        "subreddit_name": "wallstreetbets",
        "comments": 4
    },
    {
        "title": "Why is nobody talking about LNG?",
        "score": 22,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gpqeom/why_is_nobody_talking_about_lng/",
        "content": "What a week! TSLA. PLTR. BTC. Hard to pick a loser lately. A little profit taking today from paper hands but this thing seems poised to run. Jpow said inflation is over last week. And the U.S. is about to push through massive tax cuts and regulatory reform. The rocket has already made it to moon, now we're just refueling for Mars\n\nSo what's the play going forward? Well over the past week the one thing that will likely benefit most from deregulation has been almost flat. Natural gas. \n\nIn the U.S., gas is cheap. Dirt cheap. It's basically a waste product from oil production at this point and we just burn the stuff at the wellhead because there's not enough pipeline capacity to get it to the customers.\n\nDomestically, we are going to need a ton of energy for everything from data centers to manufacturing and there are no sources that can be brought on as fast as natural gas. So why haven't we expanded our pipeline capacity already? Simple, regulation has made the prospect of pipeline expansion unrealistic. But that's going to change. Unlocking oil and gas is expected to be a day 1 Executive Order. \n\nInternationally, the picture is looking even brighter. Turns out we're the only ones with dirt cheap natural gas. The rest of the world pays 10x or more what we do for natural gas. And now the U.S. wants to dominate energy exports. We are about to see LNG exports become a cornerstone of American trade policy. \n\nPosition- $LNG 3/21/25C, $ET 6/20/25C\n\nTldr: LNG and Pipelines 🚀 🚀 🚀 on day 1 Executive Orders\n\nThis is not financial advice. I'm just a fellow moron with a few news subscriptions and too much time on my hands. Do your own due diligence. \n",
        "created_utc": 1731433119.0,
        "subreddit_name": "wallstreetbets",
        "comments": 17
    },
    {
        "title": "My views on why NVDA beats earnings and flies to higher supports. Likley past 200. ",
        "score": 24,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gpq5d8/my_views_on_why_nvda_beats_earnings_and_flies_to/",
        "content": "For the PE bitchers and moaners, I leave you this:\n\nAMD Trailing Twelve Month ACTUAL PE is: 126\n\nNVDA Trailing Twelve Month ACTUAL PE is: 69\n\nChanos bitched and moaned all the way to the broke house where he had to close shop. Tesla preaching and evangelizing the PE did him an apostate. He's done. TESLA CRUSHED HIM. Tesla easily slid into it's PE and Chanos is no more. Same thing happened with the bitchers and moaners with Amazon, Google, etc. When a company is a quality company and especially part of the SP500, where every iteration of the that index HAS TO PURCHASE this stock, you ride well, and the company easily slides well into it's PE very well and snuggly like. \n\nJust like Zuckerberg sucker punched Open AI LLM's by making it's LLM open source and scorching the Earth, So goes NVDA: Open sourcing their DATA CENTER TECH, ( a little secret, its not just about the GPU, it's the entire package, it's not just about BLACKWELL GPU. But Rack/ Data Center Tech Design and Architecture, there will BE ZERO INCENTIVE FOR CUSTOMERS TO GO TO COMPETITORS WHEN RACK ARCHITECTURE THAT FITS BLACKWELL GPU's with ZERO ISSUE, IS COMPLETELY OUT IN THE OPEN: READ SUMMARY( this is why AMD and INTEL are having such a hard time competing and frankly anybody else, unless you're DELL and WORKING with Jensen... But Dell doesn't make chips, so their good bros and compliment each other very well in many ways, STILL NVDA HAS IT'S OWN DATA CENTER RACK TECHNOLOGY THAT IS NOT DELL'S AND IT IS NOW OPEN SOURCE- FROM COOLING TO ETHERNET AND SCALING DATA TECHNOLOGY... GIVING THEM A MASSIVCE ADVANTAGE.. vs those that want to take away their Data Center Service / Business :\n\nThis OCP summit with this open sourcing debut specifically for Blackwell tech was as of last month, Oct 17th.\n\n( Jensen is busy busy busy )  \n\"At this year’s OCP Global Summit, NVIDIA will be sharing key portions of the NVIDIA GB200 NVL72 system’s electro-mechanical design with the OCP community — including the rack architecture, compute and switch tray mechanicals, liquid-cooling and thermal environment specifications, and NVIDIA NVLink™ cable cartridge volumetrics—to support higher compute density and networking bandwidth.\"  \n..\"said Jensen Huang, founder and CEO of NVIDIA. “By advancing open standards, we’re helping organizations worldwide take advantage of the full potential of accelerated computing and create the AI factories of the future.”\n\n[https://nvidianews.nvidia.com/news/nvidia-contributes-blackwell-platform-design-to-open-hardware-ecosystem-accelerating-ai-infrastructure-innovation](https://nvidianews.nvidia.com/news/nvidia-contributes-blackwell-platform-design-to-open-hardware-ecosystem-accelerating-ai-infrastructure-innovation)\n\nEverybody KNOWS there is a plateau. A plateau and lower business revenues based on estimates that TAKE INTO CONSIDERATION THAT INFERENCE IS LESS DEMANDING THAN TRAINING. THAT BEING SAID, MARKET IS NO LONGER LOOKING FOR INSANE NUCLEAR GROWTH. BUT STEADY HEALTHY GROWTH. THAT\\*\\* WILL PROPEL THIS STOCK HIGHER.\n\nCrazy AI nuclear growth, is not what the market is expecting. Market is expecting a healthy stable growth, now that we are near equilibrium with AI and chips, ( this is obviously not true, but it's the arguments bears try to hang on. They think Amazon will overtake a 30 year CUDA industry software environment the entire world/industry has created THEIR ENTIRE INFRASTRUCTURE, BOTH SOFTWARE AND HARDWARE AROUND). Go look up CUDA. It's older than many traders here. There is no world, or dimension, in the slightest, where a newcomer, or an online retailer, will wrap up 30yrs in a qtr or two. Or three, or four... NVDA continues to climb on growth, steady healthy growth, not insane nuclear growth. THAT WILL PROPEL THIS STOCK HIGHER. It has no where else to go. Ive's and Wedbush, are ENTIRELY correct.\n\nDan Ives and Josh Brown Discuss NVDA  \n[https://youtu.be/u-95RKiEl5o?si=8Cpbr3LFWE9WsVju](https://youtu.be/u-95RKiEl5o?si=8Cpbr3LFWE9WsVju)\n\nI'm not your mom. Just an OP. Read and discuss and be nice to each other. And remember to hedge like a good little boy and girl.",
        "created_utc": 1731432472.0,
        "subreddit_name": "wallstreetbets",
        "comments": 37
    },
    {
        "title": "🚀 MPWR YOLO Alert 🚀",
        "score": 12,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gpra3g/mpwr_yolo_alert/",
        "content": "Monolithic Power Systems (MPWR) – These guys aren’t some rando chip stock. They’ve been around since ‘97, pumping out high-performance power tech across cloud, telecom, cars, industrial gear, and gadgets. They’re out of Kirkland, WA, and have secured a spot as a serious player in the semiconductor game.\n\n**Stock Moves** 💸\n\nSo MPWR’s been on a wild ride lately, down to $638.26 as of Nov. 12, tanking 13.98% after hitting $689 intraday. We saw a low of $610. But the analysts? They’re **not sweating it**.\n\n**Analyst Degen Ratings** 🚀💰\n\nEven with the recent dips, the big brains on Wall Street still say “buy.” Check out these price targets:\n\n* **Truist Financial** – William Stein said **BUY** on Oct. 31 and juiced his target to $994 from $918.\n* **Stifel Nicolaus** – On Oct. 9, Stifel kept the “BUY” train rolling with a target hike to $1,100.\n* **TD Cowen** – Matt Ramsay (Diamond Hands) dropped a **BUY** on Oct. 31 with a $975 target.\n* **Rosenblatt** – Back on Oct. 29, they called **BUY** with a $880 target.\n* **Needham & Co.** – On Nov. 11, Quinn Bolton didn’t flinch. Still **BUY** at $950.\n\nThe **average target** sits around **$942.40**, so we’re looking at a potential upside of about **23%** if the suits are right. That’s a **Strong Buy Consensus** across the board. 🤑\n\n**Latest Drama** 📉💥\n\nMPWR got slapped with a 15% drop on Nov. 11 after some rumors claimed they might lose Nvidia’s business. But MPWR’s management said “Fake News” – no issues with Nvidia, and the analysts were quick to back ‘em up. Just noise, or time to load the dip?\n\n**TL;DR** 🦍💎🙌\n\nMPWR’s a big fish in the semiconductor pond with killer positioning in high-growth sectors. Analysts are still diamond-handing it, so if you’re looking for a semi play with strong fundamentals, this could be it. Get ready for a rocket or a rollercoaster.\n\n  \nPositions Posted Below: \n\nhttps://preview.redd.it/r81bpq3rhi0e1.png?width=1926&format=png&auto=webp&s=bc30c9a813b39fc2e84e047ef16b819cdc38a2e1\n\n",
        "created_utc": 1731435225.0,
        "subreddit_name": "wallstreetbets",
        "comments": 8
    },
    {
        "title": "TSM play off NVDA earnings",
        "score": 4,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gpsfpn/tsm_play_off_nvda_earnings/",
        "content": "I got roughly 5k people mad saying that Tesla was sooo overpriced, and look at it today it’s looking like it’s going to rebound but I’m going to hold my puts for shits. NVDA is too expensive for my liking I wish it stayed at 143 into open. TSM seems to be lagging imo I think a good NVDA earnings run up with carry all relevant semi conductors. Starting to scale into some small TSM otm contracts to sell before NVDA earnings and am scoping NVDA Dec 6 OTM when it comes down in price.\n\nLook forward to what you guys have to say about that.",
        "created_utc": 1731438066.0,
        "subreddit_name": "wallstreetbets",
        "comments": 12
    },
    {
        "title": "Did anyone on here invest when Apple was almost bankrupt? ",
        "score": 33,
        "url": "https://www.reddit.com/r/investing/comments/1gpllz1/did_anyone_on_here_invest_when_apple_was_almost/",
        "content": "What is the cheapest the stock got to when they were almost bankrupt before Steve Jobs returned to the company? I'm curious. \n\nI know most people would not have thought anything of Apple at that time and I'm pretty curious when sentiment was at its lowest. ",
        "created_utc": 1731420747.0,
        "subreddit_name": "investing",
        "comments": 75
    },
    {
        "title": "Chipotle (CMG) vs NVIDIA (NVDA) growth for 2025",
        "score": 1,
        "url": "https://www.reddit.com/r/stocks/comments/1gptg02/chipotle_cmg_vs_nvidia_nvda_growth_for_2025/",
        "content": "When both companies went through a stock split early this year (CMG was north of $3,000 and NVDA north of $1,200) I jumped on a few shares as both companies had tremendous growth. CMG stock has increased 250% past couple years, and plans to open between 285 and 315 new restaurants next year, and get into some international markets for the first time, it has experienced revenue growth that even big places like Taco Bell and McDonalds haven’t seen with fewer locations. NVDA has been deemed the most valuable company, AI is the wave of the digital future with NVDA leading the charge, and CMG just makes burritos and bowls but great P/E ratio and same-store sales. Both are two totally different markets and all, but am considering selling my CMG share and dumping them in NVDA. Thoughts? ",
        "created_utc": 1731440494.0,
        "subreddit_name": "stocks",
        "comments": 0
    },
    {
        "title": "NVDA is upcoming earnings report",
        "score": 17,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gpt9tg/nvda_is_upcoming_earnings_report/",
        "content": "It's all up or down depending on Blackwell's guidance in this cycle... The major tech companies, the Seven Sisters and other giants like that, and the relatively large data center capex is expected to grow 24% to $282 billion by 2025...\n\nWith just that capex it's hard to have a sudden avalanche, unless it's a technical Blackwell and other chip competition issue. Otherwise there is nothing wrong with the whole year 25 years, the world in addition to China and the United States, many countries ai capex also still have a lot of room to improve",
        "created_utc": 1731440093.0,
        "subreddit_name": "wallstreetbets",
        "comments": 15
    },
    {
        "title": "MindMed Report: HC Wainwright $55 Valuation, Up Nearly 150% YTD",
        "score": 26,
        "url": "https://www.reddit.com/r/stocks/comments/1gp8d4y/mindmed_report_hc_wainwright_55_valuation_up/",
        "content": "Mind Medicine (MNMD) [\"Buy\"](https://www.marketbeat.com/stocks/NASDAQ/MNMD/forecast/) Rating Reiterated at HC Wainwright, with all twelve analysts saying its buy time.\n\n[MindMed ](https://www.businesswire.com/news/home/20241107702200/en/MindMed-Reports-Third-Quarter-2024-Financial-Results-and-Business-Updates)has reported its financial results for Q3 '24 and shared key updates on its clinical development programs.\n\nMindMed is on track to begin the Phase 3 Voyage study for MM120 Orally Disintegrating Tablet (ODT) in Generalized Anxiety Disorder (GAD) in Q4 2024, with top-line data expected by mid-2026. The company is also preparing to initiate the \\*Panorama\\* (GAD) and \\*Emerge\\* (Major Depressive Disorder, MDD) Phase 3 studies in the first half of 2025.\n\nAs of September 30, 2024, MindMed reported a strong cash position of $295.3 million, which is expected to fund operations through 2027, covering costs up to 12 months beyond the first Phase 3 data readout for MM120 ODT in GAD.\n\nThe company continues to advance its MM120 (LSD) program for both GAD and MDD. It is also progressing with MM402 (R(-)-MDMA) for Autism Spectrum Disorder (ASD), with recent completion of a Phase 1 study.",
        "created_utc": 1731372642.0,
        "subreddit_name": "stocks",
        "comments": 1
    },
    {
        "title": "The top is in",
        "score": 5041,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gpn6qs/the_top_is_in/",
        "content": "I am a physician and I was admitting a patient to the hospital with anemia (low blood count) due to a bleed in his stomach. He would not look away from his phone while he was trading Bitcoin to answer my questions (while he was bleeding in the emergency room).\n\nThe top is in.",
        "created_utc": 1731425063.0,
        "subreddit_name": "wallstreetbets",
        "comments": 521
    },
    {
        "title": "iOS 18.2 fixes one of the most annoying aspects of the Photos app.",
        "score": 1514,
        "url": "https://9to5mac.com/2024/11/11/ios-18-2-photos-app/",
        "content": "",
        "created_utc": 1731370028.0,
        "subreddit_name": "apple",
        "comments": 222
    },
    {
        "title": "Kuo: Apple to release its own smart home camera in 2026, with AI features",
        "score": 1179,
        "url": "https://9to5mac.com/2024/11/12/kuo-apple-smart-home-camera/",
        "content": "",
        "created_utc": 1731408801.0,
        "subreddit_name": "apple",
        "comments": 222
    },
    {
        "title": "Apple teams up with airlines for new ‘Share Item Location’ AirTags feature in iOS 18.2",
        "score": 649,
        "url": "https://9to5mac.com/2024/11/11/ios-18-2-share-item-location-airtags-feature/",
        "content": "",
        "created_utc": 1731407174.0,
        "subreddit_name": "apple",
        "comments": 33
    },
    {
        "title": "Apple Releases $350 Gold Link Bracelet for Apple Watch",
        "score": 609,
        "url": "https://www.macrumors.com/2024/11/12/apple-watch-gold-link-bracelet/",
        "content": "",
        "created_utc": 1731454705.0,
        "subreddit_name": "apple",
        "comments": 154
    },
    {
        "title": "Apple Music Classical Updated With CarPlay and Siri Support",
        "score": 490,
        "url": "https://www.macrumors.com/2024/11/12/apple-music-classical-carplay-and-siri-support/",
        "content": "",
        "created_utc": 1731433000.0,
        "subreddit_name": "apple",
        "comments": 73
    },
    {
        "title": "Apple’s Next Device Is an AI Wall Tablet for Home Control, Siri and Video Calls",
        "score": 450,
        "url": "https://www.bloomberg.com/news/articles/2024-11-12/apple-home-hub-detailed-apple-intelligence-homeos-square-ipad-like-design",
        "content": "",
        "created_utc": 1731444455.0,
        "subreddit_name": "apple",
        "comments": 202
    },
    {
        "title": "Commission and national authorities call on Apple to stop geo-blocking practices on Apple Media Services",
        "score": 255,
        "url": "https://ec.europa.eu/commission/presscorner/detail/es/ip_24_5727",
        "content": "",
        "created_utc": 1731420767.0,
        "subreddit_name": "apple",
        "comments": 84
    },
    {
        "title": "M4 Pro MacBook Pro: HUGE Leap for Music Production | M4 Pro vs M3 Pro vs M2 Pro vs M1 Pro",
        "score": 150,
        "url": "https://youtu.be/hccy19Hm6M8?si=nKCQPitz_FsdT5LC",
        "content": "",
        "created_utc": 1731434526.0,
        "subreddit_name": "apple",
        "comments": 59
    },
    {
        "title": "iPhone SE 4 Camera Modules to Enter Mass Production Next Month",
        "score": 142,
        "url": "https://www.macrumors.com/2024/11/12/iphone-se-4-camera-enter-mass-production-december/",
        "content": "",
        "created_utc": 1731419822.0,
        "subreddit_name": "apple",
        "comments": 21
    },
    {
        "title": "Daily Advice Thread - November 12, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/apple/comments/1gpi6i9/daily_advice_thread_november_12_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1731409227.0,
        "subreddit_name": "apple",
        "comments": 62
    }
]