[
    {
        "title": "Disney will start laying off employees this week, CEO Bob Iger says in memo",
        "score": 2560,
        "url": "https://www.reddit.com/r/stocks/comments/123sjrn/disney_will_start_laying_off_employees_this_week/",
        "content": "https://www.cnbc.com/2023/03/27/disney-layoffs-bob-iger-memo.html\n\nDisney will begin layoffs this week, the first of three rounds before the beginning of the summer that result in about 7,000 job cuts, according to a memo sent by Chief Executive Bob Iger.\n\nThe cuts are part of a broader effort to reduce corporate spending and boost free cash flow. Disney said last month it plans to cut $5.5 billion in costs, including $3 billion in content spend.\n\n“This week, we begin notifying employees whose positions are impacted by the company’s workforce reductions,” Iger wrote in the memo, which was obtained by CNBC. “Leaders will be communicating the news directly to the first group of impacted employees over the next four days. A second, larger round of notifications will happen in April with several thousand more staff reductions, and we expect to commence the final round of notifications before the beginning of the summer to reach our 7,000-job target.”\n\nThe layoffs were initially announced in February. The job cuts will be cross-company, hitting Disney’s media and distribution division, parks and resorts, and ESPN.\n\nDisney is following the lead of Warner Bros. Discovery and other legacy media companies that are cutting jobs and spending. Disney has said its streaming business, led by Disney+, Hulu and ESPN+, will stop losing money in 2024. Disney shares are up about 8% this year after falling 44% last year.\n\n“We have made the difficult decision to reduce our overall workforce by approximately 7,000 jobs as part of a strategic realignment of the company, including important cost-saving measures necessary for creating a more effective, coordinated and streamlined approach to our business,” Iger wrote. “For our employees who aren’t impacted, I want to acknowledge that there will no doubt be challenges ahead as we continue building the structures and functions that will enable us to be successful moving forward.”\n\nSince returning as CEO, Iger has reorganized the company and acknowledged that he’d consider selling Hulu. Disney will host its annual shareholder meeting April 3.\n\nRead Iger’s full memo:\n\nDear Fellow Employees,\n\nAs I shared with you in February, we have made the difficult decision to reduce our overall workforce by approximately 7,000 jobs as part of a strategic realignment of the company, including important cost-saving measures necessary for creating a more effective, coordinated and streamlined approach to our business. Over the past few months, senior leaders have been working closely with HR to assess their operational needs, and I want to give you an update on those efforts.\n\nThis week, we begin notifying employees whose positions are impacted by the company’s workforce reductions. Leaders will be communicating the news directly to the first group of impacted employees over the next four days. A second, larger round of notifications will happen in April with several thousand more staff reductions, and we expect to commence the final round of notifications before the beginning of the summer to reach our 7,000-job target. \n\nThe difficult reality of many colleagues and friends leaving Disney is not something we take lightly. This company is home to the most talented and dedicated employees in the world, and so many of you bring a lifelong passion for Disney to your work here. That’s part of what makes working at Disney so special. It also makes it all the more difficult to say goodbye to wonderful people we care about. I want to offer my sincere thanks and appreciation to every departing employee for your numerous contributions and your devotion to this beloved company. \n\nFor our employees who aren’t impacted, I want to acknowledge that there will no doubt be challenges ahead as we continue building the structures and functions that will enable us to be successful moving forward. I ask for your continued understanding and collaboration during this time. \n\nIn tough moments, we must always do what is required to ensure Disney can continue delivering exceptional entertainment to audiences and guests around the world – now, and long into the future. Please know that our HR partners and leaders are committed to creating a supportive and smooth process every step of the way.\n\nI want to thank each of you again for all your many achievements here at The Walt Disney Company. \n\nSincerely,\n\nBob",
        "created_utc": 1679935121.0,
        "subreddit_name": "stocks",
        "comments": 437
    }
]