[
    {
        "title": "Zoom to lay off 1,300 employees, or about 15% of its workforce",
        "score": 2823,
        "url": "https://www.reddit.com/r/stocks/comments/10w810w/zoom_to_lay_off_1300_employees_or_about_15_of_its/",
        "content": "https://www.cnbc.com/2023/02/07/zoom-to-lay-off-1300-employees-or-about-15percent-of-its-workforce.html\n\nZoom blog post: https://blog.zoom.us/a-message-from-eric-yuan-ceo-of-zoom/\n\nZoom on Tuesday announced plans to cut about 1,300 workers, or 15% of its workforce, according to a blog post shared to the company’s website.\n\nShares of Zoom were up about 6% Tuesday.\n\nCEO Eric Yuan wrote in the blog post that as the world continues to adjust to life after the pandemic, the company needs to adapt to the “uncertainty of the global economy” as well as “its effect on our customers.”\n\nZoom experienced a huge boom during the pandemic when people were forced to work from home and turned to video chat software to stay in touch with colleagues, friends and family.\n\n“We worked tirelessly and made Zoom better for our customers and users. But we also made mistakes,” Yuan said. “We didn’t take as much time as we should have to thoroughly analyze our teams or assess if we were growing sustainably, toward the highest priorities.” \n\nYuan said the cuts will impact every organization across Zoom, and employees will be offered up to 16 weeks of salary and healthcare coverage. Yuan also said he plans to reduce his own salary for the coming fiscal year by 98%, and he is also foregoing is 2023 corporate bonuses.\n\n“As the CEO and founder of Zoom, I am accountable for these mistakes and the actions we take today– and I want to show accountability not just in words but in my own actions,” he wrote in the post.\n\nThe company’s layoff announcement marks the latest round of job cuts in the tech industry, as Dell on Monday announced plans to cut 6,650 jobs. In January, Google revealed plans to lay off more than 12,000 workers, Microsoft disclosed plans to cut 10,000 employees and Salesforce announced plans to lay off 7,000 workers.",
        "created_utc": 1675791893.0,
        "subreddit_name": "stocks",
        "comments": 370
    }
]