[
    {
        "title": "Netflix reportedly testing AirPods spatial audio support - 9to5Mac",
        "score": 4558,
        "url": "https://9to5mac.com/2021/01/14/netflix-spatial-audio-airpods/",
        "content": "",
        "created_utc": 1610657521.0,
        "subreddit_name": "apple",
        "comments": 225
    },
    {
        "title": "After 8 months of trial and error, hundreds of hours of Youtube, losing money, almost giving up, I can finally say I made my first $100 trading stocks",
        "score": 6966,
        "url": "https://www.reddit.com/r/stocks/comments/kxa9r4/after_8_months_of_trial_and_error_hundreds_of/",
        "content": "I started paper trading and thought that what I was doing was working (looking back at my trades makes me cringe now), so I decided to put $1000 in my account and try it for real.  I was on a steady downtrend for the first 2 months (while the general market is on a steady uptrend) and found my account balance to be below $850. I had to take a break at this point and had serious thoughts about giving up. I thought I wasn't cut out to be a trader; I must be a part of the 95% who fail.  I decided to give it one more shot. I took a deep analytical dive into my past trades. I reevaluated my strategy, and found what was working and what wasn't. I slowly started seeing results. I clawed my way back to the original $1000 investment and today have officially hit the $100 profit mark.\n\nIf anyone is still reading this, I know what you're thinking: \"Wow, 100 bucks, big deal,\" and you're right. It's not much. However, If an average guy like myself can battle back and grow his account 10% (+30% in two months), I strongly believe that anyone can; with enough dedication. I'd be happy to talk more about my journey to anyone who's interested or just starting out.\n\nEdit: Thank you all for your comments! I’ve been reading almost every one! I knew a lot of people would say that based on my story, trading probably isn't for me, you have a very valid reason for saying so, and you could still be right. I've heard that everyone's trading journey is different, and I'm hoping my journey can continue for much longer. Instead of thinking about how I've only made 10% in 8 months in one of the strongest bull runs, I like to think that I've gone from $850 to $1100 (30% gain) while the SPY has gone up 8% in the past two months.  I hope these type of gains can continue, but time will tell. Even if I can't continue these gains, I've really enjoyed the learning process and think that the knowledge I've gained is beneficial and worth the time to me.\n\nAlso, I am only trading with money I can afford to lose.  I have the majority of my money in mutual funds that I don't plan on touching for a long time",
        "created_utc": 1610645376.0,
        "subreddit_name": "stocks",
        "comments": 1189
    }
]