[
    {
        "title": "Short sellers are GOOD for the Market",
        "score": 1142,
        "url": "https://www.reddit.com/r/investing/comments/izw2gt/short_sellers_are_good_for_the_market/",
        "content": "Shortsellers are going after our favorite stocks to profit therefore we should despise them right? But are they all really bad? \n\nDon’t just read articles and blog posts that confirm your view about a company. ***Right  now a lot of $TSLA & $NKLA shareholders are mad about shortsellers  going after their stock but in fact you should embrace it.***\n\nShortsellers do research that you could ***never do on your own***.  In fact I would love it if someone would give me a 50 page report on  everything thats wrong with any of my holdings. I know whats right about  all the companies I own. What I want to know are the flaws, the  accounting issues ( if there are any ) etc.\n\nWith Luckin Coffee Muddy Waters Research bought thousands of cups of  coffee from different branches and kept an eye on the customers. Thats  invaluable research and in the end they were right that the numbers  don’t match up. \n\nThey probably saved a lot of Luckin Coffee Shareholders from bigger  losses ( those who read the report). And of course short sellers should  get compensated for this work. There have to be incentives to do this  kind of work. Else nobody would do it. Don’t count on auditors which are  incentivized to look the other way and keep a paying client.When you’re  an analyst you can just say you think revenue will go up but you don’t  need to back it up. \n\nThats it. But when you accuse someone of fraud then you better have a  lot of evidence to support this view. Short sellers face potential  losses & lawsuit. If they are wrong they lose a lot. Thats why they  work hard and only release reports when they have enough to back up  their claim. Also what do Companies like Nikola have to worry about ? If  everything is fine then the Hindenburg report will turn out false and  they continue to enjoy a rising share price. **But what if the report is right?**\n\nIf you are a Nikola shareholder then you should pay attention to it.  Read it and work this into your thesis for owning the stock. Is it worth  the risk? Maybe limit your exposure.But don’t ridicule the people that  release those reports. There is a lot of hard work & money behind  it.\n\n***Short sellers don’t do this for the fun of it.***  And if they are right they should be compensated for their work. I  would actually say that many short sellers work much harder on research  than a long analyst. After all they have to be right to make money. If  they’re wrong they won’t be able to enjoy market returns. They would  literally get wiped out. \n\n&#x200B;\n\nsource: [https://welovevalue.com/short-sellers-are-good-for-the-market/](https://welovevalue.com/short-sellers-are-good-for-the-market/)",
        "created_utc": 1601082015.0,
        "subreddit_name": "investing",
        "comments": 231
    }
]