[
    {
        "title": "Tim Cook joins the billionaire club as Apple’s value climbs toward $2 trillion",
        "score": 6974,
        "url": "https://9to5mac.com/2020/08/10/tim-cook-net-worth/",
        "content": "",
        "created_utc": 1597084181.0,
        "subreddit_name": "apple",
        "comments": 827
    },
    {
        "title": "Apple goes to war with the gaming industry",
        "score": 5082,
        "url": "https://techcrunch.com/2020/08/09/apple-goes-to-war-with-the-gaming-industry/",
        "content": "",
        "created_utc": 1597050799.0,
        "subreddit_name": "apple",
        "comments": 1182
    },
    {
        "title": "Margin Isn't Dangerous & Why I'd Still Use It If I Had Less Than $25,000",
        "score": 248,
        "url": "https://www.reddit.com/r/Daytrading/comments/i7a9e8/margin_isnt_dangerous_why_id_still_use_it_if_i/",
        "content": "# Cash vs. Margin\n\n&#x200B;\n\n**TL;DR-** Use Margin if you're trading securities and either above or below 25k. If you know how to size positions, it won't matter if you move $4,000 into a trade or $4,000,000. As long as you sized the position correctly. If you're limited to 3 trades, then take 3 PERFECT trades:  [https://imgur.com/a/SpPOERQ](https://imgur.com/a/SpPOERQ)\n\n&#x200B;\n\nI see lots of people discussing contrasting ideas although they attempt to justify using both. Here are some things I see said and written frequently from people that doesn't add up for me:\n\n&#x200B;\n\n* ***\"Use a cash account to avoid PDT\"*** \\- (Totally fine, in some cases such as certain options traders. Not if you're trading securities.)\n* ***\"Risk 1% of your account\"*** \\- (So if your account is at $25,500, I risk \\~$255 and if I lose 2R I'm below PDT. Doesn't sound too great to me if I were to lose the first 2 straight trades.)\n* ***\"Margin is a double-edged sword\"*** \\- (It's only dangerous if you don't set hard stops or size your positions correctly.)\n* \"**Never take on a trade that is worth more than your account\"** \\- (I can agree if you were swing trading but in terms of IntraDay trading, this is hindering your ability to grow your account. If you're risking $100 on a trade that costs less than your account value.. then $25 on a trade because of your account value.. then you're adding unneeded variables. Remember: \"Consistency.\")\n\n&#x200B;\n\n&#x200B;\n\n[The Predictive Model I built lays out all valid trades within the report range as well as \\\\\"Perfect Trades\\\\\" that I consider \\\\\"Textbook\\\\\".  The report range is between a 30 day range. Between 4-17-20 to 5-17-20. Total \\\\\"Perfect Trade\\\\\" count is 9 trades. Even if I were limited to 3 trades per week. I'd be able to trade them with less than 25k on margin. The stats reflect $100 risk I've set on a different tab. \\(The \\\\\"W\\\\\" is just a graphic I made for \\\\\"Winning\\\\\"\\)](https://preview.redd.it/bvc575ndr7g51.png?width=2955&format=png&auto=webp&s=29f9ee90fe82d8844deedba838cd724469501ae6)\n\n&#x200B;\n\nIt doesn’t matter if you move $4,000, $40,000, or $4,000,000 into a position. As long as you’re risking the same. Your **Trading Account's**  performance is based off of risk. Such as:\n\n•Sharpe ratio\n\n•RRR\n\n•Number of R’s in 1 week/month/quarter. (Example: I made 7R this week. If my R is $100. I made $700)\n\n# If I were to go back to when I was below $25,000 some years ago. I'd still use a margin account while being limited to 3 trades per week. Here's why:\n\n`Formulas you have to know:`\n\n`Position size formula = Risk ÷ Stop Size`\n\n`Stop Size Formula = Entry - StopLoss`\n\n# Example 1a:\n\n**Stock ABC,**\n\n*Entry* = $10.00\n\n*StopLoss* = $9.90\n\n*StopSize* = 10¢\n\n*Risk* = $100\n\n`In Live Trading: $100 ÷ $0.10 = 1000 Shares`\n\n1,000 shares at $10.00 = **$10,000** position\n\n# Example 1b:\n\n**Stock XYZ,**\n\n*Entry* = $385\n\n*StopLoss* = $383.00\n\n*StopSize* = $2.00\n\n*Risk* = $100\n\n`In Live Trading: $100 ÷ $2.00 = 50 Shares`\n\n50 shares at $385 = **$19,250** position.\n\n&#x200B;\n\n\\*$10,000 **CASH** account: CANNOT trade Stock XYZ and must wait 3 days for his entire account to settle after trading **Stock ABC.** If it was a margin account, they'd still be able to take 2 more trades this week.\n\n\\*$10,000 **MARGIN** account: CAN trade Stock XYZ and can trade both scenarios while still able to trade 1 more time in a 5 day rolling period.\n\n&#x200B;\n\n# Then the next point made is, \"Just won't trade anything above $20\".\n\n&#x200B;\n\nOk. great rebuttal, but why? \n\n&#x200B;\n\nLet's remember this: **StopSizes aren't always directly correlated to the price of a stock.** YES you're more likely to have a wider StopSize on a higher priced stock and a tighter StopSize on a lower priced stock. But remember this: **1¢** of slippage on **1,000 shares** is **10%** of his risk (**$10**)... It will be even more slippage if his stop loss market order is hit. Even a Sell-StopLimit order will have slippage within the amount you allow for when you enter a position.\n\n**Stock XYZ** would have to be slipped 20¢ just to equate the amount of slippage on **Stock ABC**.Highly liquid and available stocks such as AAPL, AMD, NVDA etc don't have 20¢ spreads. Not even 10¢. Rarely 5¢. Most of the time. Just a couple cents. Of course there could be more right out of the open but the spread in my years of experience is tightened within 2 minutes of the open.\n\nYes, these small amounts in pennies do hold lots of merit if you're looking at having any longevity in this business, it WILL add up over the years.\n\n&#x200B;\n\n# Both trades have the same risk [in perfect world theory].\n\nIf both stop market orders were hit *(StopLoss)*. Both traders would exit with a $100 loss on each. Although 1 trade required **$10,000** in capital and the other trade required **$19,250** in capital.\n\nUse margin. If I had to go back to when I had less than $25,000 in my account, I'd still do it the same way I did it with margin. I highly suggest using margin even if you’re limited to 3 trades per week. I get asked all the time when I began trading. If you watched my last video, I showed my first ever deposit with Scottrade (Old brokerage that was bought out by TDA a few years ago) in 2015 although I don't consider that's when I started trading because I didn't treat it the way I do today.\n\nI really consider myself starting as a trader in 2017 when I:\n\n•Wrote a business plan\n\n•Understood statistics\n\n•How to research.\n\nAll this being said, slowly over time I noticed that I am taking less and less trades  and increasing my risk size. Why?\n\n**EV: Expected Value.**\n\n&#x200B;\n\n&#x200B;\n\n`- Margin has zero negative effect if you're sizing your positions the same every time. Margin allows you to take on more expensive positions that are showing your edge.`\n\n&#x200B;\n\n**Bonus:** Being limited to 3 trades a week isn't fun, I remember that feeling from years ago. Just remember to take 3 perfect trades a week. Sometimes \"Perfect Trades\" don't work out in your favor while some subpar situations hit target. Some weeks you might take your 3 \"Perfect Trades\" by Tuesday. Some weeks you might take only 1 \"perfect trade\". If you follow my watchlists on Twitter (Same handle as my Reddit), I keep my Day Trading Buying Power transparent. Not always is it growing perfectly linear. And not always am I posting every single day because sometimes, my edge isn't there. Just because the market is open doesn't mean you HAVE to trade.\n\nMy watchlists aren't littered with 15+ tickers. Rarely do they have more than 7. That may work for other traders, but for me, I demand quality. It's either there or it isn't. No reason to force a trade. I'd rather focus heavily on a few tickers rather than spread myself thin across multiple.\n\nTrading isn't supposed to be exhilarating or an adrenaline rush. It can be boring. I said that in the post I wrote back in April.\n\nAlso if you make money, even if its just $20 in a month. Take that money out and buy something. Shrine it. Cherish it. You ripped that money out of WallStreet. Be proud of it. It takes a lot of courage to do this business. Realize that the P/L is real money. Sometimes even just buying a tank of gas or a book will help you realize that. Spend it from time to time. Get something out of your trading account. You may or not be trading for long, get something that is tangible to always remember the experience in case you don't last. Make it your trophy.\n\n&#x200B;\n\nThat's all I've got for right now. Maybe I'll make another post or 2 before the year ends. I hit my 1 year full-time mark in September.\n\nBest wishes!\n\n\\-CJT2013",
        "created_utc": 1597083461.0,
        "subreddit_name": "Daytrading",
        "comments": 79
    }
]