[
    {
        "title": "Trump demanding that Apple must unlock shooter's iPhones because of foreign apps",
        "score": 2459,
        "url": "https://appleinsider.com/articles/24/09/26/trump-demanding-that-apple-must-unlock-shooters-iphones-because-of-foreign-apps",
        "content": "",
        "created_utc": 1727350249.0,
        "subreddit_name": "apple",
        "comments": 345
    },
    {
        "title": "Avoid Vehicle Motion Sickness With This New iOS 18 Feature",
        "score": 1745,
        "url": "https://www.macrumors.com/how-to/ios-motion-sickness-prevention/",
        "content": "",
        "created_utc": 1727349621.0,
        "subreddit_name": "apple",
        "comments": 220
    },
    {
        "title": "Apple preparing iOS 18.0.1 update for iPhone following several bugs",
        "score": 1539,
        "url": "https://www.macrumors.com/2024/09/26/apple-preparing-ios-18-0-1/",
        "content": "",
        "created_utc": 1727368605.0,
        "subreddit_name": "apple",
        "comments": 312
    },
    {
        "title": "Apple rolling out another new firmware update for AirPods Pro 2 ",
        "score": 1402,
        "url": "https://9to5mac.com/2024/09/26/new-software-update-for-airpods-pro-2-rolling-out/",
        "content": "",
        "created_utc": 1727384197.0,
        "subreddit_name": "apple",
        "comments": 158
    },
    {
        "title": "Apple rejects new AI pact in EU, despite support from OpenAI, Google, more ",
        "score": 1162,
        "url": "https://9to5mac.com/2024/09/26/apple-rejects-new-ai-pact-in-eu-despite-support-from-openai-google-more/",
        "content": "",
        "created_utc": 1727362072.0,
        "subreddit_name": "apple",
        "comments": 226
    },
    {
        "title": "I'm a full time trader and this is everything you need to know in premarket as China pumps the stimulus again. All summarised in a 5 minute read for you to peruse over your coffee.",
        "score": 132,
        "url": "https://www.reddit.com/r/Daytrading/comments/1fpvhmh/im_a_full_time_trader_and_this_is_everything_you/",
        "content": "**MACRO NEWS:**\n\n* 5 year auction summary yesterday:\n* Overall, a neutral-to-slightly positive auction for bonds. The auction came in \"on the screws,\" indicating stable demand, with indirect bidders (often seen as a measure of foreign interest) showing strong participation, which is a good sign for the longer end of the curve.\n* Spanish retail sales come out better than expected this morning. \n* SNB cut rates by 25%This in line with expectations\n* \"THREE INTEREST CUTS SO FAR AND NOT RULING OUT A FURTHER CUT MEANS WE ARE IN GOOD SHAPE\". - SNB\n* GDP growth rate comes out 3%, in line with expectations. This is positive for markets. Tells us that recession is still quite far away, which leads us to expect strong forward earnings from the rate cuts. \n* GDP price index also came in line with expectations which is good. \n* THESE WERE JUST FINAL REVISION NUMBERS THOUGH. \n* Durable goods orders less negative than expected. Positive indeed, good sign for manufacturing even. \n* Jobless claims slightly lwoer than expected. Still following seasonal trend. \n\nALL GLOBAL MARKETS ARE HIGHER ON CHINA STIMULUS NEWS. \n\n* SPX broken above 5750 which was a key gamma level, after MU earnings, META, and China stimulus news. \n* Next level up is 5800\n* Nasdaq higher on Meta and MU which is bringing all semis higher. \n* Dow Jones is higher too \n* HKG with a MASSIVE pop, above 20,500. This comes after additional China stimulus news. \n* China50 up 8% in ONE DAY. \n* Ger40 above 19,100. \n* FTSE higher too. \n* Oil is lower despite China stimulus news, and this is because Saudi have mentioned they are increasing supply into 2025. \n\nCHINA MORE STIMULUS IS THE MAIN NEWS IN PREMARKET. \n\n* China is reportedly considering injecting up to 1 trillion yuan into its largest state banks to support the struggling economy, according to Bloomberg. This would be the first capital injection since the 2008 financial crisis. Funding would mainly come from special sovereign bonds, with final details yet to be confirmed.\n* The move aims to boost lending capabilities as banks face pressure from regulators to offer cheaper loans to struggling sectors like real estate and local government financing.\n* While China's top six banks have capital levels above requirements, they are battling declining profits, record low margins (down to 1.54% as of June), and rising bad debts.\n* This injection could ensure banks maintain their lending capacity despite these challenges. The last time Beijing stepped in like this was in the late 1990s and early 2000s when bad loans surged to about 40%\n* ADDITIONALLY XI ANNOUNCED: — Ensuring necessary fiscal spending — Implementing significant rate cuts — Strengthening employment support for college graduates — Boosting support for the disabled and unemployed — Measures to Stop the Decline in the Real Estate Market and manage housing oversupply\n* I am quite impresed with the fiscal spending measures.\n* DIRECT STIMULUS IN POCKET OF PEOPLE. Tjhis is a massive tailwind. It means China will literally be sending poeple money in their account and saying spend it.\n* CHINA’s CSRC announcing plans to motivate companies to buy back shares, aiming to enhance foundational systems for long term investments. \n* TALK IS THAT CHINA COULD ISSUE $284B in Soverign Debt for fiscal stimulus. \n\n———— MAG 7 ------\n\n* TSLA - Wolfe Research - rate Peerperform:\n* Says that value of Teslas initiatives is still years away, and they are likely to see high costs in near term. Investors need confidence that Tesla is making MEASURABLE progress. \n* META up following their product event yesterday. Was very well received. Bullish indeed. \n* AAPL - iPhone 16 sales disappoint, Despite initial sell-outs, analysts suggest demand is weaker compared to the iPhone 15, with global pre-orders reportedly down about 13%.\n\nOTHER COMPANIES NEWS;\n\n* Semis all up on MU earnings. They were BLOWOUT earnings. The commentary was insane. \n* Says entering FY25 with the strongest competitive positioning in Micron's history. Says expects a broadening of demand drivers, complementing demand in the data center. Says looking forward to delivering a substantial revenue record with significantly improved profitability in FY25. Says ramping production of the technology nodes in both DRAM and NAND. Says expects FY25 DRAM front-end cost reductions excluding HBM to be in the mid- to high-single-digit percentage range.\n* All semis are higher on this. MU got a lot of bullish analyst upgrades as a result. \n* OIL STOCKS ARE LOWER as Saudi has increased supply into 2025. This comes despite the fact that China has announced a lot of new stimulus measures. \n* LUV - Southwest Airlines is boosting their Q3 outlook. Seeing a 2.5B share buyback plan. \n* raised its Q3 revenue per available seat miles (RASM) forecast to up 2-3% y/y, from the previous flat to -2%. They’re also affirming full-year 2024 guidance, with ASMs up 4% y/y and CASM-X up 7-8%.\n* Announced ex CEO of Spirit to Southwest board. \n* PLTR - Sees price target raised by Dan Ives to 45 from 38, stating enterprise driven AIP strategy is a clear game changer.\n* ZETA: CEO was on CNBC yesterday. Said: \"Independent study shows that for every dollar an agency spends w Zeta there is a $5-$7 dollar ROI\" \n* DIS - lays off 300 workers in cost cutting round. These will be US based corporate jobs as part of ongoing cost reduction efforts. \n* SBUX - upgraded to outperform, PT of 115 from 92. Upgraded because they say the market has responded positively to Brian Niccols appointment. \n* Said: \"Even after modeling a conservative FY25 EPS decline of around 5%, following a compressed FY24 EPS growth of 0.9%, we believe the current valuation doesn’t fully capture the earnings potential\n* HSY - cut to underperform, PT lowered to 163 from 184. Downgraded due to structural risks in chocolate category. Elevated prices and stretched consumer. \n* PFE - withdraws their Oxbryta from Global markets as they cite safety risks. This is a sickle cell disease treatment. They also halted ongoing clinical trials. Said the risks outweigh the benefit now\n* ADP - is reportedly in advanced talks to acquire Workforce Software for around $1.2B. \n* MCD - announced a 6% increase in quarterly dividend. Said they are seeing confidence in accelerating the arches growth plan. \n* Hooters restaurant chain seeking debt advice as business falters. \n* LSPD was up yesterday as they explore a sale. \n\nOTHER NEWS:\n\n* Fed's Kugler: \"It makes sense to shift atention to employment mandate...The job market has cooled, don't want it to weaken further.\"\n* According to Zillow data, the median U.S. \n*  household spent 29.9% of their income on rent in August 2024. While that's down from the peak of 31.2% in June 2022, it's still above the pre-pandemic level of 28.5% in February 2020.\n* Putin yesterday threatened potential for nuclear war. Not taken by market to have much weight. ",
        "created_utc": 1727355300.0,
        "subreddit_name": "DayTrading",
        "comments": 9
    }
]