[
    {
        "title": "JPMorgan agrees to $125 million fine for letting employees use WhatsApp to evade regulators reach",
        "score": 4431,
        "url": "https://www.reddit.com/r/stocks/comments/rihm2k/jpmorgan_agrees_to_125_million_fine_for_letting/",
        "content": "https://www.cnbc.com/2021/12/17/jpmorgan-agrees-to-125-million-fine-for-letting-employees-use-whatsapp-to-evade-regulators.html\n\nJPMorgan Chase is paying a $125 million fine to settle Securities and Exchange Commission charges that its Wall Street division allowed employees to use WhatsApp and other platforms to circumvent federal record-keeping laws. The SEC said Friday in a statement that JPMorgan Securities admitted to “widespread” record-keeping failures in recent years. The bank’s employees used personal smartphones and email accounts, as well as messaging services including Meta-owned WhatsApp, to conduct securities business matters from at least January 2018 through November 2020, the regulator said. SEC officials who spoke to reporters Thursday evening said JPMorgan’s failure to preserve those off-line conversations violated federal securities law and left the regulator blind to exchanges between the bank and its clients.\n\nFederal law requires financial firms keep and retain meticulous records of electronic messages between brokers and clients so that regulators can make sure those firms aren’t skirting anti-fraud or antitrust laws. Regulators in New York and London have ratcheted up enforcement of record-keeping rules in recent years as traders migrated to encrypted messaging platforms including WhatsApp, Signal or Telegram. While phone conversations and messages on official company devices and software platforms are preserved, it’s much harder for bank compliance departments to surveil communications on third-party apps. The method picked up in popularity after two of the industry’s biggest trading scandals of the past decade (involving manipulation of Libor and foreign exchange markets) hinged on incriminating messages preserved in chatrooms, resulting in multi-billion dollar fines for banks.\n\nTraders at JPMorgan, Morgan Stanley, Deutsche Bank and other firms have been dismissed or placed on leave for infractions tied to the practice. But the SEC order reveals how pervasive it was. At JPMorgan, the practice of going offline to communicate was firm-wide, and even the managers and senior personnel responsible for compliance used their personal devices to communicate sensitive business matters, the SEC said. The investigation at JPMorgan is ongoing and the SEC has launched similar probes at firms across the financial universe. JPMorgan ordered its traders, bankers and financial advisors to preserve work-related messages on personal devices earlier this year, Bloomberg reported in June.\n\nOfficials declined to offer details on the current status of the JPMorgan examination or those at other banks. “As technology changes, it’s even more important that registrants ensure that their communications are appropriately recorded and are not conducted outside of official channels in order to avoid market oversight,” SEC Chair Gary Gensler said in a press release. In stressing the importance of diligent recordkeeping, Gensler recalled the foreign exchange scandal of 2013, when traders at several of the globe’s largest banks used a private chat room to conspire to fix currency rates to maximize profits. Five of the globe’s largest banks, including JPMorgan, ultimately agreed to pay more than $5 billion in combined penalties and plead guilty to resolve the investigation. “Books-and-records obligations help the SEC conduct its important examinations and enforcement work,” Gensler added. “They build trust in our system.” While SEC officials said the $125 million penalty is its largest recordkeeping fine to date, the bigger threat to JPMorgan may be reputational. By going after JPMorgan, the world’s biggest Wall Street firm by total revenue, the SEC has put the industry on notice.",
        "created_utc": 1639748249.0,
        "subreddit_name": "stocks",
        "comments": 370
    },
    {
        "title": "Big Tech Sell-off - will AAPL bounce back off 169.69?",
        "score": 8,
        "url": "https://www.reddit.com/r/AAPL/comments/riipg1/big_tech_selloff_will_aapl_bounce_back_off_16969/",
        "content": "I am thinking Apple itself is buying back today, maybe heavily.  So watch to see the price it bounces off, which is so far 169.69.  Could be Apple's limit buy order point.   And despite these last few days sell-off, the Santa Claus rally may still be a thing. Stay tuned.",
        "created_utc": 1639751616.0,
        "subreddit_name": "AAPL",
        "comments": 32
    }
]