[
    {
        "title": "PR month +$32,358. $136k on the year. Crazy how fast life can change I made just $1,325 in January of this year. For any struggling traders out there keep studying hard and showing up everyday because once you find your edge trading can go from a side hobby to changing your life completely.",
        "score": 1041,
        "url": "https://www.reddit.com/r/Daytrading/comments/xshxk9/pr_month_32358_136k_on_the_year_crazy_how_fast/",
        "content": "Since my last post in August I have received tons of questions in my private messages and on twitter, so I figured I would share all the details of my trading in one place. Hopefully by sharing my process and strategy I can speed up the learning curve of other traders and maybe inspire some new people by showing what is possible if you work hard at trading.\n\n**Stats**\n\n* Started 01/01/2022 with $30k account\n* 161 green days\n* 34 red days\n* 59.3% win rate\n* 2.27 profit factor\n\n[Monthly performance](https://preview.redd.it/p0kv9o0ze3r91.png?width=622&format=png&auto=webp&s=c2689d16d2411045ac3901342036f41bb0d8f64a)\n\n&#x200B;\n\n[Months in calendar form](https://preview.redd.it/us31a8hlf3r91.png?width=981&format=png&auto=webp&s=e22ee02f688685e9bcffe283d8b05748d0063669)\n\n&#x200B;\n\n[past 90 days](https://preview.redd.it/5j4z69x5f3r91.png?width=1069&format=png&auto=webp&s=7c4bcaf28fa7fe478cf37f4d44ed88a620e80e7d)\n\n&#x200B;\n\n[2022 stats](https://preview.redd.it/unuw3kpaf3r91.png?width=953&format=png&auto=webp&s=3ea29c60e3f421a1e264f4446e3e6f7409cf0393)\n\n&#x200B;\n\n**Platform + Market**\n\nI am a LONG only day trader of US markets, and I trade SHARES through TD Ameritrade's ThinkorSwim partnered with DasTrader. I use ThinkorSwim for charts and DasTrader for tape/lvl2 as well as buy/sell through Das.\n\n**Scanner**\n\nI used ThinkorSwim scanner to get started and upgraded to TradeIdeas when I could afford it. I have found there to be not much benefit of TradeIdeas over ThinkorSwim scanner, for me personally.\n\nThinkorSwim scanner is free to use and TradeIdeas is about 1.5k/yr so building your own on ThinkorSwim is best for beginners. (what I did)\n\n**Stock Selection**\n\nI trade ONLY low float small cap gappers that are GREEN on the day.\n\n* Usually less than 15m float\n* Less than 500m market cap,\n* Up 10% + on day.\n* 250k + volume on day.\n\nEvery stock I trade is close to or within those parameters because I am trying to find the most volatile, easy to rig, rangy names. Sometimes I will adjust the parameters to expand/narrow the scan.\n\n**Trading** **Style**\n\nI do not trade pre market and will wait the first 10-15minutes every day for the clear LIQUIDITY leaders to establish themselves. For example, today I focused on INM, ATXI, AIMD, SOBR, ATXD.\n\nOnce the names I will be focusing on that day are becoming clear, I will check the daily chart, hourly, and 5min to mark any key levels that I should watch for tape/lvl2 interaction with.\n\nI would consider myself to be a micro-scalper of the tape and level2 based on key levels.\n\n* Discretionary systematic\n* Reading price action\n* Higher lows, vwap reclaims, breakouts, offer traps, other discretionary dip buys\n* Vwap and 100 ema only\n\nI do not ever look at SPY, VIX, BTC or any of the large indexes, it is irrelevant to my trading.\n\nAn example trade would be a stock rips 30% out of the open, then falls back to a key level I have marked (sometimes vwap). If the stock bounces at my key level I will wait for a higher low dip and if tape + volume confirms I will buy with them and join the new trend.\n\n**Level2, Tape.**\n\nMy edge comes 75% from reading tape + lvl2 and 25% from chart setup. The chart setup tells me when to watch the tape + lvl2 closely, and I can identify my entry based on the tape at a certain level.\n\nI learned to read tape from watching MadazMoney on YouTube but once you know the basic premise of what to watch for it is all about screen time and experience to develop your own intuition and feel for the tape.\n\n**Fundamentals**\n\nI do not check news, read filings, track institutional ownership, look at earnings, or consume a single piece of information about the company I am trading. I trade the raw price action and chart exclusively.\n\n**Risk**\n\nMy risk management is extremely tight and a bit unique. My entries are based off of buying when I see other buyers on the tape that have \"protected/soaked\" a level. If I take an entry on a dip candle then my risk will be the low of that same candle or a very small risk below that because I am entering after buyers have made their presence clear on the tape. If buyers are not willing to protect a level they were aggressive at just moments ago, why should I stick around?\n\nThis means my losses are extremely small in size because my risk is often 5-10 cents below my entry. That concept is reflected in my profit factor which is on average around 2.5 and for this month was 4.47.\n\nThat is the best way I can describe my risk management because my trading is so heavily discretion based.\n\n**Study System**\n\nTo learn my foundation for small caps I spent lots of time reading and reviewing TradetheMatrix's blog posts on small cap stocks and to learn how to read tape and lvl2 studied MadazMoney's YouTube videos.\n\nThose 2 resources built 90% of my foundation and the rest was screen time and experience. My study system is very basic I made an empty discord server where I screenshot and annotate my prints and the charts of the top runners everyday.\n\nI did not miss a day of studying for 6 months straight. (1-2 hours a night)\n\nThe key is maximizing the number of hours spent studying, practicing, and ultimately trading. How long it takes to gather enough hours practicing to become profitable is up to the individual. Only through 100's of repetitions and thousands of hours can you train your brain to see the trades in real time.\n\n**End**\n\nI hope this post helped those starting out or in the process of becoming a profitable trader. Feel free to ask any questions and I will do my best to answer timely. I also post educational threads, daily PNL, prints, and respond to all dm's on my twitter [https://twitter.com/kycefn](https://twitter.com/kycefn).\n\nEdit: I originally had a few links attached to make it easier to go to the materials I used to study, but people thought I was advertising for those sites/people so I took them out because that is not the point of the post. I made this purely to share my process and help fellow traders out.",
        "created_utc": 1664586187.0,
        "subreddit_name": "Daytrading",
        "comments": 230
    }
]