[
    {
        "title": "For the youth, just broad strokes what I've learned after 20 years investing.",
        "score": 4645,
        "url": "https://www.reddit.com/r/stocks/comments/mlux4z/for_the_youth_just_broad_strokes_what_ive_learned/",
        "content": "#DON'T PANIC\n\n(This was my response to a young investor here. Thought I might just post it, I like to lurk but whatever. Some edits have been made.)\n\nFor what it is worth this is my advise:\n\nSAVING IS HARD. Unless you were born to wealth it is hard. Sometimes even saving $5 is hard, and as you climb up in life there are always new things you will see to spend your money on. \n\n#1 if you see money laying on the ground PICK THAT UP. IT'S FREE MONEY. People throw money down because they don't know what money is really worth or what money can do. PICK IT UP AND POCKET THAT. NEVER THROW MONEY DOWN, NOT EVEN A PENNY. Damn, I hate seeing money on the ground. Even that penny was some time or labor earned, dont disregard that time and labor. \n\n\n::\n# I cant believe I have to edit this, but some idiot brought it up: If you find a large some of money laying on the ground take it to your local police station. Check your local laws to determine what the minimum amount would be for your state/jurisdiction most are between $500 and $10,000. If you find it in a bag with drugs... well, you do you. \n\n::\n\nI was really just talking about pocket change \n\nTry to use your money earned to make you happy, but put some back. Even if it is only $5 this week, but you wanted to go out and have a good steak. \n\nIf you did not grow up with a family that knows how money works you need to educate yourself.\n\nThis is NOT thought [edit: or taught] in school. \n\nYou either need family to teach you or you will have to learn on your own. Go to your library and read finance books, subscribe to some financial magazines, and watch YouTube, or go to broker sites and go through their online education stuff. TDA (not that I'm a fan of them or anything), Fidelity both have some good reading and watching. \n\nMy grandfather was born in the great depression to a pretty poor family, joined the navy, became a cop and spent 1960 (he was 30 when this got intresting to him) till the day he died, investing and trying to learn this shit and tried to teach me what he found out, and I have spent the last 20+ years doing it too. I've gotten pretty good at what I can find and I'm 41, still think I'm not all that good at it, but I could still just say F it and retire today if I wanted to. Make no mistake, if you do not have generational support you have a lot to do, make sure you pass on what you learn. I try to educate my friends and family that will listen, but I feel like a blowhard sometimes. \n\nGo to seminars, or online live stuff. Learn the financial products and how to use them. Learn how to read company financials and how to interpret it. \n\nNone of this takes a huge amount of time. Spend 5 or 10 hours a week doing this instead of watching tv, reading fantasy, playing games (or working, fuck the man).  \n\nIn 1 year you will be ahead of 90% of others. \n\nDon't believe what financial media is telling you, by the time you hear it from them it's already over and the big boys are looking for bag holders. You have to learn how to do your own due diligence. Never believe anything you can't verify.  Pretty sure CrMer was shouting to buy lemanbrothers in 2008... that worked out well?\n\nBroad market ETFs are seeming more and more like those bundled loan securities pre 2008. Looks like we might see more losers than winner soon, but I could be wrong.... do your research. \n\nI like managed funds. Vanguard and Fidelity have their reputation for a GOOD reason, and they have their own clearing houses. \n\nPick a solid broker, read above. \n\n#Get a ROTH and max it before anything else, then standard IRA, then brokerage. Try hard as hell to get 6 months or 1 year of savings to cover basic expenses. \n\nDon't be afraid to gamble a little every now and then, but don't make a r/WSB yolo 90% of your portfolio. Unless that's your risk tolerance... investing really is ALL ON YOU. (You can [and I have] make good money on a meme stock, but pIck an entry and exit; you do NOT need a 1000% gain, a 10% gain is PROFIT, AND PROFIT: IS PROFIT.)\n\nStart with managed ETFs, mutual funds, then maybe some passive ETFs that track indexes. Then, Once you  have your feet wet, and have some cash in savings (don't forget that inflation will take cash out of your pocket, but a market correction could take more [it's a balancing act]) Try some stock picking.\n\nAfter you have set yourself up  try picking some stocks. Look long term, 10+ years. I like inovationers or solid old companies that just truck along and pay dividends. Healthcare, biotech, chips, multifamily REITs are what I'm in. Go global too. \n\nMaybe after you are set long term, try short term picks. It really is all about risk and risk tolerance. \n\nAfter you have a little bank roll sell some options. Sell cash covered puts for stocks you like or own and want more of for a lesser price. Sell covered calls on stocks you have, and this can lower your cost basis.  \n\nDon't do naked calls, dont short sell. Avoid Infinite risk, but know what your risk is and go for it if you think you might have a win. \nIf you bet $500 on a play that could get you 5k I call that an ok gamble, IF you can take a $500 risk. \n\nIf you are not from a family already rich now, its about getting rich in 10, 20, or 30 years. Save now. Learn how this works, have capital for down turns (buy dips and crashes), and ride the waves. This is a lot easier if you are young and have the time to ride it out while you wage slave. \n\nLook at any chart of any index over 20 or 30 or even 100 years, guess what ..... stocks go up.\n\nDon't try to out think the market. Go with the flow. Follow the waxing and waning. Markets move through rotations just like tides in the sea. Move with it, not against it. \n\n#DONT PANIC. \n\nDon't trade with emotion, do your due diligence and analysis, and. stick. to. your. plan.\n\nLearn how to make a budget and include your investments into it.\n\nBuy 1 or 2 realestate properties. Everything you invest after purchase price is considered a loss and can offset your tax burden (even if it adds value).\n\n\nLearn some hedges. I take a 1% stake against my positions with 1yr puts or calls every year. If I'm down in a year I'll take a 1% value call option. If I'm up I'll take a 1% put a year out. Its like insurance. And believe me, it CAN and WILL save your ass. \n\nTime in the market vs timing the market ... time in always wins, but having bad timing can set you back a long time. \n\nAnyway, at the end of the day... just do something. \n\nDo not disregard other avenues of investment either. Realestate, income property, land, art, farms, cattle (it's a big one where I'm from), antiques, clasic cars (but that might be over after all the boomers are gone [I'm gen X and still remember the smell of them (and that is a real thing kids)]. \n\nTry not to fall into investment fads.\n\nWhen I was a kid these collectors thought these stupid bennie baby things and pogs were for life.... if those dumb*sses would have bought $AAPL instead they wouldn't still have tubs of useless, multicolored, cute cotton, whatever animal like things they would have yachts. Those damb card games are another one, yes I do have some Magic gathering cards worth some money, but I didn't buy it as an investment, I was a geek who liked playing the game with my friends.\n\nAnd buy some $GME. Even 2 shares. That shit is crazy, who knows what will happen.\n\n\n*I am not a financial advisor, I'm just a dude on the internet sharing what he has learned. Nothing should be taken as any type of financial advise, but everyone should save some money and invest with using their own risk tolerance and the help of a certified financial adviser (not me).*\n\n**last edit: swords for plowshares boys**\n\nPS: I upvoted you all so far, love this late(early) discussion. Going to sleep now. Whether you agree with me or not, I wish you all solid gains. It is not about you or them, or your gains vs his/her loss. I hope you all make gains and that my small insite can lead future generations(or my own or past) to an easy life where we maybe don't have yachts or pent houses, but at the same time.... have to die young of stress and ill health, and can just have the money to be content and happy and be like me,... spending this week digging a new garden, and not be broken old men/women like I see so often.\n\nAnd if you dont like that, if you say everyone should \"pull up them boot straps\" then I say Fuk you. That didn't work. So I won, and I hope I can teach even one kid to win to\n\n#dont award this, take that and buy some stocks or donate to St Jude or something, I dont even know what those things are but I know it cost $$. This whole sub is about saving and investing, investing in lame awards for my dumb ass isnt working. Charity IS A WRITE OFF. \n\nAnd dont PM me please, I'm not a D but I do not know how to reply. Reddit changed and I did not change with it.\n\n# EDIT DOWN---->\n\n# edit** Thanks for all those awards: I think I said something about NOT throwing money down?! That's what you did. I also said not to do that.\n\n#Please, don't buy single ply toilet paper, but don't give me awards either. \n\nI have seen some comments about the whole  15% comment I made below. It is TOTALLY about what I said above about knowing financial products, and managing things yourself in your brokerage. \n\nI DO NOT SELF MANAGE MY IRAs.  MY IRAs truck  along just fine. \n\nBut I do manage my margin account. I use every thing I can to make more $$. And options are a big part. I am not making insane call buys. I sell covered calls and buy cash secured puts. I sell iron condors or butterflies (depends on the equity). I follow trends and waves and rotations and I use leaps and verticals. \n\n(This is me, I am not an advisor, I'm an idiot on the internet.. DO NOT DO WHAT I DO, THIS IS ONLY ME AND ME ALONE. I AM ONLY TELLING THE PUBLIC WHAT I HAVE DONE AS A SOLITARY INVESTOR.) \n\nBUT: I closed almost every position I had 2 weeks ago. I got greedy enough last year and till now, I had a great return. I'm stepping back.",
        "created_utc": 1617772525.0,
        "subreddit_name": "stocks",
        "comments": 449
    }
]