[
    {
        "title": "Disney will name new CEO in early 2026; Gorman to become board chair next year",
        "score": 130,
        "url": "https://www.reddit.com/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/",
        "content": "Disney has tapped James Gorman to replace Mark Parker as the company’s next chairman, effective in January, as the media giant lays the groundwork to name a successor for CEO Bob Iger in early 2026, the company said Monday.\n\nGorman joined Disney’s board less than a year ago and was named the head of the succession planning committee in August. He will continue to lead that committee after he takes over as board chairman from Nike Executive Chairman Parker.\n\n“The Disney board has benefited tremendously from James Gorman’s expertise and guidance, and we are lucky to have him as our next chairman – particularly as the board continues to move forward with the succession process,” Iger said in a statement. “I’m extremely grateful to Mark Parker for his many years of board service and leadership, which have been so valuable to this company and its shareholders, and to me as CEO.”\n\nParker will step down after nine years on the Disney board “to focus on other areas” of his work, according to a Disney statement. That includes spending more time working on Nike-related matters, according to a person familiar with the matter. Elliott Hill took over as Nike CEO last week, replacing John Donahoe.\n\nEarly 2026\n\nDisney had initially targeted 2025 to announce a successor, as CNBC reported last year. Pushing the date back to early 2026 will give the board more time to conduct due diligence on both internal and external candidates, according to people familiar with the matter, who asked not to be named because the discussions are private.\n\nGorman has experience with succession planning: He oversaw the orderly transfer of power at Morgan Stanley, with Ted Pick succeeding him as CEO there at the start of this year.\n\nSuccession hasn’t been smooth at Disney. The board fired Iger’s handpicked successor, Bob Chapek, in November 2022 after a turbulent tenure that lasted less than three years. Iger returned to the CEO job, and now, Disney shareholders are eager to see a succession plan stick.\n\nIger’s four direct reports — ESPN Chairman Jimmy Pitaro, Disney Experiences Chairman Josh D’Amaro, and Disney Entertainment Co-Chairmen Dana Walden and Alan Bergman — have all interviewed with the succession committee in recent weeks, since Gorman took over in August, according to the people familiar.\n\nGorman said in a CNBC interview in March, before taking over as the board’s succession chair, that Disney was running a “forward-looking, forward-leaning, incredibly disciplined process.”\n\nStill, while putting a specific timeline on naming a successor adds a bit of clarity to the search, it also means the question of who will take over for Iger will continue to hover over the company for another year.\n\nIger has pushed back his retirement five different times to continue to lead Disney as CEO. Activist investor Nelson Peltz focused on the board’s failure to name a lasting successor in his unsuccessful campaign to gain board seats earlier this year.\n\nIger’s current contract as CEO runs until Dec. 31, 2026. He and the board haven’t decided if Iger will extend his board tenure past 2026, said the people familiar.\n\nSource: https://www.cnbc.com/2024/10/21/disney-ceo-succession-plan-board-chair.html",
        "created_utc": 1729514332.0,
        "subreddit_name": "stocks",
        "comments": 33
    },
    {
        "title": "Me, after putting all my money into shorting NVDA, because ChatGPT told me to.",
        "score": 15583,
        "url": "https://i.redd.it/hby2n4m5s0wd1.jpeg",
        "content": "",
        "created_utc": 1729477368.0,
        "subreddit_name": "wallstreetbets",
        "comments": 278
    },
    {
        "title": "NVDA put buyers today",
        "score": 5651,
        "url": "https://i.redd.it/mn59i2ac56wd1.jpeg",
        "content": "",
        "created_utc": 1729542338.0,
        "subreddit_name": "wallstreetbets",
        "comments": 142
    },
    {
        "title": "LEAPS are supreme ",
        "score": 869,
        "url": "https://www.reddit.com/gallery/1g92vx8",
        "content": "Positions are 30x NVDA 60 call with expiry 1/16/2026. Will most likely sell once i get long term cap gains treatment and buy some more deep ITM LEAPS as far out as i can.",
        "created_utc": 1729550070.0,
        "subreddit_name": "wallstreetbets",
        "comments": 256
    },
    {
        "title": "NVDA I will cheer for you",
        "score": 765,
        "url": "https://i.redd.it/1x2rea89c6wd1.jpeg",
        "content": "On Monday, NVIDIA surpassed last week's intraday high of $140.89, closing up 4.14% to set a new closing all-time high of $143.71, and closed with a market capitalization of $3.53 trillion, closing in on Apple's $3.6 trillion market cap.\nDespite last Tuesday's dip in NVIDIA's stock price after ASML's earnings blowout, and the market's concerns about slowing AI spending remain, NVIDIA's stock price still recorded a 2% gain last week, a cumulative increase of more than 50% over the bottom at the time of the market's collapse in early August.\n\nWall Street analysts continue to be firmly bullish on NVIDIA ahead of its November earnings report. According to Bloomberg survey statistics, analysts expect NVIDIA shares to rise to $ 148.37 in the next 12 months, including a number of highly bullish analysts on NVIDIA, for example:\n\nOn Friday, Bank of America raised its Nvidia price target from $165 to $190. Bank of America analyst Vivek Arya, among others, said buying Nvidia is a “once-in-a-generation opportunity.”\nLast week, investment research firm CFRA raised its price target on NVIDIA from $139 to $160.\nIn the view of Bank of America analysts, the overall AI market demand is growing strongly, in addition to this is also worth noting that NVIDIA's strong performance in the field of enterprise AI, such as partnerships with Microsoft and Accenture and other companies, Bank of America to raise its target price of the other factor, NVIDIA is the preferred partner for enterprise AI hardware and software.\n\nWedbush analyst and NVIDIA majority owner Dan Ives expressed a similar sentiment in a report sent to investors on Sunday. He claimed that enterprise spending is growing in giant waves as AI adoption scenarios explode, and NVIDIA is leading the way.\n\nIves predicts that the AI infrastructure market will grow tenfold between now and 2027, with companies investing $1 trillion in AI capital expenditures during that time. “In short, we think tech stocks are poised for another 20% rally in 2025, and this tech bull market driven by the AI revolution is just entering its next phase. We believe that the Fed and Powell have initiated an aggressive rate-cutting cycle, that a soft macroeconomic landing is still the way forward, and that tech spending on AI is a crossover spending wave that is just getting off the ground in the tech sector.”",
        "created_utc": 1729544665.0,
        "subreddit_name": "wallstreetbets",
        "comments": 110
    },
    {
        "title": "Nvda play +73k",
        "score": 541,
        "url": "https://i.redd.it/ontqo601f4wd1.jpeg",
        "content": "",
        "created_utc": 1729521380.0,
        "subreddit_name": "wallstreetbets",
        "comments": 112
    }
]