[
    {
        "title": "Intel to cut 15% of headcount, reports quarterly guidance miss ",
        "score": 1622,
        "url": "https://www.reddit.com/r/stocks/comments/1ehqdsk/intel_to_cut_15_of_headcount_reports_quarterly/",
        "content": "Intel shares slid 10% in extended trading on Thursday after the chipmaker said Thursday it would lay off over 15% of its employees as part of a $10 billion cost reduction plan and reported lighter results than analysts had envisioned. Intel also said it would not pay its dividend in the fourth quarter of 2024.\n\nHere’s how the company did, compared to LSEG analyst expectations:\n\nEarnings per share: 2 cents adjusted vs. 10 cents expected\nRevenue: $12.83 billion vs. $12.94 billion expected\nIntel’s revenue declined 1% year over year in the quarter, which ended on June 29, according to a statement. The company had a $1.61 billion net loss, or 38 cents per share, compared with net income of $1.47 billion, or 35 cents per share, in the year-ago quarter.\n\nThe company’s Client Computing Group that makes PC chips contributed $7.41 billion in revenue, up 9% and right around the $7.42 billion consensus among analysts surveyed by StreetAccount.\n\nIntel’s Data Center and Artificial Intelligence unit posted $3.05 billion in revenue. The result was down 3% and lower than the $3.14 billion StreetAccount consensus.\n\nFor the fiscal third quarter, Intel called for an adjusted net loss of 3 cents per share on $12.5 billion to $13.5 billion in revenue. The LSEG consensus was adjusted net earnings of 31 cents per share and $14.35 billion in revenue.\n\nDuring the quarter, Intel announced that Apollo would invest $11 billion in a joint venture around a chip manufacturing plant in Ireland. The company also introduced Xeon 6 server processors, along with a Gaudi 3 accelerator for artificial intelligence workloads.\n\nIn addition, Intel disclosed in May that the U.S. Commerce Department was revoking export licenses for consumer items to a customer in China, widely believed to be Huawei. Intel said second-quarter revenue would still be in its previously announced range of $12.5 billion to $13.5 billion, but below the middle of the range.\n\nExcluding the after-hours move, Intel stock has lost 42% of its value so far this year, while the S&P 500 index is up almost 14% in the same period.\n\nSource: https://www.cnbc.com/2024/08/01/intel-intc-q2-earnings-report-2024.html",
        "created_utc": 1722542844.0,
        "subreddit_name": "stocks",
        "comments": 572
    }
]