[
    {
        "title": "I'm an Emergency Physician and wanted to talk about Apple Watch's new ECG",
        "score": 8689,
        "url": "https://www.reddit.com/r/apple/comments/9fkb3t/im_an_emergency_physician_and_wanted_to_talk/",
        "content": "I'm an Emergency Physician and read/interpret ECGs on a daily basis. I wanted to talk about the Apple Watch's new ECG feature as there are a lot of misconceptions about this new function. Apple Watch's new ECG feature is pretty neat and a lot of people here are understandably excited about it, but it does have limitations. \n\nI also wanted to do a brief tutorial on the basics of ECGs. \n\n&nbsp;\n\n**Electrocardiography aka ECG or EKG**\n\nAt its basic core, ECGs measure voltage activity in the heart. As the heart beats, electrical activity moves along the heart and [shows up as the bumps and spikes in the ECG](https://upload.wikimedia.org/wikipedia/commons/0/0b/ECG_Principle_fast.gif).\n\nVoltages are measured across gradients meaning you need at least two electrodes with vectors go across the heart. An ECG computer measures these voltages and calculates certain vectors or \"leads\" based on the orientation of the electrodes and displays them as a rhythm strip, that [looks something like this](https://lifeinthefastlane.com/wp-content/uploads/2011/12/sinus-rhythm-strip.jpg).\n\nSome of these vectors are direct measurements of certain electrodes, [while others are calculated by the computer across multiple electrodes](https://upload.wikimedia.org/wikipedia/commons/1/19/Limb_leads_of_EKG.png).\n\n&nbsp;\n\nThe most comprehensive ECG is known as a [12-lead ECG](https://lifeinthefastlane.com/wp-content/uploads/2011/12/normal-sinus-rhythm.jpg).\n\nThis ECG uses 10 electrodes, 4 on each limb, and 6 in a specific orientation around the heart in order to represent [12 separate vectors across the heart](https://upload.wikimedia.org/wikipedia/commons/0/0e/EKG_leads.png). In some ways you can think about this type of ECG as almost a 3D measurement of electrical activity in the heart.\n\n&nbsp;\n\nThe heart monitors typically used in the hospital settings usually use 3-5 electrodes, limiting the number of leads that are measured, but still useful for other diagnostic tests as they are typically continuous.\n\n&nbsp;\n\n**What is Apple Watch's ECG?**\n\nThe Apple Watch ECG is a single lead ECG, measuring Lead I. This is great for measuring the rate and rhythm of the heart which can be very useful for the screening of atrial fibrillation. \n\n[Atrial Fibrillation Rhythm Strips](https://upload.wikimedia.org/wikipedia/commons/6/64/Afib_ecg.jpg)\n\nThe normal bottom strip is nice and regular and also includes something called a P-wave that represents the beat of the atrium and is supposed to be before every big spike. The top strip represents afib, the spikes are disorderly and not regular, it is also notably missing that P-wave.\n\nIn its current state, the Apple Watch will continuously monitor your heart beat with it's optical sensor, and if it detects an arrhythmia, prompt you with a notification at which point you can conduct an ECG. \n\n&nbsp;\n\n**Atrial Fibrillation**\n\nAtrial Fibrillation (aka a-fib) is the most common cardiac arrhythmia, and up to 25% of people above the age of 40 will experience at least one episode of afib. It occurs when the [normal path of electrical activity](https://upload.wikimedia.org/wikipedia/commons/c/c3/Heart_conduct_sinus.gif) is [interrupted and disorganized](https://upload.wikimedia.org/wikipedia/commons/4/44/Heart_conduct_atrialfib.gif).\n\nAtrial fibrillation can occur in episodes that may only last a few minutes and go back to normal rhythm by itself. Some of these episodes can be precipitated by certain events like drinking alcohol, being sick, or other medical conditions. Some people will have recurrent episodes of self resolving afib, also known as paroxymal atrial fibrillation with no known cause. The extreme of this are people who have persistent afib and who's rhythm can be very difficult to flip back back to normal.\n\nHaving atrial fibrillation in it of itself is not necessarily an emergency. Many people with atrial fibrillation are completely asymptomatic and others may only have the feeling of palpitations or an irregular heart beat. \n\nWhere atrial fibrillation can get dangerous is if it causes vital sign abnormalities, where your blood pressure can get so low you pass out, you feel short or breath, or your heart rate is dangerously fast. If your heart rate is greater than 100-110 or so, you are in a state called atrial fibrillation with rapid ventricular response. At this point we would control your heart rate with IV medications in an emergent setting.\n\nWhile brief periods of asymptomatic afib can be benign, sustained atrial fibrillation increases your risk for stroke, clots in the lung, and heart failure. Depending on the patient's risk factors, some people will require blood thinners to reduce these risks. The longer your heart is in uncontrolled afib, the more difficult it is to reverse as there can be an element of cardiac remodeling. \n\n&nbsp;\n\n**What the Apple Watch is not**\n\n* At this point in time, the Apple Watch ECG feature is not indicated for the detection of any heart conditions except Atrial Fibrillation. \n* It is also not indicated for people who already have a diagnosis of atrial fibrillation, who should be seeing a physician regularly. \n* It is NOT capable of ruling in or out a heart attack. Even a full 12-lead ECG can miss certain heart attacks. \n* It is also NOT considered an FDA approved medical device as some people have claimed it to be. The FDA simply released [clearance](https://www.accessdata.fda.gov/cdrh_docs/pdf18/DEN180044.pdf) [letters](https://www.accessdata.fda.gov/cdrh_docs/pdf18/DEN180042.pdf), also known as a 510k Pre Market notification clearance, that also explicitly state that it is not intended for people under the age of 22. It is considered as an over-the-counter (OTC) device and classified as Class II, which is the same class as things like condoms and home-pregnancy kits.\n* It is also not a continuous monitor of your heart's electrical activity. It is only capable of measuring an ECG while your other hand is on the crown.\n    * A single electrode ECG is also physically impossible. In order to measure electrical activity, there needs to be a complete circuit that passes through the heart. Not even a wireless device on the other hand can get around this as it wouldn't be part of the same electrical circuit. \n\n&nbsp;\n\n**TLDR;**\n\nIn summary, the new Apple Watch looks like a great tool, but it is not meant to be a medical grade device and not a substitute for medical and professional evaluation in the case of symptoms. Even if your Apple Watch ECG appears totally normal that does not necessarily mean you do not have atrial fibrillation or other cardiac abnormalities.\n\nSources:\n\nhttps://lifeinthefastlane.com/ccc/atrial-fibrillation/\n\nhttps://en.wikipedia.org/wiki/Electrocardiography",
        "created_utc": 1536861794.0,
        "subreddit_name": "apple",
        "comments": 618
    },
    {
        "title": "How Apple has silently raised the price of their smartphones",
        "score": 5691,
        "url": "https://www.reddit.com/r/apple/comments/9fewr6/how_apple_has_silently_raised_the_price_of_their/",
        "content": "So I watched today's keynote, when I came to a sudden realization\n\n&#x200B;\n\nLast year, they introduced the iPhone X as a premium model, and the iPhone 8 as the \"next iteration\" and \"regular\" model. This was the first part of the plan.\n\n&#x200B;\n\nToday, Apple announced iPhone XS, XS Max, and XR.  \n\n\nThe highlight of the keynote was the iPhone XS and XS Max, the two phones that hold all of the newest features. These phones were marketed as the newest and greatest, and as the \"next iteration\" of iPhone.\n\n  \nThe XR, on the other hand, was marketed and described as a cheaper option. Apple is choosing to market the XR as the \"lower-cost\" option. It doesn't have 3D touch, a single camera, and also has a pretty low resolution screen compared to the XS series. The XR, as many people believed during the rumours, is the \"budget model\". (budget with extra air quotes)\n\n&#x200B;\n\nBut here's the thing. The iPhone XS and XS Max are being marketed as the \"regular\" models. To the regular person who reads about these new phones, they will see iPhone XS and XS Max as being replacements for iPhone 8 and 8 Plus. But that's NOT the case! The iPhone XS series is significantly pricier than the iPhone 8 and 8 Plus. In terms of pure cost, the next iteration after iPhone 8 would be the iPhone XR.\n\n&#x200B;\n\nIn other words: If you expect to pay the same price for a base model iPhone every year, this is how your purchases over the past four years would look:  \n\n\n\\-iPhone 6s\n\n\\-iPhone 7\n\n\\-iPhone 8\n\n\\-iPhone XR\n\n&#x200B;\n\nEvery year before today, the respective iPhone from that year was considered the \"regular\" model.\n\nBut THIS year, that price category is being marketed as the \"lower end\" model.\n\n&#x200B;\n\nTwo years ago, that price would have gotten you the newest model of iPhone. (iPhone 7)\n\nA year ago, that price would have gotten you the newest phone, but not the premium model. (iPhone 8)\n\nToday, that price gets you the \"lower end\", feature-absent model (iPhone XR)\n\n&#x200B;\n\nBecause of clever marketing, Apple has silently raised the prices of their flagship devices. Instead of just raising the prices suddenly one year, they released a premium model, set a precedent, then in the following year, released two models of their flagships, at the price of the premium. Then replaced what was previously known as the \"regular\" model with a cheaper, low end, feature-missing model. \n\n&#x200B;\n\nSo now, your average consumer will most guaranteed shell out more money for an iPhone XS, as they want the newest \"regular\" model. Not the \"lower cost\" option.\n\n&#x200B;\n\nPretty fucking genius. Can't help but wonder if this is on purpose or not. It sounds almost like a conspiracy theory. Let me know what you guys think!\n\nEDIT: People keep commenting as if I’m complaining about the prices. Apple can charge whatever they want. I’m simply stating the genius marketing psychology Apple has employed. It went right under my nose until I analyzed everything. Also, thank you stranger for the Reddit gold ❤️\n\nEDIT EDIT: People keep asking how this is “silent”. Well, if Apple were to just raise the prices one year, the media would go abuzz and you wouldn’t hear the end of it. “Apple raised the price of their smartphone!”. By employing this strategy over the past two years, the eventual move to $1k+ flagships and ~$800 “lower end” models went under a lot of noses.",
        "created_utc": 1536812327.0,
        "subreddit_name": "apple",
        "comments": 1307
    }
]