[
    {
        "title": "Hedge Funds Sell Tech Stocks ‘Aggressively,’ Goldman Says",
        "score": 213,
        "url": "https://www.reddit.com/r/stocks/comments/1dqagoq/hedge_funds_sell_tech_stocks_aggressively_goldman/",
        "content": "In a month when Nvidia Corp. briefly became the world’s largest company, hedge funds were “aggressively” selling tech stocks, according to analysis from Goldman Sachs Group Inc.\n\nThis month’s net selling in the US tech sector is on track to be the largest on record going back in data since 2017, according to Goldman’s prime brokerage data. Semiconductor and semiconductor equipment stocks were the ones offloaded the most by hedge funds, followed by software and internet stocks.\n\nNvidia shares have been choppy after losing $430 billion in market value late last week. And, June has been a volatile month for Big Tech stocks after the meteoric rise of Nvidia, Microsoft Corp., Amazon.com Inc., Meta Platforms Inc., Apple Inc. accounted for well over half of the 15% advance in the S&P 500 this year.\n\nThe trimming of exposure by hedge funds is in sharp contrast to the record inflows seen into tech-related funds last week, which saw the tech-heavy Nasdaq 100 index hit its latest record high on June 18. The weight of the tech sector in the S&P 500 hit 33% last week, the highest level in about 24 years.\n\nWhat’s more, the momentum factor-style investing that drove the likes of Nvidia to all-time highs this year is also faltering. Hedge funds’ momentum exposure is poised to decrease for the first time in six months, the Goldman data showed. “Long concentration” and “long crowdedness” have both seen notable declines and are at the lowest levels this year, suggesting long-short fund managers have become more mindful of a potential drawdown in those factors after strong returns.\n\nThe unwind is not just hitting tech alone. Hedge funds are now tilting more defensively than usual. Their gross leverage — a measure of risk appetite — has been declining, with North America and Europe by far the most notionally net sold regions so far in June.\n\n“After adding risk to their portfolio in all but one week so far this year, trading flows from recent sessions point to some risk unwinds, driven by long sales and to a lesser extent short covers,” Goldman wrote in a note.\n\nSource: https://finance.yahoo.com/news/hedge-funds-sell-tech-stocks-095749442.html",
        "created_utc": 1719546729.0,
        "subreddit_name": "stocks",
        "comments": 92
    },
    {
        "title": "Withholding Apple Intelligence from EU a ‘stunning declaration’ of anticompetitive behavior",
        "score": 2511,
        "url": "https://9to5mac.com/2024/06/28/withholding-apple-intelligence-from-eu/",
        "content": "",
        "created_utc": 1719576326.0,
        "subreddit_name": "apple",
        "comments": 1189
    },
    {
        "title": "FCC Proposes carriers should have to unlock your iPhone within 60 days, making it easier to switch",
        "score": 1521,
        "url": "https://9to5mac.com/2024/06/28/unlock-your-iphone-fcc-proposal/",
        "content": "",
        "created_utc": 1719586050.0,
        "subreddit_name": "apple",
        "comments": 212
    },
    {
        "title": "Report: Apple Planning to Debut New Battery Replacement Method With iPhone 16",
        "score": 822,
        "url": "https://www.macrumors.com/2024/06/28/new-battery-replacement-method-with-iphone-16/",
        "content": "",
        "created_utc": 1719587381.0,
        "subreddit_name": "apple",
        "comments": 234
    },
    {
        "title": "Samsung to Begin Rolling Out Hotel Room TVs With AirPlay Support for iPhone and iPad",
        "score": 650,
        "url": "https://www.macrumors.com/2024/06/27/samsung-airplay-hotel-room-tvs/",
        "content": "",
        "created_utc": 1719568641.0,
        "subreddit_name": "apple",
        "comments": 46
    },
    {
        "title": "Apple shipments for May up in China. ",
        "score": 10,
        "url": "https://www.reddit.com/r/AAPL/comments/1dqfwg5/apple_shipments_for_may_up_in_china/",
        "content": "https://www.yahoo.com/tech/apples-may-smartphone-shipments-china-092408644.html\n\nThe SP may zoom before we get a chance to fully commit and position ourselves… ",
        "created_utc": 1719568301.0,
        "subreddit_name": "AAPL",
        "comments": 0
    },
    {
        "title": "Wow this options got some moves — buy the dips?",
        "score": 1,
        "url": "https://i.redd.it/48cyhsglqb9d1.jpeg",
        "content": "AAPL $215 July 5 Calls",
        "created_utc": 1719585513.0,
        "subreddit_name": "AAPL",
        "comments": 36
    },
    {
        "title": "Closing chart AAPL June28 212 1/2 calls",
        "score": 1,
        "url": "https://i.redd.it/b305a0srv99d1.jpeg",
        "content": "How the option ended at expiration if you were unfortunate enough to ride til then not having an opportunity to take advantage of the numerous chances to take profits 😊",
        "created_utc": 1719563042.0,
        "subreddit_name": "AAPL",
        "comments": 1
    }
]