[
    {
        "title": "The entirety of Twitch has reportedly been leaked",
        "score": 4111,
        "url": "https://www.reddit.com/r/stocks/comments/q2hh1p/the_entirety_of_twitch_has_reportedly_been_leaked/",
        "content": "An anonymous hacker claims to have leaked the entirety of Twitch, including its source code and user payout information.\n\nThe user posted a 125GB torrent link to 4chan on Wednesday, stating that the leak was intended to “foster more disruption and competition in the online video streaming space” because “their community is a disgusting toxic cesspool”.\n\nVGC can verify that the files mentioned on 4chan are publicly available to download as described by the anonymous hacker.\n\nOne anonymous company source told VGC that the leaked data is legitimate, including the source code for the Amazon-owned streaming platform.\n\nInternally, Twitch is aware of the breach, the source said, and it’s believed that the data was obtained as recently as Monday. We’ve requested comment from Twitch and will update this story when it replies.\n\n The leaked Twitch data reportedly includes:\n\n* **The entirety of Twitch’s source code with comment history “going back to its early beginnings”**\n* **Creator payout reports from 2019**\n* [**Mobile**](https://www.videogameschronicle.com/platforms/mobile/)**, desktop and console Twitch clients**\n* **Proprietary SDKs and internal AWS services used by Twitch**\n* **“Every other property that Twitch owns” including IGDB and CurseForge**\n* **An unreleased** [**Steam**](https://www.videogameschronicle.com/platforms/pc/steam/) **competitor, codenamed Vapor, from** [**Amazon Game Studios**](https://www.videogameschronicle.com/companies/amazon-games/)\n* **Twitch internal ‘red teaming’ tools (designed to improve security by having staff pretend to be hackers)**\n\nSome Twitter users have started making their way through the 125GB of information that has leaked, with one claiming that the torrent also includes encrypted passwords, and recommending that users enable two-factor authentication to be safe.\n\nFinally, the leaked documents allegedly show that popular streamers such as Shroud, Nickmercs and DrLupo have earned millions from working with the popular streaming platform. \n\n[https://www.videogameschronicle.com/news/the-entirety-of-twitch-has-reportedly-been-leaked/](https://www.videogameschronicle.com/news/the-entirety-of-twitch-has-reportedly-been-leaked/)",
        "created_utc": 1633515336.0,
        "subreddit_name": "stocks",
        "comments": 552
    },
    {
        "title": "Tim Cook Wants Apple Devices to Be Used for Creativity, Not ‘Endless, Mindless Scrolling’",
        "score": 7953,
        "url": "https://www.macrumors.com/2021/10/06/tim-cook-endless-scrolling-too-much-technology/",
        "content": "",
        "created_utc": 1633519934.0,
        "subreddit_name": "apple",
        "comments": 919
    }
]