[
    {
        "title": "PSA: iPhone batteries are only rated by Apple to stay above 80% health in the first 500 cycles",
        "score": 4975,
        "url": "https://www.reddit.com/r/apple/comments/osqok8/psa_iphone_batteries_are_only_rated_by_apple_to/",
        "content": "Hi everyone, I’ve seen a lot of questions online lately from people about their iPhone’s battery health and whether their batteries are wearing unusually fast. iPhone 12 owners are asking things like “I’ve only had my phone for 10 months and battery health is already down to 90%, is that normal or do I have a defective battery?”\n\nApple has two main support pages about this listed here:\n\n[https://support.apple.com/en-us/HT208387](https://support.apple.com/en-us/HT208387)\n\n[https://www.apple.com/batteries/service-and-recycling/](https://www.apple.com/batteries/service-and-recycling/)\n\nSpecifically, unlike Mac, iPad, and Apple Watch batteries that are rated to 1000 cycles, the iPhone’s battery is “designed to retain up to 80% of its original capacity at 500 complete charge cycles when operating under normal conditions.”\n\nThat means that if wear happens relatively linearly, you should expect to be down to 90% health after 250 cycles. Assuming you cycle your battery about once a day, then a brand new iPhone 12 bought at launch should, according to Apple’s typical expectations, be worn down \\~10% already, as it has been 277 days since iPhone 12’s launch day.\n\nOf course, it is frustrating that because of this, your phone has an expected 1.5 year lifespan before possibly needing a battery service on a battery that is not easily replaced.\n\nThe batteries can wear more quickly due to more frequent charge cycles, and especially due to heat. They also wear more rapidly when they’re more frequently pushed to 100% charge. So some suggestions for prolonging battery life include:\n\n\\- Avoid wireless charging as it does generate additional heat (this does go against using MagSafe, but it could over time save you a few health percentage points).\n\n\\- Try to avoid getting your phone too hot with regular use.\n\n\\- Use the features that prevent charging past 80% until the morning, and also always try to keep your battery level above 20%.\n\nBut ultimately the point is, I think we’re used to built in batteries having a longer cycle rating than modern iPhones seem to have. It’s unfortunate, and I don’t know why the iPhone batteries rate worse than other products, but the answer to the question of “is 90% expected at this time” appears, from Apple’s perspective, to be yes.",
        "created_utc": 1627404951.0,
        "subreddit_name": "apple",
        "comments": 792
    },
    {
        "title": "AAPL Q2 2021 Earnings Thread",
        "score": 4,
        "url": "https://www.reddit.com/r/AAPL/comments/ospsau/aapl_q2_2021_earnings_thread/",
        "content": "Earnings: Analysts tracked by FactSet expect Apple to post $1.01 in earnings per share, up from 65 cents a year earlier. According to Estimize, which crowdsources projections from hedge funds, academics, and others, the average expectation is for $1.16 a share in EPS.\n\nRevenue: The FactSet consensus calls for $73.26 billion in overall revenue, up from $59.69 billion a year prior. On Estimize, the average estimate is for $77.38 billion.\n\nOn a segment level, analysts surveyed by FactSet project $34.19 billion in iPhone revenue, $7.17 billion in iPad revenue, $7.86 billion in Mac revenue, $16.26 billion in services revenue, and $7.83 billion in revenue for the wearables, home, and accessories category.",
        "created_utc": 1627401932.0,
        "subreddit_name": "AAPL",
        "comments": 13
    },
    {
        "title": "Forecasts For Tomorrow?",
        "score": 3,
        "url": "https://www.reddit.com/r/AAPL/comments/osopli/forecasts_for_tomorrow/",
        "content": "Regardless of how Apple does in its earnings announcement today, at least one major brokerage firm will express disappointment with the results, possibly even downgrade the stock, and the share price will drop 2+% during the trading day tomorrow.\n\nYour thoughts?",
        "created_utc": 1627398614.0,
        "subreddit_name": "AAPL",
        "comments": 8
    }
]