[
    {
        "title": "Tesla shares close down 12% after earnings miss for biggest slump since 2020 ",
        "score": 3112,
        "url": "https://www.reddit.com/r/stocks/comments/1ebbep4/tesla_shares_close_down_12_after_earnings_miss/",
        "content": "Tesla shares plummeted the most since 2020 after the electric vehicle maker reported weaker-than-expected quarterly earnings and another drop in automotive revenue.\n\nThe stock closed down 12% on Wednesday at $215.99. It’s now down 13% for the year, while the Nasdaq is up 16% over that stretch.\n\nTesla on Tuesday said auto revenue declined 7% from a year earlier to $19.9 billion while margins also fell. Total revenue increased 2% to $25.5 billion.\n\nThe company has been forced to slash prices globally and offer discounts and incentives as it faces slowing sales and rising competition, especially in China.\n\nTesla remains the top seller of electric vehicles in the U.S. by far, but is losing market share to a growing number of rivals due in part to its aging lineup of sedans and SUVs and the impact of Musk’s incendiary and political commentary.\n\nAdjusted earnings of 52 cents a share for the second quarter trailed the average analyst estimate of 62 cents, according to LSEG. And Tesla’s adjusted operating margin shrank to the lowest in three years, dropping to 14.4% from 18.7% a year earlier. It’s the fourth straight quarter of shrinkage.\n\nInvestors have been focused on a number of other areas around the Tesla story, including when the company will introduce a new mass-market car to reinvigorate its lineup of vehicles. Musk said on the earnings call Tuesday that Tesla is on track to deliver a new “affordable” car in the first half of next year.\n\nRobotaxis were a big topic on the earnings call. Musk envisions a world in which owners can authorize their Tesla vehicle to be used as part of an Uber-style ride-hailing service, with the cars driving autonomously.\n\nWhen asked when he expects the first robotaxi ride, Musk said, “I would be shocked if we cannot do it next year.”\n\nMusk has a history of promising things on a particular timeline and not delivering. On Tuesday, he pushed back the date of the company’s robotaxi event to October, after previously saying it would take place in August.\n\n“This is because I wanted to make some important changes that I think would improve the vehicle,” Musk said, adding that Tesla is “going to show up a couple of other things.” He didn’t provide details.\n\nSource: https://www.cnbc.com/2024/07/24/tesla-shares-fall-8percent-in-premarket-trading-after-weaker-than-expected-earnings.html",
        "created_utc": 1721852173.0,
        "subreddit_name": "stocks",
        "comments": 485
    },
    {
        "title": "Apple Maps on the web launches in beta",
        "score": 1910,
        "url": "https://nr.apple.com/da1v0i7qs5",
        "content": "",
        "created_utc": 1721848074.0,
        "subreddit_name": "apple",
        "comments": 335
    },
    {
        "title": "Here's everything new coming to Messages in iOS 18",
        "score": 923,
        "url": "https://9to5mac.com/2024/07/23/everything-new-coming-to-messages-in-ios-18/",
        "content": "",
        "created_utc": 1721800260.0,
        "subreddit_name": "apple",
        "comments": 281
    },
    {
        "title": "Android users switching to iPhone hits 5-year high, but there's a downside for Apple",
        "score": 819,
        "url": "https://9to5mac.com/2024/07/24/android-users-switching-to-iphone-hits-5-year-high/",
        "content": "",
        "created_utc": 1721832992.0,
        "subreddit_name": "apple",
        "comments": 188
    },
    {
        "title": "Internal Change to iPhone 16 Models Expected to Reduce Overheating",
        "score": 713,
        "url": "https://www.macrumors.com/2024/07/23/internal-change-to-iphone-16-models-expected-to-reduce-overheating/",
        "content": "",
        "created_utc": 1721791043.0,
        "subreddit_name": "apple",
        "comments": 194
    },
    {
        "title": "Overnight QQQ puts ",
        "score": 6990,
        "url": "https://i.redd.it/v6qxfeljfhed1.jpeg",
        "content": "Thought my position was regarded. It was. 475p",
        "created_utc": 1721833678.0,
        "subreddit_name": "wallstreetbets",
        "comments": 543
    }
]