[
    {
        "title": "Tesla stock downgraded to Sell, analysts say 'not much to like'",
        "score": 1665,
        "url": "https://www.reddit.com/r/investing/comments/1ecm3ra/tesla_stock_downgraded_to_sell_analysts_say_not/",
        "content": ">Tesla (NASDAQ:TSLA) stock has been downgraded to a Sell recommendation by Philip Securities analysts, who said there is “not much to like” about the electric vehicle (EV) giant following its latest quarterly report. The analysts set a price target of $135 on TSLA, implying nearly 40% downside risk from the current levels.\n\nhttps://www.investing.com/news/stock-market-news/tesla-stock-downgraded-to-sell-analysts-say-not-much-to-like-3538401",
        "created_utc": 1721994551.0,
        "subreddit_name": "investing",
        "comments": 446
    },
    {
        "title": "Tesla stock downgraded to Sell, analysts say 'not much to like'",
        "score": 2058,
        "url": "https://www.reddit.com/r/stocks/comments/1ecm2et/tesla_stock_downgraded_to_sell_analysts_say_not/",
        "content": ">Tesla (NASDAQ:TSLA) stock has been downgraded to a Sell recommendation by Philip Securities analysts, who said there is “not much to like” about the electric vehicle (EV) giant following its latest quarterly report. The analysts set a price target of $135 on TSLA, implying nearly 40% downside risk from the current levels.\n\nhttps://www.investing.com/news/stock-market-news/tesla-stock-downgraded-to-sell-analysts-say-not-much-to-like-3538401",
        "created_utc": 1721994420.0,
        "subreddit_name": "stocks",
        "comments": 461
    },
    {
        "title": "Ahead of Apple Intelligence launch, Apple agrees to AI safety guidelines established by Biden administration",
        "score": 977,
        "url": "https://9to5mac.com/2024/07/26/apple-ai-biden-safety-guidelines/",
        "content": "",
        "created_utc": 1721991845.0,
        "subreddit_name": "apple",
        "comments": 68
    },
    {
        "title": "Apple to make iPhone 16 Pro and Pro Max models in India this year",
        "score": 904,
        "url": "https://www.cnbctv18.com/technology/apple-to-make-iphone-16-pro-and-pro-max-models-in-india-this-year-19449992.htm",
        "content": "",
        "created_utc": 1722008764.0,
        "subreddit_name": "apple",
        "comments": 170
    },
    {
        "title": "SPY scalping",
        "score": 381,
        "url": "https://i.redd.it/a1wkd729axed1.jpeg",
        "content": "Been using the SPY 1 minute chart and 21 EMA to scalp slightly OTM 0 DTEs 100 contracts at a time. I’ve found trading at open has generally resulted in losses, but the late afternoon swings have been more profitable. Withdrawing cash back down to 50K and starting again!",
        "created_utc": 1722025609.0,
        "subreddit_name": "DayTrading",
        "comments": 115
    },
    {
        "title": "$12k week, how? The 2 most boring parts of trading.",
        "score": 113,
        "url": "https://www.reddit.com/gallery/1ecanjl",
        "content": "I've managed to grab another $6k win today. I posted earlier this week with another trade I took on NAS that had a similar net result.\n\nTrade was taken on Topstep & Apex, 10 funded accounts, $600+ profit each account.\n\nA few comments in my previous post talked about \"not trading anymore that week\". Granted, I also said I may not take any other trades, but there's a reason I took the trade.\n\nRules.\n\nI enter trades that meet a certain criteria and follow set rules. These are the only trades I take. \n\nIf the setup is there, it's fair game (provided your risk is controlled!)\n\nI also have risk management rules, which means it's (almost) impossible for me to give my profit back to the market unless I lose an absurd number of trades in a row. Is that possible? Yes, but that's why it's important to set rules to minimise loss and damages.\n\nThings like only 1 win a day. Or 2 losses a day. A $ amount to lose per day, etc, are all ways to maximise longevity and minimize tilt.\n\nThe reality is that these 2 things are the core elements of strategically becoming profitable.\n\n1. Have a risk strategy (no, not just fancy words. An actual risk strategy)\n\nHow do you develop this? Simply put, have hard stops on the $ amount you're willing to lose per trade. Ensure your wins are earning more $ than your losses. Most importantly; ensure you have a win rate above 50%.\n\nYes, it's possible to be profitable with a lower win rate, but in my experience this is very challenging.\n\nHow do you improve your win rate?\n\n- Use a proven entry model\n- Use only that 1 strategy \n- Track performance (most people don't do this)\n\nThankfully, I use Topstep who actually track your metrics for you. I'm currently above 60% on win rate. My average win is $400+. Average loss is sub $200. With those figures, you create profitability over time.... IF YOU STICK TO YOUR RULES.\n\n2. Have entry criteria.\n\nI only enter 2 types of trades. Either a trend continuation which I take from fair value gaps.\n\nOr liquidity sweeps followed by inverted fair value gaps.\n\nThose 2 are my bread and cheese.\n\nI don't mess with anything else. No indicators. Just price action. My entry strategy is average at best. My rules keep me going in the right direction.\n\nBonus mention 3.\n\nNone of the above 2 would be possible if your psychology wasn't on point. I continue to parrot this to people often; get your head right, the rest will fall into place.\n\nThe trade setup: https://www.tradingview.com/x/ydmJJZwQ/\n\nThis trade today was a trend continuation.\n\nNAS was bearish, after open we saw a nice move to the upside and I took the trend reversal on a continuation. There was a sweep of the low.. I didn't take the IFVG model because I missed it... so took a trend setup using a fair value gap for entry on the 5m chart.\n\nIt's been a blessed week.\n\nHere's to everyone's success next week!\n\nTomorrow, I'm taking my kid to the park and keeping my laptop off.\n\nKeep going everyone. This shit makes me feel very fulfilled and full. Not because of the money... but because I've learned so much about myself, and how to tackle life, thanks to this thing everyone calls \"gambling\". \n\nPeace!",
        "created_utc": 1721953785.0,
        "subreddit_name": "DayTrading",
        "comments": 48
    },
    {
        "title": "Update: AAPL trading July 2024 so far with 4 trading days left",
        "score": 3,
        "url": "https://www.reddit.com/gallery/1eccoyr",
        "content": "",
        "created_utc": 1721959889.0,
        "subreddit_name": "AAPL",
        "comments": 2
    }
]