[
    {
        "title": "Elon Musk laid off the Tesla Supercharger team; now he’s rehiring them",
        "score": 786,
        "url": "https://www.reddit.com/r/stocks/comments/1cs3775/elon_musk_laid_off_the_tesla_supercharger_team/",
        "content": "Two weeks ago, Tesla CEO Elon Musk enacted widespread layoffs throughout the company, including the 500-strong team responsible for the brand's Supercharger. Now, Tesla is looking to hire some of them back, Bloomberg reports, as Musk promises to spend $500 million expanding the network.\n\nThe Supercharger network is inarguably Tesla's crown jewel. The company recognized early on that, even though its owners slow-charged at home each night, knowing they had the ability to rapidly recharge on the road was critical in making an electric vehicle an acceptable alternative to existing vehicles.\n\nSince then, it has built out more than 2,000 charging stations in the US alone, with more than 25,000 plugs. More than that, the chargers invariably work, something that is often not true for other charging networks.\n\nSo successful is the Supercharger network that, over the course of last year, virtually every other automaker that sells or plans to sell EVs in the US has announced it will drop the CCS1 connector for the J3400 standard, originally developed by Tesla. But those announcements were about more than just switching plugs. Each time, the OEM also revealed it had negotiated access for its customers to the Supercharger network.\n\nThat made Musk's dismissal of the entire team responsible so hard to fathom. While the Supercharger network accounts for only about 5 percent of Tesla's revenues, that percent is poised to grow as more OEMs gain access. And although the charging experience for Tesla EVs at Superchargers is usually flawless, that's because it's optimized for a single make of car with just five different models; there's no guarantee that will prove true when cars from other brands try to charge.\n\nThe layoffs also appeared to put Tesla's plan to build a more powerful charger that would benefit cars using 800 V or 900 V architectures, including Audi, Porsche, Lucid, and others, on hold.\n\nWorse yet, dozens of Supercharger sites that were in the works have stalled out, according to multiple reports.\n\nBut last week, Musk announced that Tesla would spend more than $500 million building out more chargers, just days after saying the focus would instead be on uptime at existing locations. And to do that, Tesla will need to rehire a whole bunch of people.\n\nThat started with Max de Zegher, who was an executive under the previous head of Supercharging, Rebecca Tinucci. (At the time of the layoffs, Electrek reported that Musk got rid of the entire team because its Tinucci did not lay off enough workers on her own.)\n\nThis is not the first time Musk has had to back-track an impetuous business decision. In 2019, he decided to close all of Tesla's retail locations to pay for a cheaper version of the Model 3 sedan. Within two weeks that decision had been reversed, in no small part due to the legal consequences of breaking so many leases.\n\nSource: https://arstechnica.com/cars/2024/05/tesla-does-180-on-superchargers-rehiring-laid-off-staff-amid-new-plans/",
        "created_utc": 1715720775.0,
        "subreddit_name": "stocks",
        "comments": 187
    },
    {
        "title": "Apple, SpaceX, Microsoft return-to-office mandates drove senior talent away",
        "score": 5286,
        "url": "https://arstechnica.com/information-technology/2024/05/rto-mandates-led-to-pronounced-exodus-of-senior-workers-at-top-tech-firms/",
        "content": "",
        "created_utc": 1715701653.0,
        "subreddit_name": "technology",
        "comments": 504
    }
]