[
    {
        "title": "Disney will name new CEO in early 2026; Gorman to become board chair next year",
        "score": 130,
        "url": "https://www.reddit.com/r/stocks/comments/1g8oo5x/disney_will_name_new_ceo_in_early_2026_gorman_to/",
        "content": "Disney has tapped James Gorman to replace Mark Parker as the company’s next chairman, effective in January, as the media giant lays the groundwork to name a successor for CEO Bob Iger in early 2026, the company said Monday.\n\nGorman joined Disney’s board less than a year ago and was named the head of the succession planning committee in August. He will continue to lead that committee after he takes over as board chairman from Nike Executive Chairman Parker.\n\n“The Disney board has benefited tremendously from James Gorman’s expertise and guidance, and we are lucky to have him as our next chairman – particularly as the board continues to move forward with the succession process,” Iger said in a statement. “I’m extremely grateful to Mark Parker for his many years of board service and leadership, which have been so valuable to this company and its shareholders, and to me as CEO.”\n\nParker will step down after nine years on the Disney board “to focus on other areas” of his work, according to a Disney statement. That includes spending more time working on Nike-related matters, according to a person familiar with the matter. Elliott Hill took over as Nike CEO last week, replacing John Donahoe.\n\nEarly 2026\n\nDisney had initially targeted 2025 to announce a successor, as CNBC reported last year. Pushing the date back to early 2026 will give the board more time to conduct due diligence on both internal and external candidates, according to people familiar with the matter, who asked not to be named because the discussions are private.\n\nGorman has experience with succession planning: He oversaw the orderly transfer of power at Morgan Stanley, with Ted Pick succeeding him as CEO there at the start of this year.\n\nSuccession hasn’t been smooth at Disney. The board fired Iger’s handpicked successor, Bob Chapek, in November 2022 after a turbulent tenure that lasted less than three years. Iger returned to the CEO job, and now, Disney shareholders are eager to see a succession plan stick.\n\nIger’s four direct reports — ESPN Chairman Jimmy Pitaro, Disney Experiences Chairman Josh D’Amaro, and Disney Entertainment Co-Chairmen Dana Walden and Alan Bergman — have all interviewed with the succession committee in recent weeks, since Gorman took over in August, according to the people familiar.\n\nGorman said in a CNBC interview in March, before taking over as the board’s succession chair, that Disney was running a “forward-looking, forward-leaning, incredibly disciplined process.”\n\nStill, while putting a specific timeline on naming a successor adds a bit of clarity to the search, it also means the question of who will take over for Iger will continue to hover over the company for another year.\n\nIger has pushed back his retirement five different times to continue to lead Disney as CEO. Activist investor Nelson Peltz focused on the board’s failure to name a lasting successor in his unsuccessful campaign to gain board seats earlier this year.\n\nIger’s current contract as CEO runs until Dec. 31, 2026. He and the board haven’t decided if Iger will extend his board tenure past 2026, said the people familiar.\n\nSource: https://www.cnbc.com/2024/10/21/disney-ceo-succession-plan-board-chair.html",
        "created_utc": 1729514332.0,
        "subreddit_name": "stocks",
        "comments": 33
    },
    {
        "title": "Some bets on my radar",
        "score": 21,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1g8dr1s/some_bets_on_my_radar/",
        "content": "CELH looks pretty weak to me here right now, currently no setup as it lost its base. Key resistance level is currently at that $40 level. Until then bearish on it\n\nJPM looks very bullish to me here. This one continues to just slow grind up higher and higher. Strong action. Not much else to say on this one tbh, great action.\n\nARKK is turning around here, definitely acting a lot better now. Money seems to be flowing into the growth caps here and IWM is showing some strength as well. SHOP SQ ROKU some examples\n\nOKLO also back here and acting incredibly strong right now and making a very strong momentum burst move here. Very nice action last couple of weeks and very clear downtrend break on the weekly chart. One to watch\n\nSee yah around!",
        "created_utc": 1729471954.0,
        "subreddit_name": "wallstreetbets",
        "comments": 18
    }
]