[
    {
        "title": "Cramer thinks Wall Street pros may be playing a game with Robinhood traders",
        "score": 3026,
        "url": "https://www.reddit.com/r/investing/comments/h7la4x/cramer_thinks_wall_street_pros_may_be_playing_a/",
        "content": "CNBC’s Jim Cramer said Friday that professionals on Wall Street are taking advantage of amateur investors by bidding up beat-up but popular stocks like airlines in premarket trading. \n\n“It’s a game. If it weren’t securities, let’s say it was monopoly, let’s say it’s Draft Kings ... it would be so much fun,” Cramer said on “Squawk Box.” “Pick a couple of stocks, you gun them in the morning, and then you hope people are stupid enough and they buy them.” \n\n\nhttps://www.cnbc.com/2020/06/12/cramer-thinks-wall-street-pros-may-be-playing-a-game-with-amateur-robinhood-traders.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard\n\nFor the new investors: If the money is important to you and you can’t afford to lose it, buy great companies, and hold them, or you WILL lose money in the long run. Trying to time the market and dance in and out of positions is like the following analogy: Imagine playing a slot machine, except the casino is watching you, and they can hit a button to make you lose when ever they want. They can also hit a different button to let you win a little, in order to embolden you so that you bet more, and then hit the button to make you loose money.",
        "created_utc": 1591970708.0,
        "subreddit_name": "investing",
        "comments": 632
    },
    {
        "title": "I lost my AirPod Pros while golfing and Find My saved my ass. Plus, I learned a bit about how it works",
        "score": 4172,
        "url": "https://www.reddit.com/r/apple/comments/h7tlpq/i_lost_my_airpod_pros_while_golfing_and_find_my/",
        "content": "I was golfing with some buddies yesterday and we finished up around 4:30pm. I shot a 91 and took $42 off of them, but I digress. I left the course and got home around 5:15. It was at this point that I realized my AirPod Pros were no longer in my pocket. I frantically searched everywhere in my house and car, but nothing. \n\nThen, I remembered Find My. I pulled it up and it showed their last location was on the course around 4:11pm, just before we finished. I called the course to see if anyone had turned them in, but they hadn’t. They took my name and number and said they’d call me if they turned up. \n\nIt dawned on me that if I looked at the satellite view on the map, I might be able to tell exactly what hole I lost them on. Sure enough, the satellite view showed their last known location in the rough along the 18th hole. \n\nKnowing it was a long-shot, but not wanting to lose my $250 headphones, I jumped in the car and raced back to the course to try and get there before they closed. I made it with 15 minutes to spare. I told the guy that I’m the one that called and that I think I might know where they are. He let me use a cart and I raced out to the 18th hole. \n\nI got to the spot on the map where it said they were last seen, but nothing. I searched around the area for a good ten minutes, but came up empty handed. Then it dawned on me: the AirPods don’t have GPS, so the location Find My was giving me was the last time the phone had “seen” them (the point where they were no longer connected). This meant that they had to be farther back, closer to the start of the hole. \n\nI jumped in the cart and headed back about 100 yards and sure enough, sitting up in the grass just off the cart path was the shining white case of my AirPod Pros!\n\nAs you can imagine, a huge weight was lifted off my chest and I could finally enjoy the sweet victory of my round!",
        "created_utc": 1591997512.0,
        "subreddit_name": "apple",
        "comments": 188
    }
]