[
    {
        "title": "I Tried 4 Paid Services for Stock Selection: Here are The Results for 2021 and 2022",
        "score": 2473,
        "url": "https://www.reddit.com/r/stocks/comments/x1fjlg/i_tried_4_paid_services_for_stock_selection_here/",
        "content": "**ZACKS**\n\n**TLDR**\n\n* They make a ton of recommendations. Many products underperform the market\n* Their annual Top 10 list did great in 2021 but not 2022, but you pay for it at $3600 per year. You can get a base subscription for $249/yr for just the stock screeners which is reasonable, though many are baked into Fidelity’s platform for free.\n* Their stock screeners are great for finding stocks, especially the VGM and Zacks Rank #1 screener. But to do it right, you need to spend 5hrs a week on it seeing what’s new.\n\nZacks offers a couple dozen different lines of stock picking services plus a few dozen different stock screens. It’s quite overwhelming actually, but also a bit addictive to pour through them to find some good stocks. I found most of their services don’t outperform the market or have so many stocks in them it would be a full-time job to buy and manage them.\n\nFor most of the screeners, the time it takes to vet them and look at each of the 50 plus stocks in each is too much of a time commitment, but looking at the first few in the list gives some ideas of what is working.I started just looking at the recent additions to see if there were secular trends and that helped.\n\nI tried out some of their healthcare picks with mild success: I was going to share the names but the bots on here blocked them because they are under 300M market cap. One was bought out for 40% over purchase price. One went up 6X. Two fizzled down -70%. If you want the names DM me.  \n\n\nI did OK using the value, growth, and momentum stock screener but I really had to spend a lot of time separating out the good ones and figuring out what was recently added, which they don’t tell you. If you get them too late, the move has already occurred and you will likely see the stock correct quickly.\n\nA few gems I traded from their list around March of 2021 included SEM (health clinics), DAC (container shipping), BERY (financial), and MT (steel). My target was +100% for each and I made that within a year of buying for each. I bought options. HOLX was an exception. I lost -15% on that pick, though it was mostly due to the fact it soared high from COVID revenues and then sold off quickly as the vaccines rolled out. It’s since back to slightly above the purchase price.\n\n**Zacks Top 10 Stocks of 2021 -** their premium offering and associated returns. I did not buy all of these - only SPSC and PWR. But I did track them all in a watchlist.\n\n* **Percent Winner Rate: 90%**\n* **Avg return: 48%**\n* **SPY Return: 30%**\n\nAIMC (transmissions) 2021   \nReturn: -6%   \nReturn To date: - 23%\n\nSPSC (supply chain mgmt solutions)   \n2021 Return: +31%   \nReturn to Date: +15%\n\nAPTV (vehicle parts)   \n2021 Return: +28%   \nReturn to Date: -15%\n\nPWR (energy generation consulting services)   \n2021 Return: +64%   \nReturn to Date: +107%\n\nIAA (online vehicle sales)   \n2021 Return: +46%   \nReturn to Date: -41%\n\nWSC (storage units)   \n2021 Return: +72%   \nReturn to Date: +84%\n\nMacy’s (clothing retailer)   \n2021 Return: +144%   \nReturn to Date: +76%\n\nGDDY (domain registration)   \n2021 Return: +3%   \nReturn to Date: 0%\n\nZBRA (tech, sensors)   \n2021 Return: +54%   \nReturn to Date: -7%\n\nULTA (beauty stores)   \n2021 Return: +46%   \nReturn to Date: +38%\n\n**For 2022’s top 10 stocks,** the advice has not been quite so good, but the year isn’t over yet. I didn’t buy any this year because I was short on the market, but I have been tracking the performance to see if they can match what they did last year. So far, not so good.\n\n* **Percent Up Since Rec: 20%**\n* **Avg Return of Rec: -8.8%**\n* **SPY Return: -10.3% as of time I drafted**\n\n&#x200B;\n\n**2. LEVELFIELDS**\n\n**TLDR**:\n\n* Event-driven alerts work and I like that the success rate is visible on the website\n* There are a lot of alerts you can subscribe to, so it’s best to choose one of their lower volume, higher performing strategies to avoid opportunity overload\n* It’s good at finding high shorter term returns with high success rates\n* For the biggest companies (AAPL, TSLA, etc), my news alerts arrived faster. For those under 100B market cap, it's very helpful.\n* Price is 228/yr but their emails of a big update seem to be hinting a hike is coming soon\n\n**Winning Percent: 79%**\n\n**Avg Return/Trade: 23%**\n\nI’ve been using an event-driven research system called LevelFields for about a year now. It was a little rough around the edges in the early days but has gotten much better over time. It’s good at identifying news events early that drive stock prices up and down, often from direct announcements from companies. It shows stock patterns following events, which is cool, especially for the negative events so you can see how far the stock will probably fall. \n\nThey effectively filter the noise out of the news and just focus on a couple dozen event types that really shake stock prices: hedge fund investor moves, layoffs, shorts, FDA approvals, leadership changes, Amazon new product launches, and a couple dozen other types. Unlike the technical pattern alert systems out there I’ve seen, it focuses on real news, which I like, as I feel pattern trading is often a lot like staring at clouds and making shapes out of them in your mind.\n\nFor the big companies everyone watches, they don’t beat news alerts. But for the bulk of the companies you’ve never heard of or have forgotten about, it flags a lot of opportunities and companies on the rise.\n\nMost of the time I trade with the information. Sometimes I use it to find stocks for longer term plays. Like Zacks, they put out a lot of opportunities so any analysis here is going to be biased by what I’m choosing to act on. But they publish the success rate and show all past alerts so the past performance is embedded in the platform under each strategy, which is nice.\n\nThe winning rates for their strategies range from a high of 90% to a low of 50%, with most in the 70% range. You can alter the outcomes by adjusting the filters for the types of stocks. I don’t like to buy commodities and microcaps generally, as the prices fluctuate too much on factors beyond the company’s control, so I filter those out.\n\nLately, I’ve been trading on their layoffs scenario, which tracks companies firing people. If you filter for just expensive stocks that are firing people to grow earnings, you can get to 80% accuracy in price prediction. I’ve noticed some events cause the share prices to pop right away, so I often wait for the first selloff before entering the trade.\n\n**Here are the alerts I opted to act on and how they turned out**. I’m noting hold times since it’s not a buy and hold forever system though I supposed you could for some stocks.\n\n10.21.21 - Qualcomm. Return: stock rose +50% in 1 month. Traded options for +300% gain.  \n11.11.21 - Northern Gas (NOG). Return: +45%. I held for 5 months.  \n12.9.21 - CVS. return: +60% in 1 month (options)  \n11.18.21 - BLDR. Return: +67% in 4 days (options)  \n12.04.21 Signature Bank SBNY. Return: +16% in 1 month. I then traded a couple more times on it as it was doing well until the Crypto crash. It holds a lot of staked Bitcoin.\n\n12.6.21 Silicon Motion (SIMO). +25% in 2 months. Still like this semi and will buy back. They do memory chips and had been killing it. It was hard to find a cheap semi at one point but this one always traded at a reasonable p/e.\n\n12.9.21 Labcorp (LH): +8% in 1 month but I held it too long and exited down -10% due to covid rates dwindling and testing volumes decreasing\n\n12.15.21 - Broadcom (AVGO). Return: 0% Sold off when war started.   \n2.3.22 - Quest (DGX). Return: +50% in 1 month via option trade  \n2.15.22 - Upstart (UPST): Return: +30% on options in 1 week. I had owned this stock already and was trading it off and on for about a year..\n\n2.17.22 Blocked by mod bots from showing: +50% in 2 days   \n2.24.22 - ALSN (Allison Transmission ). Return: +8% in 1 month  \n3.11.22 - Applied Materials (AMAT). Return: +4% in a week.  \n3.17.22 - Lockheed Martin (LMT): Return: +70% in 3 weeks (option trade on news Germany was buying planes)\n\n3.17.22 - CMC Steel. Return: +10% in 1 month\n\n3.31.22 - LGVN. Return: +20% in 1 day.   \n5.9.22 - TWTR. Return +100% on puts in 1 mo. This was the “Elon will back out” trade a big hedge fund was betting on, so I joined them. A short would’ve worked too.\n\n5.24.22 - Digital Ocean (DOCN): Returns TBD. Up 8% on equity but I’m selling covered calls for an extra 20% annually. I really like this company. It’s like a mini AWS that is more cost effective for small businesses.\n\n6.15.22 - Space company. +50% in two days\n\n6.24.22 - Digital Turbine (APPS). +31% in 2 months. I think this was mostly luck given the timing of the bear market rally.\n\n6.28.22 - Alibaba (BABA). -30% on options in 3 weeks. Can’t seem to get a break on BABA.\n\n7.14.22 - Pinterest (PINS). +30% on hedge fund moves\n\n7.27.22 - Mining company. return: -10% on option puts. Still puzzled why the stock is up.\n\n7.28.22  +4% and holding. They are one of the only medicines for monkeypox.   \n8.12.22 - Peloton (PTON). +10% in a day on its layoff news\n\n8.15.22  -3%. It makes solar cells in China and is growing revenues by triple digits. \n\n&#x200B;\n\n**3. THE FOOL**\n\nI resisted trying out the Fool for years because they wrote so many articles and ads touting their stock picks that I assumed they had to be full of it. But, when I had enough money in the account, I decided to try it out and see if they maybe could save me some time finding stocks early or if they were the cause of certain pump and dumps I was watching.\n\n**TLDR**:\n\n* They pick good, overvalued growth stocks but they don’t try to time the market at all because they want 5 year hold times, which can lead to big drawdowns while you wait\n* I would’ve lost a fortune had I taken much of their advice. However, if you have a decade long time horizon and can stomach 75% pullbacks, the stocks they recommend will probably come out ahead\n* They repurpose recommendations from different subscription tiers, often using lower tier recs to increase the returns of higher level subscriptions\n* They make a lot of recommendations. It’s time consuming to keep up.\n* Big range of prices from $100/yr to $5,000/yr and they upsell a lot\n\nThey had a lot of subscription options to choose from that range from a hundred bucks or so a year to $5K per year. I signed up for a few of them, including their stock advisor, IPO one, and cloud innovators and small caps service. I should note that the lists they provide overlap enormously, so they clearly repurpose their recommendations and charge you more to get the same recs again and again.\n\nFor the cloud services recommendations, I found they generally picked out solid growth companies (DOCN, DOCU, ESTC,etc) but too late, after the stocks were already richly valued. So I traded them instead of buying them. Below are the email recommendations they sent out I saved.\n\n**12/17/21 Buy Recommendations W/Subsequent Performance Since Then**\n\nIntel (INTC): -29%\n\nJFrog (FROG): -17%\n\nProcore (PCOR): -18%\n\n**12/14/21 Recommendations W/Subsequent Performance Since Then**\n\nSell Cloudflare (NET). Return since: -41%\n\nBuy Autodesk (ADSK). Return since: -11.5%\n\nBuy Crowdstrike (CRWD). Return since: +1.12%\n\nBuy Docusign (DOCU). Return since: -52%\n\nBuy Ncino (NCNO). Return since: -35%\n\nBuy Twilio (TWLO). Return since:-66%\n\nBuy Zoom (ZM). Return since: -40%\n\n**I Tracked Every investment from their Small Caps Playbook List from January 2021. Here are their returns since then.**\n\n* **Percent Winners: 33%**\n* **Avg return per rec: -25%**\n\n1. Redacted by mods -88%\n2. Redacted by mods: +7%\n3. Camping World (CWH): +20%\n4. Flugenics (FLGT): 0%\n5. Ad company (blocked by mods): -68%\n6. Inspire Medical Systems: +14%\n7. Blocked by mods: -34%\n8. NCino: -48%\n9. Blocked by mods: 0%\n\nI kept emails of other recommendations, though I admit this list is not complete since they only sent emails containing the rec half the time. The rest of the time they send you to their website to watch a 30-minute webinar of their picks in the middle of the work day, which was strange to me and defeated my purpose of saving time digging through stock screeners. I tracked from the next day’s opening price.\n\n**StockAdvisor**\n\n2.3.22 Buy ABNB. Return Since: -17%\n\n1.6.22 Buy Confluent CFLT: Return since: -59%\n\n12.20.21 Sell Healthequity. Return since: +38%\n\n12.20.21 Sell Biotech company (blocked by mods). Return since: -69%\n\n12.20.21 Sell Grand Canyon Education. Return since: +1%\n\n12.20.21 Sell Markel. Return since: +3.34%\n\n12.20.21 Sell Ollie’s. Return since: +41%\n\n12.16.21 Buy ROKU: Return since: -72%\n\n12.2.21 Buy DOCN: Return since: -48%\n\n10.7.21 Buy SHOP. Return Since: -70%\n\n10.7.21 BUY DOCN: Return since: -42%\n\n9.23.21 Buy UPST. Return since: -90%\n\n**IPO Trailblazer:**\n\n1.31.22 Buy Digital Ocean (DOCN). Return since: -20%\n\n1.31.22 Buy Confluent (CFLT). Return since: -51%\n\n1.31.22 Buy Roblox (RBLX). Return since: -25%\n\n1.31.22 Buy Docebo (DCBO). Return since: -36%\n\n&#x200B;\n\n**4. INVESTORS PLACE**\n\n**TLDR:**\n\n* Mostly recommend long-term, long shot stocks\n* Best recommendations are free. Most paid recommendations are mediocre at best\n* News is wrong sometimes\n* They are good at spotting long-term trends in where the new money is flowing to, e.g. thematic investing (online gambling, EVs, rare minerals, etc). I derived value from seeing companies linked to these trends I may not have heard of otherwise.\n\nThey make an obscene amount of recommendations across their blog and have many subsidiary newsletter services and promotional picks, so my tracking here is admittedly biased, as I only tracked what I ended up buying. Like Fool, they have a very long investing horizon and may end up being right…years from now. They make recommendations based on thematic trends, e.g. EVs, cybersecurity, etc. However, they also push recommendations based on events or news.\n\nI signed up for Matt McCall’s Investment Opportunities and followed their website recommendations. The newsletter divided up stock recommendations along long-term thematic investing trends like AI, 5G, EVs, online gambling, precious metals, crypto, data analytics, etc).\n\nTheir basic principal is long-term investing along big emerging trends. There were about 50 stocks or so in the portfolio at any given time, but since they do long-term investing, many had been in there for years and they offered no advice on how to enter a trade they had entered 4 years ago. So I never did.\n\nHere are the ones they recommended as buys that I actually bought:\n\n**Pct of Recommendations Up: 27%**\n\n**AVG Return**: Not able to calculate this since I didn’t take advice to hold long term for most\n\nEV Maker. Return: -100%\n\nI purchased some call options in this EV company (name blocked by mods) because they made an announcement the company was a shoe-in to get an $8B EV supplier contract with the U.S. Postal Service. They claimed there were no other competitors that made EVs and therefore this would be a game changer for the company. I didn’t do my own due diligence, stupidly. A few weeks later, the award went to Oshkash, a defense contractor most known for making military vehicles. Oshkash[ partnered](https://www.caranddriver.com/news/a36826291/ford-supplier-usps-postal-truck/) with Ford on the contract to make the EVs. I lost 100% of my call options on this poorly sourced news piece.  \n\n\n7.15.21. Buy SWBI. Smith and Wesson: -40% since then. I sold it when there was a pop for breakeven returns after a shooting, which triggered an increase in price, sadly.\n\n1.4.21 Buy Chinese Pharma. Return: -48%\n\nThe return here has not been good as of late but it was up and I’m holding anyway as this company is the gatekeeper for a lot of large Pharmaceutical companies (Novartis, AstraZeneca, Amgen) to get into the Chinese market. In my view, it was a good recommendation and was largely up until recently.\n\n1.21.21. BUY (Block by mod bots): Return: +100% or 0% Correctly predicted the stock would double. It did, then gave up 100% of its gains. Glad I sold it when it doubled.\n\n1.22.21 Buy ad company (blocked by mods). Return: -76%. My stop loss triggered at -12%.\n\n2.1.21 Blocked by mod bots (rare earth minerals company). Return: +32% This was a good pick. I actually bought on the rec and made about 50% from trading options and selling covered calls. I would not have known about this stock without them. I plan to buy it back at 25. They are one of the few providers of the rare earth minerals in every electronic outside of China.\n\n2.4.21 Buy ACAD - Acadia Pharmaceuticals. Return: -71%. Their report cited 30% revenue growth and a robust pipeline of drugs. Revenue is around 17% growth now. At one point it had doubled in value. I’m still holding. My lesson learned: trade biotechs, don’t hold them.\n\n2.5.21 Buy REDACTED BY MODS. Return: -60%\n\nStraight downhill since the recommendation. Touted as a cutting edge AI/Machine learning data analytics company I bought 100 shares. Revenues are up 50% y/y but I sold it in February 2022 for a -20% loss.\n\n2.10.21 Buy rare earth minerals company. Return: +69%\n\nAnother good pick in a sector I knew nothing about prior to their recommendation. I have since sold it but was up +60% when I closed out. I will buy it again at some point when commodity prices have cooled.\n\nFeb 2021 Buy ILMN (Illumina - genetics company). Return since: -49% They pushed this stock hard and it tanked after each[ recommendation](https://investorplace.com/2021/08/ilmn-stock-will-be-unstoppable-once-the-grail-acquisition-gets-approved/), which made me believe it was a pump and dump job. I traded options on this one and cut losses -28%.\n\n2.19.21. Buy (blocked by mod bots) Return: -94% Thankfully stop lossed this one at -7%.\n\nFeb 26 2021 Buy FTCH (Farfetch 2nd hand clothing): Return: -85% I traded options on this one, using their[ recommendation](https://investorplace.com/hypergrowthinvesting/2021/02/farfetch-stock-buy-the-dip-in-ftch/) as the pump I dumped and made 20%.\n\n2.5.21. Buy (Blocked by mod bots). Return: -72%. Still holding. They offer sports gambling online and were growing revenues 75% y/ but it’s slowed to 16% growth.\n\n2.10.21 Buy online gambling co (blocked by mods). Return: -15%. Bought this one as the online gambling is doing well. We shall see.\n\n12.17.21 Buy NIO. Return since: -55%. I traded a few options on it but generally think EVs are overvalued and risky given the huge capital expenditures and exposure to macroeconomic issues. I ended up a few percent as I sold after an initial bump.\n\n&#x200B;\n\nNote: Wrote this a week ago and much of the recs I couldn't put in because of the mods banning discussion of them",
        "created_utc": 1661855480.0,
        "subreddit_name": "stocks",
        "comments": 214
    }
]