[
    {
        "title": "Bloomberg: US Considers a Rare Antitrust Move: Breaking Up Google",
        "score": 3303,
        "url": "https://www.reddit.com/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/",
        "content": "A rare bid to break up Alphabet Inc.’s Google is one of the options being considered by the Justice Department after a landmark court ruling found that the company monopolized the online search market, according to people with knowledge of the deliberations.\n\nThe move would be Washington’s first push to dismantle a company for illegal monopolization since unsuccessful efforts to break up Microsoft Corp. two decades ago. Less severe options include forcing Google to share more data with competitors and measures to prevent it from gaining an unfair advantage in AI products, said the people, who asked not to be identified discussing private conversations.\n\nRegardless, the government will likely seek a ban on the type of exclusive contracts that were at the center of its case against Google. If the Justice Department pushes ahead with a breakup plan, the most likely units for divestment are the Android operating system and Google’s web browser Chrome, said the people. Officials are also looking at trying to force a possible sale of AdWords, the platform the company uses to sell text advertising, one of the people said.\n\nThe Justice Department discussions have intensified in the wake of Judge Amit Mehta’s Aug. 5 ruling that Google illegally monopolized the markets of online search and search text ads. Google has said it will appeal that decision, but Mehta has ordered both sides to begin plans for the second phase of the case, which will involve the government’s proposals for restoring competition, including a possible breakup request.\n\nAlphabet shares fell as much as 2.5% to $160.11 in after-hours trading before erasing some losses.\n\nA Google spokesman declined to comment on the possible remedy. A Justice Department spokeswoman also declined to comment.\n\nThe US plan will need to be accepted by Mehta, who would direct the company to comply. A forced breakup of Google would be the biggest of a US company since AT&T was dismantled in the 1980s.\n\nJustice Department attorneys, who have been consulting with companies affected by Google’s practices, have raised concerns in their discussions that the company’s search dominance gives it advantages in developing artificial intelligence technology, the people said. As part of a remedy, the government might seek to stop the company from forcing websites to allow their content to be used for some of Google’s AI products in order to appear in search results.\n\n**Breakup**\n\nDivesting the Android operating system, used on about 2.5 billion devices worldwide, is one of the remedies that’s been most frequently discussed by Justice Department attorneys, according to the people. In his decision, Mehta found that Google requires device makers to sign agreements to gain access to its apps like Gmail and the Google Play Store.\n\nThose agreements also require that Google’s search widget and Chrome browser be installed on devices in such a way they can’t be deleted, effectively preventing other search engines from competing, he found.\n\nMehta’s decision follows a verdict by a California jury in December that found the company monopolized Android app distribution. A judge in that case hasn’t yet decided on relief. The Federal Trade Commission, which also enforces antitrust laws, filed a brief in that case this week and said in a statement that Google shouldn’t be allowed “to reap the rewards of illegal monopolization.”\n\nGoogle paid as much as $26 billion to companies to make its search engine the default on devices and in web browsers, with $20 billion of that going to Apple Inc.\n\nMehta’s ruling also found Google monopolized the advertisements that appear at the top of a search results page to draw users to websites, known as search text ads. Those are sold via Google Ads, which was rebranded from AdWords in 2018 and offers marketers a way to run ads against certain search keywords related to their business. About two-thirds of Google’s total revenue comes from search ads, amounting to more than $100 billion in 2020, according to testimony from last year’s trial.\n\nIf the Justice Department doesn’t call for Google to sell off AdWords, it could ask for interoperability requirements that would make it work seamlessly on other search engines, the people said.\n\n**Data Access**\n\nAnother option would require Google to divest or license its data to rivals, such as Microsoft’s Bing or DuckDuckGo. Mehta’s ruling found that Google’s contracts ensure not only that its search engine gets the most user data – 16 times as much as its next closest competitor — but that data stream also keeps its rivals from improving their search results and competing effectively.\n\nEurope’s recently enacted digital gatekeeper rules imposed a similar requirement that Google make available some of its data to third-party search engines. The company has said publicly that sharing data can pose user privacy concerns, so it only makes available information on searches that meet certain thresholds.\n\nRequiring monopolists to allow rivals to have some access to technology has been a remedy in previous cases. In the Justice Department’s first case against AT&T in 1956, the company was required to provide royalty-free licenses to its patents.\n\nIn the antitrust case against Microsoft, the settlement required the Redmond, Washington, tech giant to make some of its so-called application programming interfaces, or APIs, available to third-parties for free. APIs are used to ensure that software programs can effectively communicate and exchange data with each other.\n\n**AI Products**\n\nFor years, websites have allowed Google’s web crawler access to ensure they appear in the company’s search results. But more recently some of that data has been used to help Google develop its AI.\n\nLast fall, Google created a tool to allow websites to block scraping for AI, after companies complained. But that opt-out doesn’t apply to everything. In May, Google announced that some searches will now come with “AI Overviews,” narrative responses that spare people the task of clicking through various links. The AI-powered panel appears underneath queries, presenting summarized information drawn from Google search results from across the web.\n\nGoogle doesn’t allow website publishers to opt-out of appearing in AI Overviews, since those are a “feature” of search, not a separate product. Websites can block Google from using snippets, but that applies to both search and the AI Overviews.\n\nWhile AI Overviews only appear on a fraction of searches, the feature’s roll-out has been rocky after some excerpts offered embarrassing suggestions, like advising people to eat rocks or to put glue on pizza.\n\nhttps://www.bloomberg.com/news/articles/2024-08-13/doj-considers-seeking-google-goog-breakup-after-major-antitrust-win",
        "created_utc": 1723582995.0,
        "subreddit_name": "stocks",
        "comments": 598
    },
    {
        "title": "The iPhone 15 may be obsolete faster than any model in history",
        "score": 2735,
        "url": "https://9to5mac.com/2024/08/13/the-iphone-15-may-be-obsolete-faster-than-any-model-in-history/",
        "content": "",
        "created_utc": 1723570548.0,
        "subreddit_name": "apple",
        "comments": 919
    },
    {
        "title": "Apple Likely Won't Charge for Apple Intelligence Features Until At Least 2027",
        "score": 778,
        "url": "https://www.macrumors.com/2024/08/12/apple-intelligence-fees-2027/",
        "content": "",
        "created_utc": 1723539497.0,
        "subreddit_name": "apple",
        "comments": 252
    },
    {
        "title": "iPhone SE 4 Likely to Feature 8GB of RAM for Apple Intelligence",
        "score": 748,
        "url": "https://www.macrumors.com/2024/08/13/iphone-se-4-8gb-ram-apple-intelligence/",
        "content": "",
        "created_utc": 1723555713.0,
        "subreddit_name": "apple",
        "comments": 283
    },
    {
        "title": "NVDA FOMO",
        "score": 9182,
        "url": "https://i.redd.it/d4pjohipndid1.png",
        "content": "",
        "created_utc": 1723531397.0,
        "subreddit_name": "wallstreetbets",
        "comments": 463
    },
    {
        "title": "Apple AirPods Pro 3 Rumors and Speculations Point to Major Upgrades for 2025",
        "score": 3,
        "url": "https://www.headphonesty.com/2024/08/apple-airpods-pro-3-rumors/",
        "content": "",
        "created_utc": 1723527097.0,
        "subreddit_name": "AAPL",
        "comments": 2
    }
]