[
    {
        "title": "Meta adds $200 billion to market cap in one day, largest surge in stock market history",
        "score": 3639,
        "url": "https://www.reddit.com/r/stocks/comments/1ah7zs5/meta_adds_200_billion_to_market_cap_in_one_day/",
        "content": "Meta shares are up 20% this morning, after the company surpassed analyst expectations and beat earnings. This growth took the company from a market cap near $1 trillion to a market cap of about $1.2 trillion, good for a $200 billion surge, possibly the largest in history. \n\nMeta also announced a $50 billion stock buyback and a new shareholder dividend. \n\nhttps://www.bloomberg.com/news/articles/2024-02-02/meta-s-meta-200-billion-surge-is-biggest-in-stock-market-history",
        "created_utc": 1706892069.0,
        "subreddit_name": "stocks",
        "comments": 570
    },
    {
        "title": "Tim Cook teases Apple AI announcement ‘later this year’",
        "score": 399,
        "url": "https://www.reddit.com/r/stocks/comments/1agtkhe/tim_cook_teases_apple_ai_announcement_later_this/",
        "content": "Apple CEO Tim Cook teased that Apple may have an artificial intelligence announcement later this year during a call with analysts after the company reported fiscal first-quarter earnings.\n\nWhile Cook’s remarks on Thursday did not include many details, they did indicate that Apple wants to compete with Microsoft, Google, Amazon, OpenAI and other technology companies working on cutting-edge AI models that can generate text and images.\n\n“As we look ahead, we will continue to invest in these and other technologies that will shape the future,” Cook said during a call with analysts. “That includes artificial intelligence where we continue to spend a tremendous amount of time and effort, and we’re excited to share the details of our ongoing work in that space later this year.”\n\nGenerative AI started drawing significant attention from technology companies and investors starting in 2022, after OpenAI released ChatGPT and image generators rapidly improved. Apple did not announce an advanced AI model last year, although the company has long invested in similar machine learning technology in its chips and software, which can, for example, identify people or pets inside photographs.\n\nApple typically announces new software in June at its annual developer’s conference, WWDC. Last year, the company announced an autocorrect feature for the iPhone keyboard based on a transformer-based language model, which shares the same underlying technology as GPT. But Apple never used the phrase “artificial intelligence” during the presentation, preferring the more academic term “machine learning.”\n\n“Let me just say that I think there’s a huge opportunity for Apple with Gen AI and AI, without getting into more details and getting out in front of myself,” Cook said.\n\nSource: https://www.cnbc.com/2024/02/01/tim-cook-teases-apple-ai-announcement-later-this-year.html",
        "created_utc": 1706842931.0,
        "subreddit_name": "stocks",
        "comments": 147
    },
    {
        "title": "Apple workers outnumbered customers at Vision Pro launch in downtown San Francisco",
        "score": 2454,
        "url": "https://www.sfgate.com/tech/article/apple-vision-pro-sf-union-square-launch-crowd-18644828.php",
        "content": "",
        "created_utc": 1706914272.0,
        "subreddit_name": "apple",
        "comments": 440
    },
    {
        "title": "Apple Vision Pro is 'tomorrow's technology today,' says Tim Cook",
        "score": 1241,
        "url": "https://appleinsider.com/articles/24/02/02/apple-vision-pro-is-tomorrows-technology-today-says-tim-cook",
        "content": "",
        "created_utc": 1706887179.0,
        "subreddit_name": "apple",
        "comments": 477
    },
    {
        "title": "Tim Cook confirms Apple’s generative AI features are coming “later this year”",
        "score": 1068,
        "url": "https://www.theverge.com/2024/2/1/24058647/apple-ceo-tim-cook-teases-generative-ai-iphone",
        "content": "",
        "created_utc": 1706838612.0,
        "subreddit_name": "apple",
        "comments": 205
    },
    {
        "title": "Apple CEO Tim Cook Compares Vision Pro 'Moment' to iPhone and Mac",
        "score": 626,
        "url": "https://www.macrumors.com/2024/02/02/tim-cook-on-vision-pro-moment/",
        "content": "",
        "created_utc": 1706911535.0,
        "subreddit_name": "apple",
        "comments": 358
    },
    {
        "title": "What are AAPL's AI strategies?",
        "score": 3,
        "url": "https://www.reddit.com/r/AAPL/comments/1ah5hao/what_are_aapls_ai_strategies/",
        "content": "I'm quite surprised that this isn't something that people talk about",
        "created_utc": 1706885482.0,
        "subreddit_name": "AAPL",
        "comments": 3
    }
]