[
    {
        "title": "Tesla Autopilot has 'critical safety gap' linked to hundreds of collisions: NHTSA",
        "score": 444,
        "url": "https://www.reddit.com/r/stocks/comments/1ce2p7z/tesla_autopilot_has_critical_safety_gap_linked_to/",
        "content": "Federal authorities say a “critical safety gap” in Tesla’s Autopilot system contributed to at least 467 collisions, 13 resulting in fatalities and “many others” resulting in serious injuries.\n\nThe findings come from a National Highway Traffic Safety Administration analysis of 956 crashes in which Tesla Autopilot was thought to have been in use. The results of the nearly three-year investigation were published Friday.\n\nTesla’s Autopilot design has “led to foreseeable misuse and avoidable crashes,” the NHTSA report said. The system did not “sufficiently ensure driver attention and appropriate use.”\n\nNHTSA’s filing pointed to a “weak driver engagement system,” and Autopilot that stays switched on even when a driver isn’t paying adequate attention to the road or the driving task. The driver engagement system includes various prompts, including “nags” or chimes, that tell drivers to pay attention and keep their hands on the wheel, as well as in-cabin cameras that can detect when a driver is not looking at the road. \n\nThe agency also said it was opening a new probe into the effectiveness of a software update Tesla previously issued as part of a recall in December. That update was meant to fix Autopilot defects that NHTSA identified as part of this same investigation.\n\nThe voluntary recall via an over-the-air software update covered 2 million Tesla vehicles in the U.S., and was supposed to specifically improve driver monitoring systems in Teslas equipped with Autopilot.\n\nNHTSA suggested in its report Friday that the software update was probably inadequate, since more crashes linked to Autopilot continue to be reported.\n\nIn one recent example, a Tesla driver in Snohomish County, Washington, struck and killed a motorcyclist on April 19, according to records obtained by CNBC and NBC News. The driver told police he was using Autopilot at the time of the collision.\n\nThe NHTSA findings are the most recent in a series of regulator and watchdog reports that have questioned the safety of Tesla’s Autopilot technology, which the company has promoted as a key differentiator from other car companies.\n\nOn its website, Tesla says Autopilot is designed to reduce driver “workload” through advanced cruise control and automatic steering technology.\n\nTesla has not issued a response to Friday’s NHTSA report and did not respond to a request for comment sent to Tesla’s press inbox, investor relations team and to the company’s vice president of vehicle engineering, Lars Moravy.\n\nFollowing the release of the NHTSA report, Sens. Edward J. Markey, D-Mass., and Richard Blumenthal, D-Conn., issued a statement calling on federal regulators to require Tesla to restrict its Autopilot feature “to the roads it was designed for.”\n\nOn its Owner’s Manual website, Tesla warns drivers not to operate the Autosteer function of Autopilot “in areas where bicyclists or pedestrians may be present,” among a host of other warnings.\n\n“We urge the agency to take all necessary actions to prevent these vehicles from endangering lives,” the senators said.  \n\nEarlier this month, Tesla settled a lawsuit from the family of Walter Huang, an Apple engineer and father of two, who died in a crash when his Tesla Model X with Autopilot features switched on hit a highway barrier. Tesla has sought to seal from public view the terms of the settlement.\n\nIn the face of these events, Tesla and CEO Elon Musk signaled this week that they are betting the company’s future on autonomous driving.\n\n“If somebody doesn’t believe Tesla’s going to solve autonomy, I think they should not be an investor in the company,” Musk said on Tesla’s earnings call Tuesday. He added, “We will, and we are.”\n\nMusk has for years promised customers and shareholders that Tesla would be able to turn its existing cars into self-driving vehicles with a software update. However, the company offers only driver assistance systems and has not produced self-driving vehicles to date.\n\nHe has also made safety claims about Tesla’s driver assistance systems without allowing third-party review of the company’s data.\n\nFor example, in 2021, Elon Musk claimed in a post on social media, “Tesla with Autopilot engaged now approaching 10 times lower chance of accident than average vehicle.”\n\nPhilip Koopman, an automotive safety researcher and Carnegie Mellon University associate professor of computer engineering, said he views Tesla’s marketing and claims as “autonowashing.” He also said in response to NHTSA’s report that he hopes Tesla will take the agency’s concerns seriously moving forward.\n\n“People are dying due to misplaced confidence in Tesla Autopilot capabilities. Even simple steps could improve safety,” Koopman said. “Tesla could automatically restrict Autopilot use to intended roads based on map data already in the vehicle. Tesla could improve monitoring so drivers can’t routinely become absorbed in their cellphones while Autopilot is in use.”\n\nSource: https://www.cnbc.com/2024/04/26/tesla-autopilot-linked-to-hundreds-of-collisions-has-critical-safety-gap-nhtsa.html",
        "created_utc": 1714182190.0,
        "subreddit_name": "stocks",
        "comments": 157
    },
    {
        "title": "It’s okay to admit that you’re wrong sometimes, Apple",
        "score": 1692,
        "url": "https://9to5mac.com/2024/04/26/okay-to-admit-youre-wrong-apple/",
        "content": "",
        "created_utc": 1714246539.0,
        "subreddit_name": "apple",
        "comments": 562
    },
    {
        "title": "Apple Asks Customers for Vision Pro Feedback",
        "score": 702,
        "url": "https://www.macrumors.com/2024/04/26/apple-asks-customers-for-vision-pro-feedback/",
        "content": "",
        "created_utc": 1714191293.0,
        "subreddit_name": "apple",
        "comments": 331
    },
    {
        "title": "Apple Explores Partnership with OpenAI for iPhone Generative AI for NASDAQ:AAPL by DEXWireNews",
        "score": 10,
        "url": "https://www.tradingview.com/chart/AAPL/9EMnVJHC-Apple-Explores-Partnership-with-OpenAI-for-iPhone-Generative-AI/9EMnVJHC",
        "content": "",
        "created_utc": 1714229575.0,
        "subreddit_name": "AAPL",
        "comments": 4
    }
]