[
    {
        "title": "what’s your current largest holding ",
        "score": 372,
        "url": "https://www.reddit.com/r/stocks/comments/1cpad1f/whats_your_current_largest_holding/",
        "content": "  I wanted to ask what is currently the largest holding in your portfolio, and could you share the reason behind it?\n\nFor me, it's Apple. It kind of happened accidentally as my other stocks experienced significant gains, and I decided to trim them. I believe Apple has great potential in AI development, and I expected it to continue to rise.\n\nI'm curious to know what you all have in your portfolios and the reasoning behind your largest holding.  \n\n ",
        "created_utc": 1715406574.0,
        "subreddit_name": "stocks",
        "comments": 1066
    },
    {
        "title": "Apple nears deal with OpenAI to power upcoming iPhone features with ChatGPT, says Bloomberg",
        "score": 232,
        "url": "https://www.reddit.com/r/stocks/comments/1cp6s0v/apple_nears_deal_with_openai_to_power_upcoming/",
        "content": "After talking with both OpenAI and Google about their AI models, Apple is nearing a deal to partner with OpenAI and leverage ChatGPT for upcoming iPhone features, reports Bloomberg. We can expect to see the workings of both companies as soon as next month, during Apple's Worldwide Developers Conference (WWDC).\n\nAccording to Mark Gurman, who spoke with \"people familiar with the matter,\" Apple first renewed talks with OpenAI to use the startup's tech to power new AI features coming to future iPhones, and is now nearing a formal partnership. \n\nThis comes shortly after Apple was reportedly in talks with Google to license Gemini for various iPhone services. \"Those discussions haven't led to an agreement, but are ongoing,\" says Gurman.\n\nThe news comes shortly after OpenAI announced it would be unveiling new ChatGPT features this upcoming Monday, a day before Google I/O. Talks between the Microsoft-backed AI company and Apple were apparently pretty far along, Bloomberg previously reported, as discussions of an agreement had occurred for some time.\n\nWhile Apple has plenty of researchers working on the company's own AI models, those don't seem quite ready to be the star of the show, so the company has been looking for outside help.\n\nThe next big iPhone update, iOS 18, will most likely be announced during WWDC on June 10. With Apple nearing a deal with OpenAI, we may see some familiar ChatGPT capabilities integrated across popular iOS features like iMessage, FaceTime, and, of course, Siri.\n\nIt's worth pointing out that OpenAI's ChatGPT app came to the iPhone about two months before landing on Android. Apple hasn't officially announced any AI features for the iPhone, but if you look at the Pixel 8 Pro or the Galaxy S24, you can get an idea of what the new features might be: generative AI photo editing, transcription of voice memos, webpage summarization, text generation, custom wallpapers, and so on.\n\nThere aren't any details about what iPhone models the new AI might be available on, but if Apple follows its competitors, the features will likely debut on the newest flagship and slowly trickle down to other models.\n\nSource: https://www.zdnet.com/article/apple-nears-deal-with-openai-to-power-upcoming-iphone-features-with-chatgpt-says-bloomberg/",
        "created_utc": 1715393866.0,
        "subreddit_name": "stocks",
        "comments": 85
    },
    {
        "title": "Apple is finalizing a deal with Open AI to add ChatGPT to iPhone",
        "score": 3152,
        "url": "https://fortune.com/2024/05/11/apple-openai-chatgpt-iphone-ios-18-google-gemini-ai-chatbot/",
        "content": "",
        "created_utc": 1715459617.0,
        "subreddit_name": "wallstreetbets",
        "comments": 355
    },
    {
        "title": "what’s your largest holding ",
        "score": 43,
        "url": "https://www.reddit.com/r/investing/comments/1cpadaw/whats_your_largest_holding/",
        "content": "  I wanted to ask what is currently the largest holding in your portfolio, and could you share the reason behind it?\n\nFor me, it's Apple. It kind of happened accidentally as my other stocks experienced significant gains, and I decided to trim them, part of rebalance effort. I believe Apple has great potential in AI development, and I expected it to continue to rise.\n\nI'm curious to know what you all have in your portfolios and the reasoning behind your largest holding.  \n\n ",
        "created_utc": 1715406601.0,
        "subreddit_name": "investing",
        "comments": 239
    }
]