[
    {
        "title": "Let’s find the next 100bagger for 2025",
        "score": 418,
        "url": "https://www.reddit.com/r/stocks/comments/1g9ari7/lets_find_the_next_100bagger_for_2025/",
        "content": "I posted a pretty popular thread a few years back regarding some stock predictions.\n\nIt was pretty lively and well received.\n\nAt the time, I was bullish on Joby Aviation, which I still own.  A lot of companies have shot up since then. Nvidia being one of the darlings. \n\nLet’s see if we can recreate another thread for speculation and fun for 2025\n\nI still think it is only a matter of time till Joby has its day. I am also bullish on Palantir long term.  Even holding since buying at $8 dollars.\n\nWhat companies do you think are in their infancy that may “pop? Let’s try to find the next 100 bagger!",
        "created_utc": 1729574667.0,
        "subreddit_name": "stocks",
        "comments": 175
    },
    {
        "title": "Best way to deal with a stock that 10x'd and is now a significant part of your portfolio?",
        "score": 187,
        "url": "https://www.reddit.com/r/stocks/comments/1g9l584/best_way_to_deal_with_a_stock_that_10xd_and_is/",
        "content": "NVDA is now over 50% of my portfolio, with 900% gains since I bought it a few years back.\n\nThis makes me uncomfortable, I would like to diversify and spread my risk out a bit to other stocks / ETFs. \n\nNVDA is sitting in a regular brokerage account currently, so if I sell any portion of it I would be subject to long term capital gains. I also have a 401k and a Roth IRA. Are there any creative ways to shift the stock over to those portfolios to save on tax?",
        "created_utc": 1729611523.0,
        "subreddit_name": "stocks",
        "comments": 258
    },
    {
        "title": "Peloton partners with Costco to sell Bike+ as it looks to reach young, wealthy customers",
        "score": 81,
        "url": "https://www.reddit.com/r/stocks/comments/1g9hynq/peloton_partners_with_costco_to_sell_bike_as_it/",
        "content": "Peloton’s stationary bikes will soon sell at Costco’s stores and on its website as the beleaguered fitness company looks for new ways to reach younger and affluent customers, Peloton is set to announce Tuesday.\n\nUnder the terms of the deal, Costco will offer Peloton’s Bike+ in 300 of its U.S. stores for $1,999, and on Costco.com for $2,199 between Nov. 1 and Feb. 15. It is a steep discount from the typical price of the Bike+, which is selling on Peloton’s website for $2,495. It is unclear how the price will compare to any holiday promotions Peloton plans to offer. \n\nThe new partnership comes during a state of transition for Peloton, which is being led by two board members after its former CEO Barry McCarthy stepped down earlier this year.\n\nLong focused on growth at all costs, Peloton has turned its sights to profitability and has had to become more creative as it tries to reach new users.\n\nAs sales fall and losses mount, Peloton is looking for cheaper ways to attract new customers. Costco is one way to get there, Dion Camp Sanders, Peloton’s chief emerging business officer, told CNBC in an interview. \n\n“We’ve been able to architect a deal with Costco that meets our needs with regard to profitable, sustainable unit economics, while at the same time delivering robust and clear value to Costco members,” said Camp Sanders. “We’ve structured this deal with Costco to both meet our needs for profitable, sustainable growth and getting us access to Costco’s very large net incremental audience.” \n\nCamp Sanders said Peloton’s partnership with Costco is only for a limited time because fitness is a seasonal category for the company, but Peloton hopes to keep building on the relationship and perhaps expand it to future locations both in the U.S. and abroad.\n\nThe deal with Costco gets Peloton onto the shelves of a retailer with a strong fan following and wealthier customers. The membership-based club has gained popularity as shoppers across all incomes prioritize value and try to get more for their money with bulk packs and private-label items.\n\nAs of Sept. 1, store traffic at Costco had increased 31% compared with the same period in pre-pandemic 2019, according to Placer.ai, an analytics company that estimates visits to locations based on smartphone data. \n\nCostco’s members are also getting younger. Those consumers prioritize health and wellness — and are willing to invest in it — in ways that older generations do not. \n\nAbout half of Costco’s new membership sign-ups last fiscal year came from people who were under 40 years old, and the average age of its 76 million members has fallen since the Covid-19 pandemic, Chief Financial Officer Gary Millerchip said on an earnings call in late September. \n\nAccording to Numerator, 36% of Costco’s customers have a household income of more than $125,000. Numerator has a panel of 150,000 U.S. consumers that is balanced to be representative of the country’s population.\n\nCamp Sanders said Costco’s members “have the disposable income to be able to afford our premium products,” and their lifestyles align with what Peloton offers. \n\n“Many of Peloton’s members are affluent, they often have larger homes in the suburbs and they also have life situations where Peloton fits a clear need,” said Camp Sanders. “Many Costco members are juggling families, they maybe have a busy career … and they’ve got the space in their home” to build their own gyms, he continued. \n\nCostco’s Executive Vice President of Merchandising Claudine Adamo declined to comment to CNBC.\n\nPeloton already sells its workout equipment through Amazon and Dick’s Sporting Goods, but has also been working to develop relationships with other companies that cater to similar customer bases. \n\nFor example, hundreds of Hyatt Hotel properties have Peloton equipment on site. As of this month, hotel members can earn points for completing workouts on the Peloton Bike and Row during their stay. \n\nIt also announced a deal with Truemed — the PayPal of the health savings account and flexible spending account world — that allows Peloton members to use pretax earnings to buy certain hardware products, including the Bike, Bike+ and Tread.\n\nSource: https://www.cnbc.com/2024/10/22/peloton-costco-partner-to-sell-bike-for-2024-holiday.html",
        "created_utc": 1729603205.0,
        "subreddit_name": "stocks",
        "comments": 101
    },
    {
        "title": "Walmart will start delivering prescriptions as CVS and Walgreens struggle",
        "score": 74,
        "url": "https://www.reddit.com/r/stocks/comments/1g9hzoe/walmart_will_start_delivering_prescriptions_as/",
        "content": "As CVS and Walgreens shutter hundreds of stores nationwide to shore up profits and investor sentiment, Walmart said Tuesday that it is offering a new option for customers: Delivering prescriptions to their doorsteps.\n\nThe nation’s largest retailer said deliveries are now available in six states: Arkansas, Missouri, New York, Nevada, South Carolina and Wisconsin. The company said in a news release that it expects to deliver prescriptions in 49 states by the end of January. Prescription deliveries will not be available in North Dakota due to state laws, Walmart said.\n\nThe prescription delivery service is another example of how Walmart is trying to outmatch competitors on convenience along with low prices. With the new service, customers can get a mix of items dropped off during the same delivery, such as a box of tissues, blanket or chicken noodle soup.\n\nWalmart’s new delivery offering could be another blow to drugstore chains, which are falling out of favor with consumers in a trend that has hit their profits and stock prices and forced them to reconsider their strategies. Still, it is unclear how much market share Walmart could win from CVS and Walgreens, both of which offer same-day, one-day and two-day prescription deliveries.\n\nTom Ward, chief e-commerce officer for Walmart U.S., said the company added pharmacy deliveries because of shopper demand.\n\n“This is actually the number one service requested by our customers,” he said.\n\nHe said Walmart tested the deliveries in several states and saw that customers took advantage of getting a mix of items, including the prescription, in a single delivery.\n\nWalmart’s delivery service will be available for new prescriptions and refills, the company said. It will cost $9.95 for a delivery, the standard price for Walmart doorstep deliveries, but will be free for members of Walmart+, the company’s membership program.\n\nHealth insurance plans will be applied to the transaction, like they would in the store, the company said.\n\nThe deliveries will come with a few more safety steps than Walmart’s other deliveries, the company said: Medications will be put into tamper-evident packaging. Customers can track orders in real time through Walmart’s app or website and get a photo in the app or by email when the prescription is delivered. And when a customer orders a new prescription and chooses delivery, they are prompted to do a consultation with the pharmacy by phone.\n\nMost of Walmart’s annual revenue in the U.S. – nearly 60% – comes from groceries, but health and wellness is a growing category for the company, according to the retailer’s most recent annual filing for the fiscal year that ended Jan. 31. Health and wellness accounts for about 12% of its annual revenue in the U.S. It includes pharmacy, over-the-counter drugs and other medical products, optical services and other clinical services.\n\nA new challenge for drugstores\n\nAs of Monday’s close, shares of Walmart were up around 54% for the year. Meanwhile, shares of CVS were down roughly 26% so far this year, while shares of Walgreens were down nearly 60%.\n\nCVS is the top U.S. pharmacy in terms of prescription drug revenue, holding more than 25% of the market share in 2023, according to Statista data released in March. Walgreens trailed behind with nearly 15% of that share last year, while Walmart held just 5% of that share.\n\nCVS and Walgreens are grappling with falling reimbursement rates for prescription drugs. Inflation, softer consumer spending and competition from Amazon, big-box retailers and grocery stores are making it difficult for them to turn a profit at the front of the store, which carries cleaning supplies, beauty products and pantry staples, among other items.\n\nCVS CEO Karen Lynch left the company and was replaced by David Joyner last week, as CVS faces pressure from Wall Street and, more recently, an activist investor to turn around its business. On top of the leadership shakeup, CVS plans to cut $2 billion in expenses over several years. That includes slashing less than 1% of its workforce, or roughly 2,900 jobs, on the corporate side of its business.\n\nThe company is also wrapping up a three-year plan to close 900 of its stores, with 851 locations closed as of August.\n\nWalgreens is similarly cutting costs, announcing last week that it will close roughly 1,200 stores over the next three years, which includes 500 in fiscal 2025 alone. The chain has around 8,700 locations in the U.S., a quarter of which it says are unprofitable.\n\nWalmart has faced its own financial challenges on the health-care side of the business. The discounter planned to bring its low-price spin to health care by opening clinics that offered doctor, dentist and therapy appointments for less.\n\nYet in the spring, Walmart shuttered all of the clinics, saying in a news release at the time that it couldn’t operate a profitable business because of “the challenging reimbursement environment and escalating operating costs.”\n\nSource: https://www.cnbc.com/2024/10/22/walmart-will-start-delivering-prescriptions-as-cvs-walgreens-struggle.html",
        "created_utc": 1729603284.0,
        "subreddit_name": "stocks",
        "comments": 29
    },
    {
        "title": "So What’s Next For Intel?",
        "score": 24,
        "url": "https://www.reddit.com/r/stocks/comments/1g9vv05/so_whats_next_for_intel/",
        "content": "Intel got a family of CPUs that have been dying on people this past year, announced laying off 15000 people, (!!Allegedly!!) got turned down by Broadcom for low yield on their\n18A process, Stock is down 55% YTD. That being said, they came up with lunar lake, and are now on par with the best in terms of power efficiency. I don't really know what they're up to on enterprise level, but heard that their latest Xeon server processors are promising and that Amazon will be partnering with them for custom chips. So, what are your prospects for the upcoming year? What must they do right and better not do wrong? How should we interpret next week's earnings reports?",
        "created_utc": 1729638536.0,
        "subreddit_name": "stocks",
        "comments": 35
    },
    {
        "title": "BEPC: Large Reactors and the Overlooked Nuclear Banger (LEU 2.0)",
        "score": 182,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1g9ljpz/bepc_large_reactors_and_the_overlooked_nuclear/",
        "content": "[Vogtle](https://preview.redd.it/m85u5mlkwbwd1.png?width=1015&format=png&auto=webp&s=f9554a635616f0c5042bb10047944119ad4e091c)\n\nI'm riding high on OKLO and LEU payouts (check the post history on for a recent 10x trade within two weeks). After a sector has been on fire for weeks week, the question becomes what is left that still has juice?\n\n**The answer: Large Reactors. Specifically Brookfield Renewable Corp (BEPC)**\n\n  \n**LARGE REACTORS**\n\nSMRs have been getting all the attention in the media. When Mag7 talks about nuclear - they talk about SMR. Why? Small is beautiful. And less intimidating. This is more about optics that strategy.\n\nLets get into the data: *Altman wants multiple 5 GW AI centers built across the countr*y.\n\nSMRs produce yield 10 MW to 300 MW. And that upper end is theoretical, because none are in production. Even assuming a 300 Mwe output, that is 15 reactors per data center.\n\nLet's take a step back. Is the gov really going to start building dozens of SMRs at once - before a single one is up and running and established with a proven performance and safety record? Especially after decades of building scarcely any reactors at all?\n\nFar, far too much risk. Yes, there will be a handful of SMRs built to prove out the technology. This may take around a decade. *And then* those need to for a number of years (and likely be iterated upon) before these is the confidence to deploy these widely.\n\n**In sum, to go from 0 to many SMRs will take decades.**\n\n**We don’t have decades. AI is a military horserace between the US and the rest of the world – particularly china – and in two decades the winner of that will already be decided.**\n\n  \nThe US needs to scale up nuclear energy production NOW. There is only one path to do that. And in sweeping report by the DOE - with industry and government as a target (i.e. no incentive to whitewash things by playing up SMRs) - the DOE outlines that plan:\n\n[https://liftoff.energy.gov/wp-content/uploads/2024/10/LIFTOFF\\_DOE\\_AdvNuclear-vX7.pdf](https://liftoff.energy.gov/wp-content/uploads/2024/10/LIFTOFF_DOE_AdvNuclear-vX7.pdf)\n\n  \nThe main parts of the report. \n\n- SMRs won't cut it for scaling out nuclear\n\n- They need \\*a single design of a large nuclear reactor\\*. \n\nIt must be a single design because of the realities of our national nuclear workforce. We don’t have the technical expertise to have folks going around being one type of nuclear plant, re-tooling, re-trained – and then building a different design.\n\n- They want to run with something tried and true. Something we know from many years already that gets the job done. That people in our nation already have experience building and maintaining. **That friends is the AP1000.**\n\n**- They want 5-10 new nuclear reactors \\*of that single design\\***\n\n**- They want that order to be placed before 2025**\n\n\n\nRelevant snips from the report:\n\n[Large Reactors are Will be The Bulk of Energy Production](https://preview.redd.it/9aektshonbwd1.png?width=624&format=png&auto=webp&s=367e220243be46d8185a744958e9818530fb68a5)\n\n[They Want to Order 5-10 Reactors in One Go](https://preview.redd.it/fcwok020obwd1.png?width=624&format=png&auto=webp&s=30c98e1c063e85c5f6b6c215f5d822713908a6f2)\n\n[AP1000 is the Design they Want](https://preview.redd.it/r01x3841obwd1.png?width=624&format=png&auto=webp&s=9c867e8ca8f5977fa0e704161e495ca6c102ebde)\n\n[They Want to Place these Orders Now](https://preview.redd.it/f37nrri9xbwd1.png?width=1053&format=png&auto=webp&s=b41798db75ddff864ceeb2d90d2c4984e0cba595)\n\n\n\n**INTERMISSION: PROJECT VOGTLE**\n\nWe are unambiguously on the eve on a nuclear renaissance. Yet there has basically only one major nuclear project in the US in the past four decades. *That project is Votgle.*\n\nLet that sink in.\n\nIf you happened to be a young buck in the 70s working on nuclear, maybe you have some experience on another major project. Odds are you are retired now, and it’s a long distant memory at best.  For absolutely everyone else – you only experience of a major reactor build is Votgle.\n\nProject Votgle was a beauty of a project. And what did they use? Westinghouse. In the 80s Westinghouse PWRs. And as recently as 2023, Westinghouse AP1000s.\n\nEveryone in the country has the same single reference for a major successful nuclear build-out. And it was built on the AP1000s…You now have to build 5-10 nuclear plants of a single design asap.\n\nWhat are you going to pick?\n\nUnderstanding Vogtle makes it very clear while the DOE is so bullish on AP1000s in the report.\n\nNow onto BEPC...  \n\n\n**BEPC: THE WESTINGHOUSE STAKE**\n\nWestinghouse builds the AP1000s. And Westinghouse was bought out a few years ago by a consortium including BEPC. Hence BEPC is basically only one of two ways you can get exposure to Westinghouse. \n\nhttps://preview.redd.it/752veemapbwd1.png?width=1340&format=png&auto=webp&s=6bb8b0209a2eb693b873e9262b9975df933a881d\n\nhttps://preview.redd.it/adwnem3hpbwd1.png?width=1050&format=png&auto=webp&s=99d40940a008486e0a3eff7aca09db83670019e4\n\nhttps://preview.redd.it/ruu2z75kpbwd1.png?width=1098&format=png&auto=webp&s=dbcfc93de40acb905f169b370058d5e542e23690\n\n\n\n**BEPC: THE MICROSOFT DEAL**\n\nYou may be familiar with CORZ, a bitcoin miner that has been running 300% on a deal for 200 MW of power. BEPC has a deal with MSFT for 50W. **That is 50x the power.** Let it sink in - \"largest ever corporate partnership\" and \"key enable of potentially one of the most significant technology innovations in history.\" This is not hyperbole. BEPC is a major player here.\n\n[https:\\/\\/bep.brookfield.com\\/sites\\/bep-brookfield-ir\\/files\\/Brookfield-BEP-IR-V2\\/2024\\/brookfield-renewable-corporate-profile-may-2024.pdf](https://preview.redd.it/n6ib4ccopbwd1.png?width=1070&format=png&auto=webp&s=8810295447003dc26912325356b808ef7a53ea0f)\n\n\n\n**BEPC: VALUATION AND CHART**\n\nWhat else is it important to know? The company is trading with a PE of \\~17 and dividend of 4%. This seems shockingly cheap compared to nearly every other nuclear trade. Or an energy supplier of any kind with key partnerships to the big AI players.\n\nThe chart to me is pure poetry. \n\nMy read - BEPC has seen very little of the froth hitting nuclear or energy in the past month - but over the past week the market is starting to wake up.\n\nMore or less the same setup when I picked up LEU calls that 10x'd once it rapidly re-rated. In that case I saw something that was starting to inflect, did a deep dive, liked what I saw and figured it had plenty more to run, and levered the fuck up.\n\nI think this could happen here as well. And on 30% move - which every nuclear play seems obligated to make, though at different times - the contracts are going to outright print.\n\nhttps://preview.redd.it/ib52jc15vbwd1.png?width=1395&format=png&auto=webp&s=ab8fbc11ff885279491b1d8dc02e3da8bd22ff9b\n\nIn sum, long af BEPC calls of various strikes and expiries.  \n",
        "created_utc": 1729612536.0,
        "subreddit_name": "wallstreetbets",
        "comments": 144
    },
    {
        "title": "TERM SOFR predicts 25bp rate cut. Never wrong.",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1g9ouc7/term_sofr_predicts_25bp_rate_cut_never_wrong/",
        "content": "For those who think rate cuts matter to their next investment:  \n[https://www.cmegroup.com/market-data/cme-group-benchmark-administration/term-sofr.html](https://www.cmegroup.com/market-data/cme-group-benchmark-administration/term-sofr.html)\n\nIf you sign up for free you can see the rates. Right now we're pricing in a 25bp cut, TERM SOFR has never been wrong.\n\nI think the market has priced in a 25bp cut in US and a 25bp (TIBOR) hike on Japan which is a 50bp spread, this will be a bit of a shock for the markets due to further unwinding of the \"Yen Carry\". So we probably get S&P downside 5%+ with a spike on VIX (40ish) shocking people who bet long on a rate cut.\n\nThis thesis works to crush bullish rate-cutters.\n\nUS Bonds are discounted right now which fits this thesis; the vacuum of money into bonds will be big basically needing to cover 75bp of cuts that are \"unpriced\".\n\nFurther evidence of this indexed move is in companies like SO, PM, LEN and etc. All did well after cuts and these have pulled back in anticipation of a run on all time highs while the market flounders.\n\nOther solids like MSFT have not \"outperformed\" either. This timidity all suggests they'll run on the rate cut. But for them to run it balances out the index at large opening that potential 5% pullback thesis. A nice solid dip on \"rotation\".",
        "created_utc": 1729620648.0,
        "subreddit_name": "investing",
        "comments": 9
    }
]