[
    {
        "title": "Tesla sells 1% of cars globally, yet is priced more than the companies combined that sell the other 99%",
        "score": 11478,
        "url": "https://www.reddit.com/r/stocks/comments/qmjr7o/tesla_sells_1_of_cars_globally_yet_is_priced_more/",
        "content": "The valuation on Tesla is now beyond the absurd.  \n\nWhilst European EV sales explode to presently 19% of all car sales this year, Tesla does not even make the top five EV sellers by company at a lowly 7%. (VW 25%; Stellantis 13%; Daimler 10%; BMW 10%; Hyundia-Kia 9%).\n\nTesla, unlike in the US, is simply being outsold by the vast array of alternative BEV models on sale particularly.  VW group alone offers the e-up, ID3 and ID4 (ID5 not yet on sale); Audi e-tron, e-tron Sportback e-tron GT and RS e-tron GT; Cupra Born; and Skoda Enyaq\n\nIn China Tesla has been pushed into 3rd place this year by BYD which has seen EV sales grow from 53K Q1; 98K.Q2; 183K Q3.  Tesla meanwhile has seen China quarterly sales for 2021 flattish at 69K, 62K and 75K.  China will likely sell 3 million EV's this year, half the worlds volume and Tesla sales are flat for the year.  Tesla might sell a lowly 9%.\n\nTesla dominates the US markets of course, where few EV models are on sale.  EV sales might be 3% of automotive sales.\n\nWhilst investors will assert these stats do not.matter and Tesla's valuation is all about  tech, batteries and robo-taxis, it still does not sell any car related tech beyond its own cars.  Take up of FSD is a lowly 11%.  It still buys it's battery cells.  By its own statements it has a level 2/3 driver assist whilst companies like Waymo are already starting to offer level 4/5 robo-taxis in cities like San Fran (a free trial program has commenced).\n\nWith Tesla slipping badly in the two biggest and mature EV markets globally, it's EV mkt share has fallen from near 18% highs in 2019 to 14.7% YTD in 2021.  With Europe and China likely to see 20% EV sales, the Tesla domination of global car mkts story is looking utterly flawed, yet its market capitalisation is now than the entire companies combined that sell 99% of cars and are adding EV's faster.\n\nTesla is frankly trading at utterly ludicrous levels given the clear reality of global EV market growth.\n\n(These figures all verifiable with CleanTechnica and InsideEVs)",
        "created_utc": 1636029919.0,
        "subreddit_name": "stocks",
        "comments": 2309
    }
]