[
    {
        "title": "Quick Reminder: Many Stock youtubers have financial incentive to keep you watching daily so they steer you toward short term trades.",
        "score": 2054,
        "url": "https://www.reddit.com/r/stocks/comments/pq7yae/quick_reminder_many_stock_youtubers_have/",
        "content": "If they told you invest in an index fund or buy and hold the best of FAANG+MSFT/NVDA. There would be no reason to watch their videos daily. Or their market open and close live streams. The views are how they make their money. Meet Kevin for example makes millions each month off the views.\n\nSo these financial youtubers talk about short term plays and high frequency trading so once one play is over you come back for the next. Or they talk about 5, 10, etc stocks they are buying each week.\n\nYes there is money made in swing/day trading there is also people who lose a lot of money and dont talk about it so you just here from the winners. Im just trying to say those youtubers arent there for long term advice. Some even do horrible stuff like have 50% of portfolio in TSLA or say they are buying options and will dump them into shares after the stock market has a rally that shouldnt be followed.",
        "created_utc": 1631910095.0,
        "subreddit_name": "stocks",
        "comments": 243
    },
    {
        "title": "Apple reportedly threatened to boot Facebook from the App Store over human trafficking concerns",
        "score": 47174,
        "url": "https://www.businessinsider.com/apple-threatened-to-kick-facebook-off-app-store-human-trafficking-2021-9",
        "content": "",
        "created_utc": 1631882081.0,
        "subreddit_name": "technology",
        "comments": 1930
    },
    {
        "title": "Tim Cook Faces Surprising Employee Unrest at Apple. Hundreds of current and former Apple workers are complaining about their work environment, a rarity for the once tight-lipped company.",
        "score": 11870,
        "url": "https://www.nytimes.com/2021/09/17/technology/apple-employee-unrest.html",
        "content": "",
        "created_utc": 1631917584.0,
        "subreddit_name": "apple",
        "comments": 1387
    },
    {
        "title": "How much revenue does Apple stand to lose due to the right to repair and the most recent court ruling?",
        "score": 4,
        "url": "https://www.reddit.com/r/AAPL/comments/pq2mae/how_much_revenue_does_apple_stand_to_lose_due_to/",
        "content": "",
        "created_utc": 1631893415.0,
        "subreddit_name": "AAPL",
        "comments": 15
    }
]