[
    {
        "title": "Insomniac, a top videogame developer's leaks reveal how much money Marvel makes as a licensor & panic over Microsoft's acquisition of Acti.",
        "score": 226,
        "url": "https://www.reddit.com/r/stocks/comments/19dnpw5/insomniac_a_top_videogame_developers_leaks_reveal/",
        "content": "*All the information here are already reported by other sources including Reuters, Nasdaq & Market Watch; nothing here comes from the leaks directly. This ransomware attack took place December 19 2023. After refusing a 2-million dollar ransom, the hackers dumped 1.7 terabyte of 1.3 million files. Important reveals:*\n\n............\n\n***\\*Marvel - Insomniac licensing terms for an upcoming game (X-men; one of 4 upcoming)***:\n\n*In the late 2010's Iger closed Disney's gaming divisions retaining a small staff whose sole function is to license out & creatively cooperate and supervise: Marvel Games, Lucasfilm Games...etc*. *The 2010's saw a shift in video gaming where emphasis shifted to making few games but of supreme quality, narrative and graphics. These games today are incredibly expensive costing at times $200-300mil*. *One of those games is Spiderman2 just released to become the fastest selling video game in Playstation history*. *In the leaks, licensing terms are defined by Marvel for the game developer:*\n\n***-Conditions on budget:*** *each game gets at least* ***$120 million*** *for production and* ***$30*** *million for marketing.*\n\n*-****Exclusivity:*** *Disney doesn't release licensed characters in any other video game; total of 4 up until* ***2035****.*\n\n***-Marvel Royalties:*** *several tiers depending on number of sales. If sales are above 7 million units: Disney gets* ***26% of net digital sales*** *(includes DLCs),* ***18% of physical sales***\\*, and finally\\* ***50% of bundled games***\\*.\\*\n\n*Disney has multiple deals with multiple game developers simultaneously. Marvel for example has deals with other game developers like Bethesda in addition to Insomniac. This also includes Star Wars, Indiana Jones, Avatar...etc. All that royalty almost completely goes to their bottom line having only to finance a small staff for licensing.*\n\n.............\n\n***\\*Microsoft's acquisition of Activision will leapfrog Sony past their current pillars:***\n\n*Sony allegedly goes into detail about how it views Microsoft's position moving forward. Described by Sony as \"the leapfrog,\" the slide details how Microsoft is aiming to build a mobile gaming store to compete with Apple and Google, as per previous information. It also details how Microsoft could build a comprehensive ecosystem across mobile, PC, and console, referring to Xbox Game Pass as \"GP\" throughout. Sony details how its \"pillars\" are \"dated,\" and behind Microsoft, referring to Microsoft's growing service game portfolio across titles like Sea of Thieves, Halo Infinite, and Minecraft. Sony also notes its need to \"respond,\" although its service game efforts have hit snags recently, with Destiny's upcoming expansion delayed, and The Last of Us Online wholly cancelled.*\n\n..............\n\n***\\*Video games have become more and more expensive, similar to films, compelling a change in strategy:***\n\n*Sony details how difficult it's getting to actually get a return on investment for AAA games — an issue that is plaguing the entire industry right now. Sony expresses how a $500 million game might not break even in the first year, which is upending how publishers are thinking about platforms like PC and mobile as they seek profitability and less risky investments.*\n\n*To that end, Sony's \"strategic pillars\" seem to detail an intent to eventually launch games more quickly, or even day one on Windows PCs, as part of its multi-platform pillar.*\n\n***............End of Article.............***\n\n***Sources:*** [*https://www.nasdaq.com/articles/insomniac-breach-leaks-marvel-x-men-gaming-details:-does-sony-fear-microsofts-strategy*](https://www.nasdaq.com/articles/insomniac-breach-leaks-marvel-x-men-gaming-details:-does-sony-fear-microsofts-strategy)\n\n[*https://www.windowscentral.com/gaming/microsoft-could-disrupt-and-threaten-playstation-business-sonys-alleged-xbox-fears-laid-bare-in-massive-hack*](https://www.windowscentral.com/gaming/microsoft-could-disrupt-and-threaten-playstation-business-sonys-alleged-xbox-fears-laid-bare-in-massive-hack)",
        "created_utc": 1706014274.0,
        "subreddit_name": "stocks",
        "comments": 62
    },
    {
        "title": "Mozilla’s ”Platform Tilt” Shows How Firefox Is Harmed by Apple, Microsoft",
        "score": 6344,
        "url": "https://www.howtogeek.com/mozilla-firefox-platform-tilt-launch/",
        "content": "",
        "created_utc": 1706016101.0,
        "subreddit_name": "technology",
        "comments": 642
    },
    {
        "title": "Apple Music to pay artists up to 10% higher royalties for music available in Spatial Audio",
        "score": 2095,
        "url": "https://www.musicbusinessworldwide.com/apple-music-to-pay-artists-up-to-10-higher-royalties-for-music-available-in-spatial-audio/",
        "content": "",
        "created_utc": 1706008381.0,
        "subreddit_name": "apple",
        "comments": 178
    },
    {
        "title": "Only 150+ apps have been designed specifically for Apple’s Vision Pro, so far",
        "score": 722,
        "url": "https://techcrunch.com/2024/01/22/only-150-apps-have-been-designed-specifically-for-apples-vision-pro-so-far/",
        "content": "",
        "created_utc": 1705995703.0,
        "subreddit_name": "apple",
        "comments": 247
    },
    {
        "title": "Apple Dials Back Car’s Self-Driving Features and Delays Launch to 2028",
        "score": 652,
        "url": "https://www.bloomberg.com/news/articles/2024-01-23/apple-car-ev-set-to-debut-in-2028-with-limited-autonomous-driving",
        "content": "",
        "created_utc": 1706035292.0,
        "subreddit_name": "apple",
        "comments": 303
    },
    {
        "title": "$2K to $50K in 90 Days - Options Trading Challenge (Day 1 +$250 Unrealized)",
        "score": 173,
        "url": "https://www.reddit.com/r/Daytrading/comments/19dd773/2k_to_50k_in_90_days_options_trading_challenge/",
        "content": "**Intro**\n\nAs the market has been rallying recently, I have been noticing an increase in the number of questions regarding getting started trading. People are asking where to begin, how much capital is required, what to trade, etc. So I've decided now is a good time to do one of these small account challenges publicly. Hopefully, this will provide some guidance for new traders looking to get started without much capital. I'd also like to prove the traders claiming trading short-term options is impossible and technical analysis doesn't work wrong.\n\n&#x200B;\n\n**Background**\n\nI have been in the market for 5-6 years and started trading options heavily in 2020. I got lucky with my first few months of trading which enabled me to get a lot of experience without losing any of my initial capital investment. I had some big gains and even bigger losers. It's been quite a grind and a rollercoaster of emotions. I finally started to get better in late 2021 and into 2022. I've been able to quit my job and have been profitable for a while now. I have traded several small accounts up over 1,000% and blew up my fair share as well.\n\n&#x200B;\n\n**Rules**\n\nI started today with a $2,000 cash account at Schwab and will be using Street Smart Edge to trade and mostly TradingView for charting, will sometimes use thinkorswim as well. I'm giving myself 90 days to hit my account target of $50k. I will allow myself one blowup, but will only refund the account with an additional $1k. I think this is a good idea because it can be hard to build a cushion early on and everyone who wants to attempt this should have more capital they are willing to risk outside of this account. So $3k is my max loss, if I hit that I will consider it a fail and end the challenge.\n\n&#x200B;\n\n**Trading** **Plan**\n\nI mostly prefer to trade SPY or SPX options, anywhere from 0DTE to 2-4 weeks out. I also trade QQQs and some individual stocks. Some positions will be day trades, others I may hold for 2-4 weeks. This is a very aggressive approach, which is usually how I trade.\n\n**Day 1 Trades**\n\nAMD and NVDA have probably been on everyone's radar lately, showing insane strength. A large percentage of my profit so far this year has been on AMD calls, so I've been actively looking for dips to buy. AMD opened at a new ATH this morning but sold off over 5% after an analyst downgrade. If you look at the AMD daily chart, you'll see that it bounced almost right at the previous ATH at $164.46.\n\nhttps://preview.redd.it/9z38y8tmh3ec1.png?width=1359&format=png&auto=webp&s=1c7d4d2f554a0cb5e6e23216721e0fc8e4f7bf96\n\nAround the same time, ES and NQ were trading slightly below their session lows, but UVXY was also near its session lows. UVXY also didn't react as it should have after a 20 point sell off from the highs on ES this morning. This told me that the break of the session low on ES and NQ was most likely going to cause a bounce. That gave me the confidence to long AMD at that level so I added 5 1/26 $170 calls. My analysis turned out to be correct. AMD started rallying with the rest of the market, ES and NQ did end up dropping almost back to session lows before the end of the day, but still no life in the VIX.\n\nAMD dropped a little before close as well, but as of the close, I was up about $250 or 21% on the position. I need to see AMD continue to hold above $164.46 and NQ to rally along with it. I'm not going to mess around with this position if that doesn't happen, it is very risky to long a stock that has rallied this much recently.\n\n&#x200B;\n\n**Order Details**\n\nThat's it for now, adding the order details below for full transparency. If there is interest I will continue making these posts. Possibly daily or maybe weekly if I go several days without placing a trade. Thanks for reading and feel free to DM with any questions.\n\nhttps://preview.redd.it/9bju7ks1j3ec1.png?width=710&format=png&auto=webp&s=43166b383856a3257acf914031ed4e6c3512ae0f\n\nhttps://preview.redd.it/ibm30ai3j3ec1.png?width=418&format=png&auto=webp&s=8d7fe5896e0fb1806c2ab5888e55a1e9116d4fa1\n\n&#x200B;\n\n**Edit:** See new posts here:\n\n[Day 2](https://www.reddit.com/r/Daytrading/comments/19e208r/2k_to_50k_in_90_days_options_trading_challenge/)\n\n&#x200B;\n\n&#x200B;",
        "created_utc": 1705975455.0,
        "subreddit_name": "DayTrading",
        "comments": 93
    },
    {
        "title": "Apple scores record 13 Academy Award nominations, as culture-moving feature “Killers of the Flower Moon” lands 10 historic nominations for Best Picture, Best Actress for Lily Gladstone and Best Director for Martin Scorsese",
        "score": 5,
        "url": "https://www.stocktitan.net/news/AAPL/apple-scores-record-13-academy-award-nominations-as-culture-moving-d3taocgrg2gw.html",
        "content": "",
        "created_utc": 1706035741.0,
        "subreddit_name": "AAPL",
        "comments": 0
    }
]