[
    {
        "title": "Insomniac, a top videogame developer's leaks reveal how much money Marvel makes as a licensor & panic over Microsoft's acquisition of Acti.",
        "score": 226,
        "url": "https://www.reddit.com/r/stocks/comments/19dnpw5/insomniac_a_top_videogame_developers_leaks_reveal/",
        "content": "*All the information here are already reported by other sources including Reuters, Nasdaq & Market Watch; nothing here comes from the leaks directly. This ransomware attack took place December 19 2023. After refusing a 2-million dollar ransom, the hackers dumped 1.7 terabyte of 1.3 million files. Important reveals:*\n\n............\n\n***\\*Marvel - Insomniac licensing terms for an upcoming game (X-men; one of 4 upcoming)***:\n\n*In the late 2010's Iger closed Disney's gaming divisions retaining a small staff whose sole function is to license out & creatively cooperate and supervise: Marvel Games, Lucasfilm Games...etc*. *The 2010's saw a shift in video gaming where emphasis shifted to making few games but of supreme quality, narrative and graphics. These games today are incredibly expensive costing at times $200-300mil*. *One of those games is Spiderman2 just released to become the fastest selling video game in Playstation history*. *In the leaks, licensing terms are defined by Marvel for the game developer:*\n\n***-Conditions on budget:*** *each game gets at least* ***$120 million*** *for production and* ***$30*** *million for marketing.*\n\n*-****Exclusivity:*** *Disney doesn't release licensed characters in any other video game; total of 4 up until* ***2035****.*\n\n***-Marvel Royalties:*** *several tiers depending on number of sales. If sales are above 7 million units: Disney gets* ***26% of net digital sales*** *(includes DLCs),* ***18% of physical sales***\\*, and finally\\* ***50% of bundled games***\\*.\\*\n\n*Disney has multiple deals with multiple game developers simultaneously. Marvel for example has deals with other game developers like Bethesda in addition to Insomniac. This also includes Star Wars, Indiana Jones, Avatar...etc. All that royalty almost completely goes to their bottom line having only to finance a small staff for licensing.*\n\n.............\n\n***\\*Microsoft's acquisition of Activision will leapfrog Sony past their current pillars:***\n\n*Sony allegedly goes into detail about how it views Microsoft's position moving forward. Described by Sony as \"the leapfrog,\" the slide details how Microsoft is aiming to build a mobile gaming store to compete with Apple and Google, as per previous information. It also details how Microsoft could build a comprehensive ecosystem across mobile, PC, and console, referring to Xbox Game Pass as \"GP\" throughout. Sony details how its \"pillars\" are \"dated,\" and behind Microsoft, referring to Microsoft's growing service game portfolio across titles like Sea of Thieves, Halo Infinite, and Minecraft. Sony also notes its need to \"respond,\" although its service game efforts have hit snags recently, with Destiny's upcoming expansion delayed, and The Last of Us Online wholly cancelled.*\n\n..............\n\n***\\*Video games have become more and more expensive, similar to films, compelling a change in strategy:***\n\n*Sony details how difficult it's getting to actually get a return on investment for AAA games — an issue that is plaguing the entire industry right now. Sony expresses how a $500 million game might not break even in the first year, which is upending how publishers are thinking about platforms like PC and mobile as they seek profitability and less risky investments.*\n\n*To that end, Sony's \"strategic pillars\" seem to detail an intent to eventually launch games more quickly, or even day one on Windows PCs, as part of its multi-platform pillar.*\n\n***............End of Article.............***\n\n***Sources:*** [*https://www.nasdaq.com/articles/insomniac-breach-leaks-marvel-x-men-gaming-details:-does-sony-fear-microsofts-strategy*](https://www.nasdaq.com/articles/insomniac-breach-leaks-marvel-x-men-gaming-details:-does-sony-fear-microsofts-strategy)\n\n[*https://www.windowscentral.com/gaming/microsoft-could-disrupt-and-threaten-playstation-business-sonys-alleged-xbox-fears-laid-bare-in-massive-hack*](https://www.windowscentral.com/gaming/microsoft-could-disrupt-and-threaten-playstation-business-sonys-alleged-xbox-fears-laid-bare-in-massive-hack)",
        "created_utc": 1706014274.0,
        "subreddit_name": "stocks",
        "comments": 62
    },
    {
        "title": "Mozilla’s ”Platform Tilt” Shows How Firefox Is Harmed by Apple, Microsoft",
        "score": 6344,
        "url": "https://www.howtogeek.com/mozilla-firefox-platform-tilt-launch/",
        "content": "",
        "created_utc": 1706016101.0,
        "subreddit_name": "technology",
        "comments": 642
    }
]