[
    {
        "title": "Question!",
        "score": 7,
        "url": "https://www.reddit.com/r/AAPL/comments/nadfom/question/",
        "content": "Okay so I own 39 AAPL shares at an average cost of $125.68. I truly believe in the long term future of AAPL and am definitely not selling for a long long time. \n\nMy philosophy is everyday AAPL goes below my current average I will buy another share to bring my average down. \n\nMy question is that with the lawsuit stuff going on should instead of buying a share a day if it’s below my average should I wait to see if there is a massive dip and then buy a bunch of shares at once?\n\nI know 39 shares and adding 1 share when it is down is probably child’s play to a lot of the people in this community but it is a good amount for me!\n\nWould love to hear peoples thoughts and advice.",
        "created_utc": 1620783715.0,
        "subreddit_name": "AAPL",
        "comments": 17
    },
    {
        "title": "I analyzed 9000+ trades made by Members of the U.S. Congress in the last two years and benchmarked it against S&P500. Here are the results.",
        "score": 8212,
        "url": "https://www.reddit.com/r/stocks/comments/nanrlu/i_analyzed_9000_trades_made_by_members_of_the_us/",
        "content": "**Preamble:** The ability of Congress to trade stocks has been controversial from the start. The 2020 congressional insider trading scandal where Senators used insider knowledge to trade large positions in stocks just before the coronavirus pandemic crash was just one example where they used their privileged position for gain.  While there is scope for a lot of discussion regarding the legality/ethical aspects of this, what I wanted to know is\n\n**Did Congress members** **beat the market and can I beat the market if I follow their trades after its been made public?**\n\n**Where is the data from:** senatestockwatcher.com\n\nMassive shoutout to [u/rambat1994](https://www.reddit.com/u/rambat1994/) for putting in the efforts to create this site and make the knowledge public. The website has data of Congress trading from 2019. While I could observe that all the trades may not be captured by the site, given that we have more than 9K trades to work with, I feel that we should be good from a statistical significance perspective. Also, please note that the data will contain trades done by senators who are not currently in the senate (Either they were in Senate earlier and now in the house of representative or another position of power which forces them to disclose their trades)\n\nWhile Congress members are supposed to [report the transaction within 30 days](https://www.citizen.org/article/personal-financial-disclosure-requirements-for-public-officials/), the median delay in reporting that I observed for the trades was 28 days and the average delay was 52 days. There were some outliers that pushed the average up and are most likely due to the fact that their broker might not report the trade to them immediately.\n\nAll the trades and my analysis are shared as a google sheet at the end.\n\n**Analysis:**\n\nA total of 9,676 trades were made by the members in the past two years. This analysis would be focusing on the stock purchases made by the senators. (The stock sales and the pandemic controversy can be a standalone analysis by itself). Out of the 4,911 Buy’s what I am really interested in is the 1,375 transactions which were over $15K. I decided on this cutoff as I did not want small transactions (<5K) to affect the analysis. The hypothesis being that if someone is putting almost 10% of their annual salary into one trade, they should be very confident about the stock. (I know that some senators are millionaires and this hypothesis would not apply to them, but adding their net worth would again complicate the calculations unnecessarily)\n\n**Results:** For all the stock purchases I calculated the stock price change across 3 periods and benchmarked it against S&P500 returns during the same period. \n\na.            One Month\n\nb.            One Quarter\n\nc.             Till Date (From the date of purchase to Today)\n\n**Returns made by the Congress**\n\n|Avg Return|% Change in Price|% Change in SPY|Change over SPY|\n|:-|:-|:-|:-|\n|One Month|2.55%|2.42%|0.12%|\n|One Quarter|8.76%|7.42%|1.34%|\n|Till Date|32.40%|26.40%|5.99%|\n\nAt this point, it should not come as a surprise, but Congress did beat SP500 across the different time periods. But what I am really interested in is if it's possible to follow their trades after disclosure (after a time lag of 30 days) and still beat the benchmark.\n\n**Returns if you followed their trades (after the disclosure)**\n\n|Avg Return|% Change in Price|% Change in SPY|Change over SPY|\n|:-|:-|:-|:-|\n|One Month|2.0%|2.48%|\\-0.48%|\n|One Quarter|10.46%|7.89%|2.57%|\n|Till Date|29.62%|23.73%|5.89%|\n\nIf you had invested in the stocks Congress bought, even after adjusting for the lag of disclosure, you would beat SP500 over the long run. My theory for this is that Congress usually plays the long game and invest having a time horizon of more than a year as sudden short-term gains can put a spotlight on their trades. This gives the retail investors a window of opportunity where they can follow the trades and make a significant profit.\n\n**Limitations of analysis:** There are multiple limitations to the analysis.\n\n1. The time period of the analysis is 2 years during which the market experienced a significant bull run. So, the results might change in a market downturn/recession\n2. The data has been sourced from senatestockwatcher.com as parsing the data from the official government site is extremely difficult. All the recorded transactions have a pdf of the disclosure linked to them (you can find it in the google sheet). I have made my best effort to QC the data and make sure there are no false positives. But this might not contain all the transactions made by Congress.\n3. There is no disclosure for the exact amount of money invested by Congress. The disclosure is always in ranges (e.g., $100k – $200k). So, for calculating the investment amount, I have taken the average of the given range.\n\n**Conclusion:**\n\nThis analysis proves that Congress indeed gets a better return than the overall market. Whether it is due to insider trading or due to their superior stock-picking capability is something that can’t be proven from the data and is left to the reader’s judgment. I intentionally left out the party affiliation of the members as I felt that it would bias the reader and was not the objective of this analysis.\n\nWhichever side of the political spectrum you lean-to, the above analysis shows that you get to gain by following their trades!\n\nLink to Google Sheet containing all the analysis and trades: [here](https://docs.google.com/spreadsheets/d/1Rg5jMYG-X4I7cidQylzCNc_UpJZGNhGrjAt7g0QkXYs/edit?usp=sharing)\n\n*Disclaimer: I am not a financial advisor*",
        "created_utc": 1620823410.0,
        "subreddit_name": "stocks",
        "comments": 368
    }
]