[
    {
        "title": "What Are Some Under-the-Radar Stocks with Strong Growth Potential Over the Next 5 Years?",
        "score": 295,
        "url": "https://www.reddit.com/r/stocks/comments/1f0t7ep/what_are_some_undertheradar_stocks_with_strong/",
        "content": "Looking for stock ideas that could grow big over the next five years. Not interested in the obvious picks like S&P500, Apple, Microsoft, Google, etc. I’m more curious about stocks that might be flying under the radar.",
        "created_utc": 1724581285.0,
        "subreddit_name": "stocks",
        "comments": 722
    },
    {
        "title": "We added a new mode in our camera that skips all the AI and most of the processing on your iPhone shots. We call it Process Zero, and I’m here to give out some promo codes and answers! ",
        "score": 1211,
        "url": "https://www.reddit.com/r/apple/comments/1f13u8f/we_added_a_new_mode_in_our_camera_that_skips_all/",
        "content": "Hi folks — I am the design and photo half of the team of 2 ~~dudes~~ fresh dads that make [Halide](http://halide.cam/download), a camera for iPhone.\n\ntldr: we made a way to take photos with zero AI stuff and without almost any iPhone processing.\n\nA lot of people started using our apps in the last years to get less processing on their shots. Processing is the thing that makes iPhone photos great or terrible depending on who you ask — it can do a lot of magical things in the blink of a second, like merging a dozen photos together to give you detail in shadows, highlights and dogs and cats and people. AI comes in and cuts out parts of the shot so they can be edited a bit differently. It lets you do stuff like portrait mode, or night mode!\n\nIt also sometimes is what makes you puzzled when you take a photo and it comes out looking WAY different than what you thought it would.\n\nThe reason is simple: because lots of ‘computational magic’ is done in processing to get nice shots out of very, very tiny lenses and sensors, the results always have some creative decisions baked in. And you might agree or... well, disagree with those.\n\nI always felt like it would be ideal if you could just choose — maybe even per shot! — if you wanted this or not.\n\n**That’s why we made this update.** It’s been a few years in the works (4, if we’re counting) - but new apps, new iPhones, and two babies later and here it is.\n\nHalide 2.15 lets you pick between Apple’s default camera processing, reduced processing, or Process Zero. The last is new, and shiny, and basically does a zero-AI, minimal process on raw sensor data from one shot to get a nice, film-like shot.\n\nNote that it’s not \\*better\\*(\\*): it’s really just, well, different. You can choose if you want it or not. Expect contrasty shots; grain; some imperfections that processing removes. At night, it might get very noisy! But I found it really fun to ‘relearn’ my love for photography without the help of the computational stuff.\n\n(\\* it’s better if you liked the results more. that’s the fun part!!)\n\nNow, the other part to this is that I’m... not the biggest fan of the AI wave that is hitting all sorts of creative arts. I think AI is great for doing the things that I hate doing. I want it to do my bookkeeping and organize my stuff. But increasingly, I see photos being made meaningless through generative AI and more products that replace the wonders of a creative process. I think, as companies making creative tools, we should take more of a stand to make tools for creation and putting control in the artists’ hands rather than try to replace them. And this is a small step towards that.\n\nAnyway, our update[ is out now](https://www.lux.camera/introducing-process-zero-for-iphone/) with a 1 week free trial — and I wanted to answer some questions on iPhone cameras / photography, the update, and more as well as hand out some promo codes. I usually drop into the thread a few times throughout the day and just give ‘em out, but this time I also have some for our video app Kino and our other lil cam Spectre!\n\nEdit: I wanted to add to this — I know we’ve added tons of features that mostly targeted both Pro and the latest and greatest phones, but we went through a lot of work to ensure that this is on just about any iPhone we can support — going back to iPhone 8 and iPhone X. It’ll even make your old shots you took with Halide better if you shot in RAW with our new process!\n\nDrop a comment and I’ll DM you a code as long as we got some!\n\nAnd if you already enjoy the app and take photos with it, stay tuned for a fun Process Zero contest we’re doing next week.\n\nedit: gonna step out for a quick lunch but back after to send out some more codes!\n\nedit 2: whoa folks, thanks for the amazing response. I’ll send out what I can and then switch over to sending out some codes for our other apps :)\n\nedit 3\\_final: ok folks, thank you for the fantastic response - I sent out all I could, but we’ll be back come new iPhone season!",
        "created_utc": 1724612070.0,
        "subreddit_name": "apple",
        "comments": 1508
    },
    {
        "title": "How Steve Ballmer’s Laugh at the First iPhone Shows the Risk of Revolutionary Ideas",
        "score": 752,
        "url": "https://youtu.be/qycUOENFIBs?si=vyljOVjDyr-wGhqO",
        "content": "I stumbled upon this old clip of Steve Ballmer, the ex-CEO of Microsoft, commented on the 1st iPhone right after its 2007 launch. \n\nInterviewer: What was your first reaction when you saw the iPhone?\n\nSteve: LOL ...most expensive phone in the world and doesn't appeal to business customers because it doesn't have a keyboard...\n\nFrankly, his perspective made a lot of sense. Let’s rewind to 2007: fully touchscreen phones made up less than 1% of mobile phone sales. Everyone was content with keyboard phones—they were faster and more accurate for texting and dialing. A phone with just a touchscreen and no physical keyboard? It seemed crazy and undesirable to almost everyone.\n\nFor Apple to build an entirely touch-based phone was seen nearly as a reckless gamble. Imagine trying to pitch this idea back then to investors, shareholders, or company executives, who would rightfully ask, “What’s the unique selling point (USP) here?” Back then, even Steve Jobs would've had hard time convincing people, but luckily, he didn't need to persuade many people to move forward with his vision. As Steve Ballmer’s reaction highlights, the idea was far from universally understood--at least until the iPhone’s sales numbers started to roll in.\n\nPerhaps USP isn't just about having a killer idea that wows everyone immediately. Sometimes, it's about a novel concept that starts with a small group of believers and is brought to life through relentless and meticulous execution. Steve Ballmer couldn’t pull it off—but fortunately the other Steve did.",
        "created_utc": 1724591110.0,
        "subreddit_name": "apple",
        "comments": 343
    }
]