[
    {
        "title": "Apple hit with class action lawsuit over iCloud’s 5GB limit and iPhone backup restrictions",
        "score": 3936,
        "url": "https://9to5mac.com/2024/03/02/icloud-5gb-limit-class-action-lawsuit/",
        "content": "",
        "created_utc": 1709486404.0,
        "subreddit_name": "wallstreetbets",
        "comments": 402
    },
    {
        "title": "Chinese-made phones are calling the shots in Africa as they beat global giants Samsung and Apple",
        "score": 5393,
        "url": "https://www.scmp.com/news/china/diplomacy/article/3253788/chinese-made-phones-are-calling-shots-africa-they-beat-global-giants-samsung-and-apple?module=top_story&pgtype=homepage",
        "content": "",
        "created_utc": 1709463601.0,
        "subreddit_name": "technology",
        "comments": 577
    },
    {
        "title": "Source: Apple to Announce New Products This Week",
        "score": 1998,
        "url": "https://www.macrumors.com/2024/03/03/source-apple-product-announcements-this-week/",
        "content": "",
        "created_utc": 1709496110.0,
        "subreddit_name": "apple",
        "comments": 608
    },
    {
        "title": "Gurman: No Apple Event Planned for Upcoming iPads and Macs",
        "score": 766,
        "url": "https://www.macrumors.com/2024/03/03/no-apple-event-for-new-ipads-macs-gurman/",
        "content": "",
        "created_utc": 1709486948.0,
        "subreddit_name": "apple",
        "comments": 174
    },
    {
        "title": "Friends wants me to trade for him ",
        "score": 114,
        "url": "https://www.reddit.com/r/Daytrading/comments/1b5q3s4/friends_wants_me_to_trade_for_him/",
        "content": "I have a close friend that is going through financial issues, and I am doing well in the market, where I have a strategy that makes around $4k a month. I told my friend about it and he wants me to take $750 in his Schwab account and trade it for him in the options market. I initially agreed then I realize that I made a bad decision because I am not all the way comfortable with performing trades on a small account because of three reasons:\n\n1. Complete waste of time \n2. I rather him do it on his own so he can learn the way I did \n3. Potential get get wiped out due to small account \n\nIf I did it, I would  place  all his money in AAPL, AMD, and SPY stocks and I’ll just let it grow over time. I wanted your thoughts on this. I would rather flip an account with $10k+ in it because I’m not trying to work for him to help him get more money because I did all this work to develop my strategy, and doesn’t have much benefit towards me. We have an agreement that I will take 25% profit monthly. \n\n I told him I’ll teach him but he wants me to do it. Am I wrong for saying no? I really don’t care because I have other things to worry about that matter way more than a $750 account. \n\nEdit: he has a Music Label that I would manage funds under. But after reading everything I’ve been told, it’s a waste of my time. He gotta get it out the mud like I did. I’ll point him in the right direction but that’s about it.",
        "created_utc": 1709495359.0,
        "subreddit_name": "DayTrading",
        "comments": 181
    },
    {
        "title": "AAPL breaks below the 15 min opening range 64% OF THE TIME ON THIS WEEKDAY",
        "score": 2,
        "url": "https://www.reddit.com/r/AAPL/comments/1b5ruz5/aapl_breaks_below_the_15_min_opening_range_64_of/",
        "content": "&#x200B;\n\nhttps://preview.redd.it/trh3zx39m6mc1.png?width=1080&format=png&auto=webp&s=36acc71a8c825f647feaffaaaa739ff7be501822\n\nthis report uses the 15m timeframe, and looks at the 15m opening range stats. it shows how often price breaks above, below, above and below, and doesn't break out of the opening 15m range.\n\nthis measures only the first break on a 15m timeframe after the 15m opening range is formed, not the following breaks.\n\nI pulled data on AAPL from the past 6 months and found that AAPL breaks below the 15 min opening range 64% of the time on Wednesday's. \n\nyou can use this report to scalp around market open, if price is in a downtrend and breakouts are more likely to occur, you can look for a short entry targeting the breakout.",
        "created_utc": 1709499537.0,
        "subreddit_name": "AAPL",
        "comments": 0
    }
]