[
    {
        "title": "Intel stock sinks as early 2024 outlook comes up short",
        "score": 455,
        "url": "https://www.reddit.com/r/stocks/comments/19fk5fp/intel_stock_sinks_as_early_2024_outlook_comes_up/",
        "content": "[https://www.cnbc.com/2024/01/25/intel-intc-earnings-report-q4-2023.html](https://www.cnbc.com/2024/01/25/intel-intc-earnings-report-q4-2023.html)\n\nIntel\r shares dropped in extended trading on Thursday after the chipmaker issued an outlook for the first quarter of 2024 that lagged analyst forecasts even as results for the latest quarter beat Wall Street estimates.\r  \n\r  \nHere’s how Intel did versus LSEG (formerly Refinitiv) consensus expectations for the quarter ended in December:\r  \n\r  \nEarnings per share: 54 cents adjusted, vs. 45 cents expected\r  \nRevenue: $15.4 billion vs. $15.15 billion expected\n\n\r  \nFor the first quarter of fiscal 2024, Intel expects earnings per share of 13 cents on between $12.2 billion and $13.2 billion in sales, versus LSEG expectations of 33 cents per share on $14.15 billion of revenue.\r  \n\r  \nIntel posted net income of $2.7 billion, or 63 cents per share, compared to a net loss of $0.7 billion, or 16 cents per share, last year.\r  \n\r  \nWith Intel reporting sales growth in the fourth quarter of 10% from $14.04 billion a year earlier, the company breaks a streak of seven quarters with declining revenue.\r  \n\r  \nIntel shares are up over 74% over the past year. The company is the largest semiconductor maker by revenue, according to Gartner, a market research firm, even though its market cap puts it below Nvidia\r and AMD\r on Wall Street.\r  \n\r  \nCloud providers and large tech companies, the big spenders, have been focused on the AI boom, which explains Nvidia’s recent outperformance. In the past, the most important part in a server was the central processor made by Intel. Now, AI servers can have as many as eight Nvidia or AMD graphics processing units (GPUs) attached to one or two Intel CPUs.\r  \n\r  \nIntel also continues to focus on a five-year plan implemented by CEO Pat Gelsinger, who took over the chipmaker in 2021. Intel wants to catch up to Taiwan Semiconductor Manufacturing Company\r in its ability to offer manufacturing services to other companies, while also improving its own branded chips.\r  \n\r  \nIntel has been cutting costs through workforce reductions and offloading small parts of its business. In the past year, the company said it would spin off its programmable chip unit, after turning self-driving car subsidiary Mobileye\r into an independent company in 2022.\r  \n\r  \nIntel’s largest division is its Client Computing group, which includes laptop and PC processor chips. The overall PC industry has been in a slump for two years, but recently started showing signs of growth again. Intel reported $8.8 billion in fourth-quarter sales, up 33%.\r  \n\r  \nIntel’s second largest division, Data Center and AI, saw sales decline 10% to $4 billion. That unit includes server CPUs and GPUs.\r  \n\r  \nIntel foundry services, its business making chips for other companies, remains nascent, with $291 million in revenue, a 63% annual increase.",
        "created_utc": 1706217460.0,
        "subreddit_name": "stocks",
        "comments": 222
    },
    {
        "title": "Why I’m Buying Rivian Stock",
        "score": 429,
        "url": "https://www.reddit.com/r/stocks/comments/19f3fgb/why_im_buying_rivian_stock/",
        "content": "Individual stock picking is for smart people who wear expensive suits. I’m not very smart and I hate wearing suits. I’m a boring index-fund guy. After all, history and math show us that the safe path to retirement is to simply plop money into a Vanguard fund every month. And that’s what I do with most of my money.\r  \n\r  \nBut sometimes I see a juicy opportunity that fires me up. Occasionally, the timing of that opportunity is juuuuusst right and I put real money on the line. This is one of those situations and I'd love to hear what you think about it.  \n\r  \nI recently bought 4000 shares of Rivian stock (RIVN). My average cost is just over $16/share. That amounts to about $65,000. At the time of this writing, Rivian floats around $15.00/share and has a $14.5b market cap. I might buy another 1000 shares depending on the feedback that I get to this post.\r  \n\r  \nAnyway, here is why I believe Rivian will 3-4x in the next few years. \r\n\n# Point #1 – Big Picture - EV’s Will Win… Guaranteed.\n\nOver the next 25 years, the auto industry is going to transition to electric vehicles because they will be cheaper to buy and operate. Hear me out:\n\n1. Right now, batteries are the most expensive part of an EV. But EV battery tech is in its infancy. Incremental advances in batteries will increase the energy density and versatility of batteries year by year. More importantly, the industry will scale battery production by a few orders of magnitude. This will make EV batteries significantly cheaper to purchase on a per unit basis.\n2. Government’s will continue to incentivize EV purchases with tax credits and other incentives for decades to come. In the long run, governments are definitely going to incentivize large scale energy creation by renewable means (which is getting cheaper and cheaper). On the other hand, western Governments are not going to subsidize or incentivize more coal power plants. That is just a fact.\r\n3. Moreover, gas cars are only going to get more expensive operate because gas is a finite resource. The world is literally running out of oil. We’ve only got like 100-200 years left. So, gas prices are going to go up guaranteed. On the other hand, we ain’t gonna run out of electricity. Humans will continue to innovate and drive down the relative cost of electricity. This is inevitable.\r\n\nI know I’m painting with broad strokes here, but I think any rational mind will agree with most of these assertions. Stay with me. This post gets better as I go…\r  \n\r  \nNow, just because EV’s will be less expensive than ICE vehicles in the long run doesn’t mean Rivian is going to win the game. OEM’s like Ford, GM & Stellantis are starting to produce and sell EV’s… right??? Won’t Ford and Toyota and others crush Rivian at the EV game? Nope… not a chance. Keep reading and I’ll show you why.\r\n\n# Point #2 – Pure EV Makers like Rivian & Telsa Will Crush Traditional Auto Manufacturers\n\nFord, GM, and Stellantis don’t stand a chance against Tesla & Rivian. Even if they start making compelling EV’s for customers, OEM’s will be at a long-term structural disadvantage to Rivian & Tesla. Here is why:\n\n1. Rivian does not have a dealership sales model. Dealerships are a useless 3rd party which customers hate. Removing the dealership permits Rivian to sell its vehicles for cheaper than it otherwise could, but also make more profit than it otherwise could. This will be a long-term structural competitive advantage over OEMs.\r\n2. Rivian does not have unions. Unions uniquely harm the automobile industry because the cost of strikes and the cost of artificial wage increases after the strike ends increase the cost of vehicles. The 2023 UAW strike is a good example. If Rivian treats its employees with dignity and respect, they should avoid unionization. This will be a long-term competitive advantage over OEMs.\r\n3. Rivian will make money from servicing and repairing vehicles. In the current OEM-dealership model, the dealership makes more money from the service department than it does selling vehicles. While it generally costs less to service and maintain an EV, collisions & accidents can be more expensive to repair than ICE vehicles. There is a lot of money to be made by repairing & servicing EVs and Rivian has it’s own service department. As such, it will capture that revenue as opposed to giving it to the dealership. This will be another long-term competitive advantage over OEMs.\r\n4. Rivian is vertically integrated (especially when it comes to software). Traditional auto companies are not. These companies suck at software. Meanwhile, customers want high quality software in their vehicles that works seamlessly with their phones, homes, and other devices. Rivian, at its core, is a software driven company. This allows them to update their vehicles over-the-air. This will give them an enormous advantage in the long run at improving, iterating, fixing and keeping their customers happy.\r\n\nOkay, okay, okay… I’ve convinced you that pure EV companies are going to have inherent advantages over traditional auto. That still doesn’t mean that Rivian is going to be a winner. After all… Tesla is crushing them right now. Rivian isn’t even profitable yet. If you’re going to bet on a pure EV, why not pick Tesla???\r  \n\r  \nTesla is great. I’ve got nothing bad to say about it. They make amazing cars, they have a genius founder, and it has amazing long-term potential. But this write-up isn’t about Tesla. I don’t think Rivian is better than Tesla. It’s not. \r  \n\r  \nThis write-up is more about the timing of things for Rivian. I think Rivian’s stock is uniquely undervalued right now relative to where it should be. I personally feel like this value disparity is easier for me to see for Rivian than it is for Tesla. \r  \n\r  \nAnyway, lets continue….\r\n\n# Point #3 – Rivian Makes Wonderful Vehicles that Customers Love\n\nRivian makes beautiful vehicles and customers love them. The outdoor-adventure brand is on point. Aesthetics and brand really matter to buyers, and Rivian vehicles rock. \r  \n\r  \nWhile most people hear the name “Rivian” they think of Rivian’s truck (R1T). But in reality their higher-priced SUV, (R1S) is far more popular. The CEO said on an earnings call that the demand is for 2 R1S’s for every 1 R1T. \r  \n\r  \nNow, I see a lot of R1T’s and R1S on the road here in CA. And I see more and more of them each week. Just about every single R1S driver I see here in California is good-looking mom driving her kids to soccer. That’s a good sign. I’m convinced that middle & upper-class women absolutely love the R1S. I think the R1S is going to be enormously popular. Remember how popular Range Rovers were about ten years ago? I think the R1S is going to be that kind of popular….\r  \n\r  \nBut the R1S doesn’t just appeal to soccer moms. I want one. And I’m a guy who likes to go off-roading, camping, and hiking. I’m a dude, and I love Rivian vehicles. I think the R1S is going to be a massive hit. \r  \n\r  \nWhether you believe me or not, no one can dispute that outdoor adventure brands really resonate with humans. Maybe that is why Rivian was ranked highest in customer satisfaction by JD Power in 2023. There is a lasting durability to selling adventure. I think Rivian’s brand is built to last.\r  \n\r  \nMoreover, I really like Rivian’s management team. The CEO, RJ Scaringe, and CFO, Claire McDonough, just seem to work hard with their heads down. I personally like that RJ is an engineer who went to MIT. While they have clearly made a few mistakes, I don’t think they have made any big ones. They are not flashy or full of crap (think Nikola…).\r  \n\r  \nBut EVEN if I’m right about everything so far, that still doesn’t mean Rivian is a good stock to buy. Keep reading to hear the good stuff….\r\n\n# Point #4 – Rivian Has Enormous Upside Right Now\n\nWhy would anyone want to invest in Rivian right now? At a surface level, Rivian looks like they have big problems:\n\n* Currently, Rivian is losing money on every R1 vehicle it sells. It allegedly makes money on its electric delivery vans but does not disclose how much.\r\n* Moreover, Rivian got crushed in 2022 in the supply chain shortage that delayed vehicle production. Theoretically, that could happen again.\r\n* Then interest rates started rising in 2023 making it more expensive for normal people to get a loan to buy these pricey vehicles. Most people who buy vehicles finance or lease them. Very few people buy them with cash.\r\n* Rivian has had growing-pains with their vehicles. They’ve had recalls (steering issue), mechanical issues (tonneau cover defect), accessory issues (wireless phone charger defect), and a bunch of other minor problems. These growing pains would really frustrate me if I spent $95k on a vehicle.\r\n* Rivian will be shutting down its production line for a few weeks in Q2 of 2024 to make improvements to the manufacturing line. This is definitely going to slow their numbers for that quarter.\r\n* Beyond that, even if Rivian miraculously scaled production to max capacity tomorrow at their Normal, Illinois, manufacturing plant, (150,000 vehicles) and sold every vehicle at their current prices, I don’t think the company would be profitable to a level that would excite me. \r\n\nWell all this sounds terrible! Why on earth would anyone buy their stock now??? Oh boy… let me tell you why….\n\n&#x200B;\n\n* **Mass-Market Vehicle Announcement** \\- If you’ve been following Rivian, you know that it does not have a chance of long-term success unless it introduces and starts selling a mass market vehicle much like Tesla did with the Model 3 in 2017. \r\n   * The Model S really launched Tesla into the public eye in 2014/15. But it didn’t start making real money until the Model 3. The R1 line at Rivian is meant to be Rivian’s “Model S.” It has successfully done that. People love the product. Now, the only way Rivian will become profitable is if it starts building it’s own Model 3. And that is about to happen.\r\n   * Rivian plans to introduce the R2 on March 7, 2024, in Laguna Beach, CA. This is supposed to be an affordable midsize SUV costing anywhere between $40,000 and $50,000 per vehicle. If it is anything like the R1S, I suspect it will be beautiful and a high-quality competitor to the Model Y – the most popular selling EV in the world. \r\n   * Rivian is currently building a manufacturing plant in Georgia to produce the R2. It has broken ground and should be finished in early 2026. Once up and fully scaled, it should be able to make 400,000 vehicles per year.\r\n\n&#x200B;\n\n* **Steadily Marching to Profitability** \\- As it continues to scale up production, Rivian’s loss per vehicle is shrinking dramatically quarter after quarter. In Q3 2022, it lost $139,277 per vehicle. That egregious. But that number was expected at the time and now it is shrinking dramatically. In Q3 of 2023, it lost $30,600 per vehicle. That is still a lot, but the change from one year earlier is monumental. \r\n   * Management claims they will be gross margin profitable per vehicle at the end of Q4 2024. Management says the delta they are chasing is literally baked into contracts it has with its suppliers. As they increase and improve production throughout 2024, the margin on labor per vehicle and parts from suppliers gets better and better.\r\n   * On the 2023 Q3 earnings call, the CFO said, “Overall, we continue to see a clear path to our approximately 25% gross margin target, high-teens adjusted EBITDA margin target, and approximately 10% free cash flow margin target.”\r\n\n&#x200B;\n\n* **Interest Rates Will Go Down** \\- Despite a full year of rising interest rates, Rivian’s demand has been so high it has not needed to reduce prices in order to sell its very expensive vehicles. In fact, it raised prices in March 2023. Meanwhile, other EV manufacturers like Tesla have slashed prices. \r\n   * In December 2024, the federal reserve signaled it will no longer raise interest rates, and will probably start cutting them slowly over the next few years. This means demand for Rivian vehicles will only go up as their production scales up. That sounds like perfect timing. \r\n   * Moreover, when the fed starts cutting rates, trillions of dollars will start flowing back into the market, increasing valuations. Read Warren Buffet’s 1999 Fortune article called Mr. Buffett on the Stock Market. IMO, it is highly likely that “speculative” stocks like Rivian and Tesla will be enormous beneficiaries of all this buying. The fed may start cutting rates as early as the end of Q1 2024 (but more likely Q2 or Q3 2024).\r\n\n&#x200B;\n\n* **EV’s Have Been Unfairly Beaten Up in the News Lately** – Starting in mid/late 2023, there has been a lot of speculation in the financial news that EV’s are overhyped and will not take over the market as previously thought. This fear, uncertainty, and doubt has suppressed the share prices of all the pure EV players. If this FUD has any validity at all, it is only a short-term speed bump.\n   * Remember, the inherent and structural advantages of pure EV manufacturers will win out in the long run because the costs to buy EV’s will be lower than ICE vehicles (See Point #1 & 2 above). Over time, this will prove decisive. Moreover, for some reason, the conservative side of the news media loves to bash EVs. This is just silly politics and will end with time. I mean, why on earth would conservatives honestly dislike American made vehicles with ridiculous amounts of horsepower! The bashing will end with time. I’m confident of that.\r\n\n&#x200B;\n\n* **Rivian could announce new EDV deal at any time…**\r Right now, Rivian has orders to sell about 85,000 more EDV’s to Amazon by 2030 under their 100,000 vehicle contract. This deal used to be “exclusive” with Amazon, but this contract was recently changed and now Rivian can sell EDV’s to other delivery companies. That is fantastic.\r\n   * What is even better is that on November 7, 2023, RJ Scaringe said in Q3 earnings call that “We’ll be announcing soon a range of different pilot programs that will perceive much larger orders, as these large fleets start to plan the electrification of their infrastructure.”\r\n   * A month later, in December, Rivian recently announced a pilot deal to sell an undisclosed number of EDV’s to AT&T. This shot Rivian’s share price up and made investors happy. This could lead to a much larger deal in the future.\r\n   * I strongly suspect that several more pilot programs with other delivery companies will be announced in the coming months. Over time these deals will mature and large orders will be placed.\r\n\n&#x200B;\n\n* **Attractive Price** \\- In 2021, Rivian made its IPO during the EV stimulus-uphoria at $78/share. I did not buy a single share back then. That sounded crazy overpriced for an unproven capital-intensive car company. The share price immediately jumped near to $130/share and it has done nothing but go down ever since. It’s down over 85% to $15.50. We are close to its all-time lows. I think this presents an amazing opportunity to buy at a discount.\r\n   * Rivian’s Value Compared to Competitors – Right now, Rivian’s market cap is $14.5 billion. This is small compared to Ford’s at $44 billion, GM’s at $47 billion, and Stellantis at $63 billion. While Rivian clearly sells less vehicles than these competitors, Rivian’s future is much brighter. I suspect a forward-looking stock market will quickly buy shares of Rivian over the next three years if it continues to make strong gains. While it will take a long time for the market to see Rivian as a premier competitor like Tesla or Toyota, I can easily see Rivian’s market cap soaring past Ford, GM, & Stellantis in the next three years if it’s R2 launch is successful. \r\n\n&#x200B;\n\n* **Tesla Supercharger Access**\r\n   * Range anxiety is a real thing. Until America’s EV charging infrastructure is as dependable as gas stations, it’s going to be a big factor in the buying decision. Fortunately, Tesla has paved the way and built an amazing supercharging network across the country that is extremely dependable. While Rivian is building its own network (Rivian Adventure Network), it will never be as robust as Tesla’s. Until recently, Tesla chargers were for Tesla drivers only. But not anymore….\r\n   * Tesla recently announced it was going to permit competitors vehicles like Rivian to access and use its network. This is enormous news for future buyers as it will absolutely quell most of the range anxiety concerns.\r\n   * Rivian also announced it was adopting Tesla’s North American Charging Standard plug. This is the plug that Tesla uses on its vehicles. Starting in 2025, Rivian vehicles will come standard with this plug. I don’t know about you, but I think this will help hundreds of thousands of people make the decision to switch from an ICE car to an EV. \r\n\nIf you’ve been around the market for any length of time at all, you know that the stock market is forward looking. It is constantly trying to figure out what the future holds based on all available data and placing its bet accordingly. I think most of the seven points I just made are largely unappreciated or discounted by the smart people in suits. And that is why the share price is lower than it should be. That is where our opportunity lies.\r  \n\r  \nHowever, this investing thing is not for weaklings….\r\n\n# Point #5 – Not Gonna Lie… There Are Big Risks:\n\nI’m not some delusional nerd who doesn’t understand how hard it is to make accurate predictions like this. There are some big risks here. These are the biggest ones that I see:\n\n&#x200B;\n\n* **What if the R2 Vehicle Announcement Falls Flat?**\r\n   * When the R2 is announced on March 7th, it’s possible that the reaction will be poor. The SUV could look terrible, the specs could be unappealing, or the price could be too high. \r\n   * I think this is unlikely. Considering the care, consideration, and thought that has gone into the R1S and R1T, I expect the R2 to be a big hit and a full extension of the outdoor-adventure brand.\r\n\n&#x200B;\n\n* **What if there is a Demand Problem?** \r\n   * It’s possible there is a demand problem for the R1 vehicles and the sales are not as good as I believe they are. It’s possible that inventory is rising. In early January 2024 Rivian announced it produced 17,541 and delivered 13,972 in Q4 2023. When these numbers were announced, the stock dropped 10%. \r\n   * Why the 3,569 difference? Well, between making a vehicle and selling it to a customer, it takes some time to sell, ship, and for the customer to take possession. For vehicles made in December, you can easily imagine some of those don’t actually get delivered until January. \r\n   * But why 3,569? That seems like a lot to account for that simple lag between production and delivery. According to the Q3 earnings call, the CFO said, “As a reminder, because Amazon limits the intake of new commercial vans during its peak holiday delivery period, we expect a more significant gap between production and deliveries in Q4 relative to prior periods.” I find this explanation pretty satisfying. \r\n   * But if this large gap remains at the end of Q1 2024, or grows, I’m gonna start to get worried.\r\n\n&#x200B;\n\n* **What if Building the Georgia Plant Runs into Problems?**\r\n   * It’s possible that there are major roadblocks to building the brand new R2 plant in Georgia. My imagination can go wild thinking about delays, permits, politics, protests, bureaucracy, accidents, and the “production hell” issues that Elon Musk talks about. \r\n   * The good thing is that Rivian has gone through the production process on three different vehicles in Illinois and that experience should speed the process up. But who knows what kind of disasters could come up building a plant from scratch.\r\n\n&#x200B;\n\n* **What if the March to Profitability Stalls or Reverses?**\r\n   * It’s possible that Rivian’s current march to profitability will slow to a crawl, stop, or reverse entirely. This would be bad. In the next quarter earnings statement on February 21st, Rivian better post a smaller loss than $30,600 per vehicle (Q3 2023). It better be in the mid $20k or better… Absent a really good and logical explanation, I’m going to be seriously alarmed if it doesn’t get somewhere in that range.\r\n   * If this happens, that would be a strong signal that Rivian is just making too good of a car and they either need to increase the price, or make it cheaper.\r\n   * I honestly doubt this will happen. The way the CEO and CFO handle their earnings calls inspires confidence in their managerial ability. But that is my suuuuper subjective perspective. \r\n\n&#x200B;\n\n* **What if they Issue More Debt and/or Dilution?** \r\n   * Rivian will probably have to raise more money to complete the plant in Georgia. But they are going to spend $5 billion to build the R2 plant in Georgia and they need to continue ramping production in Illinois. That’s a ton in capital outlay. \r\n   * Luckily, that fat IPO set Rivian up nice. Currently, Rivian has very little debt ($3bil) and a strong balance sheet (they have like $8-9 billion in cash/equivalents).\r\n   * But raising capital will either come in the form of more debt or share dilution. Either way, it won’t be great for the owners of the stock. But Wall Street already knows this, so nobody is going to freak out if it’s a small capital raise. But if its huge, yeah, I’m gonna freak out too.\r\n\n&#x200B;\n\n* **What if Interest Rates Rise?** \r\n   * Inflation could spike back up like it did in the 70’s. That would prompt the fed to raise interest rates again. I think this is unlikely, but it would be a bad for every auto company if it happened.\r\n\n&#x200B;\n\n* **What if Repair Cost Fears Grow?** \r\n   * The last big risk is something I don’t hear very many investment folk talk about. Repair costs.\r\n   * Repair costs seem to be very high for EV vehicles, and Rivian’s in particular. There are many stories of a medium size dent on a fender costing the customer $20-30k. This kind of stuff, if true, will drive up insurance costs. This is a red flag/danger area that will deter some cautious buyers. \r\n   * I’m not terribly worried about this. In theory, as more cars get made, repair costs will go down. But this will take time.\r\n\n# Point #6 - Rivian is Not the Next Tesla (But it Doesn’t Have to Be)\n\nI feel like everyone just wants to compare Rivian to Tesla. I think that is unwise when evaluating this investment.\n\nRivian only produced 57,000 vehicles in 2023. In the same timeframe, Tesla produced 1,850,000. These two companies are not even in the same universe. Tesla is at least 7-10 years ahead of Rivian. But that doesn’t matter at all for the question of whether or not you should own Rivian stock.\n\nThe great thing here is that if Tesla continues to win with the Model Y and Cybertruck, that will likely be a net benefit for Rivian. Tesla has smashed the entrenched auto-industry to bits, and Rivian is poised to take advantage of rebuilding it in the new vision of the future. The customer needs alternatives to Tesla. And Rivian is better positioned to capture market share from Subaru, Jeep, Land Rover, Toyota, Chevorlet and other brands that make adventure style trucks and SUV’s.\n\nTesla’s stock went from $15 a share in September of 2019 to $235 by the end of 2020. That meteoric rise was the result of a decade of work, becoming profitable, and the stimulus froth of the Covid recovery. Even if Rivian smashes its forecasts for the next two years, Rivian stock will not do what Tesla did. Tesla is so much more than a car company. As it stands, Rivian is just a car company….\n\nBut I do believe Rivian could easily get back to its IPO price in the of $70’s if it executes well on its vision over the next 2-3 years. That is what I’m hoping for. \n\n# Conclusion\r\n\nI spent all day writing this. I’m tired of typing. I hope someone out there can poke some holes in my thesis so I can sell my shares and put my $$ back into an index fund where it belongs. But I also hope that I’m right and this stock gradually rises in value over the next few years. Right now I’m committed. I’m freaking pumped about it. \n\nMaybe I’m just dumb and this whole idea is terrible…. If you think I'm missing something, please feel free to tell me in the comments below.  \r  \n",
        "created_utc": 1706165885.0,
        "subreddit_name": "stocks",
        "comments": 631
    },
    {
        "title": "Apple announces changes to iOS, Safari, and the App Store in the European Union",
        "score": 3367,
        "url": "https://www.apple.com/newsroom/2024/01/apple-announces-changes-to-ios-safari-and-the-app-store-in-the-european-union/",
        "content": "",
        "created_utc": 1706205795.0,
        "subreddit_name": "apple",
        "comments": 1563
    },
    {
        "title": "Netflix CEO says Apple Vision Pro market is irrelevant for now",
        "score": 1761,
        "url": "https://appleinsider.com/articles/24/01/25/netflix-ceo-says-apple-vision-pro-market-is-too-insignificant-to-bother-with?utm_medium=rss",
        "content": "",
        "created_utc": 1706223903.0,
        "subreddit_name": "apple",
        "comments": 523
    },
    {
        "title": "TIL if you add too many NFC cards to your iPhone, the Secure Enclave chip can run out of storage.",
        "score": 1662,
        "url": "https://x.com/tapdownunder/status/1750022004009586908?s=61&t=93aw5SGG3Imb0bFJ5Upvng",
        "content": "",
        "created_utc": 1706161989.0,
        "subreddit_name": "apple",
        "comments": 115
    },
    {
        "title": "Apple requires €1,000,000 letter of credit to open a third party app store.",
        "score": 1626,
        "url": "https://9to5mac.com/2024/01/25/apple-says-third-party-app-marketplace-creators-must-have-e1000000-letter-of-credit/",
        "content": "",
        "created_utc": 1706211960.0,
        "subreddit_name": "apple",
        "comments": 546
    },
    {
        "title": "Epic Games App Store coming to iOS, Fortnite returning to iOS (in EU)",
        "score": 617,
        "url": "https://x.com/epicnewsroom/status/1750616436957933711?s=46&t=nbZ49KWy36GcHg5aUSY1GQ",
        "content": "",
        "created_utc": 1706216313.0,
        "subreddit_name": "apple",
        "comments": 233
    },
    {
        "title": "Apple announces changes to iOS, Safari, and the App Store in the European Union",
        "score": 1,
        "url": "https://www.stocktitan.net/news/AAPL/apple-announces-changes-to-i-os-safari-and-the-app-store-in-the-lnf598k298qw.html",
        "content": "",
        "created_utc": 1706205602.0,
        "subreddit_name": "AAPL",
        "comments": 0
    }
]