[
    {
        "title": "Apple starts replacing titanium Apple Cards from original 2019 batch",
        "score": 2005,
        "url": "https://appleinsider.com/articles/24/04/29/apple-starts-replacing-titanium-apple-cards-from-original-2019-batch",
        "content": "",
        "created_utc": 1714428998.0,
        "subreddit_name": "apple",
        "comments": 306
    },
    {
        "title": "Apple's iPhone factory shift has left a ghost town behind in China",
        "score": 980,
        "url": "https://appleinsider.com/articles/24/04/29/apples-iphone-factory-shift-has-left-a-ghost-town-behind-in-china",
        "content": "",
        "created_utc": 1714400262.0,
        "subreddit_name": "apple",
        "comments": 131
    },
    {
        "title": "Popular Delta Retro Game Emulator Coming to iPad",
        "score": 718,
        "url": "https://www.macrumors.com/2024/04/29/delta-game-emulator-coming-to-ipad/",
        "content": "",
        "created_utc": 1714396122.0,
        "subreddit_name": "apple",
        "comments": 152
    },
    {
        "title": "I'm a full time trader and this is everything I'm watching and analysing in premarket including analysis of USDJPY after intervention and TSLA positioning",
        "score": 79,
        "url": "https://www.reddit.com/r/Daytrading/comments/1cfxfu0/im_a_full_time_trader_and_this_is_everything_im/",
        "content": "**ANALYSIS:**\n\n* Let’s look at and analyse the main things happening in premarket first of all. \n* Firstly, the Yen intervention, which Japan’s Kanda hasn’t confirmed but reports are out from DJ that thats what happened this morning. \n* We saw yen weaken to 160 vs the USD. This was touted by JPM as the intervention point that BOJ were looking at, although their commentary last week was all very much vague. \n* When we saw 160 hit, we saw a big drop in USDJPY, as yen squeezed higher. \n* The price action was more extreme because Japan has a national holiday today, hence trading volumes were thin. \n* WE saw it drop from 160 to 154.5\n* It found support from the technicals at the 20 day Moving average, as we see below:\n* We saw recovery above the 155 level. 155 is one of the key gamma levels, where there is a lot of put support there. The bigger key gamma level, below this is 152. There is a hell of a lot of put support at 152. If the BOJ wants the yen to meaningfully improve vs the USD, it needs to get USDJPY below 152. Thats when we can go meaningfully lower. Above there, and we expect it to find support from these gamma levels and move higher, as we saw it do from 155. \n* Skew actually points higher in USDJPY now. This tells us that traders are not really expecting much more meaningful intervention right now. We can see USDJPY move higher again soon. Probably won’t be as effective as BOJ hoped. \n* Now the other key news from premarket, is TESLA, who have now received the regulatory approval for FULL self driving in China, rather than the limited product they had on offer already. \n* Tesla is pumping in premarket. \n* If we look at the gamma levels, we see 200 as having a lot of open interest. As such, we can see it as a magnet for price action moving forward. \n* FTSE pushed higher to 8200, but we see skew lowering. This tells us traders are hedging for price action to mveo lower now. The move is likely close to done for now, except if the Fed support move higher. We expect that because OTM delta isnt really showing much call delta so traders aren’t betting FTSE goes much higher. \n* HKG50 breakout from downtrend since 2023 continues, hitting 18k level today. 18k is v big gamma level, hence why we saw price action reverse from here. \n* In SPX, we see traders unwind some of their hedges as they bet that geopolitical pressures are mostly behind us. We see that too, as oil skew points lower which suggests traders expect oil to move down soon. \n* Finally, busy week ahead. \n* This week ahead, we have FOMC decision on Wednesday, as well as jobs numbers throughout the week, which will give us some insight into the labour market. \n* Put on top of that all the following earnings reports, and we are set for a volatile week of trading. \n\nDATA LEDE:\n\n* Spain inflation rate:\n* 3.3% YOY vs 3.4% expected, previous reading was 3.2%\n* SO ticked up from last month, but not as much as expected. \n* GERMAN inflation rate:\n\nMARKETS:\n\n* SPX set to open above 5100 this morning, pulled up by Tesla and Aapl. Currently trading at 5112. This is just above the highs of Friday. \n* Nasdaq: up 0.3% in premarket, trading at 17,780. 17,850 is a resistance, then The next big resistance will be the 18k level. \n* Dow Jones: Flat in premarket, trading at 38,300. \n* HKG50 up 1% again in premarket. Now at 17,750. Touched 18k then came down from there. 18k is now the strong resistance. \n* UK100 higher to 8200, pared slightly to 8180. Still up 0.4% today. \n* GER40: flat around 18,140.\n* Oil: Flat at 83.65. Maintaining the uptrend drawn since December 2023. \n* GOld: Flat above 2300. \n* VIX: Vix flat at 15.22. last week closed perfectly at the put support of 15. Was a big VIX crush last week. Opened today at 15.22. \n\nFX:\n\n* USDJPY closed Friday at 158.3.\n* In early Monday trading, it moved up to 160. This was a key level where traders were hedging for intervention.\n* It seemed as though we did get that fX intervention hence the big decline.\n* This decline was right down to 154.5\n* This is where the 20 day Moving average was and so it found support there.\n* Also a key gamma level at 155. \n* It moved below this level, before recovering above again. \n* Note: its a national holiday in Japan, hence why more exaggerated trading on thin volumes. \n* Despite this no official comment from BOJ that they have intervened, although that is the clear assumption. \n* So Yen squeezed higher after hitting 160 vs USD\n* All other currencies quite flat compared.\n* GBPUSD up 0.3% to 1.253EURUSD same trend, up 0.2% after selling off on Friday. Now at 1.071. On Friday, it retested 1.07 before pushing higher. \n\nMAG 7 NEWS:\n\n* TSLA - Tesla will spend $10B ons elf driving in 2024. Musk says “any company not spending at this level cannot compete”.\n* Musk also makes surprise China visit to set up path for FSD there. \n* Musk strikes deal with China’s BIDU for driver assistance. Tesla partnering with Bid to deploy mapping and navigation tech in China. \n* TEsla has now paved the way for FSD to be launched in China now \n* This is a market where their sales have been weaker, So is bullish for the company. \n* Note they have had self driving there but limited version of it, not full self driving. They said that Chinese authorities removed restrictions on thier cars. \n* TESLA up 8% in premarket. \n* AAPL - renewed talks with openAI for iPhone generative AI features. This would be for the next iPhone. \n* AAPL price target at 195 from Bernstein, raised to outperform. \n* AAPl up 2% as a result. \n* AMZN -The NBA and Amazon Prime Video have a framework for an agreement that will make the streamer one of the homes for significant regular season and postseason games for a decade\n* GOOGL - plans $3B data center investment in Indiana. \n* META - down as EU probing Meta over handling of Russian disinformation. Selena Gomez also said that deleting Instagram was best decision she made. \n\nOTHER COMPANIES:\n\n* BIDU - Musk strikes deal with China’s BIDU for driver assistance. Tesla partnering with Bid to deploy mapping and navigation tech in China. \n* Tesla are leading other EVs like Li etc higher. \n* PARA up in premarket as Skydance comes back with their “best and final” offer for Paramount. \n* ORCL boosts its generative AI capabilities. \n* Crypto stocks are generally lower slightly as BTC headed slightly lower this weekend just been. BTC down 2.5% in last 24 hours. \n* SOFI up after earnings report. Strong revenue forecast. \n* LUV down as Jefferies downgrades Southwest Airlines to underperform, lowers price target to 20. current price 27. \n* Deutsche Bank lower after filing monthly SEC report. Warns on litigation with Postbank’s shareholders. \n* Could face hit up to 1.3B euros. \n* LULU - Barclays cuts to equal weight from overweight. \n* Lithium producers are generally higher as Saudi Arabia seeks lithium imports for EV ambitions. \n* Renewable stocks generally slightly higher. \n* Phillips share rocket 46% as the firm settles the US respiratory device case. $1.1B settlement. That was a major legislative headwind surrounding the company tha tis now overcome. \n* AVTR - maintained outperform by braid, price target 26 from 27. \n* OLN - Pric target cut to 73 from 78, by Keybanc, maintained at overweight. \n* DAL - Delta flight makes emergency return after exit slide separates from Boeing aircraft. \n* DPZ - sees strong orders as they smash sales expectations\n* BA - Turkish airlines in talks with Airbus and BA to buy 235 planes\n* BHP tells investors that their bid for Anglo is on strategy and says they are extremely disciplined. They are weighing up a possible improved proposal for Anglo American. \n* ZTS - will sell medicated feed additive portfolio to Phibro Animal health for 350M. \n\nEARNINGS:\n\n* SOFI EARNINGS:\n* Rev $581M vs $558M est\n* EBITDA $144M vs $123M est\n* **Sees 2Q:**\n* Rev $555-565M vs $590M est\n* EBITDA $115-125M vs $136M est\n* **Sees FY:**\n* Rev $2.39-2.43B vs $2.39B est\n* EBITDA $590-600M vs $589M est\n\nOTHER NEWS:\n\n* Likely FX intervention from BOJ as USDJPY hit 160.\n* Still no official comment from BOJ confirming the FX intervention. Japan’s Kanda says Japan will disclose if FX intervention came at the end of May. \n* Said they will continue to take appropriate action against excessive forex moves. \n* Phillips share rocket 46% in Europe as the firm settles the US respiratory device case. That was a major legislative headwind surrounding the company tha tis now overcome. \n* Treasury yields slightly lower ahead of FOMC meeting. \n* Eurozone April consumer inflation expectations came at 11.6, vs 12.3 in March, so less than expected. \n* California fast food chains are rising prices as state raised minimum wage for fast food workers. \n* Moodys on France: local currency senior unsecured rating remain unchanged at Aa2. The stable outlook remains unchanged as well.\n* Fitch affirms France at AA- outlook stable. \n* Israel officials worry that international criminal court is preparing to issue arrest warrants for senior government officials. \n* HAMAS supposedly has no major issue with ceasefire proposal put forward by Egypt and Israel, Supposedly the majority of Israeli government supports the terms fo the deal too. \n* Us says the proposal to Hamas is extraordinarily generous. \n* Egypt says that only US has the ability to break the cycle of violence in Gaza\n* Bitcoin ETF is set to launch in Australia now, following US and Hong Kong\n* Russian foreign minister says that there will be a severe response if Russian assets are touched. \n* Citigroup says that they expect 100 bps of cuts this year again, starting in July. They were previously expecting the first rate cut in June. \n* Fitch maintains Switzerlands Credit rating at AAA with stable outlook. \n* Turkish grocery delivery company, Getir says they are pulling out of European and US markets, to focus on main Turkish market. ",
        "created_utc": 1714392384.0,
        "subreddit_name": "DayTrading",
        "comments": 7
    }
]