[
    {
        "title": "Don't be fooled. This IS The Market Crash: My DD.",
        "score": 7743,
        "url": "https://www.reddit.com/r/stocks/comments/ipp3e9/dont_be_fooled_this_is_the_market_crash_my_dd/",
        "content": "I've been researching this a LOT lately because I didn't want to get caught in it. Looking at trends and past data. I believe, strongly, that we're in the middle of the market crash. I used my knowledge and was able to fully exit my entire $500k portfolio on Tuesday, maintaining all my gains. I've even taken a sizeable position in SPY puts ($50k worth of Dec $260). I got my close friends out (well the ones who listened) on Friday at the first sign of positive movement.\n\nFirst of all, a little history lesson on the [Minksy Bubble](https://en.wikipedia.org/wiki/Minsky_moment#/media/File:Stylized_Minsky_Cycle.PNG). It's basically a theory for how market bubbles happen. It occurs in 5 steps. I will outline what they are in basic and how the current market looks in relation.\n\n1. **Displacement**: This is the beginning of a new paradigm where the market changes in a big way. For this, that was the Coronavirus. This took place between February to April.\n2. **Boom**: Increase in spending begins and major gains start to be made. Media attention and market involvement begin to increase. Currently, we've seen a HUGE increase in retail traders (who are extremely volatile) and massive media attention toward the stock market as it relates to corona news as well as stimulus and recovery speed gains. This took place between April and July.\n3. **Euphoria**: People stop caring about any sort of reasonable investment strategy and just start throwing money at stuff. Tesla is a fantastic example of this, but many other stocks in the tech sector are guilty of this. July was the beginning of this phase as Tesla saw insane growth within a few week period and other companies followed suit very quickly. This continued into late August with Apple and Tesla going to stupid prices after their splits, and all the other big tech names reaching wild valuations.\n4. **Profit Taking**: Smart money starts withdrawing funds from the market as they prepare for the crash. We are seeing [record insider selling](https://www.cnn.com/2020/08/17/investing/insider-selling-stocks-market/index.html), but most publicly, it began with Tesla announcing they would sell $5bn in [new shares](https://www.cnbc.com/2020/09/01/tesla-to-sell-up-to-5-billion-in-stock-amid-rally.html). Their second biggest shareholder then announced they were conveniently \"[rebalancing](https://fortune.com/2020/09/04/tesla-stock-rally-investors-selling-outlook/)\" their portfolio to sell many Tesla shares as well. This was nothing more than a ploy to pull money out without crashing the market, even though it did anyway. I will get more in depth on this phase later. The biggest catalyst was [Softbank](https://finance.yahoo.com/news/softbank-dives-6-u-tech-004748400.html), though, and that leads me to the final stage.\n5. **Panic Selling**: This is when people start to exit en masse in order to recoup whatever they can. We are currently witnessing this. The last few days have been a trainwreck on the market, wiping out August's gains entirely.\n\nNow I know you want to say \"well look at today. We're up 2% in the S&P!\" This is par for the course on a crash. With the Corona crash, these were the rough day to day movement patterns (I'm using Corona as an example for its shortness/simplicity but all crashes have similar patterns):\n\n* 1 small loss day \n* 2 BIG loss days \n* 3 medium loss days \n* 5 ***gain days*** (there were 5 days of gains in the middle of the March crash) \n* 1 GIANT loss day \n* 3 Sideways days \n* 8 slightly down days, leading to the bottom \n\nOf those gain days, the first was a slowdown, but the second was a change of 4.8% in S&P/SPY from an open of 294 to a close of 309. Consecutive, positive days occurred during every major crash. We can see that being mirrored today and will likely see more upward mobility before more big money starts exiting. Don't be fooled by positive days. That does NOT indicate the crash is over. Novices tend to think crashes are a short event and that they should hold through them because they missed the boat. Crashes take weeks, minimum, but **usually months, if not years**, to become fully realized. Covid's crash is the fastest we've had at one month.\n\nAnother trend I've noticed is that these market bubbles are happening and recovering faster and faster. The late 80's Japanese market crash took 6 years to play out. The 2000 dotcom bubble was 4 years. The Chinese 2007 bubble took 2 years. The 2008 oil bubble took 1 year. On the flipside, the 2007 housing bubble took 5 years. The 2008 energy bubble took 3 years. We're about 6 months into this current bubble, but more if you account for any forming bubble from before covid. Maybe this means nothing, but I thought it was worth mentioning.\n\nBubble analysts always say there is a warning sign prior to a true collapse. I've been seeing these called \"violent shake-offs.\" Most crashes get one, but some get two. We had one with the June mini-crash. One could argue that this current crash could be a violent shake-off. I'll get to the alternate scenario later. Assuming it's not, which I don't think it is, we move to the final trigger, the catalyst.\n\n**Catalysts**: These are are things required to trigger a bubble collapse. Almost every bubble has had some notable catalyst(s) to trigger the rapid decline. As mentioned in Profit Taking, we've had three catalysts occur so far that triggered panic selling. New Tesla shares, secondary Tesla offloading, and Softbank. They are the big one and who I will focus on for a minute.\n\nTo those who don't know, Softbank bought $4 billion in options during the early days of the market post-covid. These options are worth a fortune right now ($30bn estimated), but they have to be sold in order to be fully capitalized on. What everyone is afraid of is Softbank doing just that, or worse, for shareholders: holding through a market crash and losing it all. In the movie, Margin Call (great movie), a hedge fund got wind of the housing market crash before everyone else and ultimately sold EVERYTHING they had in order to get ahead of it, single handedly beginning the inevitable market crash. To be fair, this is a fictional movie and they had a portfolio of like a trillion, but it's really just mentioned to illustrate my point. Softbank has to exercise these options, which have strike prices likely WAY below market value. If they sell those shares, they could easily double their investment, even through a crash. The problem is that people got so spooked by this revelation that Softbank lost over $15 billion in market cap (currently at $112bn). Had this not happened, the speed at which we decline would've been much slower. They have to make those losses up now. You know what would do that? Exercising all their options and selling them for market gains.\n\nThey can't keep those options forever, either. At best they have 2 years. Softbank will try very hard to sell all those off without crashing the market, but if it keeps dipping, they will become more desperate and start selling them more frantically, promoting a panic selling cycle. And what are we in? A panic selling cycle.\n\nIf this cycle continues with Softbank, more will tack on and we'll see this bubble continue to collapse. If it can hold a recovery this week, it might survive, but of course, I don't think it will. The end of day today really showed that people *are* afraid and that given any opportunity, selloff will occur. I think this IS the crash. But, I could be wrong. That brings me to the second and third catalysts.\n\n**Commercial Real Estate Crash**: The eviction crisis is a real threat to our economy. It's brushed under the rug pretty heavily, pointing to the home real estate market and its gains, but the damage is done. Most major commercial real estate buildings, especially apartments, are in disarray. Go look around and see the kinds of deals your local apartments are offering. Where I am, I'm seeing up to 2 months of free rent in some places. I've never seen that before. Everyone is desperate for paying tenants. Most commercial properties can weather a bit of this kind of thing, but we haven't seen anything like this. Small businesses are shutting down, new businesses are not opening. No one is shopping. Who replaces those lost tenants? All these properties are heavily in debt. That's how the industry works, for the most part. Entrepreneurs and builders finance all projects because they are seen as very safe and it's a rule of thumb to never use your own money for investment. The margins had become abysmal before corona. I once looked into buying commercial real estate and found that I would only cover the expenses and have to solely rely on the property value increasing, to make anything worthwhile. This will cause properties to bleed out extremely fast. There is a commercial real estate collapse coming, likely within 6 months, and it will compound any damage the tech bubble has done. Don't forget that this isn't strictly a US problem. This is a worldwide problem.\n\n**Vacation Industry Crash:** Many countries around the world rely on a steady influx of visitors in order to keep their businesses afloat. This, in turn, boosts GDP. Malaysia, for instance, is a place I personally visited, during Covid, and it was a desolate wasteland. Most shops had employees literally standing outside waiting for a single customer. It was like this for blocks and blocks. Huge tourist attractions were completely devoid of people. It's only a matter of time before our lack of flying catches up to these already poor and extremely hard to maintain businesses. The country in Malaysia I visited had a notoriously low success rate for new restaurants, during the best of times. Now, they are lucky to get any customers. That affect will bleed into the second catalyst. More businesses going under, causing commercial real estate to lose tenants with no one to replace them, causing those buildings to go under, causing banks to be stuck with a boat load of vacant, unprofitable properties, causing them to go under.\n\nEven with a vaccine, we won't go back to normal fast enough to recover the losses. The airline industry is reporting that they don't estimate returns to normal until late 2021, early 2022. Do you think a random Joe has enough liquidity to keep his business running that long at extreme drought? The people at the bottom of the chain, consumers and small business owners, were never prepared to have a cash supply on hand for this kind of hit to their lives. That *is* going to trickle up to the top and when it does, goodbye market.\n\nOf course, there's also the US election, but that will be a small catalyst as far as I'm concerned.\n\n\\------------------------------------------------\n\nOther notable indicators/insights that things don't look good:\n\n1. Market cap to GDP was 2:1 at peak. The dotcom crash was 1.4 and the recession was 1.1. Currently 1.77:1.\n2. Google trend results for \"Market Crash\" are trending up. Last week, which only accounted for 3 days, really, already topped the June mini-crash.\n3. An [analyst](https://www.ft.com/content/9d12ae03-2f6b-4028-8464-e305269e7ee3) who witnessed the Japanese crash of the 1980's believes this will be the biggest crash we've ever seen.\n4. EVs are the new dotcom company. Many will fail as car creation proves to be more difficult than anticipated.\n5. High growth, high revenue companies do not automatically equate to sustainable companies, despite stock prices pretending they do. For example, Sea Ltd. doubled revenue but also doubled expenses in Q2 2020. eToys is a prime example of this, from the dotcom bust era. Had huge revenue, but their expenses could not be lowered to a sustainable level and went out of business, despite the business model making sense and the revenue stream looking really good.\n6. The PE ratio of the market is above 30, which has historically always resulted in a market crash.\n7. Apple saw 12 million shares exited at the bell today. Prior to that was around 600k peak. This happened for MOST tech stocks.\n8. If you bought Microsoft at peak dotcom bust, you would have to wait 10 years to breakeven (longer if you account for inflation losses). That kind of stagnation is what we're looking at, even today.\n\n\\------------------------------------------------\n\nThis does NOT mean the entire market will crash. Quite the contrary. Yes, most stocks will go down as the market collapses in overvalued sectors (TECH) brings down the whole thing, but they will stay high if priced fairly. Most epicenter is priced within a reasonable area, for instance, and will weather the storm quite well. At least, until the commercial real estate market collapse catches up to them.\n\nPlan accordingly, set stop losses, and do your own research. I don't expect you to just follow my information blindly. I may have gotten things wrong or mixed some wires. You need to figure this out on your own and make your own judgement call. I simply hope to raise awareness for what I believe is a market crash so that people don't lose their shirt during this. I hope I'm wrong, though I'm literally betting with my money that I'm not.\n\nGood luck.",
        "created_utc": 1599685339.0,
        "subreddit_name": "stocks",
        "comments": 1659
    },
    {
        "title": "Apple Disabling 'Sign in with Apple' for Epic Games on September 11",
        "score": 9346,
        "url": "https://www.macrumors.com/2020/09/09/sign-in-with-apple-epic-games-disabled/",
        "content": "",
        "created_utc": 1599668497.0,
        "subreddit_name": "apple",
        "comments": 1030
    }
]