[
    {
        "title": "Will Nvidia suffer due to increased tensions with China?",
        "score": 234,
        "url": "https://www.reddit.com/r/stocks/comments/1gl3byx/will_nvidia_suffer_due_to_increased_tensions_with/",
        "content": "I want to be clear this is not a political post. Not looking for political opinions.\n\n  \nPost-January, we're likely to be entering a period of increased tensions with China. This seems bad for Nvidia in multiple ways.\n\n1. Beijing has previously expressed desire to urgently switch away from NVDA chips and invest locally. Obviously that's easier said than done, but with China being such a huge market for NVDA, increased tensions over tariffs could push this mandate further. The amount of revenue NVDA gets from China has already decreased, but this further deceleration could be negative. [https://archive.is/v40zX](https://archive.is/v40zX)\n\n  \n2. Trump has accused Taiwan of stealing the U.S. chip industry. He wants to put tariffs on chips from Taiwan. Obviously, everyone is relying on TSMC, so this seems clearly bad news. [https://www.cnbc.com/2024/10/28/trump-accuses-taiwan-of-stealing-us-chip-business-on-joe-rogan-podcast.html](https://www.cnbc.com/2024/10/28/trump-accuses-taiwan-of-stealing-us-chip-business-on-joe-rogan-podcast.html)\n\n  \nI'm completely open to being told I'm wrong and being called a moron, but please don't spam downvote if you disagree with my take. This is a popular stock on this subreddit, and others will have similar posts. \n\n\n\nLet's just get this discussion over with now, yeah?",
        "created_utc": 1730912652.0,
        "subreddit_name": "stocks",
        "comments": 158
    },
    {
        "title": "Qualcomm pops on chipmaker's earnings and revenue beat",
        "score": 92,
        "url": "https://www.reddit.com/r/stocks/comments/1glceac/qualcomm_pops_on_chipmakers_earnings_and_revenue/",
        "content": "Qualcomm reported fourth-quarter earnings on Wednesday that beat Wall Street expectations for earnings and revenue, and the company guided to a strong December quarter.\n\nThe shares rose 10% in extended trading at one point before falling to a gain of about 4%.\n\nHere’s how the company did versus Refinitiv consensus expectations for the quarter ending Sept. 29:\n\nEarnings per share: $2.69, adjusted $2.56 expected\n\nRevenue: $10.24 billion versus $9.90 billion expected\n\nQualcomm said it expects revenue in the current quarter of between $10.5 billion and $11.3 billion, with the midpoint of that range beating LSEG consensus expectations of $10.59 billion.\n\nThe company reported $2.92 billion in net income, or $2.59 per share, a sharp jump from last year’s $1.49 billion, or $1.23 per share. Qualcomm reported $33.19 billion in total revenue in its fiscal 2024, a 9% increase from 2023.\n\nQualcomm’s fortunes have historically been tied to the smartphone industry, where the company provides a range of chips to handset makers, including system-on-a-chip processors, modems, and antennas. The company makes the chip at the heart of most high-end Android devices, and many lower-end phones as well. Qualcomm also sells modems and related chips to Apple for its iPhones, and last year said its contract for 5G chips ran through 2026.\n\nQualcomm reported a 12% increase in handset chip sales to $6.1 billion, in line with FactSet estimates. Qualcomm introduced its high-end chip for 2025, called Snapdragon 8 Elite, in October.\n\n“In handsets we delivered greater than 20% year-over-year growth in Android revenues,” said Qualcomm CFO Akash Palkhiwala on a call with analysts.\n\nUnder CEO Cristiano Amon, the company has diversified away from being a smartphone supplier and has introduced and invested heavily in producing chips for PCs, cars, and industrial machines.\n\n“We will continue to transform Qualcomm from a wireless communications company into a connected computing company for the age of AI,” Qualcomm CEO Cristiano Amon said on the earnings call with analysts.\n\nQualcomm has also made efforts to brand itself as a leader in AI, having developed smartphone chips with specialized parts for machine learning since 2017. But unlike Nvidia, the company doesn’t produce the kind of graphics processors for data centers that are used for big AI programs like OpenAI’s ChatGPT.\n\nThe automotive business grew 86% on an annual basis to $899 million in sales. Qualcomm says it has billions of dollars in business with automakers currently in its development pipeline, and highlighted it was the fifth consecutive quarter of growth. Qualcomm said that it expected automotive sales in the current quarter to rise 50% on an annual basis.\n\nThe company’s “internet of things” business includes both chips for industrial purposes as well as the chips Meta uses in its Quest handsets and Ray-Ban Smart Glasses. It also includes the new business selling chips for laptops running Microsoft Windows. The division reported $1.68 billion in revenue, a 22% increase from a year earlier.\n\nQualcomm’s chip business, including its handset, automotive, and other chips, which together is reported as QCT, saw sales rise 18% during the quarter to $7.37 billion in total. \n\nThe company’s profitable technology licensing business, QTL, reported $1.52 billion in revenue, a 21% increase over the same period last year.\n\nQualcomm said its board had approved $15 billion in additional buybacks. During the fourth quarter, it repurchased $1.3 billion worth of shares and paid out $947 million in dividends.\n\nSource: https://www.cnbc.com/2024/11/06/qualcomm-qcom-earnings-report-q3-2024.html",
        "created_utc": 1730935673.0,
        "subreddit_name": "stocks",
        "comments": 10
    },
    {
        "title": "300 to 26k in 3 weeks",
        "score": 7650,
        "url": "https://www.reddit.com/gallery/1gl19u0",
        "content": "Been doing options since the beginning of this summer, started out with around 1.8k. Was down to my last $300 and decided to all in tesla before earnings 10/24 landing me 3.2k. It just snowballed from there and I finally reached 26k today! Never give up my fellow regards!",
        "created_utc": 1730907375.0,
        "subreddit_name": "wallstreetbets",
        "comments": 522
    },
    {
        "title": "Cathie Wood Sells Tesla Before Election; Musk Cabinet Position 'Not What Shareholders Want To See'",
        "score": 1734,
        "url": "https://www.investors.com/news/tesla-stock-cathie-wood-elon-musk-election/",
        "content": "",
        "created_utc": 1730894278.0,
        "subreddit_name": "wallstreetbets",
        "comments": 335
    },
    {
        "title": "Thanks Papa Elon, Trump ",
        "score": 1283,
        "url": "https://www.reddit.com/gallery/1gl0cru",
        "content": "Been in $TSLA leaps since July. Decided to open, and DCA 11/29 $270 calls after $TSLA red for 6 days straight after the earning. Closed the 11/29 calls. Hold the leaps for now. ",
        "created_utc": 1730904955.0,
        "subreddit_name": "wallstreetbets",
        "comments": 248
    },
    {
        "title": "Netflix offices in Europe raided by tax fraud investigators",
        "score": 755,
        "url": "https://www.forbes.com.au/news/world-news/netflix-offices-in-europe-reportedly-raided-by-tax-fraud-investigators/",
        "content": "",
        "created_utc": 1730852993.0,
        "subreddit_name": "wallstreetbets",
        "comments": 41
    },
    {
        "title": "35k Gains Tesla Calls",
        "score": 441,
        "url": "https://i.redd.it/97anwzqp3bzd1.jpeg",
        "content": "Dropped 4k 1 day before elections into Tesla $257.5 Calls expiring friday. Doubled my portfolio overnight with over 35k in gains.",
        "created_utc": 1730909868.0,
        "subreddit_name": "wallstreetbets",
        "comments": 24
    },
    {
        "title": "Bought $15K in 3:1 Kamala Bets and then 50k in OTM Tesla calls. Up >200K",
        "score": 370,
        "url": "https://www.reddit.com/gallery/1gl2362",
        "content": "I placed $15,000 on 3:1 Kamala Harris Bets and then bought 50K OTM TSLA for Mid to Late Nov. $5K downside for 200K upside?\nI'll take it",
        "created_utc": 1730909497.0,
        "subreddit_name": "wallstreetbets",
        "comments": 66
    },
    {
        "title": "For the first time ever, AMD outsells Intel in the datacenter space",
        "score": 262,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gklmy6/for_the_first_time_ever_amd_outsells_intel_in_the/",
        "content": "This victory means AMD has become the leader in the data center processor market, a significant achievement in a sector that Intel has dominated for years. AMD’s success reflects a shift in corporate preferences toward processors that offer high performance and energy efficiency, making AMD’s EPYC processors a more attractive option for businesses. \n\nhttps://www.tomshardware.com/pc-components/cpus/for-the-first-time-ever-amd-outsells-intel-in-the-datacenter-space",
        "created_utc": 1730852270.0,
        "subreddit_name": "wallstreetbets",
        "comments": 21
    }
]