[
    {
        "title": "Apple Reportedly Developing OLED iPad Mini for 2026",
        "score": 1002,
        "url": "https://www.macrumors.com/2024/05/24/apple-developing-oled-ipad-mini-for-2026/",
        "content": "",
        "created_utc": 1716556976.0,
        "subreddit_name": "apple",
        "comments": 315
    },
    {
        "title": "Apple stock is poised to surge nearly 50% as it heads toward its most important day in a decade, Wedbush says",
        "score": 29,
        "url": "https://markets.businessinsider.com/news/stocks/apple-stock-price-prediction-value-wwdc-ai-iphone-16-cycle-2024-5",
        "content": "Could AAPL be the next NVDA? Probably not, but it will be a wild ride…",
        "created_utc": 1716583039.0,
        "subreddit_name": "AAPL",
        "comments": 20
    },
    {
        "title": "I almost died today",
        "score": 3410,
        "url": "https://v.redd.it/zd5ykghbgf2d1",
        "content": "Bought 0DTE 528P on SPY and was almost immediately up $7000 but soon following that missed exit was the infamous Infinipump that blew past my stop loss and my options didn’t even get a chance to sell (even with a .10 trail). Suddenly I was down $5K. Like a true regard, I then decided to turn off all stop losses and begin the journey of averaging down all day through the 529-530 chop. I got my average down from 1.06 to .25 through sheer determination and risking almost all of my bananas.\n\nAt 1500 hours, I was visibly sweating and aggressively yelling out prayer as theta was eating up my bag down to .08 per contract and my losses were at nearly 12K. I nearly pulled the trigger and exited with a hell of a tax write off. However, I saw a little hope that SPY would be giving us a nice sour hour selloff into the holiday weekend and MAG7 looked way overbought… so I held four more minutes.\n\nI immediately fired off the sell button as soon as SPY did a sub-minute dollar drop off from 529.40 to 528.40 and my options were suddenly not only recovered, but decently green. Do you think I learned my lesson? Before you speculate whether I did or not, notice my usage of Robinhood… my account will probably be zero by the end of the month.",
        "created_utc": 1716579552.0,
        "subreddit_name": "wallstreetbets",
        "comments": 510
    }
]