[
    {
        "title": "Amazon stock soars 15% after earnings, will hike Prime membership fee",
        "score": 1755,
        "url": "https://www.reddit.com/r/investing/comments/sjvmmh/amazon_stock_soars_15_after_earnings_will_hike/",
        "content": "Article link: https://finance.yahoo.com/news/amazon-earnings-162246834.html\n\n$AMZN is currently up 18% in AH.\n\nAmazon (AMZN) reported fourth quarter results on Thursday and announced it will raise its Prime membership fee to $139 per year from $119 in the U.S. The stock is soaring in after-hours.\n\nThese are the top- and bottom-line results for Amazon's fourth quarter.\n\nEarnings per share: $27.75\n\nRevenue: $137.4 billion\n\nThis is the third time since the launch of Amazon Prime that the e-commerce giant raises prices for its yearly delivery service in the U.S. It hiked fees in 2014 and 2018 by $20 each time. The announced price change will go into effect for new members on February 18th. Existing members will see the fees upon their renewal date after March 25.\n\nThe company's net income nearly doubled last quarter compared to the same period the previous year, in large part because of the company's investment in EV startup Rivian (RIVN). Amazon reported $14.3 billion in net income for Q4, compared to $7.2 billion during the last three months of 2020.\n\n\"Fourth quarter 2021 net income includes a pre-tax valuation gain of $11.8 billion included in non-operating income from our common stock investment in Rivian Automotive, Inc., which completed an initial public offering in November,\" said the company's earnings statement.\n\nNet sales increased 9% to $137.4 billion in the fourth quarter, compared with $125.6 billion in the same period last year.\n\nAmazon's Web Services unit brought in $17.78 billion in revenue for the quarter, compared to expectations of $17.23 billion.\n\nThe company's 1st quarter revenue forecast is for $112 billion-$117 billion. The Street was expecting guidance of $120 billion.\n\n“As expected over the holidays, we saw higher costs driven by labor supply shortages and inflationary pressures, and these issues persisted into the first quarter due to Omicron. Despite these short-term challenges, we continue to feel optimistic and excited about the business as we emerge from the pandemic,\" \"Andy Jassy, Amazon CEO said in the company's earnings release.\n\nDisclosure: I have long positions in $AMZN.\n\nWhat's very noteworthy is that they also booked an **$11.8B pre-tax gain from their stake in Rivian**: https://www.reuters.com/business/media-telecom/amazon-hikes-prime-membership-fees-us-2022-02-03/, which accounted for more than *80%* of their quarterly profit",
        "created_utc": 1643925555.0,
        "subreddit_name": "investing",
        "comments": 495
    },
    {
        "title": "Why FB is investing so heavily into VR (if it isn't obvious by now)",
        "score": 2545,
        "url": "https://www.reddit.com/r/stocks/comments/sjkieh/why_fb_is_investing_so_heavily_into_vr_if_it_isnt/",
        "content": "They have no control over the OS right now. iOS (Apple) and Android (Google) can do whatever they want at the OS level.\n\nWithout control at the OS level. FB can't do the following:\n\n* Create an app store and charge 30% for transactions like Apple and Google does\n* Control its own destiny. Right now, Apple and Google control FB's destiny just as much as FB itself does. Ex: Apple deciding to take away app tracking. Android could do it eventually as well because Google now knows less tracking drives more advertisers to Google search.\n* Market its own products and services over Apple and Google's. For example, Youtube is preinstalled on Android and Apple's app store ads compete with FB's.\n\nFB is hellbent on having its own OS and controlling its own destiny in what they think is the next mass-market device: VR.\n\nFB is early in the VR push. It's early because it wants a seat at the table when VR is mature. But being early is expensive and they're not guaranteed to beat Apple, Google, Microsoft, Amazon, or some Chinese/unknown company.\n\nThat's why FB is willing to lose $10b/year on VR. Do I think it's the right strategic decision? I don't know. Am I surprised that they're willing to lose $10b/year on VR? Not at all. Not one bit. I think Zuckerberg, with his full control, would drive Meta to bankruptcy before giving up on it.\n\n**Additional commentary:**\n\nWhile I think Zuckerberg truly believes in the \"metaverse\" future, I think the recent push into VR is somewhat fueled by the inability to innovate inside FB. Think about it. When was the last time FB launched a hit app? Whatsapp and Instagram were purchased. The best IG features were copied from Snap (Stories) and Tiktok (Reels). Besides the traditional social media apps, people are also spending more time on other networks like Reddit, Discord, Twitch, Clubhouse. FB can't innovate.\n\nThey've built a culture of optimization, not creation. Because of this, they can't make something to capture the attention of the younger generation. As we all know, each generation has its own set of social media apps because kids don't want to use the same social network as their parents. FB will eventually die out because of this lack of innovation. The \"metaverse\" is kind of like Zuckerberg's hail mary. If he can create a platform, he can be the Apple or Google by controlling the OS. He won't have to worry about a new cool app that steals users away from FB/IG/Whatsapp because that app will be on his own platform.\n\nLet me ask you this: if TikTok was invented by Facebook, would they still go all in on the meta verse right now?\n\nDisclaimer: I don't own any FB stocks. I actually dislike the company a lot and wouldn't buy their stocks out of principle. But it makes total logical sense to me why FB is investing so heavily into VR.",
        "created_utc": 1643898406.0,
        "subreddit_name": "stocks",
        "comments": 820
    },
    {
        "title": "AMZN surges +15% after hours after blowout earnings release",
        "score": 1875,
        "url": "https://www.reddit.com/r/stocks/comments/sjucf4/amzn_surges_15_after_hours_after_blowout_earnings/",
        "content": "Amazon reported earnings after the bell. Here are the results.\n\nEarnings per share: $27.75\n\nRevenue: $137.4 billion vs $137.6 billion expected, according to a Refinitiv survey of analysts\n\nAWS revenue: $17.37 billion expected, according to StreetAccount\n\nAlso, Prime membership cost will be going up +$20/yr. \n\nMore here: https://www.cnbc.com/2022/02/03/amazon-amzn-q4-2021-earnings.html",
        "created_utc": 1643922361.0,
        "subreddit_name": "stocks",
        "comments": 555
    },
    {
        "title": "AMZN lives! But the FAANG is dead. FB and NFLX dont belong on the Mt Rushmore of Tech Giants, who replaces them?",
        "score": 1648,
        "url": "https://www.reddit.com/r/stocks/comments/sjvhda/amzn_lives_but_the_faang_is_dead_fb_and_nflx_dont/",
        "content": "Obviously MSFT should be one of the replacements, so who gets the other spot? NVDA seems like a solid candidate, giving us an aesthetically pleasing MANGA index. Who would you consider in the elite ring of big tech and why?",
        "created_utc": 1643925175.0,
        "subreddit_name": "stocks",
        "comments": 854
    },
    {
        "title": "Facebook blames Apple after a historically bad quarter, saying iPhone privacy changes will cost it $10 billion",
        "score": 58711,
        "url": "https://www.businessinsider.com/facebook-blames-apple-10-billion-loss-ad-privacy-warning-2022-2",
        "content": "",
        "created_utc": 1643922425.0,
        "subreddit_name": "technology",
        "comments": 4696
    }
]