[
    {
        "title": "Apple TV Plus and Paramount Plus reportedly discussing cheap bundle plan to take on Netflix",
        "score": 421,
        "url": "https://www.reddit.com/r/stocks/comments/188i79a/apple_tv_plus_and_paramount_plus_reportedly/",
        "content": "https://www.techradar.com/streaming/apple-tv-plus-and-paramount-plus-reportedly-discussing-cheap-bundle-plan-to-take-on-netflix\n\nAccording to the Wall Street Journal (WSJ), two of the world's most underrated streamers have held talks about creating a cost-effective bundle to put a stop to Netflix's dominance of the streaming landscape. People familiar with the discussions reportedly told the WSJ that Apple TV Plus and Paramount Plus aren't just looking to end Netflix's reign as the world's best streaming service. Per the US outlet's sources, the duo are also said to want to offer their services as a joint enterprise in a bid to save people money. Indeed, the two companies are believed to have had meaningful dialog about offering said bundle at a cheaper price than subscribing to both streamers separately – a deal that would surely pique the interest of customers operating on a budget.\n\nIf the WSJ's report is correct – the outlet is keen to stress talks are still in the early stages – the potential bundling of Paramount Plus and Apple TV Plus into a single package could have a big impact on the wider streaming industry. For one, the world's eight biggest streamers have all raised their prices over the past 12 months – some, such as Disney Plus and Max, have done so twice in less than a year in the US. That's placed undue pressure on people who are subscribed to multiple services, with many forced to choose which one (or, at a push two) to stay with as the cost of living continues to bite.\n\nThe bundling of Paramount and Apple's platforms, then, would be seen as a significant move. Like their rivals, the pair have increased their subscription fees in 2023 – Apple TV Plus' major price hike was particularly irksome to me – and, while each one has some great content to offer customers, their back catalogs aren't on a par with Netflix, Prime Video, or even Hulu. Apple TV Plus' library only consists of first-party (albeit mostly terrific) offerings, while Paramount Plus doesn't have the strength in depth from first and third-party perspectives to compete with the world's most popular services.",
        "created_utc": 1701453708.0,
        "subreddit_name": "stocks",
        "comments": 120
    },
    {
        "title": "Apple, Paramount discuss bundling their streaming services - WSJ",
        "score": 2966,
        "url": "https://www.reuters.com/technology/apple-paramount-discuss-bundling-their-streaming-services-wsj-2023-12-01/?utm_source=reddit.com",
        "content": "",
        "created_utc": 1701441807.0,
        "subreddit_name": "apple",
        "comments": 560
    },
    {
        "title": "Steam drops macOS Mojave support, effectively ending life for many 32-bit games",
        "score": 1863,
        "url": "https://arstechnica.com/gadgets/2023/11/steam-drops-macos-mojave-support-effectively-ending-life-for-many-32-bit-games/",
        "content": "",
        "created_utc": 1701390186.0,
        "subreddit_name": "apple",
        "comments": 157
    },
    {
        "title": "iPhone 16 to Include Action Button Across Entire Lineup",
        "score": 682,
        "url": "https://www.macrumors.com/2023/11/30/iphone-16-action-button-all-models/",
        "content": "",
        "created_utc": 1701425116.0,
        "subreddit_name": "apple",
        "comments": 291
    }
]