[
    {
        "title": "Amazon Hits $2 Trillion Valuation For First Time Ever",
        "score": 581,
        "url": "https://www.reddit.com/r/stocks/comments/1dp40ak/amazon_hits_2_trillion_valuation_for_first_time/",
        "content": "Amazon.com Inc. has reached a $2 trillion market valuation for the first time ever as an artificial intelligence-fueled rally pushed the tech giant deeper into record territory. \n\nShares rose as much as 3.6% Wednesday to $193.04, pushing the market value to more than $2 trillion. The company is now a member of an elite club of a handful of peers that have surpassed the key market capitalization. Alphabet Inc. passed the $2 trillion threshold in late April, while rallies have pushed market values of Nvidia Corp., Microsoft Corp. and Apple Inc. to more than $3 trillion. \n\nAmazon shares have whipsawed since the company’s first quarter earnings, when the cloud unit posted the strongest sales growth in a year, helping to power the stock back above the all-time high set in April. The stock rallied in June, recovering losses from the end of May to gain about 27% so far this year.\n\nShares of the megacap technology company have gotten a lift over the past year as the company cut costs and restructured its business to better take advantage of the AI frenzy. In addition, its key Amazon Web Services business has shown signs of re-accelerating growth, a major point of optimism for investors. ",
        "created_utc": 1719422102.0,
        "subreddit_name": "stocks",
        "comments": 137
    },
    {
        "title": "Why Intel is the most undervalued tech stock right now.",
        "score": 4134,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1dowoqn/why_intel_is_the_most_undervalued_tech_stock/",
        "content": "Intel ($INTC) is an insane bargain right now, as it is trading at year 1999 stock price.\n\nEvery other comparable tech stock is up 5000%-20000% since then.\n\nPeople are too focused on Intel consumer and data center products, which by the way are improving at impressive rate. Now they have AI chip comparable to NVIDIA's H100 (Guadi 3). Lunar lake SoC for laptops based on 3nm, upcoming desktop CPUs based on Intel 20 (Arrow Lake in Q3), and they also announced the next gen of Intel Arc GPUs with massive gains and driver improvements to make them very competitive with AMD & NVIDIA offerings.\n\n**But the real deal is Intel Foundry segment.**\n\nCurrently Intel is the only company in the world that has ASML's next gen EUV machines (called High-NA) up and running. They will be able to manufacture sub 2nm silicon at impressive rate. No other company has received such machines. With rumors that TSMC (current leader in foundry business) will only receive them in 2026, and **I doubt the USA will allow much to be sent to Taiwan, for obvious security reasons.**\n\nMicrosoft & Qualcomm already announced they gonna use Intel upcoming 18A node for their future products, and it's only matter of time until we hear others like NVIDIA & Apple jumping in.\n\nIf you are a big tech company and want the best, cutting edge silicon you will have to switch to Intel foundry sooner or later.\n\nInvesting in Intel right now is like buying NVDA stock before the AI boom. ",
        "created_utc": 1719402652.0,
        "subreddit_name": "wallstreetbets",
        "comments": 1326
    },
    {
        "title": "The Green Bubble Nightmare Is Over, Apple Messages Now Support RCS",
        "score": 11175,
        "url": "https://gizmodo.com/apple-messages-supports-rcs-ios18-beta-1851562461",
        "content": "",
        "created_utc": 1719443472.0,
        "subreddit_name": "technology",
        "comments": 1538
    }
]