[
    {
        "title": "JPMorgan advises clients to expose 1% of their portfolio to Bitcoin",
        "score": 4757,
        "url": "https://www.reddit.com/r/investing/comments/lt7oop/jpmorgan_advises_clients_to_expose_1_of_their/",
        "content": "In a recent note to clients, strategists from JPMorgan (NYSE:JPM) suggested a one percent portfolio allocation to Bitcoin and other cryptocurrencies.\n\nAs reported by Bloomberg, JPM strategists Joyce Chang and Amy Ho opined that Bitcoin could serve as a hedge against fluctuations from traditional assets like bonds, stocks, and commodities. However, they advised clients to allocate a small percentage due to the risk of major downturns in Bitcoin’s value.\n\nAfter setting a new all-time high above $58,000, the value of the digital asset slumped to less than $45,000 and has been struggling to recover ever since.\n\nChang and Ho told investors:\n\n>*In a multi-asset portfolio, investors can likely add up to 1% of their allocation to cryptocurrencies in order to achieve any efficiency gain in the overall risk-adjusted returns of the portfolio.*\n\nBitcoin has welcomed major investments from the likes of Paul Tudor Jones, Tesla (NASDAQ:TSLA), and MicroStrategy. The endorsement from JPM comes at a time when institutional players are rushing to accumulate the digital asset. As per Bloomberg’s report, America’s oldest bank BNY Mellon (NYSE:BK) has also announced plans to enable Bitcoin transactions for its clients.\n\nThe strategists were quick to add that cryptocurrencies should be viewed as an investment vehicle and opposed to being funding currencies like the USD or EUR. This appears to be contrary to earlier statements from other JPM analysts that called cryptocurrencies the “poorest hedge for major drawdowns in equities.”\n\n[https://www.investing.com/news/cryptocurrency-news/jpmorgan-advises-clients-to-expose-1-of-their-portfolio-to-bitcoin-2431724](https://www.investing.com/news/cryptocurrency-news/jpmorgan-advises-clients-to-expose-1-of-their-portfolio-to-bitcoin-2431724)",
        "created_utc": 1614373174.0,
        "subreddit_name": "investing",
        "comments": 1753
    }
]