[
    {
        "title": "iOS 17.4 adds new 'Virtual Card Number' feature to Apple Cash",
        "score": 1321,
        "url": "https://9to5mac.com/2024/02/11/apple-cash-virtual-card-number-feature/",
        "content": "",
        "created_utc": 1707734424.0,
        "subreddit_name": "apple",
        "comments": 123
    },
    {
        "title": "The Vision Pro now lets you reset your passcode without a trip to the Apple store.",
        "score": 1227,
        "url": "https://www.theverge.com/2024/2/12/24070904/the-vision-pro-now-lets-you-reset-your-passcode-without-a-trip-to-the-apple-store",
        "content": "",
        "created_utc": 1707765451.0,
        "subreddit_name": "apple",
        "comments": 82
    },
    {
        "title": "These seats are $200,000+ , calls on $SPY? Since the economy is booming",
        "score": 16622,
        "url": "https://i.redd.it/m4ved2rit1ic1.jpeg",
        "content": "",
        "created_utc": 1707697530.0,
        "subreddit_name": "wallstreetbets",
        "comments": 988
    },
    {
        "title": "I'm a full time trader and this is a complete report of everything I read and analysed from premarket 02/12 to inform your trading today.",
        "score": 153,
        "url": "https://www.reddit.com/r/Daytrading/comments/1aozz4k/im_a_full_time_trader_and_this_is_a_complete/",
        "content": "**Analysis**:\n\n* Today looks like a relatively light day in terms of macro releases and news. This is pretty much reflected in how flat premarket has been, around the levels it closed on Friday. \n* Let’s get into positioning then: \n* &#x200B;\n* On SPX, the call interest is surging on SPX at 5050 and 5100, following the break of 5000 on Friday. The market looks like it is extending the bets on the market going higher from here. The images below compare the option positioning on Thursday close vs Friday close. See a lot more developing over 5000.   \n \n* [https://imgur.com/a/HiOeIpa](https://imgur.com/a/HiOeIpa)\n* This chart shows all expirations. If we look at some near term expirations, we can see that the call resistance has rolled up to 5030. This is a bullish sign. We are not really seeing much activity here on the downside to suggest any worry of an immediate correction. \n* 5030 level looks like it could be a key level today, but watch the levels to watch section below  \n  [https://imgur.com/a/XLxpVBl](https://imgur.com/a/XLxpVBl)   \n   \n the Gex is very positive right now. We are quite far above the HVL. This tells us that mosts likely, since we are in such positive gamma, the volatility will be suppressed today. \n* Skew is actually pointing slightly lower, but it’s no big deal, it’s just because futures are flat. block flows are very strong, and continue to increase. \n* Traders are starting to hedge the market, buying OTM puts, but the positioning still bullish, just increasingly cautious.   \n \n* If we look at QQQ then, we had SPX hit 5k on Friday, but the market is still watching to see QQQ hit 440. That is a VERY sticky strike. We see a LOT of call interest on it, and IV OI. I’d expect it to hit this week, particularly if some of the macro data supports it.  \n \n* We can see the positioning in the images below:  \n \n* [https://imgur.com/a/LyaRLVJ](https://imgur.com/a/LyaRLVJ)  \n \n* Note that QQQ tracks Nasdaq (NDX), which is currently trading at 17,956. Watch 18k level. The market will probably face some resistance there and we will need to see stronger volume for it to break. 18k is also the Call resistance. So whilst you may watch QQQ, you should also be watching this level on NDX. \n* Look at one thing here: mag7 Skew. This is the skew but concentrated on just the Mag 7.\n* Moving higher again, at ATH. Traders don’t expect any issues for the big firms. Expected to carry the market higher. \n* Let’s take a look at some FX ahead of the week:\n* AS mentioned in the report yesterday, ahead of CPI, risk reversal in USD is pointing lower. Traders are not particularly concerned about the CPI and PPI and expect ti to come in soft or in line. \n* We can see this bearish divergence here, clearly. \n* [https://imgur.com/a/prrhrjB](https://imgur.com/a/prrhrjB)\n* For individual currency pairs, EURUSD and GBPUSD, for both, risk reversal is pointing higher. \n* [https://imgur.com/a/NZXurdQ](https://imgur.com/a/NZXurdQ)\n* A quick look at NVDa then, which is up again in premarket. \n* What we are seeing here is basically a continued squeeze. Skew points higher again, hits a new high. This comes as IV in OTM puts drop. BASically, bears keep trying to predict and short the pullback, but then as it moves higher, they continue to get squeezed and rush to cover their positions. This is moving NVDA higher in a parabolic way. If you are bearish on NVDA, it seems you need to just watch and wait rather than trying to guess the top. \n* [https://imgur.com/a/TiMQA2k](https://imgur.com/a/TiMQA2k) \n\n**Levels to watch: (plot these on your charting platform as it will help you to analyse intraday price action).**   \n \n\n* SPX currently trading at 5025.\n* One key level will be the 0dte Call resistance which is now at 5030. \n* Note the all expiration call resistance remains at 5000, which will create some support there. \n* Other key levels for gamma are 5050 and 5015. \n* My quant says the max trading range for today is 5059.\n* I doubt we hit that high, probs get stoped around 5030-5035. Let’s see\n* Quant says minimum of expected trading bound is 4994 ish. \n* QQQ:\n* Like I said, watch 18k level on NDX. This translated to around 438.4 on QQQ\n* Call resistance for QQQ is 440. I doubt we move higher than that today as there’s not much news. \n* Key gamma levels to watch are 435 and 437. \n* Quant says min of day trading range will be 433 and max of the day trading range is 441.   \n I think we trade well within that range, as traders don’t want to make big moves before CPI. \n\n**DATA LEDE:**\n\n* Nothing particularly significant on the economic calendar for today. No big data releases. \n* We do have some fedspeak later, as Bowman speaks, as does Kashkari. \n* For the UK, Governor Bailey will be speaking. He probably reiterates the data driven approach for BoE and that its too early for cuts. After the last BoE meeting, markets trimmed bets on BOE rate cuts slightly, pricing 107 BPS in 2024, from 111 before.\n\n**INSTIUTITIONAL RESEARCH:**\n\n* An interesting piece here from Goldman Sachs: They have put out a note telling their clients to get out of parabolic tech. Said Everyone Is In The Same Trades And All-In”. Went ton to say that this is the Best Start Of The Year Ever For Momentum, But \"You Don't Want To Be On The Wrong Side During A Momentum Crash”.\n* A quote from a Goldman Sachs paper, where they compare the state of the stock market today, to the 2000 Dot com bubble: “At this point, valuations at the top are no where near as frothy as they were at the height of the Dot Com Bubble. The 5 largest stocks traded at 43x Fwd PE in March ‘00, a 59% premium to the Mag 7’s current multiple of 27x.\"  \n \n* We see this demonstrated in the table below:\n* [https://imgur.com/a/fUdSFMa](https://imgur.com/a/fUdSFMa) \n* Bank of America say that they can see potential for the outperformance of small cap this year. They said that the factors that are supportive of this in 2024, include bottoming profits, historically attractive valuations (29% discount to large), improving market breadth, a Fed cutting cycle and inflecting macro indicators that are correlated with relative performance.\n* Global gold outflows continued in January, dragging Gold price lower, shows Bloomberg. \n\n**MARKETS:**\n\n* SPX: Closed Friday at 5026. In premarket, been trading in such a narrow range. Basically flat. \n* NASDAQ: Trading flat at 17,965. Watch the technical level of 18k today. Market will be trying to break it, may temporarily intraday, but this is the key level to watch as will need significant volume for Nasdaq to close above it. \n* DJI: Flat in premarket at 37,650. \n* GER40: Has been trying to break 17k level. Got a big push at 9am when market opened, right up to the 17k level. \n* Hong Kong Market closed for national holiday. \n* Chinese market slightly higher, trading at 11,430\n* OIL: Got rejected at 77 on Friday. Trading slightly lower today, at 76. OIL IS SLIGHTLY LOWER Mostly as price correction from last week, but also AS ISRAEL SAYS IT HAD CONCLUDED A SERIES OF STRIEKS IN SOUTHERN GAZA, somewhat easing concerns of supply risk. Strikes continue in Gaza though, as Gaza officials say airstrikes kill 67. \n* Bonds: Opened higher today, then moved lower.  \n\n**FOREX:**\n\n* JPY higher ahead of PPI later today. Risk reversal on JPY points lower. Traders are expecting that due to a hesitant BOJ to tighten, and no certainty on wage inflation, that JPY will underperform. \n* Dollar more or less stable right now, slightly higher, after got a bit of a push when European market opened. \n* EURUSD slightly lower, came to 1.08 then bounced down as found resistance and no big volume from the macro data to drive it higher. This was all technicals. \n* GBPUSD following lwoer.\n* AUDUSD opened slightly lwoer, then moved higher. \n* Not much news driving FX movement this morning. Just usual price action. \n* NZD lower on comments from NZRB governor who said that inflation ate was still too high at 4.7%. Whilst hawkish, there was some repricing, NZD has been up recently on expectations of RBNZ to hike again. \n\n**MAG 7 NEWs:**\n\n* AMZN - Jeff Bezos has sold $2b worth of Amazon Shares, his first sell since 2021.\n* TSLA - announced temporary model Y cuts in US until Feb 29th, less than a month after cutting prices of Model Y in Germany. \n* NVDA - building new business unit focused on designing custom chips for cloud computing firm san others, including advanced AI processors.\n* MSFT - has super bowl ad\n* AAPL - Wedbush says that apple supply chain checks show clear stabilisation of demand in China. Said iPhone will see some ‘incremental growth’ this year as iPhone 15 is catalysing an upgrade cycle that will exceed expectations. China demand story is a cloud but said promotions will be stepped up. \n* GOOGL - commits 25m to boost AI training, and skills in Europe. \n\n**COMPANY SPECIFIC NEWS:**\n\n* CSCO will lay off thousands of employees. \n* FANG - Diamondback Energy and endeavour energy are finalising a merger that would create an oil and gas behemoth worth more than 50b.\n* DKNG - has become exclusive betting partner of Barstool sports\n* DAYForce - Needham reiterates buy, price target 82, 17% above spot. \n* XPO - downgrades at Morgan Stanley to underweight, form equal weight, price target 80, which is 33% below spot. \n* ROAD - Downgraded at Baird to neutral, price target raised to 50, 9% above spot. \n* OC - downgraded at Barclays. Cut to equal weight from overweight, price target 160, 8% above spot. \n* RIVN - downgraded at Barclays. Cut to equal weight from overweight, price target 16, where spot is 16.68. \n* UL - says that activist investor Nelson pelts backs strategic shift in place. \n* TSEM - files proposal for $8B chip plant in India\n* VFC - founding family supports activist Engaged Capital in board fight. \n* SNAP - says it has entered into privately negotiated debt buyback. \n* TRMB down on earnings. Will try to release an earnings summary for this later. \n* FMC price target cut to 55 from 68 by Loop capital, cut to hold. 8% above spot. \n* CITI - Us regulators have asked Citigroup for urgent changes to way it measures default risk of trading partners. \n* HSY - cut to underweight from equal weight at Morgan Stanley\n* SAP - Supervisory board changes for Chairman. \n* LOW - Raised to overweight from Neutral by JP Morgan. Price target 20% above spot\n* CTVA - Raised to buy from Hold, 17% above spot. \n* CRWD- has Sueprbowl ad\n* SNAP - has Super Bowl Ad\n* ETSY - has Super Bowl ad\n* DASH - has super bowl ad. \n\n**OTHER NEWS:**\n\n* Argentina’s inflation is expected to have risen 257% YOY in January, up 22% MOM\n* Moodys has downgraded Israel. Israel say that the decision is politically motivated.  \n* Fed’s Logan: Said she doesn’t see any urgency to adjust rates. \n* US Senate has advanced a bill with $95b in aid for Ukraine, Israel and Taiwan. The bill has enough support to move forward in Senate. \n* Last week, and as a function of 4 week moving average, we are seeing record inflows into emerging markets, mostly the result of China as we see Heavy government buying and from China Sovereign Wealth Fund. We can see that below:\n* [https://imgur.com/a/J02eecT](https://imgur.com/a/J02eecT) \n* ECBs De Cos in a talk seemed open to rate cut discussion, but said he didn’t want to set a guidance on when it will be. \n* US defence secretary is hospitalised for bladder issues and transfers his duties to deputy \n* Goldman Sachs say they expect IPO activity to continue to improve in 2024. \n* German finance minister says that he is optimistic of economic upturn soon, but warns against more government borrowing, saying its just not sustainable\n* German Finance minister said theyre seeing an adjustment period in Commercial real estate, but its stable. \n* This comes as German office prices saw the sharpest drop on record in 2023. YOY was down 10%. First negative print since 2009. \n* According to economic surveys of economists, Germany;s economy will stagnate in Q1. \n* Jailed Imran Khan claims Pakistani electoral Win. \n* Iraq oil minister says they are committed to opec’s voluntary cut and won’t produce more than 4m BPD. \n* This comes as Saudi minister says oPEC is ready to tweak oil policy at any time. \n* Musk says he didn’t sell terminal to Russia after Kyiv alleges Russian use of the technology. \n* IMF says global economy is avoiding spillovers from Middle East war, but says the longer the war goes on, the bigger the risk. \n* IMF said they expect global economy to experience a soft landing. \n* Iran foreign minister travels to Qatar to discuss Gaza\n* North Korea has developed a new system for controlling a rocket launcher\n* Household debt tops $1.75T\n* Revolut launching phone plans for UK travellers, who ravel abroad. Gives access to data abroad without roaming charges. It’s part of Revolut’s mission to become a super app. ",
        "created_utc": 1707744374.0,
        "subreddit_name": "DayTrading",
        "comments": 28
    }
]