[
    {
        "title": "OKLO - Multimillionaire Maker",
        "score": 241,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1g7cr74/oklo_multimillionaire_maker/",
        "content": "One of many examples from the DOE you can can find if you take a few minutes to do research vs just spewing random bullshit that sounds good:\n\n\"Revitalize and strengthen the front- end of the nuclear fuel cycle and domestic nuclear industry: Smartly decrease undue permitting and regulatory burdens on industry to level the domestic playing field and value attributes provided by U.S. commercial nuclear power;\"  \n[https://www.energy.gov/articles/restoring-americas-competitive-nuclear-energy-advantage](https://www.energy.gov/articles/restoring-americas-competitive-nuclear-energy-advantage)\n\n**TL;DR:**  \nOklo is a highly speculative but potentially transformative investment, driven by its advanced nuclear reactor technology and leadership under Sam Altman. While there’s no revenue yet, the company’s micro-reactor technology has secured significant partnerships, including a pilot with the U.S. Air Force, a deal with Equinix, and a partnership with Diamondback Energy. Oklo’s decentralized grid model offers energy resilience and scalability, especially in military and data center applications.\n\nOklo represents a once in a lifetime opportunity to get in early on a company that can likely achieve a 100bn market cap within 10 years. A decentralized grid adds stabilities that even an extremely redundant grid has difficulties providing.\n\n**This is a highly speculative investment. There's no revenue, and you are making a bet that this technology will 1) work 2) gain traction.**\n\n**Board / Leadership:**\n\nAs stated above, this is a highly speculative investment. In these cases, I believe one of, if not the most important factors are the people in charge. In this case, we have a board led by non-other than Sam Altman. Sam's ambitions for OpenAI and his own need for tremendous energy are probably the largest thing in Oklo's favor. Either you believe in Sam Altman, or you don't. It's similar to how/why TSLA achieved its silly market cap, and despite Elon's constant over promises and under delivery TSLA has market cap of 691.56bn at the time of writing.\n\n* **Sam Altman** – **Board Chair** \\- if you don't know who he is or why this matters, just stop reading now.\n* **Chris Wright** \\- CEO of Liberty Energy, bringing extensive experience in the energy sector. His knowledge of energy technologies and market dynamics supports Oklo's efforts to position its advanced reactors within the broader energy landscape\n* **Richard Kinzley** \\- Chief Financial Officer at Black Hills Corporation, a diversified energy company. His expertise in financial management and regulatory compliance aids Oklo in navigating the financial aspects of the energy industry.\n* **Lt. General John Jansen (Ret.)** – **Board Member** \\- Lt. General John Jansen is a retired officer of the United States Marine Corps with a distinguished military career. His leadership experience and strategic planning skills contribute to Oklo's organizational development and operational excellence.\n\n**Current Projects and Department of Energy Progress**\n\n1. Micro-Reactor Pilot Program with the U.S. Air Force\n2. In August 2023, the Department of the Air Force, in partnership with the Defense Logistics Agency Energy, announced a critical milestone in piloting advanced nuclear energy technology. They issued a Notice of Intent to Award (NOITA) a contract to Oklo Inc. to site, design, construct, own, and operate a micro-reactor facility at Eielson Air Force Base in Alaska. This facility will be licensed by the Nuclear Regulatory Commission (NRC).\n3. **Energy Resilience:** The ability to generate reliable power in remote locations enhances operational readiness and mission assurance for military installations.\n4. **Scalability:** Successful implementation could lead to broader adoption across other military bases, indicating a significant market expansion within the Department of Defense.\n5. **Strategic Advantage:** Utilizing advanced nuclear technology aligns with national interests by promoting energy independence and reducing reliance on fossil fuels.\n6. Partnership with Diamondback Energy\n   1. In April 2024, Oklo signed a non-binding Letter of Intent (LOI) with Diamondback Energy Inc., a major independent oil and natural gas company operating in the Permian Basin. The agreement outlines plans for a 20-year Power Purchase Agreement (PPA) where Oklo would supply 50 megawatts of reliable and emission-free electricity using its Aurora powerhouses.\n      1. **Terms:** Oklo intends to license, build, and operate powerhouses capable of generating 50 MW of electric power, with options to renew and extend the PPA for an additional 20 years.\n      2. **Business Model:** Oklo's design-build-own-operate approach allows customers like Diamondback to purchase power without complex ownership issues or significant capital investments.\n      3. **Long-Term Partnerships:** Extended PPA options indicate confidence in the technology's longevity and reliability.\n7. Potential in Data Centers\n   * **Equinix Deal (April 2024)** Equinix, a leader in data center colocation and the largest data center real estate investment trust (REIT), is pioneering the integration of nuclear energy into its infrastructure. In April 2024, Equinix entered into a groundbreaking agreement with Oklo, putting down $25 million to secure between 100–500 MW of power from Oklo’s small modular reactors (SMRs). Equinix aims to purchase this energy under long-term contracts, signaling a significant step toward transforming data center energy sustainability. Oklo’s SMRs are designed to generate up to 15 MW of power and can operate for over a decade without needing refueling, offering a scalable and reliable energy solution. The partnership demonstrates the data center industry's growing interest in accelerating the transition to nuclear energy, with a focus on reducing carbon footprints and enhancing energy reliability.\n   * **Wyoming Hyperscale Partnership (May 2024)** In May 2024, Oklo announced a partnership with Wyoming Hyperscale, a leading sustainable data center developer. The collaboration aims to deliver 100 MW of clean power to Wyoming Hyperscale’s state-of-the-art data center campus through Oklo’s Aurora powerhouse. This partnership aligns with the growing trend of AI-driven digitalization, which is rapidly increasing the demand for sustainable and scalable energy solutions.\n\n**Department of Energy Progress**\n\n* **Approval of the Aurora Fuel Fabrication Facility Conceptual Design:** In a significant milestone, the DOE approved the conceptual design for Oklo's Aurora Fuel Fabrication Facility, located at Idaho National Laboratory (INL). This facility will be instrumental in converting used nuclear material recovered from the DOE’s former EBR-II reactor into usable fuel for Oklo’s advanced nuclear power plants. The facility will fabricate high-assay low-enriched uranium (HALEU) fuel, sourced from the EBR-II reactor, for the Aurora powerhouse—a liquid-metal-cooled fast reactor designed to operate on both fresh HALEU and used nuclear fuel.\n* **Fuel for Aurora:** The Conceptual Safety Design Report, submitted earlier this year to DOE’s Idaho Operations Office, outlines the safety and operational design of the facility, marking an important step in demonstrating advanced fuel recycling technologies. Oklo has been granted access to 5 metric tons of HALEU under a cooperative agreement awarded in 2019. This HALEU will power the initial Aurora reactor core, with the first commercial Aurora powerhouse expected to be deployed by 2027.\n* **Regulatory and Site Development:** Oklo is working closely with INL and DOE to finalize the facility’s design and obtain the necessary regulatory approvals to begin construction. Additionally, Oklo has secured agreements with the DOE to begin site characterization of their preferred location for the Aurora powerhouse at INL, supporting their combined license application to the U.S. Nuclear Regulatory Commission (NRC). DOE will retain ownership of the HALEU during and after its use in the reactor, highlighting a continued collaboration on resource management and safety.\n* **GAIN Vouchers and ARPA-E Support:** Oklo has received ongoing support from the DOE through GAIN (Gateway for Accelerated Innovation in Nuclear) vouchers, which have provided funding to advance the Aurora powerhouse’s design. Additionally, Oklo has secured funding from the DOE's ARPA-E program to demonstrate advanced nuclear fuel recycling technologies, further positioning the company at the forefront of nuclear innovation.\n\n**Implications for Future Growth:**\n\n* **Fuel Recycling Leadership:** The development of the Aurora Fuel Fabrication Facility and Oklo’s collaboration with INL positions the company as a pioneer in fuel recycling technologies, offering significant potential to reduce nuclear waste and enhance fuel efficiency.\n* **Regulatory Confidence:** Oklo’s ongoing progress with DOE and NRC regulatory milestones reflects confidence in its technology and is paving the way for future commercial reactor deployments.\n* **Strategic Funding Opportunities:** Oklo’s partnerships with DOE and other federal agencies continue to unlock funding for research, development, and technology deployment, accelerating the commercialization of its advanced nuclear power solutions.\n\n**EDIT 1:** bunch of people claiming regulatory issues will slow down OKLO. I'd encourage these people to look at the recent DOE publications regarding this, and their language around streamlining approvals to remain competitive. Given the current geopolitical sitaution, I believe it's more likely than not, that in the name of national security this will need to be streamlined. Given the people who support Oklo, they are well positioned to benefit from this.\n\n**EDIT 2: LOL AT ALL THE MORONS WHO DIDN'T BUY OKLO AFTER I POSTED THIS.** \n\n**Positions:**\n\nhttps://preview.redd.it/aa8s04uroqvd1.png?width=1439&format=png&auto=webp&s=0bcfbde96f0d13fa97d8ae666ccf2d6c5c13455b",
        "created_utc": 1729355501.0,
        "subreddit_name": "wallstreetbets",
        "comments": 236
    }
]