[
    {
        "title": "Super Micro shares plunge 35% as auditor resigns after raising concerns months earlier",
        "score": 547,
        "url": "https://www.reddit.com/r/stocks/comments/1gfm3zm/super_micro_shares_plunge_35_as_auditor_resigns/",
        "content": "**Super Micro shares plunge 35% as auditor resigns after raising concerns months earlier**\n\n[https://www.cnbc.com/2024/10/30/super-micro-auditor-resigns-after-raising-concerns-months-earlier.html](https://www.cnbc.com/2024/10/30/super-micro-auditor-resigns-after-raising-concerns-months-earlier.html)\n\n&#x200B;\n\nSuper Micro’s shares plunged as much as 35% Wednesday morning after the company disclosed its auditor had resigned following months of disagreement with the firm over its governance and board independence.\n\n&#x200B;\n\n&#x200B;\n\nSEC filing:\n\n&#x200B;\n\n**Changes to Registrant’s Certifying Accountant**\r  \n[https://d18rn0p25nwr6d.cloudfront.net/CIK-0001375365/76575d70-d149-4c81-a282-2b74b497f8c3.html](https://d18rn0p25nwr6d.cloudfront.net/CIK-0001375365/76575d70-d149-4c81-a282-2b74b497f8c3.html)\n\n\r  \n\r  \n*On October 24, 2024, Ernst & Young LLP (“EY”) sent the members of the Audit Committee a letter of resignation as the Company’s registered public accounting firm (the “Resignation Letter”).*\r  \n\r  \n*The Chair of the Audit Committee discussed with EY the reasons for EY’s resignation. The Company has begun the process of identifying a successor independent registered public accounting firm. The Company will authorize EY to respond fully to the inquiries of the successor independent registered public accounting firm, once selected. The Company does not currently expect that resolution of any of the matters raised by EY, or under consideration by the Special Committee, as noted below, will result in any restatements of its quarterly reports for the fiscal year 2024 ending June 30, 2024, or for prior fiscal years.*\r  \n\r  \n*EY was engaged on March 15, 2023 to perform an audit for the Company’s fiscal year ending June 30, 2024, and has not issued any report on the Company’s financial statements or the Company’s internal control over financial reporting. EY resigned while conducting the audit for the Company’s fiscal year ended June 30, 2024, EY’s first audit on the Company’s behalf.*\r  \n\r  \n*In late July 2024, EY communicated to the Audit Committee concerns about several matters relating to governance, transparency and completeness of communications to EY, and other matters pertaining to the Company’s internal control over financial reporting, and that the timely filing of the Company’s annual report was at significant risk. In response, the Board appointed an independent special committee of the Board (the “Special Committee”) to review the matters and certain of the Company’s internal controls and certain governance procedures (the “Review”). The Special Committee engaged Cooley LLP, and forensic accounting firm Secretariat Advisors, LLC to perform an investigation on behalf of and at the direction of the Special Committee. EY and the Board received updates with preliminary information relating to the Review. As of the date of this Current Report on Form 8-K, the Review remains ongoing and final findings and recommendations have not yet been communicated to EY or the Board.*\r  \n\r  \n*After receiving additional information through the Review process, EY informed the Special Committee that the additional information EY received raised questions, including about whether the Company demonstrates a commitment to integrity and ethical values consistent with Principle 1 of the COSO Framework, about the ability and willingness of the Audit Committee and overall Board to demonstrate and act as an oversight body that is independent of the CEO and other members of management in accordance with Principle 2 of the COSO Framework, and whether EY could rely on representations from certain members of management and from the Audit Committee. In the Resignation Letter, EY stated, in part: “we are resigning due to information that has recently come to our attention which has led us to no longer be able to rely on management's and the Audit Committee’s representations and to be unwilling to be associated with the financial statements prepared by management, and after concluding we can no longer provide the Audit Services in accordance with applicable law or professional obligations.”*\r  \n\r  \n*Although the Company recognizes EY’s decision is final, it disagrees with EY’s decision to resign as the Company’s independent registered public accounting firm – the Special Committee has not yet obtained all information relevant for the Review and has not concluded the Review. Nevertheless, the Company has taken the concerns expressed by EY seriously, and will carefully consider the findings of the Special Committee and any remedial or other actions recommended by the Special Committee following conclusion of the Review.*\r  \n\r  \n*Other than as described above, during the fiscal years ended June 30, 2024 and 2023, and the subsequent interim period preceding EY’s resignation, (1) there were no “disagreements,” as defined in Item 304(a)(1)(iv) of Regulation S-K, with EY on any matter of accounting principles or practices, financial statement disclosure or auditing scope or procedure, which if not resolved to EY’s satisfaction to our knowledge would have caused it to make reference to the subject matter thereof in connection with its report, and (2) there were no “reportable events” as described in Item 304(a)(1)(v) of Regulation S-K.*\r  \n\r  \n*The Company has provided EY with a copy of the disclosures required by Item 304(a) of Regulation S-K contained in Item 4.01 of this Current Report on Form 8-K and has requested that EY furnish the Company with a letter addressed to the Securities and Exchange Commission stating whether it agrees with the Company’s statements made in response to those requirements and, if not, stating the respects in which it does not agree. A copy of EY’s letter, dated October 29, 2024, is filed as Exhibit 16.1 to this Current Report on Form 8-K.*",
        "created_utc": 1730293730.0,
        "subreddit_name": "stocks",
        "comments": 141
    },
    {
        "title": "Microsoft Reports FY25 Q1 Earnings: Beat Across the Board",
        "score": 474,
        "url": "https://www.reddit.com/r/stocks/comments/1gfvz9i/microsoft_reports_fy25_q1_earnings_beat_across/",
        "content": "Microsoft Earnings Press Release: https://www.microsoft.com/en-us/Investor/earnings/FY-2025-Q1/press-release-webcast\n\n·        Revenue was $65.6 billion and increased 16%\n\n·        Operating income was $30.6 billion and increased 14%\n\n·        Net income was $24.7 billion and increased 11% (up 10% in constant currency)\n\n·        Diluted earnings per share was $3.30 and increased 10%\n\nBusiness Highlights\nRevenue in Productivity and Business Processes was $28.3 billion and increased 12% (up 13% in constant currency), with the following business highlights:\n\n·        Microsoft 365 Commercial products and cloud services revenue increased 13% (up 14% in constant currency) driven by Microsoft 365 Commercial cloud revenue growth of 15% (up 16% in constant currency)\n\n·        Microsoft 365 Consumer products and cloud services revenue increased 5% (up 6% in constant currency) driven by Microsoft 365 Consumer cloud revenue growth of 6% (up 7% in constant currency)\n\n·        LinkedIn revenue increased 10% (up 9% in constant currency)\n\n·        Dynamics products and cloud services revenue increased 14% driven by Dynamics 365 revenue growth of 18% (up 19% in constant currency)\n\nRevenue in Intelligent Cloud was $24.1 billion and increased 20% (up 21% in constant currency), with the following business highlights:\n\n·        Server products and cloud services revenue increased 23% driven by Azure and other cloud services revenue growth of 33% (up 34% in constant currency)\n\nRevenue in More Personal Computing was $13.2 billion and increased 17%, with the following business highlights:\n\n·        Windows OEM and Devices revenue increased 2%\n\n·        Xbox content and services revenue increased 61% driven by 53 points of net impact from the Activision acquisition\n\n·        Search and news advertising revenue excluding traffic acquisition costs increased 18% (up 19% in constant currency)\n\nMicrosoft returned $9.0 billion to shareholders in the form of dividends and share repurchases in the first quarter of fiscal year 2025.\n",
        "created_utc": 1730318940.0,
        "subreddit_name": "stocks",
        "comments": 191
    },
    {
        "title": "Meta beats on top and bottom lines but misses user growth expectations",
        "score": 216,
        "url": "https://www.reddit.com/r/stocks/comments/1gfw8dz/meta_beats_on_top_and_bottom_lines_but_misses/",
        "content": "Meta shares were down 2% after the company reported third-quarter earnings in which it posted lower than expected daily active people.\n\nHere are the results.\n\nEarnings per share: $6.03 vs. $5.25 expected by LSEG\n\nRevenue: $40.59 billion vs. $40.29 billion expected by LSEG\n\nThe company said it is expecting fourth-quarter revenue to be between $45 billion and $48 billion. The midpoint of that guidance is higher than the analyst consensus of $46.3 billion.\n\nMeta said daily active people grew 5% year-over-year for the third quarter to 3.29 billion, which was lower than analyst expectations’ of 3.31 billion.\n\nThe company said that guidance for its fiscal 2024 total expense will be in the range of $96 billion to $98 billion, which is lower than previous guidance of $96 to $99 billion.\n\nMeta said that capex guidance for the 2024 fiscal year will be between $38 billion to $40 billion, up from $37 billion to $40 billion.\n\nMeta said that it expects capital expenditures to continue to grow significantly in 2025.\n\nSource: https://www.cnbc.com/2024/10/30/meta-q3-earnings-report-2024.html",
        "created_utc": 1730319581.0,
        "subreddit_name": "stocks",
        "comments": 88
    },
    {
        "title": "Visa plans to fire 1,400 employees and contractors",
        "score": 130,
        "url": "https://www.reddit.com/r/stocks/comments/1gfso4m/visa_plans_to_fire_1400_employees_and_contractors/",
        "content": "Multinational payment card services corporation Visa has been planning to lay off nearly 1,400 employees and contractors by the end of 2024. \n\nAccording to sources familiar with the matter, Visa intends to fire around 1,400 employees and contractors to advance its strategy to simplify its international business. Initially reported by the Wall Street Journal, the announcement stated that approximately 1,000 of the cuts are projected to remove technology positions, with the majority of the layoffs being focused on Visa’s merchant sales and global digital partnership roles.\n\nThe report mentions that a part of the layoffs ensued a week before the news dropped, with Visa encouraging individuals to apply for open positions. However, Visa intends to maintain its workers in the global digital partnership teams employed in their positions through the end of 2024. According to a Visa representative cited by Reuters, the company works towards evolving its operational model to advance its growth, which can in turn lead to the elimination of some roles currently present. Despite this, Visa plans to employ more individuals each year for the foreseeable future, depending on its needs and demands.\n\nVisa’s legal issues\n\nRecently, Visa has been facing legal issues and was under scrutiny from regulators, as well as dissatisfied merchants. For example, in September 2024, The US Justice Department sued Visa for monopolising the debit card market, charging significant fees, and inhibiting competition. The civil antitrust lawsuit, which was filed in the US District Court for the Southern District of New York, charged the company with violating sections 1 and 2 of the Sherman Act due to more than 60% of debit transactions in the US running on its debit network.\n\nMoreover, Visa was alleged to unlawfully amassed the capability to extract fees that exceeded what it could charge in a competitive market. At the same time, merchants and banks transferred those funds to consumers by scaling prices or by minimising the quality of services. This led to Visa’s conduct negatively impacting the price of everything. The lawsuit was filed to reinstate competition in the market and to support the US public.\n\nSources:\nhttps://thepaypers.com/payments-general/visa-plans-to-fire-1400-employees-and-contractors--1270771\n\nhttps://www.wsj.com/business/visa-plans-to-lay-off-around-1-400-employees-and-contractors-cd278c71?msockid=30e79273349267d731268767356866d0\n\nhttps://www.bloomberg.com/news/articles/2024-10-29/visa-shares-reverse-earlier-gains-after-report-of-1-400-job-cuts",
        "created_utc": 1730310637.0,
        "subreddit_name": "stocks",
        "comments": 28
    },
    {
        "title": "$UBER - what do you think of impact of Waymo as its now doing 150,000 \"paid rides\" a WEEK!",
        "score": 99,
        "url": "https://www.reddit.com/r/stocks/comments/1gfet6o/uber_what_do_you_think_of_impact_of_waymo_as_its/",
        "content": "[https://www.forbes.com/sites/alanohnsman/2024/10/29/alphabets-waymo-logging-150000-robotaxi-rides-and-1-million-miles-a-week/](https://www.forbes.com/sites/alanohnsman/2024/10/29/alphabets-waymo-logging-150000-robotaxi-rides-and-1-million-miles-a-week/)\n\n  \n\"Waymo, Alphabet’s robotic taxi unit, is now providing over 150,000 paid rides per week, up by more than 50% since August\" \n\n“Waymo is now a clear technical leader within the autonomous vehicle industry and creating a growing commercial opportunity,” Pichai said. “Now each week Waymo is driving more than 1 million fully autonomous miles and serves over 150,000 paid rides, the first time any AV company has reached this kind of mainstream use.”\n\n\"In addition to new cash, Waymo is also adding a [vehicle production facility in metro Phoenix](https://www.forbes.com/sites/alanohnsman/2024/08/26/waymo-adding-a-second-robotaxi-assembly-facility/) to install sensors and its computing system into its robotaxis. It also plans to source [electric vehicles based on Hyundai’s Ioniq 5](https://www.forbes.com/sites/alanohnsman/2024/10/04/waymo-bulking-up-robotaxi-fleet-with-electric-hyundais/) model for its growing fleet starting next year. Waymo is also shifting to a new lower-cost sensor and compute system that it says is more powerful than the one currently in use and that will help it eventually become profitable.\"\n\n  \nAnd apart from having Google's tech & money power, it's raising crazy money - [https://www.nytimes.com/2024/10/28/business/waymo-investment-robot-taxis.html](https://www.nytimes.com/2024/10/28/business/waymo-investment-robot-taxis.html)\n\nAt this point it's hard to ignore its impact on Uber.\n\nYour thoughts ?\n\n",
        "created_utc": 1730263678.0,
        "subreddit_name": "stocks",
        "comments": 71
    },
    {
        "title": "Why SMCI's situation is a massive threat to Nvidia",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gfqlq2/why_smcis_situation_is_a_massive_threat_to_nvidia/",
        "content": "SMCI has faced allegations of accounting manipulation, which have escalated this morning when it was revealed that their auditor, Ernst & Young, resigned. The true extent of the situation is not yet known to the public\n\nSMCI is one of Nvidia's largest customers, accounting for 9% of their sales. If they go under, Nvidia will take a massive hit to their future earnings.\n\nSome may argue that it does not matter, because since Nvidia's production is sold out, any gap in orders would be filled by other customers. There are 2 problems with this assumption:\n\n1. This ignores the impact of a hypothetical liquidation of SMCI. If SMCI was faking orders, this would mean that they likely have a growing inventory of AI chips. These would then be auctioned off, creating a surge in supply, competing with new orders.\n\n2. The duration of Nvidia's lead times can impact their margins and pricing power. If you have a 12 month lead time due to immense demand, you can hike prices. If that lead time shrinks to 1 month due to losing a significant customer, you have less margin to raise prices without impacting sales.\n\nThis scandal could also draw attention to other \"round tripping\" arrangements in the tech industry, in which circular transactions are set up in order to fake revenue growth. This could very much be the start of the unraveling of a bubble.\n\nThis isn't going to bankrupt Nvidia, they still have incredibly successful products and other customers, but it could definitely lead to a case where earnings growth stagnates, or is not sufficient enough to justify their current share price.\n\nDespite this tremendous threat, Nvidia is down just 1% today, which is well within its normal volatility. The market is not responding to this new information appropriately.",
        "created_utc": 1730305479.0,
        "subreddit_name": "stocks",
        "comments": 89
    },
    {
        "title": "Trading Platform for Regards ($HOOD) Reports Q3 Earnings today, After-Hours",
        "score": 27,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gfsuoz/trading_platform_for_regards_hood_reports_q3/",
        "content": "Hello my fellow regards,\n\nI come to you today asking for not only your thoughts and your advice, but also for your honesty. I want you regards to think about this for more than half a second before you say the first thing that comes to your degenerate minds.\n\nBefore you read this, keep in mind Robinhood stock $HOOD has been on a run, up 70% in the past 3 months. \n\nI am a regarded Robinhood user myself. I signed up for Robinhood Gold in July of this year for all of the attractive perks (no, not those attractive perks Diddy) that they offer:\n\n• 4.5% interest on uninvested cash (was 5% until the FED cut rates)\n• 3.0% IRA Contribution match\n• 1.0% Deposit match\n• $1k of interest-free margin\n• Level 2 Market Data\n\nIn addition to these perks, Robinhood has launched a new advanced desktop trading platform (Robinhood Legend) and also offers a new credit card exclusively for Gold members that earns 3% cash back on all purchases, which is pretty rare. I think it is bullish that they are offering an unprecedented amount of cash back on all purchases - they must be doing pretty well to be able to offer this, right? And the only way to gain access to this credit card is through signing up for Robinhood gold.\n\nI think Robinhood’s platform is likely the preferred choice for the younger investor due to its easy to use and intuitive interface. It’s like the iPhone of stock trading apps. But, with these new offerings from Robinhood, including their new advanced trading platform, I could see it appealing to more and more older investors and retaining a higher percentage of their users as they get older, while continuing to be the preferred choice for the younger investor.\n\nRobinhood got me to sign up for Gold this summer. I am enjoying the perks and am confident I am making more money with these perks than what I am paying to have access to these perks ($5 per month). I think Robinhood’s platform is the most user friendly and easy to use. \n\nThat is why I am long $HOOD. Although the stock is on a 70% run over the past 3 months, I believe the stock will moon after their Q3 earnings report is released. Who is with me? Who is against me? Anybody buying Puts? Let me hear your honest thoughts on the stock you regards.\n\nJk, let’s all just buy FD’s\n\nGoing to wait until just before market close to load up on 11/1 $30c",
        "created_utc": 1730311091.0,
        "subreddit_name": "wallstreetbets",
        "comments": 87
    },
    {
        "title": "Dropbox slashes 20% of global workforce, eliminating more than 500 roles",
        "score": 214,
        "url": "https://www.reddit.com/r/stocks/comments/1gfxx8q/dropbox_slashes_20_of_global_workforce/",
        "content": "Dropbox is laying off 20% of its global workforce, the equivalent of 528 roles, CEO Drew Houston announced Wednesday in a note to staff.\n\nThe company is in a \"transitional period\" as its file sync and share business and its Dash artificial-intelligence search feature mature, Houston wrote.\n\n\"Navigating this transition while maintaining our current structure and investment levels is no longer sustainable,\" he said in his note.\n\nThe move follows a 16% cut to Dropbox's workforce in April 2023, which affected 500 staffers. At the time, Houston wrote that the cuts were due to slowing growth, economic headwinds and the need to invest more resources and head count into the increasingly competitive AI race.\n\nDropbox will be making cuts to the parts of its business where the company is \"over-invested or underperforming\" while working toward a \"flatter, more efficient\" team structure, Houston wrote.\n\n\"We continue to see softening demand and macro headwinds in our core business,\" Houston wrote. \"But external factors are only part of the story. We've heard from many of you that our organizational structure has become overly complex, with excess layers of management slowing us down.\"\n\nAffected employees will receive 16 weeks of pay, starting Wednesday, with one additional week of pay for each completed tenure year at the company.\n\nSource: https://www.cnbc.com/2024/10/30/dropbox-slashes-20percent-of-global-workforce-eliminating-500-roles.html",
        "created_utc": 1730323923.0,
        "subreddit_name": "stocks",
        "comments": 41
    },
    {
        "title": "SoFi's development and Progress made as noted in Q3 Earnings Call",
        "score": 42,
        "url": "https://www.reddit.com/r/stocks/comments/1gfnmju/sofis_development_and_progress_made_as_noted_in/",
        "content": "* **Adjusted Net Revenue:** $689 million, up 30% year-over-year.\n* **Financial Services Revenue:** $238 million, up 102% year-over-year.\n* **Tech Platform Revenue:** Nearly $103 million, up 14% year-over-year.\n* **New Members Added:** 756,000, up 35% year-over-year, totaling 9.4 million members.\n* **Loan Volume:** $6.3 billion, with $392 million in adjusted net revenue, up 14% year-over-year.\n* **GAAP Net Income:** Nearly $61 million, a $327 million improvement year-over-year.\n* **Adjusted EBITDA:** $186 million, up 90% year-over-year.\n* **Personal Loan Originations:** $4.9 billion, up 26% year-over-year.\n* **Home Loan Volume:** $490 million, up 38% year-over-year.\n* **Student Loan Volume:** $944 million, up 3% year-over-year.\n* **Member Deposits:** Grew by nearly $2.4 billion to nearly $23 billion.\n* **Total Capital Ratio:** 16.3%, Well above regulatory minimums.\n* **In Q3, tangible book value increased $236 million** to a total of $4.4 billion. \n\nCEO: \"This is why you often hear me say, it's a matter of when, but not if we'll become a Top 10 institution\"\n\n* I could not be prouder of how we've scaled this segment over the past five years since launching these products through a tumultuous and unpredictable environment to now be a $1 billion annualized revenue business growing over 100% with strong and improving profitability. And frankly, it's still day one.\n* We continue to see a strong pipeline of potential partners that are striving to modernize their platforms.\n* Our one-stop shop continues to attract great cross-buying behavior by our members. In fact, 32% of new products were opened by existing SoFi members and 20% of our new members opened a second product in their first 30 days. This is the power of the flywheel we have developed.\n* Overall, we're making incredible progress in our shift towards more fee-based, capital-light and lower-risk revenue sources. Combined, fee-based revenue made up $174 million or a quarter of our adjusted net revenue in Q3. This revenue grew by 65% year-over-year. On an annualized basis, that's nearly $700 million in revenue.\n* We've achieved 17 of 19 quarters of record revenue through a recession, a pandemic, 150 basis point rate drop, damage to our largest and most profitable business, student lender finance only to face a 500 basis point increase in rates and the collapse of venerable financial institutions in our neighborhood.\n* Our performance in the hard times is what gives me the strong confidence in our future. Today, we faced fewer headwinds than any point in our history. We're heading into 2025 with the most favorable conditions of the last seven years with declining rates and a stable economy.\n* We continue to establish SoFi as a trusted household name. We ended Q3 with our highest average unaided brand awareness of all time, up nearly 40% year-over-year to 7%. \n* We continue to innovate so people find unique value when they use our products. \n* We also launched our new directed share program, which offers a modern and streamlined approach to equity programs for companies looking to raise capital through IPOs.\n* SoFi Plus, our premium membership tier and our beta testing a new fee-based subscription option in the coming months.\n* In credit cards, we officially launched the everyday cash rewards and the essential credit cards, enabling SoFi to serve more people spending and borrowing needs,\n* We shift towards even more fee-based, capital-light, and lower-risk sources of revenue.\n* We also signed our first two direct insurance carriers for SoFi Protect, complementing our comprehensive financial services offering we've built over the last five years.\n* Home refinancing volume was the highest we've seen since the second quarter of 2022.\n* In our tech platform, we signed several new partnerships, including processing deals with two charter banks in Mexico and a deployment of Galileo's Cyber Bancorp for SoFi's new commercial payment services sponsored bank program.\n* We launched additional fraud prevention solutions, the Galileo instant verification engine, which we call GIVE as well as transaction risk GScore, both of which help clients enhance their security and operational efficiency. Our new secured credit with dynamic funding offering promotes greater financial inclusion and enables clients to help their customers build stronger credit.\n* We launched programs with clients signed in prior quarters, spanning cross-border payments, global payouts, financial literacy, and scalable payment solutions.\n* Delinquencies peaked in March of 2024. Since then, we've continued to see improvements quarter-over-quarter.\n* In closing, I couldn't be more proud of what we've accomplished not just for Q3, but for delivering a steady and consistent record of durable growth, incredible brand building and product innovation that help our members and clients and strong improving returns for our shareholders. The future is bright, and I am fired up for what in store.\n* We reduced our brokered deposits by $445 million as we continue to use our consumer deposits to replace higher cost parts of the funding stack.\n* SoFi Money continues to resonate well, maintaining market share and ranking in API. We saw over $2 billion in member deposit growth in the quarter, with spending levels on par or better than historical levels. Direct deposit customers are more engaged, with higher product adoption, contributing to our competitive advantage.\n* We declined between 70% and 80% of the personal loan applicants to SoFi. And so there's a lot of potential\n* His closing statement: We now face hopefully, the most advantageous environment that we've seen since I joined the company, and we began the relentless march to be a one-stop shop. Today, we are no longer just a lending company. Today, we are a force to be reckoned with. It is truly our time as we have more products, more members, more capital and more diverse revenue streams than ever before. We are undeniably the absolute best patient company to capture the massive opportunities still ahead of us because of the same thing that got us here, our people. Our people are great at heart. Thank you, everyone, for your time today, and we hope you have a great end to 2024.\n\nCFO:\n\n* Loan Platform Deals: CFO: This is a fee-based and capital-light revenue source for us. We generate cash fees upfront at the time of transfer or referral without taking balance sheet risk. Importantly, there are no financing commitments or loss share agreements associated with these deals.\n* There is a 220 basis points difference between the interest we pay on deposits and the interest we pay on warehouse lines, which translates to more than $500 million in annualized interest expense savings given the size of our deposit base.\n* We expect modest growth in balance sheet originations year-over-year. We are happy with the current size of our balance sheet and the net interest income generated. Excess demand from borrowers and loan investors is being fulfilled through our loan platform business. We expect growth in student loan refinancing and home loans in a lower rate environment.\n* Recent (loan) vintages are projected to produce higher returns, with ROEs above 30%. This is driven by lower expected life of loan loss rates, higher pricing beta, funding cost efficiencies, and origination fees.\n* We expect continued strong growth in the loan platform business, with commitments from Fortress and other partners. Demand is strong, and we are fulfilling it through the loan platform business.\n* For the full year 2024, we now expect to deliver adjusted net revenue of $2.535 billion to $2.550 billion, which is $85 million higher than our prior guidance range of $2.425 billion to $2.465 billion. This implies 22% to 23% annual growth versus 17% to 19% previously. This guidance assumes lending revenue will be at least 100% of 2023 levels.\n* Financial Services will grow more than 80% year-over-year and tech platform will grow low to upper teens percent year-over-year.\n* GAAP EPS of $0.11 to $0.12 per share above prior guidance of $0.09 to $0.10 per share.\n\n[https://finance.yahoo.com/news/q3-2024-sofi-technologies-inc-051725199.html](https://finance.yahoo.com/news/q3-2024-sofi-technologies-inc-051725199.html)",
        "created_utc": 1730297935.0,
        "subreddit_name": "stocks",
        "comments": 0
    },
    {
        "title": "Is Reddit the Perfect Stock? ",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gfn313/is_reddit_the_perfect_stock/",
        "content": "Follow up to my previous post where I claimed it was\n\n[https://www.reddit.com/r/stocks/comments/1e2bfit/is\\_reddit\\_the\\_perfect\\_stock/](https://www.reddit.com/r/stocks/comments/1e2bfit/is_reddit_the_perfect_stock/)\n\n  \nYes, It appears Reddit has the most unique data.  I've noticed there is a battle to train AI from data on Reddit due to how unique it is.\n\n  \nNotice the downvotes, many investors are not on the cutting edge of research and seeing what the creators of all of this are fighting over. ",
        "created_utc": 1730296479.0,
        "subreddit_name": "stocks",
        "comments": 44
    },
    {
        "title": "\"Super Micro Computer, Inc. (NASDAQ:SMCI) is an unstoppable stock that could make you richer\"",
        "score": 257,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gfnkti/super_micro_computer_inc_nasdaqsmci_is_an/",
        "content": "From an article yesterday on Yahoo Finance courtesy of Insider Monkey, the day before Ernst & Young resigns as their accountant and the stock drops by 1/3. The stock market lottery has a surprise around every corner. Long, short, whatever you want, there's a chance. If this convinced you to get back in yesterday, what a surprise was in store today.  \n\n\nSuper Micro Computer, Inc. (NASDAQ:SMCI) is an unstoppable stock that could make you richer as it is developing high-performance server and storage solutions that are in high demand amid the artificial intelligence race and digital revolution. It is turning out to be one of the biggest beneficiaries of the AI boom as it makes computers that companies use as servers for data storage.\n\nAt the start of 2024, Super Micro Computer, Inc. (NASDAQ:SMCI) held just 6% of the worldwide server market. Selling liquid-cooled, high-performance servers for demanding computing tasks has allowed it to carve out a niche for itself. Because of this, Nvidia found Supermicro to be a perfect partner and provided it with top-tier data center GPUs to aid in producing dedicated AI servers.\n\nThough not exclusive, its strategic partnership with Nvidia has strengthened its competitive edge in the server market. Super Micro’s revenue more than quadrupled from $3.6 billion in fiscal 2021 to $14.9 billion in fiscal 2024, coinciding with the generative AI market’s explosive growth. Additionally, its earnings per share (EPS) increased by almost ten times. More than half of its revenue now comes from AI servers.\n\nThe confirmation that Super Micro Computer, Inc. (NASDAQ:SMCI) is shipping more than 100,000 graphics processing units used for artificial intelligence underlines the strong demand that could translate into billions of dollars in revenues. Like other cloud service providers, Super Micro claimed to have recently installed over 100,000 GPUs with liquid cooling for some of the largest AI factories ever built.\n\nThe soaring GPU orders are one of the reasons analysts remain bullish about Super Micro Computer, Inc. (NASDAQ:SMCI), with an average price target of $64.22, implying a 33.40% upside potential as of October 25, 2024. As per Insider Monkey’s Q2 2024 database, the company was in the portfolios of 47 hedge funds.\n\n[Scout Investments, Inc](https://www.insidermonkey.com/institutional-investor/scout-investments-inc/20489/), an affiliate of [Carillon Tower Advisers](https://www.insidermonkey.com/institutional-investor/carillon-tower-advisers-inc/1984690/), released a second-quarter 2024 investor letter. [**Here**](https://www.insidermonkey.com/blog/super-micro-computer-smci-fell-after-disappointing-earnings-guidance-1348885/) is what the fund said:\n\n>\n\nOverall SMCI **ranks 8th** on our list of 8 Unstoppable Stocks That Could Make You Richer. While we acknowledge the potential of SMCI as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than SMCI, check out our report about the cheapest AI stock.",
        "created_utc": 1730297809.0,
        "subreddit_name": "wallstreetbets",
        "comments": 165
    },
    {
        "title": "META Earnings",
        "score": 29,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gfoiz4/meta_earnings/",
        "content": "Alright you fucks, listen up.  META is set to report earnings at end of day today, and I think they're going to exceed expectations and crush it.  Why?  Pretty simple really, ad spend for the quarter has been great, see GOOGL earnings from yesterday.  Who is another big daddy in the ad space?  That's right, it's ya boi meta. \n Additionally to probably having great ad numbers for the quarter, I would hope that they'll put out good guidance for threads and shit and say AI lots of times.  Because I'm a pussy, my position is all shares, hoping we see a modest gain after earnings but I'm a regard and inverting me might be smarter.  Also I bought on the dip today and if the stock rises until end of day I'll probably sell before close because what's better than maybe making more money from earnings?  That's right, it's selling for a few percent of profit with no risk.",
        "created_utc": 1730300288.0,
        "subreddit_name": "wallstreetbets",
        "comments": 60
    },
    {
        "title": "PLTR $250M+ of Insider Selling???",
        "score": 29,
        "url": "https://open.substack.com/pub/andrew310743/p/flying-too-close-to-the-sun?utm_source=app-post-stats-page&r=1rwlhn&utm_medium=iosj",
        "content": "Had a pitch on PLTR from last Friday. Now that there’s this much insider selling that’s the nail in the coffin. Here’s the pitch for those interested: \nRecommendation: I recommend a short on Palantir Technologies. The stock is currently priced at $44.79 per share, which I believe will drop by about 20-30% in the next 6–12 months. This is because, the market is highly exuberant in regards to PLTR, pricing in extreme growth rates despite signs of stunting commercial growth. Additionally, overreliance on cyclical government contracts as well as downward pressure on margins due to new AI product launches has led me to believe PLTR is overvalued, which I will prove via this pitch.\nCompany Background: Palantir at its core is a company that focuses on data-analytics, specializing in integrating large amounts of data and operationalizing that data for the public and private sectors. Its speciality lies in the extreme flexibility it provides customers in the form of Forward Deployed Engineers (FDE’s), who can create bespoke AI solutions for any customer. The key platforms are:\nGotham, a government intelligence and geospatial platform that is meant to analyze data from various sources to help support military operations and disaster response. Foundry, the commercial segment of the business: This begins with the cleaning and structuring of data, which leads into the integration of this data into AI models (AIP). These models are meant to operationalize company data improving top level decision making. Apollo integrates these systems delivering infrastructure and continual updates.\nThe advantage of this system is two-fold: First is the “ontology”, an effective digital twin of the business, which allows 1. collaboration across departments and 2. The ability to reason across data and create automations and decision making processes from it (Operationalizing data differentiates PLTR from Snowflake and Databricks which focus on simple storage and basic data analytics). The second is the labor-intensive approach in which the company deploys engineers on-site to negotiate data access, clean that data and build extremely customizable and mission critical infrastructure (Creates high switching costs)\nTo give a brief financial overview, PLTR expects to report 2.8B in net sales, which translates to 2.2B (82.5% Gross Margin) in gross profit, 1B in EBIT (35.4% Operation Margin) and 950M in FCF (34.3% FCF Margin).\nMost recently PLTR reported revenue of 678.1M (up 27% YoY), beating consensus by 3.8% (563.2M). Guidance was raised 4% for Q3 and 3% for FY2024. This seems aggressive considering that this raise in guidance is larger than the beat just posted. Thus, as expectations grow towards the moon, significant earnings beats will be required for PLTR to continue rising\nInvestment Thesis: Markets are skewing towards exuberance on PLTR, pricing in absolute perfection and unachievable growth for 3 key reasons. \nFirst let’s get a lay of the land with valuation multiples. Palantir is trading at an exuberant valuation multiple of 39x sales, surpassing even the largest monopolies and industry players:\nNVIDIA, probably the hottest stock at the moment, has monopolized over 90% of the GPU market–a necessary prerequisite to our AI revolution, 62% operating margins and revenue growth of 126% in 2024E trades at 35x sales. Databricks, the current leader in data analytics, traded at about 26x sales (And this was during the peak of the SaaS market when Q4 2023 earnings faked out investors). Snowflake, often considered overvalued by investors, trades at around 11x sales.\nSo–Does Palantir have a stronger monopoly than Nvidia, more recurring revenue than Databricks, stickier revenue than Snowflake? The answer is no.\nProponents of PLTR often tout individual cases of companies loving their product, but let’s look at it from the top. Net Revenue Retention (NRR) is one of the most popular KPI’s for SaaS companies, essentially saying do customers spend more every year on the product? In other words, have customers loved the product so much that they increase their usage the next year? The answer for PLTR–kind of? Palantir's NRR stands at approximately 110%, down from 115% two years earlier, demonstrating a poor ability to upsell and retain customers. In contrast, Snowflake boasts an NRR of 130% this year and 150% last year when its EV/Sales multiple was at 10x and 20x respectively. This suggests that cheaper competitors not only have higher revenue quality but also more robust growth prospects.\nNext, let’s look at if the current growth prospects are even justified: Unfortunately, Palantir's commercial customer growth is already slowing. A few notes here: Firstly, The number of new commercial customers added has declined from 57 in Q1 to 39 in Q2. Secondly, Palantir's Bootcamp program, which aims to onboard new customers, has seen participant numbers drop from around 350 to about 110. Thirdly, the last beat on commercial revenue was largely due to one-time boosts in revenue (For example, they invested into a few SPAC’s previously as they were using foundry, which did quite well)\nOn the government side, growth has been pretty strong (Though not strong enough) and drove almost 100% of the consensus beat. However, management noted that the segment benefited the “favorable” deal timing dynamics, implying potential growth slowdown in future quarters.\nFurthermore, margins are likely to be depressed in the next few earnings calls: PLTR has announced the release of a new product recently. Analysts noted that this would depress margins in the upcoming report. However, an additional feature was announced 3 weeks ago that likely had significant opex expenses associated that haven’t been priced in considering recent rallies in the stock. \nFinally, there is increasing competition in the AI analytics space (Think Databricks, Snowflake and even companies like Airtable), making it easier and easier to process and operationalize unstructured data. At the end of the day, there simply aren’t that many use cases for an extremely expensive labor intensive service, which cannot move downmarket no matter how well-loved the service is (As well to organizations with well endowed data science teams).\nThe realization of any of these notes in earnings reports as well as a resolution in any of the geopolitical issues that the US is attached to today could be a turn in investor sentiment and enormous room to the downside. Additionally, macro risks to enterprise spending, intensified by the enormous cost of PLTR’s service create more downside risk.\nValuation: Based on a DCF analysis, to justify PLTR’s current pricing, the company needs to expand operating margin 6% by 2029, actually accelerate to a 30% growth rate (from 24%) by 2027 through 2029 as well as maintain a 20x EV/sales multiple (Assumed 14.5% discount rate). However, even in a bull case where we model a 2% beat on consensus revenue annually, and 6% margin expansion by 2029, we still arrive at $35 per share, a 20% drop from current levels.\nRisk Factors: The biggest risk here is related to the government sector. Specifically the DoD outlines in its 2024 plan a shift to larger-scale implementation and a focus on data and overall modernization of systems. This sounds like the DoD and PLTR are pretty lovey dovey, which could potentially spell higher valuations. Further, the escalation of more dormant issues, like that of China and Taiwan could lead to higher than expected spending and therefore contract signings.\nUnexpected commercial strength could also occur. Strong enterprise SaaS spending as rates drop could accelerate sales as well as new product launches. For example, Physical AI applications with the new Live Edge platform (focusing on manufacturing use cases) have been added. However, this is unlikely to bring in revenue until later in 2025.\nTo hedge against these risks, we could purchase call options, long various paired stocks or set a stop loss.\n",
        "created_utc": 1730319041.0,
        "subreddit_name": "wallstreetbets",
        "comments": 59
    },
    {
        "title": "Reddit's Shares Surge on AI Data Licensing Deals ",
        "score": 10,
        "url": "https://www.reddit.com/r/investing/comments/1gfadkb/reddits_shares_surge_on_ai_data_licensing_deals/",
        "content": "\nJust wanted to share some exciting developments for Reddit investors and tech enthusiasts alike. Reddit's shares have seen a notable jump recently, and here's why:\n\nAI Deals Boosting Share Price:\n\n- Profitability at Last: Reddit has just reported its first profitable quarter ever, with a 68% increase in revenue YoY. This isn't just from ads; they've made smart moves by licensing their user-generated content for AI training.\n\n- Google and OpenAI: Yes, you heard that right. Reddit has inked deals with tech giants like Google and OpenAI, essentially turning user posts into gold for AI model training. This isn't just good for Reddit's bottom line; it's positioning them at the forefront of AI integration in social media.\n\n- User Base Expansion: Not only is Reddit making money, but they're also seeing a surge in daily active users. Their platform's growth seems to be fueled by these AI partnerships, perhaps through features like real-time translations or enhanced content discovery.\n\n- Market Reaction: The financial markets have responded with enthusiasm. After Reddit's earnings beat expectations, shares reportedly jumped by up to 22%. Investors are clearly betting big on Reddit's AI strategy.\n\n\nWhat This Means for Reddit:\n\n- Future Revenue Streams: This could be just the beginning for Reddit. With more AI companies hungry for training data, Reddit's stock of user-generated content becomes increasingly valuable.\n\n- Innovation in User Experience: The partnerships might lead to innovative features on Reddit, making it not just a place for discussion but a hub for cutting-edge tech experiences.\n\n- Setting a Trend: Other social platforms might follow suit, but Reddit's early move here could cement its place in the AI ecosystem.\n\nWhat do you guys think? Is this the right move for Reddit? How do you see this affecting the landscape of social media and AI? Let's discuss!\n\nReddit's shares are up due to lucrative AI data deals with companies like Google and OpenAI, hitting profitability, and growing its user base. They're leveraging their content for AI training, which might just redefine their role in tech.\n\n",
        "created_utc": 1730249211.0,
        "subreddit_name": "investing",
        "comments": 28
    },
    {
        "title": "NVDA is more than an AI bubble",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gfq4yb/nvda_is_more_than_an_ai_bubble/",
        "content": "I am a little confused with some fo the discourse regarding NVDA specifically those who call the company a result of an AI bubble and compare it to those the [Dot.com](http://Dot.com) bubble. I feel those situations are so different because firstly most of those [Dot.com](http://Dot.com) bubble companies never had real earnings. They essentially got to the point where they just added [dot.com](http://dot.com) to companies that never had a chance of profitability. Not only does NVDA have earnings but their main concern is just keeping up with demand. The only real concern I see about NVDA is whatever administration enters office within the start of the new year and how they deal with China and Taiwain especially because of Taiwains impact on the semi-condcutor industry with TSMC as the leading producer of semi-conductors especially because Intel cannot keep up and is being left behind.",
        "created_utc": 1730304308.0,
        "subreddit_name": "investing",
        "comments": 20
    },
    {
        "title": "The MacBook Air gets a surprise upgrade to 16GB of RAM",
        "score": 4650,
        "url": "https://www.theverge.com/2024/10/30/24282981/apple-macbook-air-m2-m3-16gb-ram-minimum-price-unchanged",
        "content": "",
        "created_utc": 1730300754.0,
        "subreddit_name": "apple",
        "comments": 788
    },
    {
        "title": "Apple Polishing Cloth adds support for the new iMac and MacBook Pro (M4-models)",
        "score": 2041,
        "url": "https://www.apple.com/shop/product/MW693AM/A/polishing-cloth?fnode=3e60a41d079c08ba303296fe35cfbcb846185ad8c495cbaea5fe5d8d46175c32eedc5472b7e430ffeda7fc8582b7c3a80a4ba89adcfe4d1ca938545d6db3e247e32657dd4e76951f75cc3888d4b257e6f2ce493824d9184afb0a25aa9aec7363",
        "content": "",
        "created_utc": 1730302132.0,
        "subreddit_name": "apple",
        "comments": 159
    },
    {
        "title": "New MacBook Pro features M4 family of chips and Apple Intelligence",
        "score": 1177,
        "url": "https://www.apple.com/newsroom/2024/10/new-macbook-pro-features-m4-family-of-chips-and-apple-intelligence/",
        "content": "",
        "created_utc": 1730300435.0,
        "subreddit_name": "apple",
        "comments": 554
    },
    {
        "title": "Apple silicon Macs will get their ultimate gaming test with Cyberpunk 2077 release",
        "score": 1045,
        "url": "https://arstechnica.com/gaming/2024/10/intensely-demanding-aaa-game-cyberpunk-2077-is-coming-to-the-mac/",
        "content": "Cyberpunk 2077, one of the most graphically demanding and visually impressive games in recent years, will soon get a Mac release, according to developer and publisher CD Projekt Red.",
        "created_utc": 1730329043.0,
        "subreddit_name": "apple",
        "comments": 217
    },
    {
        "title": "Apple Announces M4 Max Chip: Up to 16-Core CPU, Up to 40-Core GPU, Up to 128GB of RAM, and More",
        "score": 906,
        "url": "https://www.macrumors.com/2024/10/30/apple-announces-m4-max-chip/",
        "content": "",
        "created_utc": 1730300906.0,
        "subreddit_name": "apple",
        "comments": 152
    },
    {
        "title": "MacBook Pro Now Available With Nano-Texture Display for First Time",
        "score": 432,
        "url": "https://www.macrumors.com/2024/10/30/macbook-pro-available-with-nano-texture/",
        "content": "It is now available across the Pro Display XDR, Studio Display, ‌iMac‌, ‌MacBook Pro‌, and iPad Pro.",
        "created_utc": 1730303963.0,
        "subreddit_name": "apple",
        "comments": 89
    },
    {
        "title": "Apple is challenging hackers to break into the company's servers | Fortune",
        "score": 313,
        "url": "https://fortune.com/2024/10/30/apple-hackers-ai-intelligence-bounty/",
        "content": "",
        "created_utc": 1730315090.0,
        "subreddit_name": "apple",
        "comments": 44
    },
    {
        "title": "Apple Updates Base 14-Inch MacBook Pro With M4 Chip, 16GB of RAM, Extra Thunderbolt Port, Space Black, and More",
        "score": 299,
        "url": "https://www.macrumors.com/2024/10/30/apple-announces-14-inch-macbook-pro-with-m4-chip/",
        "content": "",
        "created_utc": 1730300857.0,
        "subreddit_name": "apple",
        "comments": 58
    },
    {
        "title": "New MacBook Pros Feature Brighter Displays Outdoors, Also Even Dimmer in Low Light",
        "score": 252,
        "url": "https://www.macrumors.com/2024/10/30/new-macbook-pros-brighter-display-outdoors/",
        "content": "",
        "created_utc": 1730316230.0,
        "subreddit_name": "apple",
        "comments": 35
    },
    {
        "title": "Tip: \"scheduling message\" to \"any device\" actually means only apple devices, despite what apple support page states.",
        "score": 229,
        "url": "https://discussions.apple.com/content/attachment/837c65c6-d616-4d63-98de-966fcff9e8c1",
        "content": "",
        "created_utc": 1730287158.0,
        "subreddit_name": "apple",
        "comments": 84
    },
    {
        "title": "New MacBook Pro M4",
        "score": 166,
        "url": "https://www.apple.com/uk/macbook-pro/",
        "content": "",
        "created_utc": 1730301569.0,
        "subreddit_name": "apple",
        "comments": 47
    },
    {
        "title": "MacBook Pro Announcement Video",
        "score": 124,
        "url": "https://youtu.be/G0cmfY7qdmY?si=_OlimaJKDHlxr4rv",
        "content": "",
        "created_utc": 1730301125.0,
        "subreddit_name": "apple",
        "comments": 22
    },
    {
        "title": "Apple Passwords’ Generated Strong Password Format",
        "score": 110,
        "url": "https://rmondello.com/2024/10/07/apple-passwords-generated-strong-password-format/",
        "content": "",
        "created_utc": 1730299473.0,
        "subreddit_name": "apple",
        "comments": 31
    },
    {
        "title": "LLM on M4 Max 128GB?",
        "score": 56,
        "url": "https://www.reddit.com/r/apple/comments/1gfz6ck/llm_on_m4_max_128gb/",
        "content": "Announcement says it can run up to 200b parameters. Meanwhile my M1 Max 64GB (maxed out chip) is struggling with 70B Llama models. How did apple benchmark this? Are they lowering the quantization to run larger models? \n\n\n\nGood source to check out:\n\n[https://www.substratus.ai/blog/calculating-gpu-memory-for-llm](https://www.substratus.ai/blog/calculating-gpu-memory-for-llm)\n\n",
        "created_utc": 1730327218.0,
        "subreddit_name": "apple",
        "comments": 8
    },
    {
        "title": "In Apple’s new ads for AI tools, we’re all total idiots",
        "score": 51,
        "url": "https://www.fastcompany.com/91218041/apple-intelligence-ad-total-idiots",
        "content": "",
        "created_utc": 1730319394.0,
        "subreddit_name": "apple",
        "comments": 104
    },
    {
        "title": "AI + HomePods?",
        "score": 40,
        "url": "https://www.reddit.com/r/apple/comments/1gfdfe6/ai_homepods/",
        "content": "What’s the chance that we see an upgraded HomePod lineup that runs Apple Intelligence, and can access chatGPT when needed just like iPhones are expected to?",
        "created_utc": 1730258665.0,
        "subreddit_name": "apple",
        "comments": 28
    },
    {
        "title": "Daily Advice Thread - October 30, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/apple/comments/1gfix40/daily_advice_thread_october_30_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1730282432.0,
        "subreddit_name": "apple",
        "comments": 101
    },
    {
        "title": "Norway: Tram derails, plows into Apple outlet in Oslo – DW",
        "score": 0,
        "url": "https://www.dw.com/en/norway-tram-derails-plows-into-apple-outlet-in-oslo/a-70633143",
        "content": "",
        "created_utc": 1730251252.0,
        "subreddit_name": "apple",
        "comments": 5
    },
    {
        "title": "Why has Apple not made an Apple Keyboard/Magic Trackpad Combo Unit like Logitech yet? This seems like a no-brainer product especially for the Mac Mini.",
        "score": 0,
        "url": "https://www.logitech.com/en-us/products/keyboards/k400-plus-touchpad-keyboard.920-007119.html",
        "content": "",
        "created_utc": 1730269223.0,
        "subreddit_name": "apple",
        "comments": 34
    },
    {
        "title": "Cyberpunk 2077 is confirmed next year for mac",
        "score": 827,
        "url": "https://i.redd.it/jx8kp2gewwxd1.jpeg",
        "content": "In Recently released announcement video for macbook pro apple officially confirmed cyberpunk 2077 for mac early next year. Time stamp -(10:17)",
        "created_utc": 1730302065.0,
        "subreddit_name": "mac",
        "comments": 83
    },
    {
        "title": "Absolute madness.... Apple must be stopped. 16 GB is far too much.",
        "score": 604,
        "url": "https://i.redd.it/41h1im1xdyxd1.jpeg",
        "content": "",
        "created_utc": 1730320110.0,
        "subreddit_name": "mac",
        "comments": 82
    },
    {
        "title": "Apple Introduces MacBook Pro M4 , M4 Pro and M4 Max ",
        "score": 508,
        "url": "https://www.apple.com/newsroom/2024/10/apple-introduces-m4-pro-and-m4-max/",
        "content": "",
        "created_utc": 1730300416.0,
        "subreddit_name": "mac",
        "comments": 109
    },
    {
        "title": "New MacBook Pro M4, M4 Pro and M4 Max released…",
        "score": 342,
        "url": "https://i.redd.it/2shgnkc8uwxd1.jpeg",
        "content": "Some nice quality of life upgrades as expected. The M4 Max will fly!",
        "created_utc": 1730301334.0,
        "subreddit_name": "mac",
        "comments": 87
    },
    {
        "title": "Mini or iMac",
        "score": 327,
        "url": "https://i.redd.it/9iaxmkvuqtxd1.jpeg",
        "content": "Looking to buy first Mac ever even though I've been using iPhone for a long time. Main use is just web surfing and accessing NAS. For rest of stuffs, I'll still use PC. If I get mini, then I plan to hook it up to living room TV as monitor and use wireless keyboard. If I get iMac, then I'll place it next to PC. Thoughts? P4A. ",
        "created_utc": 1730263880.0,
        "subreddit_name": "mac",
        "comments": 194
    },
    {
        "title": "It’s official! Cyberpunk 2077 is coming to the M4 MacBook Pros next year!",
        "score": 133,
        "url": "https://i.redd.it/gfh4vp7fwwxd1.jpeg",
        "content": "Coming “early next year”!",
        "created_utc": 1730302071.0,
        "subreddit_name": "mac",
        "comments": 16
    },
    {
        "title": "Did Apple just bait the entire Internet for new Mac memes today?",
        "score": 122,
        "url": "https://i.redd.it/pq8371v6ywxd1.png",
        "content": "",
        "created_utc": 1730302672.0,
        "subreddit_name": "mac",
        "comments": 43
    },
    {
        "title": "What Do You Think Of New MacBook Pro?",
        "score": 113,
        "url": "https://i.redd.it/v7hicp6jazxd1.jpeg",
        "content": "",
        "created_utc": 1730331031.0,
        "subreddit_name": "mac",
        "comments": 124
    },
    {
        "title": "The cost of upgrading each device to a nano-texture display: how do the new Macs compare?",
        "score": 28,
        "url": "https://i.redd.it/3ocvs1dj2yxd1.jpeg",
        "content": "I had some free time, and since there’s been some new Mac announcements this week, decided to dig into them a bit more. A big surprise to me was that the iMac and MacBook Pro both got a nano-texture display option. This wasn’t really rumoured, and got me asking how these upgrades are priced, and how it compares across the lineup. There are a few interesting things: bigger doesn’t mean more expensive; the non-Pro products are actually the best value to upgrade; and the Pro Display XDR is somewhat in a league of its own when it comes to upgrade pricing.\n\nRevolutionary analysis? Maybe not, but I found it interesting!\n\nCan read a bit more detail here: https://moof.blog/2024/10/30/reflecting-value-not-light-the-cost-of-nano-texture-across-apples-devices/",
        "created_utc": 1730316235.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "Even though I am in Europe, I have a US apple account and just got into the Beta. Can I make my iPad the primary responder to “Hey, Siri” instead of the HomePods which I have in every room?",
        "score": 25,
        "url": "https://i.redd.it/nyfmw1l3buxd1.jpeg",
        "content": "I created my apple account when there were no European ones, kept it in the US region for various reasons and I just got added to the AI beta. So I wanted to test it, but my HomePods pick up every “Hey, Siri” instead of the iPad with AI, is there a way to set up which one has precedence? I can type, but the natural conversation seems like the biggest improvement instead of “open on your phone”",
        "created_utc": 1730270686.0,
        "subreddit_name": "mac",
        "comments": 8
    },
    {
        "title": "Why Macbook M4 Pro doesn't have 64GB ram option but Mac Mini M4 Pro has it?",
        "score": 15,
        "url": "https://www.reddit.com/r/mac/comments/1gfvvxx/why_macbook_m4_pro_doesnt_have_64gb_ram_option/",
        "content": "Did you notice that Mac Mini M4 Pro has 64GB ram option but macbook M4 Pro does not?\n\nMacbook Pro 14/16 M4 Pro has max memory of 48GB \"only\". (64GB option is available with M4 Max but this is beyond the point).  \nIt is the first time I have seen on M series on macs have different ram options for the same cpu.\n\nThe whole memory topic is interesting and I am not complaining about the improvement on Pro series.  \nM4 has 2 memory channels, as it always has had.  \nM4 Pro has 4 memory channels. Same as M1 Pro and M2 Pro. But, M3 pro had 3 channels.   \nM4 Max has 8 memory channels. Binned version has 6 memory channels. No change, same as all Max series.\n\nAll M4 series support 8GB, 12GB and 16GB options per channel.   \nOnly exception is M4 Pro on Macbook Pro-s, that do not support 16GB per channel.  \nInteresting at least.",
        "created_utc": 1730318724.0,
        "subreddit_name": "mac",
        "comments": 18
    },
    {
        "title": "The new Magic Keyboard requires your Mac to be running macOS Sequoia in order to work",
        "score": 9,
        "url": "https://www.reddit.com/r/mac/comments/1gfti2e/the_new_magic_keyboard_requires_your_mac_to_be/",
        "content": "Like the title says. I received the new USB-C Magic Keyboard today and tried setting it up on my work Mac (M1 Pro) and it wouldn’t connect properly. I read the pamphlet that came with it and it says your Mac has to be running the latest software in order to fully work. \n\nMy job hasn’t allowed us to update to Sequoia yet (yay banking!) so I’m still running Sonoma (14.7). While it’s connected via the cable it will type but the function keys will not work. As soon as it’s unplugged it stops working. It won’t connect via Bluetooth. My personal M2 MacBook Air works fine since it’s running Sequoia but I’ll have to wait until my company allows the update to use my new keyboard :/",
        "created_utc": 1730312701.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "Why is my IMac (2012) like this? It has been like this for over an hour since I powered it off",
        "score": 6,
        "url": "https://i.redd.it/7e3jj2gxvsxd1.jpeg",
        "content": "",
        "created_utc": 1730253481.0,
        "subreddit_name": "mac",
        "comments": 36
    },
    {
        "title": "Finishing high-school in my 30s ",
        "score": 5,
        "url": "https://www.reddit.com/r/mac/comments/1gfqf4e/finishing_highschool_in_my_30s/",
        "content": "As the title states,  I'll be spending about 6 months finishing high-school in ontario followed by some sort of post secondary.  \n\nMoney isn't an issue but I can't decide between an m4ipad pro with magic keyboard and pencil or just getting a macbook air.  \n\nI'll be using it to study and take notes and do remote classes.   All can be done on mac os or ios. \n\nWhich do you think is more beneficial for an adult going back to school?  ",
        "created_utc": 1730305012.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "Own an M1 MacBook Pro, looking at the new Mac Minis? Stupid?",
        "score": 6,
        "url": "https://www.reddit.com/r/mac/comments/1gfkhz4/own_an_m1_macbook_pro_looking_at_the_new_mac/",
        "content": "I work in healthcare full time and do additional online study. Use case is mostly word, internet, PDF textbooks, media consumption. I also do love nice tech / better displays / speakers etc.\n\nMy 2020 M1 8gb MacBook Pro is still going strong, with an expected dip in battery life. Currently it sits in clamshell mode connected to a nice monitor for most of the time - occasionally coming to work. \n\nI am (maybe irrationally) itching for an upgrade but am not sure where to go: an updated MacBook Pro (best display, expensive), a larger MacBook Air (similar specs to my current M1 Pro), or the new Mac Mini for home and keep using a MacBook on the move?\n\nBasically- is it stupid to own a Mac mini and a 2020 MacBook Pro?",
        "created_utc": 1730288578.0,
        "subreddit_name": "mac",
        "comments": 14
    },
    {
        "title": "I f’ked up and bought a Macbook pro m3 last week",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gg0oc4/i_fked_up_and_bought_a_macbook_pro_m3_last_week/",
        "content": "Basically I needed a macbook last week so I went into KRCS (im in the UK) and bought the m3 pro 18gb 512gb model literally 6 days ago and after todays announcement im having major regret!\n\nThe equivalent m4 model is also even slightly cheaper than what I paid which is a kick in the nuts.\n\nThere is a 14 day “cooling off period” but I have used the machine (signed into my apple id, downloaded and installed logic pro and final cut etc).\n\nThis is the KRCS returns t&c’s:\n\n“We may make a deduction from a refund for any loss in value of the goods if that is a result of any unnecessary handling by you. For example, you can check the nature, characteristics and functioning of the device as you might do in one of our stores, but not install your own software or data, or make general day-to-day use of the device.”\n\nAny advice is appreciated!",
        "created_utc": 1730331212.0,
        "subreddit_name": "mac",
        "comments": 14
    },
    {
        "title": "M4 Mac Mini (Non-Pro) vs MBP M1  Pro ",
        "score": 4,
        "url": "https://www.reddit.com/r/mac/comments/1gfvmxt/m4_mac_mini_nonpro_vs_mbp_m1_pro/",
        "content": "I totally understand that these are two very different categories but my budget allows me to pick from either MBP M1 Pro(used) or New M4 Mac Mini(base model)\n\nMobility not an issue. \n\nPrimary usage is making iOS apps which means applications that will be frequently used are XCode, Postman, Figma, Photoshop among few. \n\nHow does these two fare on performance, does the M4 Mac Mini surpass on all front considering it’s three generations ahead of M1?",
        "created_utc": 1730318098.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Anyone else disappointed with the new M4’s lacking WiFi 7 support?",
        "score": 4,
        "url": "https://www.reddit.com/r/mac/comments/1gg0wif/anyone_else_disappointed_with_the_new_m4s_lacking/",
        "content": "Like the title says. I ordered a new 16” M4Pro base model and honestly didn’t really think about it until after I checked out but I’m a little disappointed that WiFi 7 didn’t make it into the new MacBook Pros. Not really a deal breaker but would’ve been nice. Since my iPhone 16 has it. \n\nhttps://www.macrumors.com/2024/10/30/m4-mac-models-no-wi-fi-7/",
        "created_utc": 1730331836.0,
        "subreddit_name": "mac",
        "comments": 20
    },
    {
        "title": "Camera Flexgate Fix Question.(Macbook Pro 2017)(1708)",
        "score": 3,
        "url": "https://i.redd.it/18wtwx038yxd1.jpeg",
        "content": "I am fixing a flexgate damaged computer, and it has both cables damaged, i have done the backlight and now i’m doing the camera one, i was wondering if i can connect the small traces connected together or in pairs or i can just leave them out, and would like to know their purpose, Thanks for the help!",
        "created_utc": 1730318123.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "M4 Mac mini internal SSD speeds",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gfsrbm/m4_mac_mini_internal_ssd_speeds/",
        "content": "A lot of hullabaloo was made about the internal SSD speeds of previous Apple Silicon Macs. To get higher speeds, you had to get the higher capacity drives due to them being comprised of multiple NAND chips, versus, for example, the single NAND 256GB SSD. For that reason, if you cared about drive speed, it was highly recommended that you avoid the baseline SSD and upgrade to at least 512GB.\n\nDo we think this will be the same case with the M4 Mac mini? Surprisingly, I haven't seen anything explicitly mention this in any of the coverage thus far. Obviously we won't know for sure before folks can get their hands on them to test, but perhaps we could get confirmation from Apple?\n\nAsking because I'm looking to build a new home server with the M4 Mac mini, and I'll be using primarily external storage, so 256GB might actually be sufficient (and I could save $200). But, of course I'd prefer the faster internal drive if this is the case once again.\n\nThoughts?",
        "created_utc": 1730310859.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "Can we talk about the M2 & M3 Macbook Air Ram Refresh? ",
        "score": 4,
        "url": "https://www.reddit.com/r/mac/comments/1gfps0q/can_we_talk_about_the_m2_m3_macbook_air_ram/",
        "content": "I know it was brief, but they kind of just swept it under the rug in the announcement event. \n\n“Now on models with M2 and M3, were doubling the starting memory to 16 GB and keeping the starting price at just $999”\n\nI feel bad for anyone who just bought an M3 Macbook air before today",
        "created_utc": 1730303414.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "The new M4 Macbook Pro",
        "score": 2,
        "url": "https://www.reddit.com/gallery/1gfp0nk",
        "content": "",
        "created_utc": 1730301483.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "I reached 1300 cycle count on my macbook pro early 2015:)",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gfkznr/i_reached_1300_cycle_count_on_my_macbook_pro/",
        "content": "https://preview.redd.it/urkap84rwvxd1.png?width=1252&format=png&auto=webp&s=bfe3607f0a121640a3d9204a6d8b852f1328fb8a\n\nSo this is my first macbook, I purchased it second hand and is still in great condition! Maybe in future I will buy a new macbook, but for now what I have still works for college and I already have a PC at home:)",
        "created_utc": 1730290247.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "Should I buy Mac Mini M4 and resell MacBook Air M1 (8GB)?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gfkany/should_i_buy_mac_mini_m4_and_resell_macbook_air/",
        "content": "Apple recently announced the new Mac Mini, and I’m considering purchasing the 16GB version while selling my three-year-old MacBook Air (M1) with 8GB RAM. The MacBook Air starts to be slightly sluggish when I open many Safari tabs while launching  image editors.\nDo you think this upgrade is worthwhile and cost-effective? I already own a PC with a 27” monitor and Bluetooth keyboard, and I’m also getting the new iPad Air M2 next month for mobile use.",
        "created_utc": 1730287857.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "I messed up yet again - 2009/2010 MacBook Pro not turning on ",
        "score": 4,
        "url": "https://www.reddit.com/gallery/1gfk2fu",
        "content": "A bit earlier, I bought a 2008 MacBook as I needed a MacBook for some things. It arrived, it didn’t turn on no matter what I tried, the battery did charge though. \n\nSo then, I bought this one, which I even got pictures of it working, and nope, it arrived and it does not work. The battery was also bloated and a fire hazard! \n\nThe charging light is green and the battery indicator LED works too but that’s about all I can get. Reseating RAM does nothing too. ",
        "created_utc": 1730287026.0,
        "subreddit_name": "mac",
        "comments": 17
    },
    {
        "title": "How to enable Wi-Fi monitor mode on Sonoma and up?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gfit8z/how_to_enable_wifi_monitor_mode_on_sonoma_and_up/",
        "content": "Hi, I have a macbook pro M2 and it turns out that since sonoma, the airport tool is no longer supported. How can I now monitor the networks around me? Is there a new way to do this?",
        "created_utc": 1730281979.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Windows user looking to invest in the new Mac Mini for productivity.",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gfamrr/windows_user_looking_to_invest_in_the_new_mac/",
        "content": "Hey all, I’m someone who uses Windows and iPhone.\n\nMy current setup is an MSi Gaming laptop, which I use to play games and interface with Windows. I don’t actually take it anywhere, aside from longer trips. Mostly have used laptops for being a convenient all-in-one. And for the most part I am content with it \n\nIt is getting a bit old though. And I would like to have a dedicated device for productivity. Mostly to facilitate art, music creation, and modeling. I don’t need this new Mac Mini to play games. Moreso the size and price for performance are the real draws for me.\n\nI plan on using my current laptop a bit longer before replacing it with a new Windows setup. Mostly because I know compatibility with Apple software is not as open as Windows.\n\nAnd so I might ask; What are some things I should know as a Windows user? Is there a specific brand of monitor I need? And what suggested specs do you all recommend for productivity?\n\nThanks in advance!",
        "created_utc": 1730249962.0,
        "subreddit_name": "mac",
        "comments": 8
    },
    {
        "title": "please help",
        "score": 2,
        "url": "https://www.reddit.com/gallery/1gg05hl",
        "content": "hey guyss supp !! I’ve had a MacBook Pro M1 since 2021, and I’m wondering if there’s any way to get rid of these ‘sweat stains’?",
        "created_utc": 1730329823.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "Does the MacBook Pro support MULTIPLE 144Hz+ external monitors?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gfzuyo/does_the_macbook_pro_support_multiple_144hz/",
        "content": "I have Googled this very question and have seen some people have success with multiple high refresh rate monitors. However, I have seen others have issues with similar setups for some reason or another. And when viewing Apple's website only ever mentions ONE monitor at 4k144Hz. \n\nTherefore, I don't have that 100% gut feeling in knowing whether MacBook Pros support MULTIPLE external displays at high refresh rates, regardless of resolution. I would like to see if someone with success could share their setup and confirmation. My brain tells me it simply should come down to bandwidth, so if you have the bandwidth available then you should be able to mix and match whatever resolution and refresh rates you want. \n\nSo can some people here that are running multiple 144Hz+ please comment below and tell me that it works? Please state your resolution and your refresh rate for your monitors, as both are important to know. Thank you personally, and also from the many people who will find this on Google later.",
        "created_utc": 1730329033.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "$485 Apple Trade-In for 2020 13\" M1 MBP 8 Core, 16GB, 1TB",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gfzf7x/485_apple_tradein_for_2020_13_m1_mbp_8_core_16gb/",
        "content": "It seems insane that a laptop from only 4 years ago with good specs that was over $3k is now only worth $485... Or am I crazy? Am I better off trying to sell it on my own outside of Apple Trade-In?? What is everyone's experience with selling vs trade in, was it worth it? \n\nSide question: upgrading to the M4 Max for heavy CAD, 3D modeling, and rendering use and can't decide between 14\" and 16\". Any advice on which to choose? Is 16\" worth the $300 price difference? \n\nI know lots of folks are asking for advice so apologies in advance is this is repetitive and annoying! ",
        "created_utc": 1730327860.0,
        "subreddit_name": "mac",
        "comments": 11
    },
    {
        "title": "Upgrading from previous model",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gfykmq/upgrading_from_previous_model/",
        "content": "Hi everyone! So after waiting a bit for the news, I’m still undecided. I’m currently in the market to purchase either a new macbook or ipad, but I don’t know which one. With the news about the new m4 chip. Is it worth it to upgrade either of my devices?\n\nThe price between the two isn’t too big for me (unless i get the m4 max). \n\nI currently have a : \n- 15in 2016 2.6 GHz quad core intel core i7 16 GB 2133 MHz LPDDR3\n- iPad Pro 10.5 inch model MPDY2LL/A \n\n\nI appreciate any thoughts and advice, thank you!",
        "created_utc": 1730325637.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Sudden Black Shadows on MacBook Pro M1 Screen",
        "score": 2,
        "url": "https://www.reddit.com/gallery/1gfxpdb",
        "content": "I’m experiencing an issue with my MacBook Pro M1 where black shadows suddenly appear at  the bottom of my screen. They disappear after I open and close the MacBook 2 times .Has anyone else encountered this problem? Any suggestions on how to fix it? Will the screen die ?",
        "created_utc": 1730323354.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "m4 macbook pro or m4 pro macbook pro",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gfwdv6/m4_macbook_pro_or_m4_pro_macbook_pro/",
        "content": "I am a student who has hella tabs open always, very rarely do video editing (but I still do it), and I play some games and produce using FL studio. Should I get the m4 or m4 pro mbp? Of course, I want it to be future-proof and there is a $350 price hike between the two.. Is it justified this year (given that the base models now have 16+512)",
        "created_utc": 1730319976.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "3rd Party 27 inch (or bigger) monitor recs?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gfw6d1/3rd_party_27_inch_or_bigger_monitor_recs/",
        "content": "I need a new Mac.  My iMac (late 2014) cannot upgrade past Big Sur and I can't run latest MS Office software since the current OS doesn't support it.  Also, the computer hangs up quite a lot (spinning rainbow ball) and I have to reboot - about once a month.  If I am teaching when this happens, it's a disaster.  Sometimes only a hard reboot will work.  OK, so I have to upgrade.\n\n  \nSince iMac no longer comes in a 27 inch size, I'm considering a Mac Mini.  I wasn't really considering that because the Apple 27 inch monitor is so expensive (1599 list) but I just saw an ad for a Dell 27 inch monitor  for $170, and it makes me think I should go that route.\n\nSo I\"m looking for a guide to monitors that will work with a Mac.  Is there a good resource that compares various 3rd party monitors, especially ones that will work well with a Mac?\n\nAlso, if anyone has any advice that I'm going about this the wrong way (\"Don't do that!  Do this instead.\") I'd love to hear it.  Thanks for your help.",
        "created_utc": 1730319435.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "History of 8GB Apple laptops",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gfu4g8/history_of_8gb_apple_laptops/",
        "content": "date | event\n--- | ---\n2012-10-27 | 12\" MacBook Pro introduced with a premium prebuilt option with 8GB DDR3 SDRAM (instead of the 4GB of the starting model).\n2013-10-22 | Apple releases its final model of MacBook Pro that can be purchased with only 4GB of RAM. It's discontinued 2014-07-29, at which point, 8GB becomes standard across all \"Pro\" models of Apple laptops.\n2015-03-09 | 2015 MacBook Air launched with only 4GB of RAM, it will be the last Apple laptop with 4GB of RAM.\n2015-04-10 | 12\" MacBook introduced with 8GB LPDDR3 standard. The entire line was discontinued in 2019.\n2017-06-05 | 2015 MacBook Air bumped from 4GB to 8GB LPDDR3, and continued to be sold until 2021. 8GB is now standard across all Apple laptops.\n2023-11-07 | Apple (hopefully) released its final model of MacBook Pro with only 8GB of LPDDR5. It was available for purchase with a starting price of only 1599$ with a 512GB SSD.\n2024-03-08 | M3 MacBook Air launched with 8GB LPDDR5. It was available for 1099$ with a 256GB SSD until November.\n2024-10-30 | M2 and M3 MacBook Air starting models both bumped to 16GB without raising their starting prices. An additional 8GB of LPDDR5 still costs the normal 200$. Also, Mac mini, iMac, and MacBook Pro are unavailable for purchase until the new models launch in November, making 16GB the minimum available for any new computer from Apple.",
        "created_utc": 1730314239.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Does anyone still use El Captain?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gftdqz/does_anyone_still_use_el_captain/",
        "content": "i have an 2007 15-inch Macbook Pro. i installed El Captain recently was wondering if theres any useful apps i can install on El Captain. or any old website i can download old software. ",
        "created_utc": 1730312397.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "My dad has asked me to sell or get rid of his imac he bought years ago. Is it worth anything today?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gfrpbh/my_dad_has_asked_me_to_sell_or_get_rid_of_his/",
        "content": "IMAC 27INCH LATE 2012\n2.9GHZ INTEL I5 QUAD CORE \n16GB 1600MHZ DDR3\n1TB FUSION DRIVE\nNVIDIA GEFORCE GTX 660M 512MB\n",
        "created_utc": 1730308237.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "Debating trading in my Mac mini m2 for the new m4",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gfr1ea/debating_trading_in_my_mac_mini_m2_for_the_new_m4/",
        "content": "Bought a Mac mini m2 with 26GB and 1TB early this year and of course a refresh happens the same year I buy it. \n\nSaw that Apple does trade in to help pay for the newer M4. Has anyone done a trade in before and is the value “fair” to warrant it?",
        "created_utc": 1730306578.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "Am I mad for upgrading? ",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gfq5ak/am_i_mad_for_upgrading/",
        "content": "I currently have base M1 MBP with Touch Bar, 256gb and 8gb RAM. It is ostensibly *fine,* and would last anyone another few years at least - it isn't sluggish to open apps, it has great battery life, it does 99% of what I want.\n\nHowever in work I do a lot of graphic design and photo and video editing, and I have started to butt up against RAM limits more and more. It's probably my fault for having too much open at once, but the nature of my job means a lot of back and forth with files, and I'm getting the out of RAM message at least once a day, so it's a bit frustrating.\n\nMy storage is also at that point where is full, but full of lots of tiny files that are an absolute pain to go through and clear out easily. Also my Touch Bar is broken.\n\nSO I am mulling an M3 15 Inch MBA with 16gb of RAM and 512GB of storage - which I can get on Amazon now for £1549.\n\nAm I mad for considering it? Will I notice any appreciable upgrade in speeds? Will the RAM boost be felt? And most importantly, are there any ways in which going from the Touch Bar Pro to a new-style MacBook Air will feel like a downgrade, hardware wise?\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThis is a not-inconsequential amount of money for me, so any and all advice is appreciated!",
        "created_utc": 1730304329.0,
        "subreddit_name": "mac",
        "comments": 14
    },
    {
        "title": "Target Display Mode - Late 2013 iMac 27\"",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gfle6v/target_display_mode_late_2013_imac_27/",
        "content": "Hi guys,\n\nI've seen a few posts on this issue but just wanted to see if anyone has tried or tested this: \n\nI have the Late 2013 iMac 27\" and am planning to upgrade to the new Mac Mini M4. Will it be possible to use my iMac as the monitor via Target Display Mode if I use the Thunderbolt cable to connect them both? Has anyone tried something similar with the Mac Studio or other Macs running the silicon chip and thunderbolt 3/4 ports? \n\nThanks ",
        "created_utc": 1730291549.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Buying my first Mac. What specs should I purchase?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gflbw1/buying_my_first_mac_what_specs_should_i_purchase/",
        "content": "(Mods feel free to delete this if a purchase megathread is made)\n\nBasically as the title says. I’ve only used windows for my entire life and have zero experience with anything Mac related. I’m a college student and my major is in the computer field and I feel some experience working with MacOS would be helpful.\n\nAs of now I can afford the new mini, my main question is what specs would people recommend? The most intense software I’d run is any virtual machine software and maybe editing software. I also have a bad habit of not closing tabs. I also want to have the Mac last as long as possible, ie not running out of storage within a year or two or not being able to run programs in the future as they require more RAM.\n\nRight now I’m considering the M4 mini with 24GB of RAM and 512GB of storage. Would this be overkill for my use case? Any replies are appreciated!",
        "created_utc": 1730291348.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Keyboard and mouse don't work when starting",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gfkvuw/keyboard_and_mouse_dont_work_when_starting/",
        "content": "I wanted to open my macbook, but I found my mouse and keyboard don't do anything. I went to recovery assistant, but no luck either. What do I do? There are so many important files on my macbook.",
        "created_utc": 1730289891.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "2 External displays for m4 MacBook Air?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gfik3c/2_external_displays_for_m4_macbook_air/",
        "content": "Given the iMac and mini both support 3 displays, are we finally going to get an air that supports two external displays + built in with M4? This is the biggest gripe with my m1 Air, so would definitely be tempting. The base 16gb that we’ve seen with M4 would increase the value prop too.",
        "created_utc": 1730280796.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Mini & PC as remote desktop",
        "score": 2,
        "url": "/r/macmini/comments/1gfi4nj/mini_pc_as_remote_desktop/",
        "content": "",
        "created_utc": 1730280536.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Since Sequoia: Problem with reappearing WhatsApp Drafts",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gfh4ml/since_sequoia_problem_with_reappearing_whatsapp/",
        "content": "Hello,\n\nI have a strange problem with the WhatsApp app, which has only been occurring since Sequoia. \n\nThe app randomly saves individual chat messages I've started and displays them as drafts whenever I tap into the app again. Up to this point, this is a normal WhatsApp function. Unfortunately, the drafts are never deleted.\n\nIt then also moves the chats for which it has saved drafts to the top of the chat overview. If I then want to write a message in the chats where this problem exists, I always have to delete the draft first. As soon as I leave the app, for example by switching to another desktop, the old draft then reappears in the same chat and the game starts all over again. \n\nIt seems that WhatsApp writes these drafts to the cache and does not register them when I delete them. The problem only occurs with individual chats, others are unaffected.\n\nDoes anyone else have this problem? Has anyone found a solution to this yet?\n\nI've already deleted the app, reinstalled it, restarted the Mac. \n\nI would really appreciate some help!",
        "created_utc": 1730274056.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "10/10core 32gb M4 Mac Mini vs 14/20core 48gb M4 Pro Mac Mini",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gfg81l/1010core_32gb_m4_mac_mini_vs_1420core_48gb_m4_pro/",
        "content": "I have a base model 2019 MacBook Air and an iPad Pro M4 13’ and MK. I am looking at picking up a Mac Mini to tie me over for the next few years until Apple launch MacBook Pros with OLED displays. It doesn’t look like the next revision of MacBook Pros will have OLED displays, and it is more likely to be the next revision which will have them\n\nHow much more performance will the 14/20core afford me over the 10/10core? A consideration is that I would like to run Windows through Parallels (I still use Windows and will be replacing a NUC running Windows with this Mac Mini. Gaming is neither here nor there. I wouldn’t be opposed to playing some TF2 and some very casual games on it through Parallels, however it isn’t the end of the world if I can’t. I do have another PC in the household that I can freely play heavier AAA games on when desired\n\nI personally believe I will benefit from the 14/20core M4 over the 10/10core M4 in uses related to Parallels, I am just unsure how much of a benefit the extra cores would be in my use case\n\nAny advice from people who have experience multiple SKU’s of core counts within the M lineup would be valuable\n\nThanks everyone",
        "created_utc": 1730269717.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Mac Mini or New MBP, need help! ",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gffizy/mac_mini_or_new_mbp_need_help/",
        "content": "I have a 2020 intel i5 MBP with 8GB ram. It has served me well for past 3 years but now it's painfully slow. I need to run Android Studio, with an emulator most of the times. AS with Java eats around 4-5GB of ram and then 2GB for emulator.\n\nI was planning to buy new MBP with M chips for quite sometime now but with the launch of new Mac Mini, I'm inclinded towards it. \n\nI don't have any strict budget but since I'll be spending my own money, I don't want to waste on something that won't be beneficial to me. \nDoes it make sense to buy new M4 MBP or should I go with Mac Mini? \n\nSince Mini is so light, I can carry it with the laptop and use MBP as a monitor, is it possible? \nI'm looking at M4 with 32GB ram costing INR 1,00,000 while MBP will probably cost around 2.4x of that. Here is the comparison with M3 Pro but M4 will probably have the similar price. \n\nMac Mini M4, 10 Core, 32GB ram, 256GB ssd - INR1,00,000 \n\nvs\n\nMBP M3 Pro, 11 Core, 36GB ram, 512GB ssd - INR2,39,900",
        "created_utc": 1730266623.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Buying a new computer for my mom - M4 Mac Mini or M4 iMac?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gfcnhv/buying_a_new_computer_for_my_mom_m4_mac_mini_or/",
        "content": "My mom's been using an old prebuilt PC for the past 7 years. It works fine for her needs but it's starting to stutter a lot and crash randomly. I'm a PC enthusiast and build computers for fun, but my mom isn't tech savvy at all so I end up having to troubleshoot things for her all the time. I want to convince her to switch to a Mac because I think it'll be a better user experience for her. She doesn't need portability so the Macbook Air would be wasted on her since she'd rather have a bigger screen. So it comes down to the base M4 Mac Mini or the base M4 iMac. Of course I'll be paying for her new computer, and I'm wondering which one would be better suited for her.\n\nThe Mac Mini is smaller and would fit easily on her desk, but she would need a new monitor too (her current one is a 20\" 1680 x 1050 Dell monitor which I'm pretty sure would look horrible with MacOS). And she'd also need a new keyboard and mouse since her current peripherals use USB A and are wired. The iMac would be a more elegant solution, and would eliminate the need to purchase a separate monitor, mouse and keyboard. It also comes in pink which is her favorite color (she's been saying she wants a pink mouse and keyboard for a while now), but it's twice the price of the Mac Mini. I guess the price of a Mac Mini plus the required extra peripherals might end up equaling the cost of the iMac, but I'm not so sure about that. She will mainly be using the computer for basic web browsing, writing documents and attending frequent Zoom meetings. Which one would be better for her?",
        "created_utc": 1730256148.0,
        "subreddit_name": "mac",
        "comments": 29
    },
    {
        "title": "Moving from Windows PC to Macbook Pro 16\" for motion graphics, editing and 3D but I have a question about the spec comparison",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gf9z7z/moving_from_windows_pc_to_macbook_pro_16_for/",
        "content": "Ok so I'm sure people are sick of hearing question about \"which is better?\" and this isn't that. I'm starting a new job next week where I'll be doing exactly what I currently do as a freelancer right now which is shooting, editing (Resolve and Premiere), motion graphics (After Effects, Photoshop, Illustrator) and some light 3D work (probably Blender). I had a choice of a new desktop or laptop and since I'll be mobile quite a bit I opted for the laptop. Here's the system I have at home (and have used for about 6 years now).\n\nWindows 11   \nIntel(R) Core(TM) i7-7800X CPU @ 3.50GHz   3.50 GHz  \n128 GB (128 GB usable)  \nNvidia RTX 1080 ti\n\nHere's what I picked out as the laptop.\n\n* Apple M3 Max chip with 16‑core CPU, 40‑core GPU and 16‑core Neural Engine\n* 64GB unified memory\n* 4TB SSD storage\n* 16-inch Liquid Retina XDR display²\n* 140W USB-C Power Adapter\n* Three Thunderbolt 4 ports, HDMI port, SDXC card slot, headphone jack, MagSafe 3 port\n\nMy question is how does the 64GB of Ram in the Macbook Pro compare to the 128GB of Ram I'm currently using in my desktop? Is it 1:1 or are there extra benefits with the Macbook Pro that would technically make that 64GB feel closer to the 128gb in the desktop?\n\nThe issue is that it would have been over an extra $1k to bump up the ram from 64 to 128 and that started to push the budget too high. \n\nWould love any insight you could provide!",
        "created_utc": 1730248071.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Nothing Made a Glow-in-the-Dark Phone After Asking Customers What They Want | With over 900 entries from 47 countries, a glow-in-the-dark Nothing Phone (2a) Plus was a culmination of the five winning ideas.",
        "score": 1202,
        "url": "https://gizmodo.com/nothing-made-a-glow-in-the-dark-phone-after-asking-customers-what-they-want-2000518105",
        "content": "",
        "created_utc": 1730288440.0,
        "subreddit_name": "gadgets",
        "comments": 73
    },
    {
        "title": "M4 Max chip has 16-core CPU, 40-core GPU and 35% increase in memory bandwidth compared to the previous M3 / Apple says the M4 Max is the fastest laptop chip in the world.",
        "score": 351,
        "url": "https://9to5mac.com/2024/10/30/m4-max-chip-has-16-core-cpu-40-core-gpu-and-35-increase-in-memory-bandwidth/",
        "content": "",
        "created_utc": 1730301604.0,
        "subreddit_name": "gadgets",
        "comments": 68
    },
    {
        "title": "All of Apple’s Macs now start with 16GB of RAM | Macs with 8GB of RAM are a thing of the past.",
        "score": 699,
        "url": "https://www.theverge.com/2024/10/30/24270669/apple-macbook-pro-mac-mini-imac-16gb-ram-doubled-apple-intelligence-ai",
        "content": "",
        "created_utc": 1730307910.0,
        "subreddit_name": "technews",
        "comments": 121
    },
    {
        "title": "r/Stocks Daily Discussion Wednesday - Oct 30, 2024",
        "score": 13,
        "url": "https://www.reddit.com/r/stocks/comments/1gfiik1/rstocks_daily_discussion_wednesday_oct_30_2024/",
        "content": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1730280608.0,
        "subreddit_name": "stocks",
        "comments": 342
    },
    {
        "title": "Why SPY and QQQ over SPXL and TQQQ? (If holdning for longer than 2 years)",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gfkhqr/why_spy_and_qqq_over_spxl_and_tqqq_if_holdning/",
        "content": "Can I please get some experiences of the two different products and stories?\n\nIf the market goes further up than dowj, why should a leveredged multiplyer not be a good / better idea? \n\nI know both of the 3x products have additional yearly costs, but would the added gains not make up for it?\n\n",
        "created_utc": 1730288555.0,
        "subreddit_name": "investing",
        "comments": 16
    }
]