[
    {
        "title": "Apple removes most of Alex Jones’s podcasts from the Podcasts app",
        "score": 13619,
        "url": "https://www.buzzfeednews.com/article/johnpaczkowski/apple-is-removing-alex-jones-and-infowars-podcasts-from",
        "content": "",
        "created_utc": 1533525263.0,
        "subreddit_name": "apple",
        "comments": 917
    },
    {
        "title": "I built the Apollo Reddit client and I'm donating 100% of the proceeds today to our local SPCA animal shelter that's really low on food and supplies due to kitten season so your help would be AMAZING!",
        "score": 7568,
        "url": "https://www.reddit.com/r/apple/comments/953nqz/i_built_the_apollo_reddit_client_and_im_donating/",
        "content": "Hey! I'm that fella who built that [Apollo Reddit client](https://itunes.apple.com/app/id979274575) (well I still build it but you know) and long story short our local animal shelter (SPCA, basically Canadian version of the American ASPCA) is knee-deep in kittens because of kitten season (basically cats breed a lot when it's warm out) and it's really putting a strain on their resources and [they're really low on food](https://www.reddit.com/r/halifax/comments/94vbs9/ns_spca_says_rooms_are_overflowing_with_kittens/).\n\nThey're an awesome group non-profit, no-kill group and where I got my lovely kitty from so I wanted to make a donation to them and I figured the awesome Apple/Reddit community could help out too so I'm donating 100% of Apollo's proceeds today to the shelter.\n\nSo if you're at all interested in Apollo (it's a free to download Reddit app that's an alternative to the official one with some snazzy features and design) but held off on buying Pro (a few bucks and unlocks some extra features) today's an awesome day to do it! You'll get the extra features and it'll go toward feeding some hungry kitties and puppies! You can 100% also [donate directly](https://46189.thankyou4caring.org/sslpage.aspx?pid=298) or just give to your local shelter because they probably need the help too!\n\nIf you're awesome and already have Pro there's an optional \"Tip Jar\" in the Settings tab where you can leave an extra tip, and 100% of that is going to the shelters too!\n\nObligatory picture of the one I adopted (her name is Ruby): https://i.imgur.com/6qVtDgu.jpg\n\nSo… yeah! Would love your support toward a great cause if you can spare it! I'll post how much we raised tomorrow as well as a proof of donation! \n\nLet me know if you have any questions and my kitty thanks you.\n\nDownload link: https://itunes.apple.com/app/id979274575\n\nOh and I'm doing an AMA too if that's your thing! Post here or there and I'll do my best to answer! https://www.reddit.com/r/IAmA/comments/9533xn/i_build_the_apollo_reddit_app_an_alternative/\n\n\\- Christian\n\nEDIT: Thanks for the gold too I'll donate that as well. :P <3 ",
        "created_utc": 1533579037.0,
        "subreddit_name": "apple",
        "comments": 481
    }
]