[
    {
        "title": "JPMorgan is suing customers accused of theft in viral 'infinite money glitch'",
        "score": 603,
        "url": "https://www.reddit.com/r/stocks/comments/1ge82cr/jpmorgan_is_suing_customers_accused_of_theft_in/",
        "content": "JPMorgan Chase has begun suing customers who allegedly stole thousands of dollars from ATMs by taking advantage of a technical glitch that allowed them to withdraw funds before a check bounced.\n\nThe bank on Monday filed lawsuits in at least three federal courts, taking aim at some of the people who withdrew the highest amounts in the so-called infinite money glitch that went viral on TikTok and other social media platforms in late August.\n\nA Houston case involves a man who owes JPMorgan $290,939.47 after an unidentified accomplice deposited a counterfeit $335,000 check at an ATM, according to the bank.\n\n“On August 29, 2024, a masked man deposited a check in Defendant’s Chase bank account in the amount of $335,000,” the bank said in the Texas filing. “After the check was deposited, Defendant began withdrawing the vast majority of the ill-gotten funds.”\n\nJPMorgan, the biggest U.S. bank by assets, is investigating thousands of possible cases related to the “infinite money glitch,” though it hasn’t disclosed the scope of associated losses. Despite the waning use of paper checks as digital forms of payment gain popularity, they’re still a major avenue for fraud, resulting in $26.6 billion in losses globally last year, according to Nasdaq’s Global Financial Crime Report.\n\nThe infinite money glitch episode highlights the risk that social media can amplify vulnerabilities discovered at a financial institution. Videos began circulating in late August showing people celebrating the withdrawal of wads of cash from Chase ATMs shortly after bad checks were deposited.\n\nNormally, banks only make available a fraction of the value of a check until it clears, which takes several days. JPMorgan says it closed the loophole a few days after it was discovered.\n\nMiami and California\n\nThe other lawsuits filed Monday are in courts including Miami and the Central District of California, and involve cases where JPMorgan says customers owe the bank sums ranging from about $80,000 to $141,000.\n\nMost cases being examined by the bank are for far smaller amounts, according to people with knowledge of the situation who declined to be identified speaking about the internal investigation.\n\nIn each case, JPMorgan says its security team reached out to the alleged fraudster, but it hasn’t been repaid for the phony checks, in violation of the deposit agreement that customers sign when creating an account with the bank.\n\nJPMorgan is seeking the return of the stolen funds with interest and overdraft fees, as well as lawyers’ fees and, in some cases, punitive damages, according to the complaints.\n\nCriminal cases?\n\nThe lawsuits are likely to be just the start of a wave of litigation meant to force customers to repay their debts and signal broadly that the bank won’t tolerate fraud, according to the people familiar. JPMorgan prioritized cases with large dollar amounts and indications of possible ties to organized crime, they said.\n\nThe civil cases are separate from potential criminal investigations; JPMorgan says it has also referred cases to law enforcement officials across the country.\n\n“Fraud is a crime that impacts everyone and undermines trust in the banking system,” JPMorgan spokesman Drew Pusateri said in a statement to CNBC. “We’re pursuing these cases and actively cooperating with law enforcement to make sure if someone is committing fraud against Chase and its customers, they’re held accountable.”\n\nSource: https://www.cnbc.com/2024/10/28/jpmorgan-suing-customers-over-infinite-money-glitch.html",
        "created_utc": 1730136967.0,
        "subreddit_name": "stocks",
        "comments": 240
    },
    {
        "title": "Bloomberg’s estimates on the big four tech giants ",
        "score": 32,
        "url": "https://www.reddit.com/r/stocks/comments/1ge79db/bloombergs_estimates_on_the_big_four_tech_giants/",
        "content": "The big four tech giants are expected to spend a record $56 billion in total capital expenditures in the third quarter, according to the average estimate of analysts aggregated by Bloomberg. Much of that spending will go to NVIDIA and other AI-related device makers, with further increases expected in the coming quarters.\nAll signs point to continued strong AI-related spending. From chip device maker Asmax (ASML.US) to TSMC (TSM.US), AI has been a big part of this earnings season.\nThat backdrop has pushed NVIDIA shares higher, while Chief Executive Jen-Hsun Huang has assured that production of its new Blackwell chips is going well and demand is strong. NVIDIA is the biggest beneficiary of the big investment in artificial intelligence computing devices. The stock hit an all-time high last week and now has a market capitalization of about $3.5 trillion, slightly less than Apple (AAPL.US), which is still the world's most valuable company.\nTo be sure, there are concerns about the big tech companies' spending on artificial intelligence, as investors believe the billions of dollars these companies are investing are generating relatively little revenue. As such, this will be another focus of attention this week when these companies report earnings.\nYou have to walk the fine line of investing,“ said Paul Marino, chief revenue officer at Themes ETFs, ‘so that investors understand that you're ’not going too far”.\nNvidia's revenue is expected to more than double this year to $125.6 billion, according to the average forecast of analysts compiled by Bloomberg. Next year, the chipmaker's fiscal year 2026, sales are expected to grow 44 percent to $181 billion.\nOf course, there are other companies benefiting from high AI spending, including Broadcom, Ultra Micro Computer and Dell Technologies.",
        "created_utc": 1730135004.0,
        "subreddit_name": "stocks",
        "comments": 20
    }
]