[
    {
        "title": "This Time is Different (2001-2003 v. 2008 v. 2022)",
        "score": 1500,
        "url": "https://www.reddit.com/r/investing/comments/vekcxs/this_time_is_different_20012003_v_2008_v_2022/",
        "content": "I don't know how many of you are old enough to remember the Tech Bubble or The Great Recession, but I have been alive long enough to remember all of the major market corrections going back to 1973-74.  My contention is that this time is truly different.  Hear me out.\n\nDuring 2001-2003, while the overall equity markets were down each of the three years, there was still money to be made in commodities, fixed income, and precious metals.\n\nIn 2008, which is the worst market of all our lifetimes, one could make money in alternatives, fixed income (especially taxable income), and healthcare.\n\nEven in 1973-74, there was money to be made in T-Bills, T-Bonds, and real estate.\n\nThis year has been different. There is money to be made in commodities especially with energy.  The only other sector that has been profitable is agriculture.  What seems to make this different, is that the more traditional hedges against down markets such as fixed income and precious metals have been losers too. The last time we had a market that was down over -20% and the treasury bond index was negative was in 1931. It appears we are in new territory for many of us, including professionals. This is function of rising interest rates from historical lows and an uncertain future for the global economy.  Based on inflationary numbers, every country on this planet is feeling it.  \n\nHang in there folks. I won't say prepare for impact, but do prepare for a continued bumpy ride.",
        "created_utc": 1655484383.0,
        "subreddit_name": "investing",
        "comments": 457
    },
    {
        "title": "USB-C iPhone could become mandatory in the US as senators push for common charger law.",
        "score": 62557,
        "url": "https://9to5mac.com/2022/06/17/usb-c-iphone-united-states/",
        "content": "",
        "created_utc": 1655471832.0,
        "subreddit_name": "technology",
        "comments": 4299
    }
]