[
    {
        "title": "Intel to cut 15% of headcount, reports quarterly guidance miss ",
        "score": 1622,
        "url": "https://www.reddit.com/r/stocks/comments/1ehqdsk/intel_to_cut_15_of_headcount_reports_quarterly/",
        "content": "Intel shares slid 10% in extended trading on Thursday after the chipmaker said Thursday it would lay off over 15% of its employees as part of a $10 billion cost reduction plan and reported lighter results than analysts had envisioned. Intel also said it would not pay its dividend in the fourth quarter of 2024.\n\nHere’s how the company did, compared to LSEG analyst expectations:\n\nEarnings per share: 2 cents adjusted vs. 10 cents expected\nRevenue: $12.83 billion vs. $12.94 billion expected\nIntel’s revenue declined 1% year over year in the quarter, which ended on June 29, according to a statement. The company had a $1.61 billion net loss, or 38 cents per share, compared with net income of $1.47 billion, or 35 cents per share, in the year-ago quarter.\n\nThe company’s Client Computing Group that makes PC chips contributed $7.41 billion in revenue, up 9% and right around the $7.42 billion consensus among analysts surveyed by StreetAccount.\n\nIntel’s Data Center and Artificial Intelligence unit posted $3.05 billion in revenue. The result was down 3% and lower than the $3.14 billion StreetAccount consensus.\n\nFor the fiscal third quarter, Intel called for an adjusted net loss of 3 cents per share on $12.5 billion to $13.5 billion in revenue. The LSEG consensus was adjusted net earnings of 31 cents per share and $14.35 billion in revenue.\n\nDuring the quarter, Intel announced that Apollo would invest $11 billion in a joint venture around a chip manufacturing plant in Ireland. The company also introduced Xeon 6 server processors, along with a Gaudi 3 accelerator for artificial intelligence workloads.\n\nIn addition, Intel disclosed in May that the U.S. Commerce Department was revoking export licenses for consumer items to a customer in China, widely believed to be Huawei. Intel said second-quarter revenue would still be in its previously announced range of $12.5 billion to $13.5 billion, but below the middle of the range.\n\nExcluding the after-hours move, Intel stock has lost 42% of its value so far this year, while the S&P 500 index is up almost 14% in the same period.\n\nSource: https://www.cnbc.com/2024/08/01/intel-intc-q2-earnings-report-2024.html",
        "created_utc": 1722542844.0,
        "subreddit_name": "stocks",
        "comments": 572
    },
    {
        "title": "Apple sales rise 5%, topping estimates as iPad and Services revenue jump",
        "score": 484,
        "url": "https://www.reddit.com/r/stocks/comments/1ehr1f1/apple_sales_rise_5_topping_estimates_as_ipad_and/",
        "content": "Apple reported fiscal third-quarter earnings on Thursday that beat Wall Street expectations, with overall revenue rising 5%.  \n\nHere’s how Apple did versus LSEG consensus estimates for the quarter ended June 29: \n\nEPS: $1.40 vs. $1.35 estimated\n \nRevenue: $85.78 billion vs. $84.53 billion estimated \n\niPhone revenue: $39.30 billion vs. $38.81 billion estimated \n\nMac revenue: $7.01 billion vs. $7.02 billion estimated \n\niPad revenue: $7.16 billion vs. $6.61 billion estimated \n\nWearables, Home, and Accessories revenue: $8.10 billion vs. $7.79 billion estimated \n\nServices revenue: $24.21 billion vs. $24.01 billion estimated \n\nGross margin: 46.3% vs. 46.1% estimated \n\nApple did not provide formal guidance, although CEO Tim Cook and CFO Luca Maestri often share information about the current quarter on a call with analysts.  \n\nApple reported $21.44 billion in net income during the quarter, versus $19.88 billion in the year-ago period.  \n\nApple’s most important business remains the iPhone, which accounted for about 46% of the company’s total sales during the quarter. While Apple beat LSEG estimates, the product line still declined about 1% on an annual basis to $39.29 billion in revenue.  \n\n“On a constant currency basis, we grew year on year. And so that’s sort of how we look at it from an operational point of view,” Apple CEO Tim Cook told CNBC’s Steve Kovach.  \n\nCook said that while Apple doesn’t know about the positive sales impact from its newly announced Apple Intelligence service until it starts shipping to customers later this fall, he said that Apple had been increasing spending to get the service ready.  \n\n“What we’ve done is we’ve redeployed a lot of people on to AI that were working on other things,” Cook said. “From a data center point of view, as you know, we have a hybrid approach. So we both have our own and we partner with people. And so that capex would be in the partners’ financials, and we would be paying expense.” \n\n“Certainly embedded in our results this quarter is an increase year over year in the amount we’re spending for AI and Apple intelligence,” Cook continued.  \n\nApple showed strongest growth in its iPad division, which grew nearly 24% year-over-year to $7.16 billion in sales. Apple released new iPads during the quarter for the first time since 2022, which spurred a wave of upgrades. \n\nCook said that about half of iPad buyers haven’t owned one before, suggesting the tablet market is not yet saturated. \n\nApple’s Mac division reported $7 billion in sales, up about 2% from the year-ago quarter.  \n\nApple Watch sales, headphones such as Beats or AirPods, and HomePod home speakers are reported under “Wearables, Home, and Accessories.” Sales in the catch-all category declined 2% to $8.10 billion during the quarter.  \n\n“A whopping two thirds of the Apple Watch buyers were new to the product. So, we’re still growing that base significantly,” Cook said.  \n\nThe Services business is most important growth category for Apple and includes hardware warranties, revenue from Google, monthly cloud storage subscriptions, and the company’s content subscriptions, such as Apple TV+. The company reported $24.21 billion in Services sales, up 14% and in-line with Apple’s forecast and LSEG estimates. \n\nApple said in a statement that it had more active devices in each of its regions than it ever had before, without providing a specific number. Apple’s active device count is important because it signifies a group of existing Apple customers to which it can sell its profitable services. Apple said in February that it had 2.2 billion active devices.  \n\nApple said it had 1 billion paid subscriptions, which includes subscriptions to iPhone apps through Apple’s App Store.  \n\nHowever, Apple sales declined 6% to $14.72 billion in greater China, a region that also includes Taiwan and Hong Kong. Apple is under pressure in mainland China as local rivals such as Huawei introduce competing products.  \n\n“Mainland China and Greater China actually had a record in the iPhone install base,” Cook said. “Kantar tells us we had the top three selling smartphones in urban China and the results in China represent an acceleration from the first half of the year.” \n\nApple said it spent $32 billion on dividends and share repurchases during the quarter. \n\nSource: https://www.cnbc.com/2024/08/01/apple-aapl-earnings-report-q3-2024.html",
        "created_utc": 1722544422.0,
        "subreddit_name": "stocks",
        "comments": 99
    },
    {
        "title": "The old saying is \"Buy low, sell high\", what stock or industry is \"low\" right now that you feel is undervalued and is the time to buy?",
        "score": 362,
        "url": "https://www.reddit.com/r/stocks/comments/1ehprq7/the_old_saying_is_buy_low_sell_high_what_stock_or/",
        "content": "We all know Warren Buffet only buys undervalued companies, or ones that are discounted.  He likes big names too, so they need little marketing money as well.  Think of names like Apple, Bank of America, Amex, and CocaCola.\n\nSo what stock or industry do you think is \"low\" at the moment and is a time to buy to get the deal?",
        "created_utc": 1722541336.0,
        "subreddit_name": "stocks",
        "comments": 671
    },
    {
        "title": "CNBC: Meta’s advertising growth is proof that hefty AI spending is already paying off",
        "score": 264,
        "url": "https://www.reddit.com/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/",
        "content": "This is a pretty long article, but I think it is an important read since it answers the key question \"Is anyone making significant money from AI right now?\" Clearly the answer is yes for Meta. \n\nFor easier reading I tried to bold the parts the discuss AI specifically.\n\nSource: [CNBC](https://www.cnbc.com/2024/07/31/meta-advertising-growth-proof-that-hefty-ai-spending-is-paying-off.html)\n\nFor investors who are skeptical of Meta’s massive spending on artificial intelligence and whether it will pay off anytime soon, CEO Mark Zuckerberg is urging them to look to the present.\n\nAfter the company’s better-than-expected second-quarter earnings report on Wednesday, Zuckerberg and finance chief Susan Li rattled off all the ways that AI has helped the company grow faster than the competition in the digital advertising market, Meta’s core business.\n\n“The ways that it’s **improving recommendations and helping people find better content**, as well as making the advertising experiences more effective, I think **there’s a lot of upside there**,” Zuckerberg said on the earnings call. “Those are already **products that are at scale**. The AI work that we’re doing is going to improve that.”\n\nMeta reported revenue growth of **22% from a year earlier to $39.07 billion**, with 98% of its sales coming from advertising, primarily on Facebook and Instagram. Its growth rate was double that of Google’s ad business, which saw sales increase 11% to $64.6 billion, Alphabet\n said in its earnings report last week.\n\nMeanwhile, Pinterest and Spotify, which are both significantly smaller than Meta, reported revenue growth of 21% and 20%, respectively, in their latest reports.\n\nAs in previous quarters, Li said Meta’s advertising business benefited from online commerce, gaming and the media and entertainment sectors, and that ad growth continued to be strongest in the Asia-Pacific region. She said the company’s “improved ad performance” helped lift overall ad prices despite slowing growth in that region.\n\nZuckerberg pointed to **AI as the foundation behind Meta’s refreshed online advertising platform**, which was battered after Apple introduced an iOS privacy update in 2021 that made it harder for social media companies to target users across the Internet.\n\n“They rebuilt their ad tech stack using AI and they changed their user interface and **generated a lot more user engagement because of AI**,” said Mark Mahaney, internet analyst at Evercore ISI, in an interview on CNBC’s “Closing Bell: Overtime” on Wednesday. “It’s **showing up in the revenue and the profits now**,” said Mahaney, who recommends buying Meta shares.\n\nMeta shares popped 7% in extended trading after Wednesday’s earnings report, which included an uplifting forecast for the current quarter.\n\nLike the other mega-cap tech companies, Meta is **spending billions of dollars** on Nvidia’s graphics processing units (GPUs), which are needed to train AI models and run hefty workloads. Some industry experts have questioned the outlays because so much of the investment is tied to expectations that generative AI — popularized by OpenAI’s ChatGPT — will lead to big revenue gains in the future.\n\n‘Already seen a return’ Meta is showing that, while the bet is on major growth down the road, the company is **reaping rewards today**.\n\n“You’ve already seen a return with Meta over the last two years,” Mahaney said.\n\nAngelo Zino, an analyst at CFRA Research, agreed with Mahaney, telling CNBC that Meta has “really navigated some of the concerns and the storms” from a couple years ago and is “**clearly integrating AI across their ecosystem extremely nicely**.”\n\nZino noted that Meta’s growth rates are “**nicely outpacing those of its peers**.”\n\n**Meta isn’t finished spending big money on AI** and the far-flung metaverse, which continues to lose billions of dollars each quarter. Li said that Meta expects “**significant CapEx growth in 2025 as we invest to support our AI research** and our product development efforts.”\n\nFor 2024, Meta said it now expects capital expenditures in the range of **$37 billion to $40 billion, lifting the low end of that range, which had been $35 billion**.\n\nLi says investors should think of Meta’s AI strategy as a two-pronged approach, with “core AI” helping Meta improve its advertising platform and recommendation system, thus leading to more user engagement and ad performance that “have translated into revenue gains.”\n\nGenerative AI is a longer-term bet. Li said that the company doesn’t “expect our Gen AI products to be a meaningful driver of revenue in ’24, but we do expect that they’re going to **open up new revenue opportunities over time** that will enable us to generate a solid return off of our investment.”",
        "created_utc": 1722487975.0,
        "subreddit_name": "stocks",
        "comments": 100
    },
    {
        "title": "Apple reports third quarter results",
        "score": 1214,
        "url": "https://www.apple.com/newsroom/2024/08/apple-reports-third-quarter-results/",
        "content": "",
        "created_utc": 1722544433.0,
        "subreddit_name": "apple",
        "comments": 240
    },
    {
        "title": "Google Maps and Waze Updated With New iPhone and CarPlay Features",
        "score": 1106,
        "url": "https://www.macrumors.com/2024/08/01/google-maps-waze-new-carplay-features/",
        "content": "",
        "created_utc": 1722523476.0,
        "subreddit_name": "apple",
        "comments": 231
    },
    {
        "title": "iPhone 16 Pro White, Gray, and Dark Black Colors Shown in New Image",
        "score": 639,
        "url": "https://www.macrumors.com/2024/08/01/iphone-16-pro-colors-shown-leaked-image/",
        "content": "",
        "created_utc": 1722523395.0,
        "subreddit_name": "apple",
        "comments": 344
    },
    {
        "title": "$0.5M goal reached",
        "score": 6446,
        "url": "https://i.redd.it/ukief8shoyfd1.jpeg",
        "content": "Started with $60k got up to $190k with tsla puts during the April downturn. But then proceeded to lose a good chunk ending with $37k towards end of May. Say fukc it and Yolo the remaining $37k on nvda calls before q1 earnings. Made back what was lost and some. Turned the gains into 1k tsla shares. Bought more tsla puts for q2 earnings. Cashed out big. Now holding a sh!tload of tsla calls and nvda calls. Next goal to turn the calls into 1.5k nvda shares and another 500 tsla shares. Goal is to hit $1M EOY. Just lots of luck and good timing.",
        "created_utc": 1722478353.0,
        "subreddit_name": "wallstreetbets",
        "comments": 784
    },
    {
        "title": "Apple reports third quarter results",
        "score": 15,
        "url": "https://www.stocktitan.net/news/AAPL/apple-reports-third-quarter-ifixgl4ly0gc.html",
        "content": "",
        "created_utc": 1722544208.0,
        "subreddit_name": "AAPL",
        "comments": 5
    },
    {
        "title": "Updates For Getting Payment in Apple $500M Investor Settlement",
        "score": 12,
        "url": "https://www.reddit.com/r/AAPL/comments/1ehowoq/updates_for_getting_payment_in_apple_500m/",
        "content": "Hey guys, maybe you know about this, but Siri is getting a glow up. Apple just launched an update (only for developers tho) and soon we´ll see a new “Apple Intelligence” in all our devices. If everything goes well, this will be available this fall.\n\n\n\nIn other Apple news, if you were paying attention back in 2018, Tim Cook, our famous CEO said that though Apple had sales problems in a few countries with high inflation rate (like Brazil and Russia), there were no such problems for China. But then, just a few days later, Apple decided to cut production and requested it from the suppliers, so I think it was obviously otherwise.\n\n\n\nAnd just two months later, Apple shocked everyone with its first announcement about the revenue cut since the iPhone establishment in 2007, causing AAPL to drop by 10% and resulting in 70B losses.\n\n\n\nThis led to several big scandals and lawsuits based on Cook's comments, but Apple denied that they had any wrongdoing in this case (and they continue to deny it to this day).\n\n\n\nSo, at this point, this whole story is going to an end because recently, Apple decided to pay $490M to investors due to the situation (even before the court hearing), so if you were one of those damaged investors, you can[ check it out](https://11thestate.com/cases/apple-investor-settlement).\n\n\n\nHowever, does that half a billion even come close to covering the $70 billion loss? Especially with all the drama Apple's dealing with in China?\n\n",
        "created_utc": 1722539173.0,
        "subreddit_name": "AAPL",
        "comments": 9
    },
    {
        "title": "Apple Earnings Call",
        "score": 7,
        "url": "https://www.apple.com/investor/earnings-call/",
        "content": "https://www.apple.com/investor/earnings-call/",
        "created_utc": 1722546455.0,
        "subreddit_name": "AAPL",
        "comments": 0
    },
    {
        "title": "New trade AAPL Aug09 $230 calls 09:17am 08/01/24",
        "score": 3,
        "url": "https://i.redd.it/azguy3wyv2gd1.jpeg",
        "content": "",
        "created_utc": 1722529295.0,
        "subreddit_name": "AAPL",
        "comments": 9
    }
]