[
    {
        "title": "Google announces Bard A.I. in response to ChatGPT",
        "score": 1687,
        "url": "https://www.reddit.com/r/stocks/comments/10vikbb/google_announces_bard_ai_in_response_to_chatgpt/",
        "content": "https://www.cnbc.com/2023/02/06/google-announces-bard-ai-in-response-to-chatgpt.html\n\nGoogle blog post: https://blog.google/technology/ai/bard-google-ai-search-updates/\n\nGoogle on Monday announced an artificial intelligence chatbot technology called Bard that the company will begin rolling out in the coming weeks. The announcement confirms CNBC’s prior reporting. Bard will compete directly with rival ChatGPT, an AI service created by OpenAI.\n\nBard is powered by the company’s large language model LaMDA, or Language Model for Dialogue Applications. Google will open up the conversation technology to “trusted testers” ahead of making it more widely available to the public, the company said in a blog post Monday.\n\nLast week, CNBC reported that Google is testing some of these features with employees as part of a “code red” plan to respond to ChatGPT, the popular chatbot backed in part by Microsoft. Features included a chatbot called “Apprentice Bard,” as well as new search desktop designs that could be used in a question-and-answer format.\n\n“Soon, you’ll see AI-powered features in Search that distill complex information and multiple perspectives into easy-to-digest formats, so you can quickly understand the big picture and learn more from the web: whether that’s seeking out additional perspectives, like blogs from people who play both piano and guitar, or going deeper on a related topic, like steps to get started as a beginner,” wrote CEO Sundar Pichai.\n\nThe company gave an example of using Bard to simplify complex topics, like explaining new discoveries from NASA’s James Webb Space Telescope to a 9-year-old.\n\nThe product tests come after a recent all-hands meeting where employees raised concerns about the company’s competitive edge in AI, given the sudden popularity of ChatGPT.\n\nCNBC reported that Google’s AI chief, Jeff Dean, told employees at the time that the company has much more “reputational risk” in providing wrong information and thus is moving “more conservatively than a small startup.” However, he and Pichai teased at the time that Google may launch similar products to the public sometime this year.\n\nGoogle’s prime business is web search, and the company has long touted itself as a pioneer in AI. Leaders have been asking more employees for feedback on the efforts in recent weeks.\n\nThe company emphasized Monday that it will need rigorous testing, saying “we’ll combine external feedback with our own internal testing to make sure Bard’s responses meet a high bar for quality, safety and groundedness in real-world information.”",
        "created_utc": 1675718450.0,
        "subreddit_name": "stocks",
        "comments": 461
    }
]