[
    {
        "title": "Elon Musk backtracks on Supercharger network halt, says more chargers coming",
        "score": 379,
        "url": "https://www.reddit.com/r/stocks/comments/1covdpg/elon_musk_backtracks_on_supercharger_network_halt/",
        "content": "Last week Tesla's CEO fired nearly the entire 500-member Supercharger team. Tesla's partners are demanding answers, with competitors waiting in the wings.\n\nLeave it to Tesla CEO Elon Musk to add more chaos to a situation that he ostensibly created in the first place.\n\nIn a tweet on X early Friday morning, Musk addressed concerns many have had over his recent move to shrink down Tesla’s (TSLA) Supercharger team.\n\n“Just to reiterate: Tesla will spend well over $500M expanding our Supercharger network to create thousands of NEW chargers this year,” Musk wrote. “That’s just on new sites and expansions, not counting operations costs, which are much higher.”\n\nShortly thereafter, Musk also started a “Supercharger Community” on X, where members can discuss and share stories on the topic.\n\nWhether Musk’s proclamation that Tesla is still heavily investing in the Supercharger is accurate or not is another story, but the industry, investors, and EV owners are seeking clarity and demanding answers.\n\nLast week Musk and Tesla laid off nearly the entire Supercharger organization, which was responsible for the build-out of its best-in-class charging network. In the aftermath of the initial layoffs, Musk addressed the Supercharger news on X, stating that the network will grow at “a slower pace” for new locations.\n\nAutomakers like GM, Ford, Kia, Polestar, Stellantis, Honda, and others had signed up to access the Supercharger network, and incorporate Tesla’s NACS plug inlet in their future vehicles, under the promise that the Supercharger network would continue to grow at a steady pace.\n\nTesla was likely getting an earful from its NACS partners, questioning what they were getting exactly after signing deals to access the Supercharger network.\n\nIn addition, contractors and others working with Tesla on existing Supercharger projects were getting their emails bounced back with no feedback on what to do next. Tesla also apparently backed out of leases at four upcoming Supercharger sites in New York, per EV blog Electrek.\n\nCharging network provider EVgo told Yahoo Finance that it was “actively engaged” in the development of the NACS network and was adding more locations to take advantage of Tesla’s move to backtrack its expansion.\n\nEVgo competitor Blink Charging is also poised to move on the opportunity, claiming potential Supercharger customers contacted Blink about future orders in the wake of Tesla’s move.\n\nEven oil and gas stalwarts like BP are moving in on Tesla. With its BP Pulse charging network, the company said it “is aggressively looking to acquire real estate to scale our network, which is a heightened focus following the recent Tesla announcement.”\n\nThe company’s top executive is even telling Tesla’s jilted partners to give him a ring.\n\n“If there are stranded real estate partners who are looking for someone to call, they should feel free to pick up the phone and call me or look me up on LinkedIn,” BP Pulse Americas CEO Sujay Sharma told Bloomberg.\n\nSource: https://finance.yahoo.com/news/elon-musk-backtracks-on-supercharger-network-halt-says-more-chargers-coming-170947263.html",
        "created_utc": 1715362854.0,
        "subreddit_name": "stocks",
        "comments": 115
    },
    {
        "title": "Real Estate vs. The Market - An answer to all those touting real estate as the way out there",
        "score": 40,
        "url": "https://www.reddit.com/r/investing/comments/1cow4e0/real_estate_vs_the_market_an_answer_to_all_those/",
        "content": "Real estate has often been touted as one of the most accessible ways to grow real wealth. Who among us ambitious haven’t heard the platitudinous claims passed off as conventional wisdom or perhaps as an arcane right of passage into occult upper echelons of society?\n\n*“Real estate makes more millionaires than any other industry.”*\n\nWe have heard it in forums, self-help books, and from passing snake oil peddlers trying to get you to sign up for their educational seminar so you too can get rich.\n\nAs an engineer fortunate enough to not be living pay check to pay check as many Americans do, I also found this promise alluring. After all the basic principle that you can own a second home and collect a sizable and secure supplemental income certainly seems like a good deal at first approximation and so when me and my wife moved out of our first home for new jobs, we decided to keep it as a rental property rather than sell it.\n\nWe had purchased the property for only $130,000 dollars in 2017 and after living there for about five years the value had doubled. It was also located in an above average area of growth in South Carolina that had seen explosive growth going from Hicksville, USA to having two Starbucks by the time we moved out (of course the number of Starbucks is the proper measure of affluence). We were able to rent the house out with ease for two years for $1,800 a month while all of the recurring costs amounted to only $1,000 a month.\n\nIndeed on paper it was an excellent investment. But when a difficult tenant started to stress us out we began to wonder if having a rental was worth all the hype in comparison to less stressful alternative investments.\n\nSo I decided that rather than scouring the internet for advice from likely unqualified faceless charlatans, I would conduct my own analysis of owning a rental home vs. simply investing in the stock market. After all, at one point in the not so distant past relying on your own mind rather than the top 10 Google search results to reach your own conclusions was considered desirable.\n\n# The Calculation\n\nMy methodology was to calculate the total net benefit over the next 22 years (the time until the house would be paid off) in today’s dollars of keeping the rental vs. the total net benefit in today’s dollars of selling it and investing the proceeds in an index fund for 22 years and compare the two results. Although seemingly simple, the reality is that the financials of rentals are convoluted and comparing them to neat investments is *actually kind of difficult.* There are a lot of assumptions and extrapolations that must be made about both benefits and expenses.\n\nThe total net benefit for market investing was actually pretty simple. I estimated that the total proceeds from a sale after everything was said and done would be $100,000. So simply applied compounding interest to calculate the value I’d have in 22 years.\n\nFor this I assumed the historical average market return of 10% (7% accounting for inflation) as well as a few other higher returns to see how I would fare if things went well.\n\nBecause I will not be retired in 22 years and this money would be growing in a traditional taxed brokerage account, I made the assumption that if I wanted to derive regular income from the final capital I would have to sell everything and take the fat 15% long-term capital gains tax in order to move the money from an index fund into a high yield fund providing a yield of 5%. I then further assumed that as income I would have to pay 29% of those earnings in federal and state taxes. This yielded the total income I could expect in my pocket every month after investing for 22 years.\n\nTotal derived benefit and possible income for investing $100,000 in index funds after 22 years.\n\nThe calculation for the house was much more tenuous, but as I mentioned earlier, you do have to make some big assumptions to make a comprehensive assessment of the total net benefit of renting a house for 22 years. I started by calculating the **total positive factors**:\n\n**Total rent —** Assuming that I will increase rent at 3% to keep up with inflation, I assumed an average rent value for a total present day value of all collected rents over 22 years of $468,600. I then adjusted this value for an assumed vacancy rate of 8% to yield **$431,112 (A)**.\n\n**Appreciation** — Of course one of the benefits of real estate is that it generally appreciates at a rate that is commensurate with the desirability of the location. Before things exploded circa 2022 and houses got crazy expensive, the rate of appreciation in my area was just under 5%. This is a good bit better than the historical national average of 3.5%. Since it is a higher growth area in South Carolina where I’ll used the higher number. At 5% appreciation (2% after accounting for inflation) I can expect the house value to grow from the present value of $250,000 to about $386,494 or an increase of **$136,494 (B)** in today’s dollars.\n\nAlthough there are *many* other potential benefits of renting a house, at the basic level, the benefits are from rent and appreciation. So the total gross benefit can be calculated simply by adding **A+B** for a total of **$567,606.**\n\nHowever, the story doesn’t stop there. There are also negatives or *expenses* associated with owning a rental property. The **total negative factors** were calculated as:\n\n**Capital gains tax on sale-** It turns out that when you sell your house after many years of appreciation you have to pay long-term capital gains tax on the profit. *There actually are ways around this* but as we will discuss later they probably are pretty useless to the average one-off real estate investor. So since I paid $130,000 for the house and expect it to be worth $386,494 when I ultimately sell it 22 years from now, the net profit is $256,494 which is taxed at 15% costing **$38,474 (A)**.\n\n**Depreciation recapture tax-** When you rent out a house you get to depreciate it’s value every year like any other large capital assett in a business. This means you can kind of say you “lost” a certain amount of value every year from use. That depreciation ultimately helps lower your taxes every year and so it is a benefit….kind of.\n\nWhen the time comes to sell your house, you actually have to pay the government back for all the asset depreciation you claimed. You could try to figure this out yourself, but I just used an online calculator and figured that I would have to pay about **$31,200 (B)** in depreciation recapture tax.\n\n**Sales cost —** There are also significant costs associated with actually selling your house. Things like real estate agent commissions and repairs can really add up. Based on some internet research I saw that 8% is a reasonable number for sales cost. It could be more if there are many repairs needed. At 8% it would cost **$30,920 (C)** to sell a house for $386,494.\n\nThe total **future expenses at time of sale** can be calculated as **A+B+C** or $100,594. However, this is in 2046 dollars (22 years from 2024). This has to be adjusted to be in present 2024 dollars for the purpose of comparison. The adjusted number in 2024 dollars works out to **$58,432 (D)**.\n\n**Maintenance —** There are also repairs to consider. Any repairs that are not covered by the rent payments come out of your pocket. There are a lot of assumptions that you have to make here. I was actually pretty light on repairs assuming that the tenant wouldn’t trash the place and that only predictable things would need to get done. This included things like replacing the roof once, changing the carpet out three times in 22 years, and painting the place several times, and replacing the wooden privacy fence once. I also made the assumption that most of the repairs would be sooner rather than later. I browsed the internet to get estimated repair costs and life expectancy numbers. For 22 years I estimated **$75,000 (E)** (in today’s dollars). Honestly, I think this number is very light and could easily see it being twice that.\n\nSo everything said and done, the total gross expense in present money can be found by adding **D** and **E** for a **total of $133,432.**\n\nThe **total net benefit** can *finally* be calculated by subtracting the total expenses from the total benefits, or **$434,174** ($567,606 — $133,432 )**.**\n\nWhen we compare this with the estimated stock market returns, we see that it is on par with the 11% return (8% after inflation) which is slightly better than the more conservative 7% often quoted. So at that it looks like real estate wins! … however there is still more to consider.\n\n# Other Considerations\n\nRemember why I started looking at this in the first place? I said that having a rental property was beginning to stress me out. Even with a property management company “running things” the reality is that it is impossible for them to take care of your property the way you would want to. They aren’t there day in and day out noticing the slow degradation of condition. Yes, they will catch the big things and hopefully boot tenants that are trashing the place, but the insidious decay will be left un-noticed until it becomes a big enough problem.\n\nFor me, being emotionally attached to the house, I find this to be *incredibly stressful.* It is fair to say that not everyone feels that way about their properties, some are able to treat them strictly as business assets that require repair when they stop working. However, you really can’t discount the psychological affects of dealing with someone who doesn’t care about your home the way you do.\n\nSo now we are talking about 22 years of stress. That is 22 years of worrying if you are going to go in to sell the place and find that the house should be condemned and repairs would take a tremendous chunk out of what you expected (possible A LOT more than that $75k we estimated). That is 22 years of stress dealing with tenants and having to watch their ridiculous and rude maintenance tickets come through your email where they call you a “slum lord” and tell you that the carpet looks like someone “took a shit on it” (mind you *this* is who is living in the house you once loved).\n\n*Is it still worth the difference?*\n\nThat is a personal determination that everyone in this situation must make on their own. In my case, I am leaning towards ‘no.’\n\n*But why does everyone make a bid deal out of real estate? If the actual returns are comparable to the market, why is it so special?*\n\nNow *that* is the question, and I think that we are ready to answer it given the context of the above analysis.\n\nIf the total net benefit really is comparable to the market then why in the hell would anyone want to dabble in real estate let alone claim it is *“the way?”*\n\nI am hardly the Supreme Overlord Barron Lord Admiral of real estate investing, but I know enough to tell you that the reasons have to do with those secondary benefits we deferred from earlier.\n\nThe primary benefit of real estate is *leverage.* Leverage is the idea that you can own a house using primarily someone else’s money (i.e., the bank’s through a mortgage). This means you get the full benefit of owning a house and renting it (full appreciation, equity, and rent proceeds) with minimal investment of your own. You are taking out a loan to buy an asset and having someone else pay for it. Leverage is possible for stock investing, but houses are much more secure investments and banks realize this and so the rates and terms are much more reasonable than taking out a loan to buy stocks. So why would you ever want to give that up?\n\nThe reality is that you are only leveraged while you are …. well, leveraged. As your equity in the house increases (either by paying down the mortgage or through appreciation) you become less leveraged. That is to say that magical benefit of real estate decreases with the less you owe.\n\nLook at it this way. Say you only owe the bank one more dollar on your mortgage; while you still don’t own the house outright, you have nearly 100% equity. That equity is effectively *your money* (not the bank’s) that can be applied to anything and thus it carries an opportunity cost. That is, you have to compare what it is doing for you tied up in the house to what you could get from the market or other investments. If the situation were flipped and you only had one dollar of equity, it is a **much** better deal… you couldn’t do much else with that single dollar. *The more equity you have in your house, the less leveraged it is, and the more it acts like a traditional stock.*\n\nWhat you’ll find, is that houses perform very much like high dividend, low growth stocks. That is, they provide good income, but appreciate less than the market. When we do the comparison (as we did above) it really does come out as more of a wash than many burgeoning real estate investors might think.\n\nThere are other benefits to owning a home. For example, it is real and has an intrinsic value; when the next great depression happens, people will still need a place to live. Plus, since mortgages don’t change with time (that is they get cheaper with time due to inflation) *you* could live there during difficult times, probably for much less than your current rent or mortgage.\n\nAlthough these are secondary considerations, there are also creative financial mechanisms available for homes. For example, home equity loans or lines of credit can give you a better rate when you need money compared to a private loan. There are also mechanisms to avoid having to pay taxes on your gains (possibly until you die) such as 1031 exchanges, however these are very complicated and are really only designed for real estate investors to turn one property into another. They are nearly useless for the average Joe with maybe one rental (big surprise).\n\nWe also hear a lot about the tax benefits of owning rental property. What are those? Well you can claim depreciation. Depreciation is the government’s way of acknowledging that large capital business assets (think a large factory machine) lose value over time as they are used. So you are generally allowed to claim back the full purchase price of your home over the course of 30 years which helps to offset taxes on the rental income. However, you *do have to pay it all back* when you sell the house in a process called depreciation recapture tax. So maybe it isn’t that much of a benefit after all….the real benefit is that since you pay it back later it is worth less due to inflation. Not a huge benefit… You can also claim business operating expenses to also help offset your rental income (think new roof, new windows, repairs, project management fees etc.).\n\nSo now seeing the whole picture it is obvious that there are *some* benefits to owning a rental home over investing in the stock market. However, they may not be what you thought. Let’s recap:\n\n* **The total net benefit from renting a house, vs. investing in the market is likely comparable.**\n* **Renting a house is much more stressful (even with a management company) than investing in the stock market. You have to have the right kind of personality to not be affected by people trashing your place, being rude to you, and, if this was a home you lived in, the steady decay of a home you once loved (because no, management companies do not maintain houses like you did when you lived there). There is also (i’d argue) a lot more variability in how you’ll fare with real estate (assumptions about vacancy rate, long-term repairs, etc.)**\n* **The primary benefit of owning rentals is the ability to leverage into a stable investment on favorable terms. The more of your house you own, the more they perform like traditional stocks and the less argument there is for keeping it due to the opportunity cost of your tied up equity.**\n* **There are some secondary benefits, pertaining to taxes, the actual utility of the home, and some creative financing opportunities.**\n\n**So in conclusion:** what does this mean? It means in an apple to apple comparison houses are good investments that rival stock markets but they are much more stressful. However, with leverage being the primary benefit *there is* a real advantage here if you are willing to maximize your leverage in the real estate market.\n\nIf you are going to have one house and pay it off and keep it for income, I’d advise you to consider other options if it is stressing you out as (1) it won’t make you rich and (2) it may not be better than the markets. **However,** if you are going to go big and leverage leverage (no not a typo) there is a possibility to do well.\n\nSo what does that mean? Money is made in real estate at the front end by making good investments and using (and I mean USING leverage). If you are willing to maximize your credit and home equity usage as much as possible to buy more and more houses putting as little of your own money into each one as possible and you are willing to have a part or full-time job dealing with managing them all and it won’t stress you out, it is **a** path to wealth. Of course, you could also do well just dropping that $100k into the S&P 500 and call it a day.",
        "created_utc": 1715364787.0,
        "subreddit_name": "investing",
        "comments": 55
    },
    {
        "title": "Incredible Apple M4 benchmarks suggest it is the new single-core performance champ, beating Intel's Core i9-14900KS",
        "score": 2458,
        "url": "https://www.tomshardware.com/pc-components/cpus/apple-m4-scores-suggest-it-is-the-new-single-core-performance-champ-beating-intels-core-i9-14900ks-incredible-results-of-3800-posted",
        "content": "",
        "created_utc": 1715347234.0,
        "subreddit_name": "apple",
        "comments": 484
    },
    {
        "title": "Apple’s “Let Loose” iPad Event was Shot on iPhone — With Panavision Lenses",
        "score": 722,
        "url": "https://prolost.com/blog/panavision-iphone",
        "content": "",
        "created_utc": 1715337819.0,
        "subreddit_name": "apple",
        "comments": 125
    },
    {
        "title": "I'm a full time trader and this is everything I'm watching and analysing in premarket 10/05. SPX above 5200. Including all the earnings reports. ",
        "score": 66,
        "url": "https://www.reddit.com/r/Daytrading/comments/1conbxl/im_a_full_time_trader_and_this_is_everything_im/",
        "content": "ANALYSIS:\n\n* GOLD\n* **Gold positioning remains and looks bullish. 2400 calls and 2475 calls are the main option contracts being bought right now. Tells us traders expect gold to go higher.** \n* OIL\n* **we have seen oil reverse higher, although not with any real velocity. Skew still points higher right now, as traders are looking for 85-86 on brent, or above 80 on WTI.**\n* Silver:\n* **silver positioning looks bullish following Gold after yesterdays jobless numbers. We probably hit a new 52 week high on SLV soon.**\n* GER40:\n* **Call delta overwhelmingly bullish. 19k is the wall, and probably the target right now. Put delta there will likely stop an upside break of 19k**\n* **Overall market:**\n* **Bullish positioning indeed.** SPX level of 5200 will now act as a support, where it ws a resistance. QQQ level of 440 will act as a support, and below that 18k on Nasdaq. \n* Dow Jones momentum continues, traders targeting 40k.  VIX low and traders remain short on it, jobs numbers yesterday supported rate cut sentiment, so overall positioning v bullish. \n\nDATA LEDE:\n\n* UK GDP Growth Rate (Q1) \n* GDP comes out at 0.7% YOY for March, vs 0.3% expected. Highest YOY reading since September. \n* GDP 3 month average comes out at 0.6% vs 0.4% expected\n* GDP MOM comes 0.4% vs 0.1% expected. Highest since June last year. \n* SO UK GDP GROWTH COMES BETTER THAN EXPECTED, HENCE GBP JUMPS. \n* Fed Bowman Speech  \n* ECB Meeting minutes \n* US consumer Sentiment numbers - 5 year and 1 year inflation expectation numbers. \n* Fed Goolsbee Speech  \n* Fed Barr Speech  \n\nMARKET:\n\n* Markets generally continue trend of being higher after jobless numbers come soft yesterday.\n* SPX Trading at 5232, now above 5200. 5200 will now act as a strong support. It will be looking to get to ATH again. \n* Nasdaq: Trading at 18,200. Strong resistance just above 18300. Strong support at 18k-17.95k. \n* DJI: trading at 39,500. Targeting ATH, at 40k again. \n* GER40: Trading above 18,800. Very calm. Will be targeting 19k.\n* UK100: 8,450. Moving higher since yesterday after dovish BOE. Yesterday was trading at 8350 so has jumped 100 points since. \n* HKG50: Trading at 19k. Up 2%. Hang Seng market was higher after authorities said they were contemplating a plan to exclude private investors from paying taxes on income earned from HK equities, purchased through Stock Connect. \n* GOLD - higher by 1.1%\n* Oil slightly higher today. \n\nFX:\n\n* USDJPY higher to 156. \n* Dollar slightly higher today, paring some of its losses following jobless claims numbers yesterday. \n* GBP is higher after GDP numbers come strong in UK\n* Euro tracks GBP slightly higher. \n* Yen is lower again as weakness in Yen persists after failed intervention. \n\nEARNINGS:\n\nMARA\n\n* GOOD EARNINGS . Killed hash rate target, many acquisitions \n* EPS of 1.26 Beat estimates of 0.21. DESTROYED ESTIMATES by 600%.\n* It was up 100% Sequentially\n* Revenue was 165.2M, missed by 9%. Still up by 6% seuqneitally and 300% YOY\n* Main metrics:\n* Produced 2,811 BTC during Q1 2024, which was up 28% YOY\n* Adjusted EBITDA was 528.8M, up by double vs last quarter, and up 4x vs last year\n* Mining capacity v high\n* RAISED THEIR OUTLOOK FOR HASH RATE TARGET FOR 2024. Raised to 50EH/s from 35-37 EH/s\n* Operational Highlights: Closed Multiple acquisitions of data centres to expand mining operations\n* Our strategic acquisitions and the robust expansion of our mining operations have sibginfiactly boosted capacity and efficiency, leading to outstanding financial performance this q. \n* Good earnings. \n\nU - EPS not great, revenue guidance missed the mark. \n\n* EPS of -0.75 vs estimate of 0.17. So big miss on EPS. Notched a surprise loss vs expected profit\n* Revenue was down 8% YOY, came in at 460M, which was ahead of expectations by 6%\n* Segment breakdown:\n* Strategic Portfolio Revenue was 426M, beat estimates by 2% at midpoint. Up 2% YOY\n* Create solutions Revenue was 133M, up 17% YOY\n* Grow solutions revenue was 294M, down 4% YOY\n* Non strategic portfolio revenue was 34M, down 59% YOY\n* GAAP net loss of 291M includes 212M restructuring cost\n* CEO transition, Matt Bromberg joining as CEO effective May 15. \n* Focus will be on integrating engine, cloud, monetisation and aura to enhance value\n* Expansion in real time 3d capabilities across various industries, including automotive and e com\n* Strategic partnerships with Mazda and Gucci\n* Enhanced AI capabilities with Unity Muse\n* Expects: \n* Growth from new game subscriptions, multiplayer expansions, and greater use of their real time 3d techs in diverse industries. \n* Move into Mixed reality, using devices like Apple Vision pro and Meta quest. \n* NEXT QUARTER GUIDANCE\n* Strategic revenue expected missed by 4.4%, down 6.5% YOY\n* Adjusted EBITDA expected to be 75m-80M\n* FY 2024 Guidance:\n* Strategic Revenue missed by 1.7%\n* SO GUIDANCE MISSED THE MARK \n\nARRY - PUMPING AFTER POSITNG A SURPRISE PROFIT\n\n* EPS of 0.06 beat by 0.08. So was expected to record a loss, but turned in a surprise profit\n* Revenue of 153M was down 59% YOY, missed slightly\n* Adjusted gross margin of 38.3%\n* Reaffirmed full year guidance\n* Expects Revenue to be in range of 1.25-1.4B\n* EBITDA to be 285-315M\n* Thats reaffirmed last quarters guidance\n* Commentary:\n* They started off strong as the momentum observed in Q4 continued into new year. \n* Continued strong global demand for our products and services\n* Revenue of 153M, which was slightly ahead of expectations. \n* Record gross margin \n\nAKAM\n\n* Down on cut on full year guidance. GUidance for next quarter and full year missed the mark entirely. MISSED ESTIMATES BY AROUND 6%\n* CURRENT RESULTS: \n* EPS of 1.64 vs estimate of 1.61 (beat by 1.8%)\n* Revenue of 987M, more or less in line. \n* GAAP income was up 81% YOY\n* Security revenue was up 21% YOY\n* Compute revenue was up 25% YOY\n* Delivery revenue was DOWN 11% YOY\n* Cash from operations was 36% of revenue, which is healthy \n* GUIDANCE:\n* Q2 2024 \n* EPS of 1.51-1.56 missed by 6% at midpoint\n* Revenue miss by 3%\n* Full year guidance: (CUT FULL YEAR GUIDANCE)\n* EPS of 6.3, missed estimate by 6.4%\n* Revenue missed by 2.4% vs estimate\n* COmments:\n* Said that they had to cut their full year guidance to reflect industry wide challenges and cost optimisations by major customers. Increased expectations for security and computer solutions. \n*  \n* Expected to come weak imo after NET came weak in same industry. \n\nBE\n\n* Said that they are seeing momentum for its alternative energy products\n* EPS of -0.17 missed by 0.06 (miss)\n* Revenue of 235M was down 14% YOY, missed by 14M (miss by 6%)\n* Bloom Reaffirms Outlook for full year 2024\n* Gross margin of 16%, down 3.5% vs 19.7% in Q1 2023\n* Seeing strong market interest and increasing momentum and robust commercial activity across diverse end markets. \n* Viewing AI hardware as growth opportunity for Bloom as well as data centres which they are lady target\n* New CEO\n\nYELP Mixed advertising metrics and Full year revenue guidance cut has them lower \n\n* Rev $333M vs $333M est. IN LINE. Up 6.5% YOY\n* EPS $0.20 vs $0.06 est. BEAT 300%\n* Current quarter metrics:\n* Services revenue of 203.3M up 11% YOY\n* RR&O Revenue up just 1% YOY\n* Advertising Revenue was up 7% YOY\n* Other revenue down 1% YOY\n* Said ad clicks are up 8% YOY\n* Paying advertising locations are DOWN 4% YOY\n* Average CPC DOWN\n* So mixed advertising metrics. \n* **FY outlook:**\n* Rev unchanged (but 2Q guide is a 1% shortfall) \n* EBITDA moves down to $315-325M vs $315-335M prior \n* Cut top end of guidance by 3% \n* Said they expect an increase in expenses. \n* Said they are seeing macro pressures \n* Said this quarter they launched Yelp assistant using LLM tech for improved consumer service matching. \n\nMAG 7:\n\n* AAPL - to power AI tools with in house server chips this year, plans to use its own in house processors similar to those in Macs for cloud computing servers to support AI features\n* TSLA - to spend well over $500M to expand Tesla electric vehicle charging. Network this year. \n* NVDA up in premarket, in part due to the pump in Soundhound. NVDA backs Soundhound. \n* MSFT GOOGL - OpenAI will launch an AI powered search product to compete with GOOGL. They will be reading to launch it as soon as Monday apparently. \n\nOTHER COMPANIES:\n\n* Gold miners will be up today as Gold points higher. \n* Materials generally are higher on lower dollar, following weaker jobless claims yesterday\n* Solar stocks will be higher on US gov putting tariffs on Chiense solar companies, and also on ARRY and BE earnings. Both are up in premarket. \n* TMUS - nearing deal to buy part of Us Cellular, for 2B, aiming to take over some operations and wireless spectrum licenses. Deal could close later this month. \n* NVAX - secures a strategic deal with Sanofi, easing viability concerns. $1.2B agreement to co market its Covid 19 vaccine and develop flu-covid combo shots\n* TSM - sees April sales jump by 60% YOY, driven by continued demand for AI semiconductors and a recover in Consumer electronics. \n* Chinese EV can be down on this news - US to impose tariffs on Chinese EV, batteries and solar cells.\n* But this will help domestic solar companies. \n* AI stocks will likely pump on Soundhound earnings. NVDA can be up on this too. \n* SOUNDHOUND is seeing strong demand for voice AI platform service \n* DBX - JMP Securities remains a hold on Dropbox\n* APP - continues higher after their pump yesterday on earnings, as they get positive price target from Jefferies, price target 105 vs 93\n* MU - Micron backed Silvaco rises ind but yesterday after top end IPO pricing. \n* NET - maintained at neutral by Citigroup, price target cut to 90 from 95. \n* VSCO preliminary earnings outperforms, citing quarterly sales improving, with April being the strongest. \n\nOTHER NEWS:\n\n* Hang Seng market was higher after authorities said they were contemplating a plan to exclude private investors from paying taxes on income earned from HK equities, purchased through Stock Connect. \n* Yesterday saw highest jobs claims since August. This spurred sentiment that jobs market was weakening, which lead to suggestions that the Fed could cut rates. \n* This sent dollar lower yesterday\n* US to impose tariffs on Chinese EV and other key sectors as per Bloomberg.  - as soon as next week, targeting industries like EV , batteries and solar cells. \n* Good for domestic producers. \n* BOE’s Bailey yesterday: V dovish commentary: It’s likely we will need to cut bank rate. Will need to make policy less restrictive. Cutting Interest rate doesnt mean policy won’t be restrictive still. Rates are maybe going to fall more sharply than markets expect. \n* UBS expects BOE to start cutting interest rates in June vs prior forecast of August.\n* SO UBS HAS SHIFTED MORE DOVISH ON BOE. \n* UK’s Chancellor Hunt says that today’s growth figures are proof that the economy is returning o full health for the first time since the pandemic. \n* China’s April car sales fall 5.8% YOY. \n* Chiense EV maker Zeekr prices US IPO at top of range. \n* Fed’s Daly: There is considerable uncertainty about inflation in next 3 months. \n* Decent 10 year bond auction yesterday, good demand for it. \n* Italian industrial production just hit lowest level since 2020 YOY. \n* Fed’s Bostic this morning: Gain of 175k jobs as per last week jobs numbers may seem low vs pandemic era, but its still above what economy requires and is therefore strong. \n* Said job growth needs to slow more. \n* Said he’s not thinking about how many rate cuts, just thinking of when is best time for the first one. \n* Kishida - government will closely collaborate with BOJ on FX. Japan finance minister says that it will take necessary measures regarding FX. \n* As per BOfA EPFR data: Crypto seeing inflows, cash seeing inflows. Bull and bear indicator jumps to 5.4 from 5.2",
        "created_utc": 1715340720.0,
        "subreddit_name": "DayTrading",
        "comments": 13
    }
]