[
    {
        "title": "Favorite 10 stocks",
        "score": 261,
        "url": "https://www.reddit.com/r/stocks/comments/1gbl5kl/favorite_10_stocks/",
        "content": "These were chosen out of a pretty much unfiltered list (all US stocks >100M market cap) one by one.\n\n# *Selection criteria:*\n\n\n\n1. The first rounds of filtering were based on the overall trend of revenue growth over 20, 10, & 5 years. All must be positive\n\n2. The second round is based on the actual current size of revenue & total equity growth. Generally it must be at least +30% rev & eq combined\n\n3. Third round, consistency. Any \"weird\" financials, inconsistencies are tossed\n\n4. Soft fourth for value, taking into account PEG and other price:financial metrics\n\n5. Fifth leaves us with around 50. Sorted by the criteria above, keep top 10.\n\n\n\n# *List*\n\n|Ticker|Name|Industry|Revenue Growth y/y%|Total Equity y/y %|\n|:-|:-|:-|:-|:-|\n|1. VITL|Vital Farms|Eggs|39%|35%|\n|2. TSM|Taiwan Semi|Semiconductor|33%|13%|\n|3. NVDA|Nvidia|Semiconductor|122%|111%|\n|4. IESC|IES|Industrial|32%|37%|\n|5. FIX|Comfort Systems|Industrial|40%|33%|\n|6. AMZN|Amazon|Consumer|10%|40%|\n|7. MELI|Mercado Libre|Consumer|42%|62%|\n|8. GOOGL|Google|IT|14%|13%|\n|9. MSFT|Microsoft|IT|15%|30%|\n|10. HEI|Heico|Industrial|37%|22%|\n\n",
        "created_utc": 1729827229.0,
        "subreddit_name": "stocks",
        "comments": 84
    },
    {
        "title": "When/how do you know it's time to sell your successful stock?",
        "score": 158,
        "url": "https://www.reddit.com/r/stocks/comments/1gbnd05/whenhow_do_you_know_its_time_to_sell_your/",
        "content": "Hey. When it comes to huge companies, like Amazon, Nvidia and others, it's obvious you can and should keep their stocks when they give you significant profits, say, 11% in a month (unless there is something obvious that could crumble them ofc). \n\nBut what about smaller companies that ppl find full of potential? I bought Celestica Inc. (CLS) stocks like a month ago. It's already given me about 15% (after yesterday's strong earnings report). I read articles where this company is stated promising etc, but I'd like to know when it is the best time to sell. \n\nIt may rise even more which could lead to a lost profit for me, but what's the common strategy in such cases?",
        "created_utc": 1729835469.0,
        "subreddit_name": "stocks",
        "comments": 137
    },
    {
        "title": "r/Stocks Daily Discussion & Fundamentals Friday Oct 25, 2024",
        "score": 8,
        "url": "https://www.reddit.com/r/stocks/comments/1gbq8o7/rstocks_daily_discussion_fundamentals_friday_oct/",
        "content": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.\n\nExpect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nBut growth stocks don't rely so much on EPS or revenue as long as they beat some other metric like subscriber count:  Going from 1 million to 10 million subscribers means more revenue in the future.\n\nValue stocks do rely on earnings reports, investors look for wall street expectations to be beaten on both EPS & revenue.  You'll also find value stocks pay dividends, but never invest in a company solely for its dividend.\n\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia page](https://www.investopedia.com/fundamental-analysis-4689757/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp) and read [their PDF on the topic.](http://i.investopedia.com/inv/pdf/tutorials/fundamentalanalysis_intro.pdf)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1729848611.0,
        "subreddit_name": "stocks",
        "comments": 156
    },
    {
        "title": "U.S. Bond Market Braces for the ‘Trump Trade’ of Large Tariffs and Deficits",
        "score": 321,
        "url": "https://www.reddit.com/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/",
        "content": "https://www.nytimes.com/2024/10/25/business/economy/trump-economy-markets-trade.html?unlocked_article_code=1.U04.Vli9.tD2qYGIXIvLk&smid=nytcore-ios-share&referringSource=articleShare\n\nAnd now we know why rates have risen since the Fed .5% rate cut. Does this not scare the hell out of you guys? So we make money on equities for a moment and then fiscal default really kicks in? ",
        "created_utc": 1729862592.0,
        "subreddit_name": "stocks",
        "comments": 121
    },
    {
        "title": "Nvidia Nudges Record Highs Ahead of Big Tech Earnings",
        "score": 175,
        "url": "https://www.barrons.com/amp/articles/nvidia-stock-price-big-tech-earnings-909f67d3",
        "content": "🔥All The News Today of Tech Earnings, NVIDIA Deals, & Mass Share Buying🔥\n\nFurther gains will likely require the likes of Microsoft , Amazon.com , Meta Platforms and Google-parent Alphabet to signal they will spend more on AI data centers housing Nvidia chips in their coming earnings next week. \n\nSo far, the signals from the various companies in the supply chain for AI infrastructure have been positive",
        "created_utc": 1729844547.0,
        "subreddit_name": "wallstreetbets",
        "comments": 11
    },
    {
        "title": "NVIDIA Blackwell Ultra AI GPUs To Be Called B300, Feature 12-Hi HBM3E & TSMC CoWoS-L Tech",
        "score": 86,
        "url": "https://wccftech.com/nvidia-blackwell-ultra-ai-gpus-b300-feature-12-hi-hbm3e-tsmc-cowos-l/",
        "content": "",
        "created_utc": 1729883873.0,
        "subreddit_name": "wallstreetbets",
        "comments": 35
    },
    {
        "title": "Portfolio Tracking Software -- Need Help",
        "score": 8,
        "url": "https://www.reddit.com/r/investing/comments/1gbvrhw/portfolio_tracking_software_need_help/",
        "content": "Back in April I signed up for Sharesight. At first I was happy. I did everything manually. I also write a lot of options contracts. I established makeshift transactions using a CASH and PROFIT position to log them, adding premiums to the PROFIT and when assigned purchasing shares in the given security at my strike price. Everything seemed to be working. \n\nUntil I realized my returns were being diluted after every infusion of capital into my portfolio. The whole damn point of tracking software is to assess my time-/capital-weighted--i.e. ACTUAL--returns. Instead, just like Schwab or any other brokerage that costs me nothing to use, if I doubled a position in which I'd earned a 20% return, suddenly it would be diluted to 10%. \n\nAs any fund manager or investor worth their weight in salt understands, my performance isn't cut in half simply because I double my position size. Any software worth $200/year should, at the very least, have this figured out. It's utterly bemusing to me that Sharesight's engineers spent all this time fussing with incredibly detailed tools and yet didn't stop to think of this issue. \n\nIt took me months to realize the problem because I've been performing very well this year, and my biweekly capital infusions after receiving my paycheck were small enough to fly under the radar. Each infusion knocked my performance down a few basis points that were largely covered up by strong performance. \n\nBut then I sold my business, with the express intention of investing the majority of the proceeds in the market. Once I started injecting relatively large sums into my account, I saw my total \"return\" drop dramatically in kind. \n\nIt's just beyond my capacity to understand why a software that advertises itself as a performance tracker would quite literally fail one of the most basic functions. It completely defeats the purpose. I wasted my money, and I will be cancelling my Sharesight subscription when my year comes up. \n\nNow I need some advice. Is there any tracker that actually works as it's supposed to? As explained, I'm more than happy to manually input my trades. But I need something that actually tracks my performance. I'm not going to stop adding capital to my portfolio, so the problem needs to be solved at the root. Otherwise I might as well do the entire thing on my own. ",
        "created_utc": 1729867036.0,
        "subreddit_name": "investing",
        "comments": 6
    },
    {
        "title": "Nvidia Overtakes Apple as World's Most Valuable Company",
        "score": 1070,
        "url": "https://www.reuters.com/technology/nvidia-overtakes-apple-worlds-most-valuable-company-2024-10-25/",
        "content": "",
        "created_utc": 1729872845.0,
        "subreddit_name": "wallstreetbets",
        "comments": 92
    },
    {
        "title": "Berkshire Hathaway as proxy cash holding?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gc1s9w/berkshire_hathaway_as_proxy_cash_holding/",
        "content": "Disclaimer: I don't hold any BRK at this time (because I own A LOT of Apple).\n\n* BRK.B is 983B USD, out of which, 277B USD is cash \n* That's \\~70% in solid business and \\~30% in cash.\n* Cash grows \\~5% per year.\n\nLet's assume BRK stock holdings drop by 10% in a given year.\n\n* BRK 10% drop in the stock holdings is 7% of their total holdings.\n   * adjusted drop 7%.\n* BRK cash grows \\~5% per year, which is 1.5% of their total holdings.\n   * adjusted drop 5.5%.\n* BRK gets \\~5B USD in dividends every year, which is 0.5% of their total holdings: adjusted drop 5%\n\nNow, with a loss of 5%, BRK maybe realize some losses in order to offset capital gains, which would bring the actual loss even lower, let's say it drops another 0.5%, which makes the loss 4.5%.\n\nNow, if BRK's holdings drop 4.5% and let's say you need to take 30% of the money from it:  \n\\- Now, BRK will buy more of their holdings.  \n\\- In order to recover the 4.5% of the 30% of the original money you've taken, the stock only needs to recover \\~7% (which is not a lot, considering it just dropped 10%).\n\n",
        "created_utc": 1729882542.0,
        "subreddit_name": "investing",
        "comments": 4
    }
]