[
    {
        "title": "Favorite 10 stocks",
        "score": 261,
        "url": "https://www.reddit.com/r/stocks/comments/1gbl5kl/favorite_10_stocks/",
        "content": "These were chosen out of a pretty much unfiltered list (all US stocks >100M market cap) one by one.\n\n# *Selection criteria:*\n\n\n\n1. The first rounds of filtering were based on the overall trend of revenue growth over 20, 10, & 5 years. All must be positive\n\n2. The second round is based on the actual current size of revenue & total equity growth. Generally it must be at least +30% rev & eq combined\n\n3. Third round, consistency. Any \"weird\" financials, inconsistencies are tossed\n\n4. Soft fourth for value, taking into account PEG and other price:financial metrics\n\n5. Fifth leaves us with around 50. Sorted by the criteria above, keep top 10.\n\n\n\n# *List*\n\n|Ticker|Name|Industry|Revenue Growth y/y%|Total Equity y/y %|\n|:-|:-|:-|:-|:-|\n|1. VITL|Vital Farms|Eggs|39%|35%|\n|2. TSM|Taiwan Semi|Semiconductor|33%|13%|\n|3. NVDA|Nvidia|Semiconductor|122%|111%|\n|4. IESC|IES|Industrial|32%|37%|\n|5. FIX|Comfort Systems|Industrial|40%|33%|\n|6. AMZN|Amazon|Consumer|10%|40%|\n|7. MELI|Mercado Libre|Consumer|42%|62%|\n|8. GOOGL|Google|IT|14%|13%|\n|9. MSFT|Microsoft|IT|15%|30%|\n|10. HEI|Heico|Industrial|37%|22%|\n\n",
        "created_utc": 1729827229.0,
        "subreddit_name": "stocks",
        "comments": 84
    },
    {
        "title": "When/how do you know it's time to sell your successful stock?",
        "score": 158,
        "url": "https://www.reddit.com/r/stocks/comments/1gbnd05/whenhow_do_you_know_its_time_to_sell_your/",
        "content": "Hey. When it comes to huge companies, like Amazon, Nvidia and others, it's obvious you can and should keep their stocks when they give you significant profits, say, 11% in a month (unless there is something obvious that could crumble them ofc). \n\nBut what about smaller companies that ppl find full of potential? I bought Celestica Inc. (CLS) stocks like a month ago. It's already given me about 15% (after yesterday's strong earnings report). I read articles where this company is stated promising etc, but I'd like to know when it is the best time to sell. \n\nIt may rise even more which could lead to a lost profit for me, but what's the common strategy in such cases?",
        "created_utc": 1729835469.0,
        "subreddit_name": "stocks",
        "comments": 137
    },
    {
        "title": "r/Stocks Daily Discussion & Fundamentals Friday Oct 25, 2024",
        "score": 8,
        "url": "https://www.reddit.com/r/stocks/comments/1gbq8o7/rstocks_daily_discussion_fundamentals_friday_oct/",
        "content": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.\n\nExpect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nBut growth stocks don't rely so much on EPS or revenue as long as they beat some other metric like subscriber count:  Going from 1 million to 10 million subscribers means more revenue in the future.\n\nValue stocks do rely on earnings reports, investors look for wall street expectations to be beaten on both EPS & revenue.  You'll also find value stocks pay dividends, but never invest in a company solely for its dividend.\n\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia page](https://www.investopedia.com/fundamental-analysis-4689757/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp) and read [their PDF on the topic.](http://i.investopedia.com/inv/pdf/tutorials/fundamentalanalysis_intro.pdf)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1729848611.0,
        "subreddit_name": "stocks",
        "comments": 156
    },
    {
        "title": "U.S. Bond Market Braces for the ‘Trump Trade’ of Large Tariffs and Deficits",
        "score": 321,
        "url": "https://www.reddit.com/r/stocks/comments/1gbu5k6/us_bond_market_braces_for_the_trump_trade_of/",
        "content": "https://www.nytimes.com/2024/10/25/business/economy/trump-economy-markets-trade.html?unlocked_article_code=1.U04.Vli9.tD2qYGIXIvLk&smid=nytcore-ios-share&referringSource=articleShare\n\nAnd now we know why rates have risen since the Fed .5% rate cut. Does this not scare the hell out of you guys? So we make money on equities for a moment and then fiscal default really kicks in? ",
        "created_utc": 1729862592.0,
        "subreddit_name": "stocks",
        "comments": 121
    },
    {
        "title": "Nvidia Nudges Record Highs Ahead of Big Tech Earnings",
        "score": 175,
        "url": "https://www.barrons.com/amp/articles/nvidia-stock-price-big-tech-earnings-909f67d3",
        "content": "🔥All The News Today of Tech Earnings, NVIDIA Deals, & Mass Share Buying🔥\n\nFurther gains will likely require the likes of Microsoft , Amazon.com , Meta Platforms and Google-parent Alphabet to signal they will spend more on AI data centers housing Nvidia chips in their coming earnings next week. \n\nSo far, the signals from the various companies in the supply chain for AI infrastructure have been positive",
        "created_utc": 1729844547.0,
        "subreddit_name": "wallstreetbets",
        "comments": 11
    },
    {
        "title": "NVIDIA Blackwell Ultra AI GPUs To Be Called B300, Feature 12-Hi HBM3E & TSMC CoWoS-L Tech",
        "score": 86,
        "url": "https://wccftech.com/nvidia-blackwell-ultra-ai-gpus-b300-feature-12-hi-hbm3e-tsmc-cowos-l/",
        "content": "",
        "created_utc": 1729883873.0,
        "subreddit_name": "wallstreetbets",
        "comments": 35
    },
    {
        "title": "Portfolio Tracking Software -- Need Help",
        "score": 8,
        "url": "https://www.reddit.com/r/investing/comments/1gbvrhw/portfolio_tracking_software_need_help/",
        "content": "Back in April I signed up for Sharesight. At first I was happy. I did everything manually. I also write a lot of options contracts. I established makeshift transactions using a CASH and PROFIT position to log them, adding premiums to the PROFIT and when assigned purchasing shares in the given security at my strike price. Everything seemed to be working. \n\nUntil I realized my returns were being diluted after every infusion of capital into my portfolio. The whole damn point of tracking software is to assess my time-/capital-weighted--i.e. ACTUAL--returns. Instead, just like Schwab or any other brokerage that costs me nothing to use, if I doubled a position in which I'd earned a 20% return, suddenly it would be diluted to 10%. \n\nAs any fund manager or investor worth their weight in salt understands, my performance isn't cut in half simply because I double my position size. Any software worth $200/year should, at the very least, have this figured out. It's utterly bemusing to me that Sharesight's engineers spent all this time fussing with incredibly detailed tools and yet didn't stop to think of this issue. \n\nIt took me months to realize the problem because I've been performing very well this year, and my biweekly capital infusions after receiving my paycheck were small enough to fly under the radar. Each infusion knocked my performance down a few basis points that were largely covered up by strong performance. \n\nBut then I sold my business, with the express intention of investing the majority of the proceeds in the market. Once I started injecting relatively large sums into my account, I saw my total \"return\" drop dramatically in kind. \n\nIt's just beyond my capacity to understand why a software that advertises itself as a performance tracker would quite literally fail one of the most basic functions. It completely defeats the purpose. I wasted my money, and I will be cancelling my Sharesight subscription when my year comes up. \n\nNow I need some advice. Is there any tracker that actually works as it's supposed to? As explained, I'm more than happy to manually input my trades. But I need something that actually tracks my performance. I'm not going to stop adding capital to my portfolio, so the problem needs to be solved at the root. Otherwise I might as well do the entire thing on my own. ",
        "created_utc": 1729867036.0,
        "subreddit_name": "investing",
        "comments": 6
    },
    {
        "title": "Nvidia Overtakes Apple as World's Most Valuable Company",
        "score": 1070,
        "url": "https://www.reuters.com/technology/nvidia-overtakes-apple-worlds-most-valuable-company-2024-10-25/",
        "content": "",
        "created_utc": 1729872845.0,
        "subreddit_name": "wallstreetbets",
        "comments": 92
    },
    {
        "title": "Berkshire Hathaway as proxy cash holding?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gc1s9w/berkshire_hathaway_as_proxy_cash_holding/",
        "content": "Disclaimer: I don't hold any BRK at this time (because I own A LOT of Apple).\n\n* BRK.B is 983B USD, out of which, 277B USD is cash \n* That's \\~70% in solid business and \\~30% in cash.\n* Cash grows \\~5% per year.\n\nLet's assume BRK stock holdings drop by 10% in a given year.\n\n* BRK 10% drop in the stock holdings is 7% of their total holdings.\n   * adjusted drop 7%.\n* BRK cash grows \\~5% per year, which is 1.5% of their total holdings.\n   * adjusted drop 5.5%.\n* BRK gets \\~5B USD in dividends every year, which is 0.5% of their total holdings: adjusted drop 5%\n\nNow, with a loss of 5%, BRK maybe realize some losses in order to offset capital gains, which would bring the actual loss even lower, let's say it drops another 0.5%, which makes the loss 4.5%.\n\nNow, if BRK's holdings drop 4.5% and let's say you need to take 30% of the money from it:  \n\\- Now, BRK will buy more of their holdings.  \n\\- In order to recover the 4.5% of the 30% of the original money you've taken, the stock only needs to recover \\~7% (which is not a lot, considering it just dropped 10%).\n\n",
        "created_utc": 1729882542.0,
        "subreddit_name": "investing",
        "comments": 4
    },
    {
        "title": "Jury rules Masimo smartwatches infringe Apple design patents",
        "score": 1549,
        "url": "https://9to5mac.com/2024/10/25/masimo-apple-design-patents-apple-watch/",
        "content": "",
        "created_utc": 1729897809.0,
        "subreddit_name": "apple",
        "comments": 146
    },
    {
        "title": "iOS 18.2 lets you add the volume slider back to your iPhone’s Lock Screen",
        "score": 887,
        "url": "https://9to5mac.com/2024/10/25/iphone-volume-slider-lock-screen/",
        "content": "",
        "created_utc": 1729882686.0,
        "subreddit_name": "apple",
        "comments": 97
    },
    {
        "title": "You Won't Get These Apple Intelligence Features Until 2025",
        "score": 824,
        "url": "https://www.macrumors.com/2024/10/24/apple-intelligence-2025-features/",
        "content": "",
        "created_utc": 1729846390.0,
        "subreddit_name": "apple",
        "comments": 270
    },
    {
        "title": "In South Korea there were a man who make petition, protested on front of Apple store because Find My was not working in there at all over 15 years. Now Find my will be available in spring 2025.",
        "score": 491,
        "url": "https://damoang.net/applemoang/7187?sfl=wr_subject&stx=%EC%B0%BE%EA%B8%B0&sop=and",
        "content": "",
        "created_utc": 1729882745.0,
        "subreddit_name": "apple",
        "comments": 33
    },
    {
        "title": "Apple Tests Blood-Sugar App in Sign of Its Health Ambitions",
        "score": 334,
        "url": "https://www.bloomberg.com/news/articles/2024-10-25/apple-secretly-tests-blood-sugar-app-in-sign-of-health-ambitions",
        "content": "",
        "created_utc": 1729880082.0,
        "subreddit_name": "apple",
        "comments": 58
    },
    {
        "title": "Mac Enthusiast creates a replacable SSD mod for an M1 Macbook",
        "score": 273,
        "url": "https://youtu.be/E3N-z-Y8cuw?si=-Clu04dPcSJ5-5tu",
        "content": "iBoff RCC, a famous \"Mac Logic Board Enthusiast\", created a replaceable SSD Mod for an M1 Macbook.\n\nWhat do you guys think? I think this is an insane achievement and feat of engineering.",
        "created_utc": 1729883918.0,
        "subreddit_name": "apple",
        "comments": 40
    },
    {
        "title": "Apple is Adding Spatial Photo and Video Support to Safari",
        "score": 147,
        "url": "https://petapixel.com/2024/10/25/apple-is-adding-spatial-photo-and-video-support-to-safari/",
        "content": "",
        "created_utc": 1729891221.0,
        "subreddit_name": "apple",
        "comments": 19
    },
    {
        "title": "Daily Advice Thread - October 25, 2024",
        "score": 0,
        "url": "https://www.reddit.com/r/apple/comments/1gbqnqf/daily_advice_thread_october_25_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1729850436.0,
        "subreddit_name": "apple",
        "comments": 32
    },
    {
        "title": "Apple Dares Anyone to Find a Problem With Its Darling AI, Offers $1 Million Bounty | If you find anything wrong with Apple Intelligence’s Private Cloud Compute you can net between $50,000 up to $1 million.",
        "score": 753,
        "url": "https://gizmodo.com/apple-dares-anyone-to-find-a-problem-with-its-darling-ai-offers-1-million-bounty-2000516513",
        "content": "",
        "created_utc": 1729867796.0,
        "subreddit_name": "technology",
        "comments": 120
    },
    {
        "title": "Apple will pay you up to $1 million if you can hack into Apple Intelligence servers",
        "score": 403,
        "url": "https://www.zdnet.com/article/apple-will-pay-you-up-to-1-million-if-you-can-hack-into-its-apple-intelligence-servers/",
        "content": "",
        "created_utc": 1729899695.0,
        "subreddit_name": "technology",
        "comments": 58
    },
    {
        "title": "Smartphone buyers meh on AI, care much more about battery life | A survey found that only a relatively small minority of consumers are currently using AI features on their smartphones , and it doesn’t yet seem to be a purchase driver",
        "score": 142,
        "url": "https://9to5mac.com/2024/10/25/smartphone-buyers-meh-on-ai-care-much-more-about-battery-life/",
        "content": "",
        "created_utc": 1729868738.0,
        "subreddit_name": "technology",
        "comments": 56
    },
    {
        "title": "Amazon seizes domains used in rogue Remote Desktop campaign to steal data",
        "score": 72,
        "url": "https://www.bleepingcomputer.com/news/security/amazon-seizes-domains-used-in-rogue-remote-desktop-campaign-to-steal-data/",
        "content": "",
        "created_utc": 1729882183.0,
        "subreddit_name": "technology",
        "comments": 0
    },
    {
        "title": "Samsung phone users under attack, Google warns -- \"A nasty bug in Samsung's mobile chips is being exploited by miscreants as part of an exploit chain to escalate privileges and then remotely execute arbitrary code, according to Google security researchers.\" \"affects Samsung Exynos mobile processors\"",
        "score": 46,
        "url": "https://www.theregister.com/2024/10/24/samsung_phone_eop_attacks/",
        "content": "",
        "created_utc": 1729865231.0,
        "subreddit_name": "technology",
        "comments": 4
    },
    {
        "title": "Macbook Pro 15” 2011 advice ",
        "score": 64,
        "url": "https://i.redd.it/unhku9w09uwd1.jpeg",
        "content": "Hello , i just bought a macbook pro 2011 15 inch with 2.2 i7 12GB ram and an amd gpu , from what i have read they are very unreliable and i wanted to know a way to prevent damaging the gpu , i am using oclp with monterey and i turned on the accelerations, the temps on the intel were high so i have to replace  the thermal paste. \n\nThe gpu from what i see its working fine for now , should i just disable it for preserving it and use the integrated one , ?\nOn day to day basics should feel a difference without it? \nAnd if you guys have some tips on optimizing the oclp to manage the OS better , I didn’t find anything online for those kind of questions. ",
        "created_utc": 1729834141.0,
        "subreddit_name": "mac",
        "comments": 37
    },
    {
        "title": "VirtualBox on Apple Silicon",
        "score": 17,
        "url": "https://www.reddit.com/gallery/1gbpcoo",
        "content": "This is my second post on the topic, since VirtualBox has Apple Silicon support in the latest version and it’s the software recommended by the university (we’re gonna use it in exams) I decided to try to use it instead of VMware or UTM. I installed it but I couldn’t find the ARM64 version of the Ubuntu ISO I need to run the VM.\nA video on YouTube downloaded it from this website but when I go to the website there is no “Desktop” option. And I could only find the AMD64 version on the official Ubuntu website. Where can I find the image? ",
        "created_utc": 1729844448.0,
        "subreddit_name": "mac",
        "comments": 28
    },
    {
        "title": "MacBook 💻 Pro mid-2012 Sierra doesn’t recognize floppy discs",
        "score": 14,
        "url": "https://i.redd.it/cv1v013v2uwd1.jpeg",
        "content": "Hey guys, do you know why my MacBook 💻 Pro mid-2012 Sierra doesn’t recognize floppy discs? I’ve bought a Sony pcga-ufd5, it works on windows but not on my MacBook 😭\n\nDo I need to install a special driver? I do not found anything on Sony website!\n\nhttps://www.sony.lu/fr/electronics/support/accessories-personal-computer-accessories/pcga-ufd5\n\nMany thanks 😊 for your help!",
        "created_utc": 1729832068.0,
        "subreddit_name": "mac",
        "comments": 28
    },
    {
        "title": "2017 iMac suddenly very slow",
        "score": 6,
        "url": "https://www.reddit.com/r/mac/comments/1gbhh1c/2017_imac_suddenly_very_slow/",
        "content": "Hoping somebody here has some suggestions on how to get back to my old operating speed. Apologies in advance for the long post, just trying to include all the details and what I've done so far....\n\niMac is 2017  (Model iMac18,3)  \n27\" 5K Retina  \n3.8 GHz Quad Core Intel Core i5  \n24GB RAM  \n2.12TB Fusion drive (1.2 TB free)  \nVentura 13.7\n\nLiterally overnight my mac has become unusably slow. Last Sat it was working fine, on Sun it was crawling. It was taking several minutes to respond to anything (even moving/minimising windows), showing no back ground picture, not loading anything (at least I didn't wait long enough, I gave up after about an hour).\n\nI rebooted, same behaviour. Booting took ages. Over 15 minutes (again, I just left it and did other stuff, so no exact time). Eventually manged to open Activity Monitor, showed less than 10% CPU usage, 7GB or less of RAM usage. Edit to add: systems would sit for a while, going slow, then reboot itself.\n\nBooted in Recovery (cmd+option+R), ran first aid on the drives, it did report an issue with the HDD portion, but said I needed to run first aid from within recovery. I was in Recovery (internet loaded one I'm pretty sure).\n\nSafe boot wasn't any faster.\n\nI ended up wiping and formatting the drives (i.e. both bits of the fusion drive), then had to re-fusion them (otherwise resoring from time machine didn't want to work, not enough space on the 128GB SSD). Fresh install of Ventura, restored from time machine backup.\n\nStill very slow, but slightly improved. Takes several minutes to boot up, where it used to take less than a minute. Opening a program is painfully slow, can't play a video in quicktime at all. I can move windows and minimise them instantly, but anything that seems to require thinking about just doesn't happen, or does slow very slowly (still low CPU and RAM usage)\n\nSMART drive monitor details don't show any issues.\n\nCurrently, after mucking about with it for ages, it takes just over a minute to get to the login screen. Then 2 minutes of spinning circle before it prompts for password for a 2nd time, then another 2 minutes before my desktop starts to load (sidebar only, no icons/menu etc.), icons there another 30 seconds later, menu bar a bit after that.\n\nI'm guessing the spinny HDD bit of the fusion drive is showing it's age?  \nBest to upgrade to an SSD?\n\nAny other idea for what may be causing the slow down?\n\nI've seen the instructions for putting in an internal SSD, which don't scare me too much (I'm and electronics engineer, just not on computers), but also using an external USB C SSD drive looks cheaper, easier and less likely to break something.\n\nIs there any advantage to going the internal method?\n\nEdited for spolling miskates\n\n  \nUPDATE edit: See message below. It was the fusion drive, replaced it with a 2TB M.2 SSD in a Thunderbolt enclosure and all is good. Thanks all!",
        "created_utc": 1729815397.0,
        "subreddit_name": "mac",
        "comments": 18
    },
    {
        "title": "Upgrading old computer to Mac mini - logistics questions..",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gc5mk8/upgrading_old_computer_to_mac_mini_logistics/",
        "content": "So I've got a 2015 27\" iMac that I absolutely love - but alas 'tis no longer supported and will need to upgraded.  I do believe I've settled on moving away from the all in one iMac approach, replacing it with a MacMini + various components (monitor, external storage, etc).\n\nAs I think through some implications (it's been a minute since I've replaced my desktop...) - as I go from a 2TB iMac to a MacMini that has far less on-board storage - In a scenario where I add incremental storage via multiple external hard drives (I'm thinking of using two 2TB external SSD's - one to run applications/store information, and one as a backup drive) - how do I best manage a migration?  When 2015 iMac was bought, there was a handy migration manager that simply moved data from whatever my older model was to the 2015 model - and as 2015 model has enough on-board storage - it wasn't a problem.\n\nHow do I think about what that looks like today?  Does the modern migration manager (or whatever it's called - the utility that allows you to seamlessly move your profile/data from the old thing to the new thing) - allow for migrating that data from a single, large capacity hard drive to multiple, smaller hard drives?\n\nHow do I best think about this?  \nThank you!",
        "created_utc": 1729892752.0,
        "subreddit_name": "mac",
        "comments": 11
    },
    {
        "title": "M1 Max 16” Powerbook External Monitor Ghosting",
        "score": 3,
        "url": "https://www.dropbox.com/scl/fi/euzpimq4vxtlh3usougpq/External-Monitor.mp4?rlkey=ndo3bfjzudk62jxan8ttfm8yo&dl=0",
        "content": "First, sorry for the extremely crappy iPhone video… tried capturing the issue on screen in mirror mode as well as extended but for some reason it wouldn’t show. You can basically get the gist by watching the cursor.\n\nIssue: Have a ViewSonic VX3276-4K-MHD 32 Inch 4K UHD Monitor that I am testing as an external monitor with an M1 Max Powerbook running Monterey 12.6.9. I’m getting what I can only describe as ghosting when moving windows, the cursor, scrolling websites… etc. I’ve tried connecting the monitor to the Mac with an HDMI to Thunderbolt cable inserted on the right side of the Mac by the HDMI port. I also tried both thunderbolt ports on the left side. I’ve tried 2 different HDMI to HDMI cables connected to the HDMI port on the Mac with the same results. I actually have 2 of these ViewSonic VX3276-4K monitors. When I connect to the other one with the HDMI to Thunderbolt there is no issue on the second monitor.\n\nBoth monitors are connected to a 2010 5,1 Mac Pro desktop with an AMD Radeon RX 5600 XT… I’m using the DisplayPort on one to connect to the graphics card and the HDMI on the other. When testing the problem monitor I was manually switching between the 5,1 and M1 Max via the onboard monitor menu. I also did try and pull the DisplayPort cable connected to the 5,1 to see if that made a difference… it didn’t.\n\nOther things tried, adjusting brightness, switching refresh rate and switching resolution via BetterDisplay app.\n\nI’m at a loss as why one monitor would connect fine and the other wouldn’t. I would appreciate any input.\n\nTLDR: Ghosting on Viewsonic monitor connected to an M1 Max 16” Powerbook running Monterey 12.6.9\n",
        "created_utc": 1729873197.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Refurbishing imacs",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gbxjm0/refurbishing_imacs/",
        "content": "Hey guys I'm attempting to refurbish 3 imacs but they still have the previous accounts on, I've wiped the HDDs and done a reinstallation of macOS through the internet recovery, however the accounts (that I can't access) are still on there. Does anyone know how I can reinstall macOS and remove the accounts so that I can sell these imacs on?\n",
        "created_utc": 1729871624.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Should I go back to Monterey",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gboj6i/should_i_go_back_to_monterey/",
        "content": "I am using 2015 MBP and running Sequoia with OCLP but Apple's native apps(Safari, Music, Settings) keep on quitting when I type something. If I restart it it becomes ok, but it comes up again and again. But it's not like I can't live with this. Should I keep using Sequoia or should I go back to Monterey? Any opinions appreciated!",
        "created_utc": 1729840579.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "A pair of solid momentum plays on QQQ today",
        "score": 278,
        "url": "https://i.redd.it/1gsrht6t2ywd1.jpeg",
        "content": "The calls were perfect, obviously wishing I had held the puts another hour or so now. Can't complain.",
        "created_utc": 1729880478.0,
        "subreddit_name": "wallstreetbets",
        "comments": 30
    },
    {
        "title": "Rode the SPY wave | ~60k gain",
        "score": 155,
        "url": "https://www.reddit.com/gallery/1gc2cen",
        "content": "Took advantage of the past two crazy days of SPY. Left a lot on the table but still secured a pretty penny ",
        "created_utc": 1729883999.0,
        "subreddit_name": "wallstreetbets",
        "comments": 24
    },
    {
        "title": "PREMARKET REPORT 25/10 - Everything you need to know ahead of the trading day",
        "score": 24,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gbs03p/premarket_report_2510_everything_you_need_to_know/",
        "content": "MACRO DATA:\n\n* ECB 1 year and 3 year inflation expectations fall. This is a another indicator that inflation likely to continue to drop in Eurozone. However, in Eurozone, this is driven by demand weakness rather than any improvement in supply. \n* Tokyo Core CPI comes in ahead of expectations at 1.8% vs 1.7% expected. HOWEVER, HEADLINE CAME IN MUCH WEAKER at 1.8% vs 2.1% expected. \n* FOLLOWING THIS, BoJ’s Ueda Signals No Hike Next Week, Noting Time Is On His Side – BBG\n* Spain PPI comes in MUCH lower than expected at -5.2% vs 1.9% anticipated. \n* Points to further disinflation to come\n* IFO survey in Germany - better than expected which is a surprise. Business climate, current conditions and Expectations all point to weakness still, but less weak than anticipated. \n* US durable Goods orders coming out premarket\n* Then we have 5 year and 1 year inflation expectations, along with Current conditions. Current conditions data likely to come out strong, but this may not era. Positive thing as it will lead to more strength in the bond yields. \n\nMARKETS:\n\n* SPX: despite Tesla move higher yday, could only muster a flat day. Fell to 5785. This because bond yields are elevated which is pressuring markets. Partly attibutatle to too strong data .\n* Nasdaq continues higher, 20,272. BOUNCED off key support 2 days ago at 20.073 then moved higher as a result of Tesla. Can see continuation as MAGS is breaking out. \n* Dow - flat 42.5 in what was a breakout retest \n* GER40: Flat, was up slightly, trying to hold the trend line.\n* HKG50 up by 1% as China top legislator will meet in early November amid hopes of more stimulus. Was up more, then pared gains. \n* Gold lower but just trying to consolidate and gain liquidity for next move higher. \n* Oil lower, is holding the support just above 70. Positioning has shifted on oil to v bullish so wouldn’t be surprised to see a move higher soon.\n* VIX - hovering around that key 19 level. Is likely to remain elevated into elections.\n* Bond yields - 2 year flat above 4%. 5 year the same. So bond yields flat, but maintaining the recent gains. \n\nFX:\n\n* Ueda points to NO Hike Next Week, Noting Time Is On His Side.\n* This will reduce the strength of the yen. USDJPY still hovering around that important 150 level. \n\nEARNINGS:\n\nSKX: Strong beat and raise quarter. Wholesale segment doing v well. V strong volume. Noted strong consumer demand and strong results from celebrity and athlete partnerships. Beats all across the board. \n\n* Revenue: $2.35B (Est. $2.31B) UP +15.9% YoY. BEAT\n* EPS: $1.20 (Est. $1.16)  BEAT\n* Raised FY 2024:\n* Revenue: $8.925B-$8.975B (Est. $8.93B)  BEAT\n* EPS: $4.20-$4.25 (Est. $4.17)  BEAT\n* Q4 Guidance:\n* Revenue: $2.165B-$2.215B (Est. $2.22B) BEAT\n* EPS: $0.70-$0.75 (Est. $0.76) BEAT\n* Segment Performance: \n* Wholesale Revenue: UP +20.6% YoY (Volume up +21.2%)\n* Direct-to-Consumer (DTC) Revenue: UP +9.6% YoY\n*  International Revenue: UP +16% YoY\n*  Domestic Revenue: UP +15% YoY\n* Operational Highlights:\n* Selling Expenses: Increased 18.4%, driven by higher demand-creation spending.\n* General and Administrative Expenses: UP +14.4%, driven by labor, rent, and facility costs.\n* Share Repurchase: $90M spent on 1.4M shares; $910M remaining under repurchase program.\n* Store Expansion: Added 506 stores; Total Skechers stores now 5,332.\n* COMMENTS:\n*  “Skechers delivered another record-breaking quarter, driven by strong consumer demand across wholesale and direct-to-consumer channels. Our continued growth in key regions like EMEA and the Americas, paired with increasing adoption of Skechers' comfort technology, underscores our momentum.\" — David Weinberg, COO\n\nDECK - margin improvement, revenue smashed targets. Raised guidance on revenue AND on margins. All areas of the business are killing it, especially HOKA brand, which is experiencing RAPID growth. \n\n* Said they are experiencing STRONG consumer demand. \n* EPS: $1.59\n* Revenue: $1.31B (Est. $1.2B) UP +20% YoY\n* Gross Margin: 55.9% (vs. 53.4% YoY) \n* Operating Margin: 23.3% (vs. 20.6% YoY)\n* Raised FY25 Guidance:\n* Revenue: \\~$4.8B (Prior: \\~$4.7B); UP +12% YoY \n* EPS: $5.15-$5.25 \n* Gross Margin: 55%-55.5%\n* Operating Margin: 20%-20.5% (Previous: 19.5%-20%) \n* Segment Revenue:\n* HOKA Brand: $570.9M (Est. $517.7M), UP +34.7% YoY\n* UGG Brand: $689.9M (Est. $634.4M) ,UP +13% YoY\n* Teva Brand: $22.0M (Est. $21.1M),UP +2.3% YoY\n* Sanuk Brand: $2.8M; DOWN -47.6% YoY \n* Other Brands: $25.8M; DOWN -15.8% YoY \n* Channel Performance:\n*  Direct-to-Consumer (DTC) Revenue: $397.7M; UP +19.9% YoY\n* Wholesale Revenue: $913.7M; UP +20.2% YoY\n* Domestic Revenue: $853.9M; UP +14.2% YoY\n\nDXCM - Cautious outlook, challenges and growth concerns. US sales decline, leaves FY forecasts unchanged. \n\n* Stock was initially down 16%, now down 7%\n* Price targets mostly cut, but bullish rating as big banks see the company as undervalued. Bernstein and JPM actually RAISED Price target. \n* In my opinion, is a hard one to play though as Hardware revenue guidance missed the market by a LOT. \n\nMAG 7:\n\n* AAPl - importantly, Keybanc has downgraded AAPL to underweight, price target at 200. \n* This downgrade was driven by Consumer Survey that says that many users are looking t the iPhone SE as a viable alternative to the iPhone 16. As such, iPhone SE can cannibalise demand for iPhone 16. Also they said broad based growth expectations appear unrealistic, and with this, the valuation is expensive. \n* AAPL - Also important data from IDC who said that Q3 China smartphone sales for apple are dipping as Huawei surges. Apple sales slipped 0.3%, whilst Huawei surged 42% \n* In other news, Apple CEo met with China’s commerce minister, saying Apple will increase investments in supply chain there and will commit to long term relationship. \n* AMZN - yesterday expanded partnership with BOX to bring generative Ai to enterprise content. Integrated Amazon Bedrock with models like Anthropic’s Claude  META - Bernstein raises price target to 675 from 600. \n* MSFT - CEO pay surges 63% to $79M in 2024. \n* MSFT - Bernstein rates outperform, PT 500. Said that story is well understood. Street will be looking at Azur growth, AI tailwind, sustainability of office 365 and margins. Said more products and services. They are bullish on these elements. \n* TSLA - MSUK SAYS REPORT FROM WSJ ABOUT REGULAT CONTACT WITH PUTIN IS NOT TRUE AT AL. \n\nOTHER STOCKS:\n\n* Chinese stocks higher as China’s top legislator will meet in early November amid hopes of more stimulus. \n* A number of stocks added to Oppenheimer’s Top ideas list. These include DKNG, AVGO, PINS, MA, TEAM. \n* Gold and silver stocks down slightly as Gold cools off, but is still just setting up for next leg higher. \n* CPRI tanking as their deal with Tapestry is blocked by the judge. Federal judge granted FTC’s preliminary injunction to block TPR’s acquisition of Capri.\n* On this news, Evercore ISI has raised their price target on TPR to 63 from 47. Rated at outperform. They said this is positive for TPR and whilst decision can be appealed, the stock will trade like the deal is off. \n* TSM - Chip yield at TSM’s Arizona Fab exceeds Taiwan’s\n* ONON moving higher in sentiment with Skechers. CROX the same\n* UNH - STAT+ report says that UNH is the leading insurer profiting form billions in QUESTIONABLE medicare payments. Bad PR. \n* TXN yesterday announced it is quadrupling production of gallium nitride power semiconductors . Basically quadrupled their capacity. Can sell more = bullish\n* DIS - raised at Goldman Sachs to 125 from 120, maintains at buy\n* VKTX - more positive coverage from Mizuho yesterday, \"The oral is the bigger deal, especially with Novo hiccups, Viking might slide into first or second position”. Said Viking would be a good take-over candidate for big Pharma\n* Boeing talks with Union ongoing\n* XRAY - Dentsply Sirona suspends sales and marketing of Byte aligners. Suspends sales of impression kits. Will assess next steps. Voluntary suspension as they review certain regulatory requirements\n* JBL - Apple supplier, JBL eyes 2 more India units with $275M investment. \n\nOTHER NEWS\n\n* China’s top legislators will meet on November 4-8 amid stimulus hopes. \n* JPM are bullish on Big tech earnings. Says that As we've seen withNFLX, NOW and VRT through earnings, investors are eager to defend or chase their winners, despite any earnings question marks—whether it’s a subs miss, cRPO miss, or bookings miss. This dynamic, combined with cleaner positioning, bodes well heading into next week's Mega Cap earnings.'",
        "created_utc": 1729855746.0,
        "subreddit_name": "DayTrading",
        "comments": 0
    },
    {
        "title": "Stock Market Today: Apple And Goldman Sachs Ordered To Pay More Than $89 Million + TKO Group To Acquire 3 Businesses From Endeavor For $3.25 billion",
        "score": 2,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gbhr8y/stock_market_today_apple_and_goldman_sachs/",
        "content": "* Stocks closed out a mixed day on Thursday. The Nasdaq jumped 0.8% thanks to Tesla’s blowout earnings, while the S&P 500 managed to claw back a 0.2% gain after spending some time in the red. The Dow wasn’t as lucky, dropping 150 points, as IBM’s disappointing revenue weighed it down.\n* Tesla’s strong report fueled tech optimism, giving investors hope for a solid earnings season. But not everyone was celebrating—broader concerns over rising rates and sluggish earnings kept the Dow in the red for a fourth straight session.\n\n# \n\n# Winners & Losers\n\n# What’s up 📈\n\n* **Tesla** surged 21.92% following the electric vehicle maker’s third-quarter profit beat. CEO Elon Musk forecasted that the company will see vehicle growth of 20% to 30% in 2025. ($TSLA)\n* **T-Mobile** delivered strong third-quarter results, beating analyst expectations for both revenue and profit. The telecommunications giant also provided an upbeat forecast, rising 5.71%. ($TMUS)\n* **ServiceNow** advanced 5.39% after posting third-quarter adjusted earnings of $3.72 per share, topping Wall Street’s estimate. Revenue also exceeded expectations. ($NOW)\n* **United Parcel Service** reported its first revenue and earnings gains in two years, sending its shares up 5.28%. ($UPS)\n* **KKR & Co.** became the fourth private-markets firm to eclipse $500 billion of fee-paying assets under management, moving further beyond its buyout roots. The stock increased 3.41%. ($KKR)\n\n# What’s down 📉\n\n* **TKO Group** fell 8.73% after announcing the acquisition of three businesses for $3.25 billion from its controlling owner, Endeavor Group. The deal will increase Endeavor’s ownership in TKO from 53% to 59%. ($TKO)\n* **Harley-Davidson** tumbled 7.21% as the motorcycle maker slashed third-quarter motorcycle shipments by almost 40% year-over-year due to an inventory glut. The company also cut its annual revenue forecast. ($HOG)\n* **IBM** dropped 6.17% after posting third-quarter revenue of $14.97 billion, missing analysts’ expectations of $15.07 billion. ($IBM)\n* **Tractor Supply** slumped 6.09% after reporting steady but slow growth, with Q3 revenue rising 2% year-over-year but same-store sales slipping by 0.2%. ($TSCO)\n* **Southwest Airlines** slid 5.56% following its third-quarter earnings report. Adjusted earnings totaled 15 cents per share, while revenue exceeded expectations. ($LUV)\n* **Keurig Dr Pepper** decreased 4.80% after its revenue missed analysts’ estimates amid slumping U.S. coffee sales. The company also announced plans to buy a 60% stake in energy-drink maker GHOST Beverages. ($KDP)\n* **Honeywell** fell 5.10% after missing revenue estimates for the third quarter, posting $9.73 billion compared to the expected $9.91 billion. ($HON)\n\n# \n\n# Apple And Goldman Sachs Ordered To Pay more Than $89 Million For Apple Card Failures\n\nApple’s reputation for intuitive design hit a snag with its Apple Card. \n\nPartnering with Goldman Sachs, Apple aimed to streamline credit card use, but the user experience didn't live up to expectations. The result? A hefty $89 million fine from the Consumer Financial Protection Bureau (CFPB) for mishandling consumer disputes and misleading customers about interest-free installment plans.\n\nThe fines, split between Apple and Goldman, come after issues that affected thousands of Apple Card users, particularly around dispute resolution and installment payment options.\n\n**Where Apple Fell Short**  \n  \nAt the heart of the problem was Apple's design for reporting billing errors. The process was supposed to be seamless, but many users were left frustrated when additional forms were required, and disputes weren’t properly sent to Goldman Sachs for investigation. \n\nOn top of that, Apple’s checkout process confused customers by not making it clear they needed to opt into interest-free payments for Apple products. This led to unexpected interest charges for many.\n\n**Goldman’s Role in the Mess**\n\nGoldman Sachs didn’t escape the CFPB’s scrutiny either. \n\nThe bank faced a slew of complaints over how it handled disputes once they were forwarded by Apple. Many disputes weren’t acknowledged within 30 days, and investigations often fell short of federal standards. \n\nThe situation was worsened by Goldman’s failure to communicate how refunds and interest-free payments would work, leading some customers to rack up unnecessary interest.\n\nWhile both Apple and Goldman have taken steps to resolve these issues, this situation serves as a cautionary tale about the risks of over-promising simplicity in financial products.\n\n# \n\n# Market Movements\n\n* 💼 **Boeing workers extend strike:** Boeing machinists overwhelmingly rejected a new labor deal, prolonging a strike that has stalled most aircraft production for over a month. The deal included a 35% wage increase and enhanced retirement contributions, but union members remained unsatisfied. This poses a significant challenge for Boeing’s new CEO Kelly Ortberg, who aimed to end the strike as part of his broader turnaround strategy.\n* ☕ **Starbucks' new CEO faces challenges:** Starbucks continues to struggle despite bringing in Chipotle veteran Brian Niccol as its new CEO. The coffee chain reported a 7% drop in same-store sales for Q3, marking the third consecutive quarterly decline. Niccol is focused on simplifying the menu and improving operations, but has a long road ahead, especially in China where competition from local chains is growing.\n* 🥤 **Keurig Dr Pepper makes a splash:** Keurig Dr Pepper is acquiring energy-drink maker Ghost for over $1B, marking its largest deal since its 2018 purchase of Dr Pepper Snapple. ($KDP)\n* 👓 **Apple cuts Vision Pro production:** Apple has significantly reduced production of its Vision Pro headset and may stop production of the current model by year-end, as it shifts focus toward developing more affordable versions. ($AAPL)\n* **🤖 Nvidia's India expansion:** Nvidia will supply AI processors to major Indian companies, including Reliance Industries, to power data centers and AI initiatives. ($NVDA) \n* **👜 Judge blocks Tapestry-Capri merger:** A federal court blocked Tapestry’s proposed $8.5 billion acquisition of Capri, citing FTC concerns over reduced competition and potential harm to consumers. ($TPR) ($CPRI)\n* **📊 U.S. economy set for strong growth:** Fresh data shows the U.S. economy is on track to grow at an annualized rate of 2.5% in Q4, driven by competitive pricing and a steady pace of business activity. The strong growth is easing recession fears. \n* **⚖️ Intel wins big in court:** Intel secured a victory as the E.U.’s top court ruled that the E.U. cannot reimpose a $1.14B antitrust fine related to alleged anticompetitive practices, ending a 15-year legal battle. ($INTC)\n* **🤖 AI tools expand at Morgan Stanley:** Morgan Stanley is ramping up its use of OpenAI-powered tools across its investment banking and trading divisions, aiming to enhance productivity. ($MS)\n* **✈️ Southwest avoids proxy fight:** Southwest Airlines and Elliott Investment Management are nearing a settlement that would grant Elliott several board seats, thus avoiding a proxy fight for control. ($LUV)\n* **💊 Novo Nordisk petitions FDA:** Novo Nordisk has asked the FDA to ban compounding pharmacies from producing cheaper versions of its popular weight loss and diabetes drugs, Wegovy and Ozempic, citing safety risks. ($NVO)\n\n# \n\n# TKO Group To Acquire 3 Businesses From Endeavor For $3.25 billion\n\nTKO Group, the owner of UFC and WWE, just went shopping—and they didn’t hold back. \n\nIn a $3.25 billion all-stock deal, TKO is scooping up three sports-related businesses from Endeavor Group: Professional Bull Riders (PBR), On Location, and IMG. Not only does this bolster TKO’s portfolio, but it also pushes Endeavor’s ownership stake in the company from 53% to a commanding 59%.\n\nThe deal isn’t just about grabbing new leagues. TKO’s getting a piece of the action in premium hospitality (On Location) and sports media rights (IMG). This move positions them as a heavyweight not only in sports leagues but in everything from ticket sales to media strategy. Sounds like TKO is aiming for a bigger slice of the sports entertainment pie.\n\n**TKO's Stock Buyback and Dividends: Sweet Deal for Investors**  \n  \nAlong with the big buy, TKO is treating its shareholders to a little extra love. The company announced plans to buy back up to $2 billion in stock and kick off quarterly dividends of $75 million. \n\nThat's a solid move considering TKO's cash-generating capabilities, and it sends a clear signal: they’re serious about rewarding their investors.\n\nTKO’s shares took a dip following the news, sliding 5.9% in early trading, but the long-term play seems geared toward solid growth. With UFC and WWE already under their belt, adding PBR and IMG only deepens TKO’s stronghold on live sports and media rights.\n\n**What’s Next for TKO?**  \n  \nAs TKO’s President, Mark Shapiro, pointed out, this is no small acquisition. PBR hosts over 200 events a year, while On Location is known for luxe packages at major sports spectacles like the Super Bowl and FIFA World Cup. \n\nIMG, on the other hand, is a major player in media rights deals for everything from the NFL to the English Premier League. That means TKO is moving beyond just operating leagues—they’re stepping into a full-scale sports entertainment empire.\n\nNo more shopping from Endeavor, though—at least for now. Shapiro made it clear that TKO’s not looking to buy more assets from its parent company. \n\nBut as Endeavor goes private, TKO seems primed to snatch up other opportunities in the sports and entertainment world, positioning themselves as a giant in the industry.\n\n# \n\n# On The Horizon\n\n# Tomorrow\n\nThe week fizzled out without much action on the economic front.\n\nDurable goods—think cars, washing machines, and industrial robots (maybe) —are the heavy hitters of the manufacturing world. Tracking orders for these big-ticket items gives us a snapshot of how businesses are feeling about their future. Are they investing in long-term assets, or tightening the purse strings?\n\nEconomists are predicting a 1% drop in orders this month, a sign that the manufacturing sector is still stuck in a rut after last month’s flat performance. Looks like the industry's struggle bus isn’t pulling into the station just yet.",
        "created_utc": 1729816284.0,
        "subreddit_name": "DayTrading",
        "comments": 0
    }
]