[
    {
        "title": "Musk now says it's 'pointless' to build a $25,000 Tesla for human drivers",
        "score": 754,
        "url": "https://www.reddit.com/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/",
        "content": "So, will there be any new car model for Tesla in 2025???\n\n&#x200B;\n\n**Musk now says it's 'pointless' to build a $25,000 Tesla for human drivers**\r  \n[https://www.reuters.com/business/autos-transportation/musk-now-says-its-pointless-build-25000-tesla-human-drivers-2024-11-05](https://www.reuters.com/business/autos-transportation/musk-now-says-its-pointless-build-25000-tesla-human-drivers-2024-11-05)\n\n&#x200B;\n\n*When Reuters reported in April that Tesla had scrapped plans for a long-promised, next-generation $25,000 electric vehicle, the automaker’s stock plunged. Chief Executive Elon Musk rushed to respond on X, his social-media network.*\r  \n*“Reuters is lying,” he posted, without elaborating. Tesla’s stock recovered some of its losses.*\r  \n*Six months later, Musk appears to have backed into an admission that Tesla dropped its plans for a human-driven $25,000 car. He said in an Oct. 23 earnings call that building the affordable EV would be \"pointless” unless the car was fully autonomous.*\r  \n*His latest remarks came in response to an investor asking: “When can we expect Tesla to give us the $25,000 non-robotaxi regular car model?”*\r  \n*Musk responded: “We’re not making a non-robo…,” before he was interrupted by another Tesla executive. Musk later added: “Basically, I think having a regular $25K model is pointless. It would be silly.”*\r  \n*The April 5 Reuters article reported that Tesla had abandoned plans for an all-new, affordable mass-market EV but still planned a self-driving robotaxi. Since then, Musk has increasingly touted plans for robotaxis and autonomous vehicles.*\r  \n*Tesla and Musk did not respond to requests for comment for this story.*\r  \n*On the October earnings call, Musk said that Tesla does plan a “$25K car” – its “Cybercab,” a two-door, two-seat, fully autonomous vehicle. Musk unveiled a prototype at a Hollywood-style event on Oct. 10.*\r  \n*Musk says Tesla will start production of the Cybercab in 2026, after it deploys fully autonomous versions of its current Model 3 and Model Y vehicles in Texas and California next year. The automaker faces steep technological, regulatory and legal challenges in delivering on Musk’s latest promises of fully autonomous vehicles, which echo others dating back about a decade.*\r  \n*An all-new affordable Tesla for human drivers had until recently been a linchpin of Tesla’s strategy to become the world’s biggest automaker. For several years, Tesla had a goal of producing 20 million vehicles a year by 2030, more than tenfold what it sells now and nearly double that of Toyota, the current global sales leader. In May, Tesla dropped the 20-million goal from its latest “impact report” on progress toward sustainability goals.*\r  \n*As recently as January of this year, Musk confirmed the plan for an all-new affordable EV in an earnings call. He said the next-generation vehicle would arrive in 2025 and launch a second major \"growth wave,” following the first wave with the release of its Model 3 and Model Y vehicles in 2017 and 2020, respectively.*\r  \n*Investors and Tesla fans commonly called the anticipated cheap car a “Model 2,” slotting in below the Model 3, currently the least-expensive Tesla, starting at $42,490.*\r  \n*In January, Musk described the all-new model as requiring “new revolutionary manufacturing technology.” But in April, after Reuters reported Tesla had scrapped the Model 2, Musk outlined a plan for “more affordable” models that could be produced “on the same manufacturing lines” as current Teslas.*\r  \n*Seth Goldstein, a Morningstar Research Services analyst, said he believes these less-expensive vehicles will be built on current Tesla platforms and priced in the mid-$30,000s.*\r  \n*“It was my understanding that the original plan was to make the more-affordable vehicle on a new platform,” he told Reuters. “I think Tesla realized they were late to making an affordable vehicle versus their Chinese-EV peers … So, they changed their strategy rather than make a large investment to produce a new vehicle.”*\r  \n*After the April 5 Reuters report that Tesla had killed the Model 2, Musk posted that day on X saying Tesla planned a “robotaxi unveil” in August. The event, delayed until October and held on a movie set near Los Angeles, underwhelmed Wall Street and drove a 9% drop in Tesla shares the following day.*\r  \n*Some investors viewed Musk’s comments on the Cybercab – along with displays of an autonomous “Robovan” concept and humanoid robots – as short on concrete details about the products. Tesla hasn’t said whether the Cybercab will feature new self-driving technology beyond the company’s “Full Self-Driving” feature in its current vehicles. Its existing models can’t fully drive themselves and require a human driver paying strict attention.*\r  \n*The target market for the Cybercab isn’t clear. The Cybercab’s sports-car looks and two-door, two-seat configuration – a nearly extinct layout in the wider U.S. auto market – puzzled some analysts who expected a robotaxi with more room for passengers and luggage.*\r  \n*Musk, in the October earnings call, said the concept vehicle’s design was “optimized for autonomy” and would also deliver affordability.*\r  \n*“It will cost … roughly 25K, so it is a 25K car,” Musk said. “It just won't have a steering wheel and pedals.”*",
        "created_utc": 1730815541.0,
        "subreddit_name": "stocks",
        "comments": 382
    },
    {
        "title": "Which Earning Reports Have Impressed You?",
        "score": 137,
        "url": "https://www.reddit.com/r/stocks/comments/1gk38ce/which_earning_reports_have_impressed_you/",
        "content": "For quick example, Google crushed it, TSM crushed it, PLTR crushed it, META crushed it, RDDT crushed it.\n\nWhat are some favorites you're watching which have had great ER reports so far this season? What did you like? Maybe lesser known companies which beat and did well?",
        "created_utc": 1730800597.0,
        "subreddit_name": "stocks",
        "comments": 106
    },
    {
        "title": "Does anyone have an inverse Reddit portfolio?",
        "score": 116,
        "url": "https://www.reddit.com/r/stocks/comments/1gkbnqg/does_anyone_have_an_inverse_reddit_portfolio/",
        "content": "Ever since Reddit’s emotional hive mind thought META was going to $0, I’ve learned it’s usually good to bet against it. What stocks have given you the most success that Reddit hates for emotional reasons?",
        "created_utc": 1730826505.0,
        "subreddit_name": "stocks",
        "comments": 86
    },
    {
        "title": "Super Micro Computer- SMCI $26 - Avoid Till We Get Restated Financials",
        "score": 94,
        "url": "https://www.reddit.com/r/stocks/comments/1gkgqx3/super_micro_computer_smci_26_avoid_till_we_get/",
        "content": "**I think Super Micro Computer, (SMCI) should be avoided for the following reasons:**\n\n**Restatements could alter the financials significantly:** The odds are high that the company will end up restating past financials. The Auditor’s resignation, its CEO’s pay package, and its past settlement with the SEC in 2018 all suggest that SMCI will have to restate its financial statements.\n\n**No 10K:** SMCI has delayed its annual 10-K filing and without an audited 10K, we have precious little faith in the numbers. \n\n**SMCI has priors:** This was not their first time. In 2018, the company settled charges with the [SEC for improper accounting](https://www.sec.gov/newsroom/press-releases/2020-190). As stated in the article from the SEC website….\n\n>\n\n**Tainted:** To me the alleged malfeasance creates significant doubts for investors that will not go away for a while, and it's very likely that Wall Street will not touch it, fearing liability for not doing enough due diligence. Also, I can’t imagine SMCI getting a decent multiple in the future for the same reasons until faith is restored in management and its books.\n\n**Possible Loan Default:**  There is a significant risk of Super Micro defaulting on the company's Term Loan Agreement with Bank of America. \n\n**Compensation tied to aggressive revenue targets**: The CEO’s unusual compensation package, with virtually no base salary and bonuses tied to very aggressive revenue and share price targets, is a dangerous and potentially abusive practice.\n\n**Possible delisting from the Nasdaq, and getting thrown out of the S&P 500**: The chances of both are high as a new auditor needs to be found, and a substantial amount of restatement work needs to be done.\n\n**A great business:** Sure, SMCI has a great server liquid cooling business, which has tremendous potential and demand for server racks for AI GPUs, right now and for the foreseeable future. However, as we saw Nvidia has already started shifting this business.\n\n**Ignore the low valuation:** I’m going to ignore the current low valuation of 8x earnings and 0.5x sales, which are much lower than competitors such as Dell (DELL) and Oracle (ORCL), simply because I have no idea what the restated financials will look like, and the valuation could be a lot different\n\nThe only way I would invest is the possibility of a merger/acquisition/White Knight, that will keep the stock afloat. The CEO owns close to 10% of the company so I doubt if he would let this go without a fight.\n\nThe other problem I foresee is the difficulty of getting good and timely information. For the most part, we rely on analysts who expect a proper set of books. Instead of focusing on the fundamentals, we’ll be spending far too much time, and worse without success trying to figure out what is genuine or not, It would make better sense to invest in other GPU/semiconductor businesses. ",
        "created_utc": 1730839261.0,
        "subreddit_name": "stocks",
        "comments": 50
    },
    {
        "title": "Do I sell my stock and dump the money into ETFs like VOO and VIG?",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gk9vg0/do_i_sell_my_stock_and_dump_the_money_into_etfs/",
        "content": "My YTD return on my portfolio is currently 12.6% compared to VOO at 21.81% or VIG at 15.79%. I am a long-term investor and my thesis for each stock still holds strong, but I am certainly drawn to the higher returns and diversification in ETFs. Should I maintain my current holdings and continue to dump future money into ETFs or just sell now, and put all of the money into ETFs? Some of my stocks include NVIDIA, Delta, Disney, Amazon, American Express, Capital One, HCA, and others to list a few. ",
        "created_utc": 1730822017.0,
        "subreddit_name": "stocks",
        "comments": 33
    },
    {
        "title": "Remember remember the 5th of November",
        "score": 90,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gk4gj2/remember_remember_the_5th_of_november/",
        "content": "SIRI has done that split-off with Liberty Media and Berkshire Hathaway just increased their stake to 33%. SiriusXM has more users than Spotify when including Pandora and is sitting rather undervalued ie. Warren Buffet takes advantage. And he’s picky. Something appears to be cooking. Acquisition target? Cause the ER wasn’t that good and he’s not really the yolo’ing kind is he?\n\nKeep in mind the recent reverse split. You don’t want to buy those cause that’s the pennystock playbook. However, in rare cases prior to an acquisition it may be a term for the acquisition itself to take place. They had no non-compliamce issues and the price was not below $2 pre-split. \n\nSo that is clearly unusual. When a reverse split, which is THE most important tool for scamming predators, appears to NOT be used for the sole intent of diluting to get paid and live like kings, that sticks out to me. I know how pennystocks operate and this is not how.\n\nEx-date is today Nov 5 and I’ve heard something about FTD’s outstanding. Can anyone confirm?\n\nI’m not saying it will go to the moon and not before a 30% drop. Maybe it’s too obvious to happen idk. Or maybe we’re supposed to think it’s too obvious to happen so we’re like “naah” and then when it happens we’re like “God damn it I knew it!”. \n\nEither way I see it as a stamp of approval and I started a small position Friday in the PM. I hope it’ll drop honestly. I’d like a larger position in this particular case. And Yesterday it did drop so I’ve added a little bit more.\nNot easy to find a good management and Warren Buffet is known for his and Charlie Munger’s need to like a company’s management and the way they run the business.\n\nEDIT: The 200MA on the 1hr chart or 50MA on the 4hr chart MAY provide support. Placed a little extra buy order at 25 if/when it closes the gap.\n\nGOLD EDIT: My man just brought it to my attention that their new Sirius 360L and OEM radios transmit and receive on a decent bandwith. Perfect for telemetry, diagnostics, GPS - data that is valuable to first responders, insurance companies, law enforement etc.\nAnd they have a legal monopoly in satellite radio. \n\nTHAT’s what Berkshire Hathaway sees coming - the value of the data only SiriusXM can provide. Meet the next generation of road safety:\n[RapidSOS](https://rapidsos.com/the-next-generation-of-road-safety-sirius-xm-and-rapidsos/)\n\nNews from Nov 14\nhttps://www.idaireland.com/latest-news/press-release/siriusxm-opens-dublin-technology-hub\n\n[Sirius is hiring a Senior Security Incident Response Engineer](https://imgur.com/a/HLPKyKV)\n\n[“Sirius is a legal monopoly”](https://www.fool.com/investing/2024/11/04/1-stock-split-stock-to-buy-in-november-2-to-avoid/)\n\n[Maintained at Outperform with a $40/share by Barrington Research](https://www.tradingview.com/news/DJN_DN20241104007623:0/)\n\n[After Its Reverse Stock Split, Is SiriusXM Satellite Radio a Buy?](https://finance.yahoo.com/news/reverse-stock-split-siriusxm-satellite-154100152.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmRrLw&guce_referrer_sig=AQAAAJTi3290W4fe_e_MrmJjxBJCraylAsodWVjitdyapgHy2VLnLr4jiDZgdBmqPbG3rJ-w3lHTT_O_s77nknuv4a6nhkYFIT_K3ISu03YG5uvTrhwa6FJP4hh-mvURjMSAdPZAuJuMFOr3zWGWM8_5DjVwSmRSmysxjfRRrD3sG_P2)\n",
        "created_utc": 1730805796.0,
        "subreddit_name": "wallstreetbets",
        "comments": 62
    },
    {
        "title": "For the first time ever, AMD outsells Intel in the datacenter space",
        "score": 243,
        "url": "https://www.reddit.com/r/investing/comments/1gke6xh/for_the_first_time_ever_amd_outsells_intel_in_the/",
        "content": "https://www.tomshardware.com/pc-components/cpus/for-the-first-time-ever-amd-outsells-intel-in-the-datacenter-space\n\n> AMD's datacenter segment revenue reached $3.549 billion in the third quarter, whereas Intel's datacenter and AI group's earnings were $3.3 billion in Q3 2024. Just two years ago, Intel's DCAI group earned $5 billion - $6 billion per quarter. But as AMD's EPYC processors have gained competitive advantages over Intel's Xeon CPUs, Intel has had to sell its server chips at significant discounts, which has reduced the company's revenue and profit margins.\n> \n> It is noteworthy that Intel's flagship 128-core Xeon 6980P 'Granite Rapids' processor costs $17,800, making it the company's most expensive standard CPU ever. By contrast, AMD's most expensive 96-core EPYC 6979P processor costs $11,805. If demand for Intel's Xeon 6900-series processors remains high and the company can supply these CPUs in decent volumes, then Intel's datacenter revenue will likely get back on track and surpass AMD's datacenter sales. However, Intel still has to ramp up production of its Granite Rapids products. ",
        "created_utc": 1730832811.0,
        "subreddit_name": "investing",
        "comments": 4
    },
    {
        "title": "Stocks tracker app - Yahoo Finance alternative, so done with them ",
        "score": 1,
        "url": "https://www.reddit.com/r/investing/comments/1gk0k4b/stocks_tracker_app_yahoo_finance_alternative_so/",
        "content": "Yahoo Finance keeps breaking what's not broken. Been using them for years...\n\nRecent changes - adding \"for you\" tab on home page that takes almost one third of the view away (WTF yahoo are you doing) and removing multiple portfolios view on a single page in collapsing mode, made me looking for another alternative. I need app with clean UI that shows pre / after market price movement and allows to build multiple watchlists on a single page if possible. Any similar alternatives on the market?\n\n\n\n\n\n\nUpdate: if you use YF app and don't like recent UI revamp keep complaining in the reviews on Apple / google store about what you don't like. They generally listen. It's just amazing that these changes that decrease usability are approved to be deployed into Production. I guess UI designers / product managers need to stay busy but come on. ",
        "created_utc": 1730788268.0,
        "subreddit_name": "investing",
        "comments": 5
    },
    {
        "title": "The M4 Mac mini could be the best offer Apple has ever made PC switchers",
        "score": 1914,
        "url": "https://9to5mac.com/2024/11/05/the-m4-mac-mini-could-be-the-best-offer-apple-has-ever-made-pc-switchers/",
        "content": "",
        "created_utc": 1730831234.0,
        "subreddit_name": "apple",
        "comments": 341
    },
    {
        "title": "Apple News will use Live Activities to track election results live on iPhone",
        "score": 1717,
        "url": "https://appleinsider.com/articles/24/11/04/apple-news-will-use-live-activities-to-track-election-results-live-on-iphone",
        "content": "",
        "created_utc": 1730778461.0,
        "subreddit_name": "apple",
        "comments": 225
    },
    {
        "title": "Rumor: Apple developing 90Hz display tech for iPad Air, Studio Display, and iMac",
        "score": 1259,
        "url": "https://9to5mac.com/2024/11/04/rumor-90hz-display-imac-studio-display-ipad-air/",
        "content": "",
        "created_utc": 1730769663.0,
        "subreddit_name": "apple",
        "comments": 326
    },
    {
        "title": "Why GM is ditching Apple CarPlay, with software boss Baris Cetinok",
        "score": 950,
        "url": "https://www.theverge.com/24285581/gm-software-baris-cetinok-apple-carplay-android-auto-google-cars-evs-decoder-podcast",
        "content": "",
        "created_utc": 1730823824.0,
        "subreddit_name": "apple",
        "comments": 637
    },
    {
        "title": "Apple Silicon Unified Memory: How Much Mac RAM Do You Need?",
        "score": 625,
        "url": "https://www.macrumors.com/guide/how-much-mac-ram/",
        "content": "",
        "created_utc": 1730826985.0,
        "subreddit_name": "apple",
        "comments": 343
    },
    {
        "title": "Apple offers Indonesia US$10 million sweetener to reverse its iPhone ban",
        "score": 529,
        "url": "https://www.scmp.com/news/asia/southeast-asia/article/3285194/apple-offers-indonesia-us10-million-sweetener-reverse-its-iphone-ban",
        "content": "",
        "created_utc": 1730795947.0,
        "subreddit_name": "apple",
        "comments": 60
    },
    {
        "title": "Apple Preparing for Upcoming Siri Onscreen Awareness Feature With New iOS 18.2 API for Developers",
        "score": 298,
        "url": "https://www.macrumors.com/2024/11/04/apple-onscreen-awareness-ios-18-2-api-developers/",
        "content": "",
        "created_utc": 1730775216.0,
        "subreddit_name": "apple",
        "comments": 18
    },
    {
        "title": "Google may bring its file sharing client to Apple devices so you can transfer files to and from iPhones and MacBooks",
        "score": 225,
        "url": "https://www.androidauthority.com/quick-share-for-ios-macos-rumor-3496057/",
        "content": "",
        "created_utc": 1730826442.0,
        "subreddit_name": "apple",
        "comments": 39
    },
    {
        "title": "Apple to Face First EU Fine Under Bloc’s Digital Markets Act",
        "score": 171,
        "url": "https://www.bloomberg.com/news/articles/2024-11-05/apple-to-face-first-eu-fine-under-bloc-s-digital-markets-act",
        "content": "",
        "created_utc": 1730842973.0,
        "subreddit_name": "apple",
        "comments": 136
    },
    {
        "title": "Daily Advice Thread - November 05, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/apple/comments/1gk4401/daily_advice_thread_november_05_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1730804428.0,
        "subreddit_name": "apple",
        "comments": 42
    }
]