[
    {
        "title": "Musk now says it's 'pointless' to build a $25,000 Tesla for human drivers",
        "score": 754,
        "url": "https://www.reddit.com/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/",
        "content": "So, will there be any new car model for Tesla in 2025???\n\n&#x200B;\n\n**Musk now says it's 'pointless' to build a $25,000 Tesla for human drivers**\r  \n[https://www.reuters.com/business/autos-transportation/musk-now-says-its-pointless-build-25000-tesla-human-drivers-2024-11-05](https://www.reuters.com/business/autos-transportation/musk-now-says-its-pointless-build-25000-tesla-human-drivers-2024-11-05)\n\n&#x200B;\n\n*When Reuters reported in April that Tesla had scrapped plans for a long-promised, next-generation $25,000 electric vehicle, the automaker’s stock plunged. Chief Executive Elon Musk rushed to respond on X, his social-media network.*\r  \n*“Reuters is lying,” he posted, without elaborating. Tesla’s stock recovered some of its losses.*\r  \n*Six months later, Musk appears to have backed into an admission that Tesla dropped its plans for a human-driven $25,000 car. He said in an Oct. 23 earnings call that building the affordable EV would be \"pointless” unless the car was fully autonomous.*\r  \n*His latest remarks came in response to an investor asking: “When can we expect Tesla to give us the $25,000 non-robotaxi regular car model?”*\r  \n*Musk responded: “We’re not making a non-robo…,” before he was interrupted by another Tesla executive. Musk later added: “Basically, I think having a regular $25K model is pointless. It would be silly.”*\r  \n*The April 5 Reuters article reported that Tesla had abandoned plans for an all-new, affordable mass-market EV but still planned a self-driving robotaxi. Since then, Musk has increasingly touted plans for robotaxis and autonomous vehicles.*\r  \n*Tesla and Musk did not respond to requests for comment for this story.*\r  \n*On the October earnings call, Musk said that Tesla does plan a “$25K car” – its “Cybercab,” a two-door, two-seat, fully autonomous vehicle. Musk unveiled a prototype at a Hollywood-style event on Oct. 10.*\r  \n*Musk says Tesla will start production of the Cybercab in 2026, after it deploys fully autonomous versions of its current Model 3 and Model Y vehicles in Texas and California next year. The automaker faces steep technological, regulatory and legal challenges in delivering on Musk’s latest promises of fully autonomous vehicles, which echo others dating back about a decade.*\r  \n*An all-new affordable Tesla for human drivers had until recently been a linchpin of Tesla’s strategy to become the world’s biggest automaker. For several years, Tesla had a goal of producing 20 million vehicles a year by 2030, more than tenfold what it sells now and nearly double that of Toyota, the current global sales leader. In May, Tesla dropped the 20-million goal from its latest “impact report” on progress toward sustainability goals.*\r  \n*As recently as January of this year, Musk confirmed the plan for an all-new affordable EV in an earnings call. He said the next-generation vehicle would arrive in 2025 and launch a second major \"growth wave,” following the first wave with the release of its Model 3 and Model Y vehicles in 2017 and 2020, respectively.*\r  \n*Investors and Tesla fans commonly called the anticipated cheap car a “Model 2,” slotting in below the Model 3, currently the least-expensive Tesla, starting at $42,490.*\r  \n*In January, Musk described the all-new model as requiring “new revolutionary manufacturing technology.” But in April, after Reuters reported Tesla had scrapped the Model 2, Musk outlined a plan for “more affordable” models that could be produced “on the same manufacturing lines” as current Teslas.*\r  \n*Seth Goldstein, a Morningstar Research Services analyst, said he believes these less-expensive vehicles will be built on current Tesla platforms and priced in the mid-$30,000s.*\r  \n*“It was my understanding that the original plan was to make the more-affordable vehicle on a new platform,” he told Reuters. “I think Tesla realized they were late to making an affordable vehicle versus their Chinese-EV peers … So, they changed their strategy rather than make a large investment to produce a new vehicle.”*\r  \n*After the April 5 Reuters report that Tesla had killed the Model 2, Musk posted that day on X saying Tesla planned a “robotaxi unveil” in August. The event, delayed until October and held on a movie set near Los Angeles, underwhelmed Wall Street and drove a 9% drop in Tesla shares the following day.*\r  \n*Some investors viewed Musk’s comments on the Cybercab – along with displays of an autonomous “Robovan” concept and humanoid robots – as short on concrete details about the products. Tesla hasn’t said whether the Cybercab will feature new self-driving technology beyond the company’s “Full Self-Driving” feature in its current vehicles. Its existing models can’t fully drive themselves and require a human driver paying strict attention.*\r  \n*The target market for the Cybercab isn’t clear. The Cybercab’s sports-car looks and two-door, two-seat configuration – a nearly extinct layout in the wider U.S. auto market – puzzled some analysts who expected a robotaxi with more room for passengers and luggage.*\r  \n*Musk, in the October earnings call, said the concept vehicle’s design was “optimized for autonomy” and would also deliver affordability.*\r  \n*“It will cost … roughly 25K, so it is a 25K car,” Musk said. “It just won't have a steering wheel and pedals.”*",
        "created_utc": 1730815541.0,
        "subreddit_name": "stocks",
        "comments": 382
    },
    {
        "title": "Which Earning Reports Have Impressed You?",
        "score": 137,
        "url": "https://www.reddit.com/r/stocks/comments/1gk38ce/which_earning_reports_have_impressed_you/",
        "content": "For quick example, Google crushed it, TSM crushed it, PLTR crushed it, META crushed it, RDDT crushed it.\n\nWhat are some favorites you're watching which have had great ER reports so far this season? What did you like? Maybe lesser known companies which beat and did well?",
        "created_utc": 1730800597.0,
        "subreddit_name": "stocks",
        "comments": 106
    },
    {
        "title": "Does anyone have an inverse Reddit portfolio?",
        "score": 116,
        "url": "https://www.reddit.com/r/stocks/comments/1gkbnqg/does_anyone_have_an_inverse_reddit_portfolio/",
        "content": "Ever since Reddit’s emotional hive mind thought META was going to $0, I’ve learned it’s usually good to bet against it. What stocks have given you the most success that Reddit hates for emotional reasons?",
        "created_utc": 1730826505.0,
        "subreddit_name": "stocks",
        "comments": 86
    },
    {
        "title": "Super Micro Computer- SMCI $26 - Avoid Till We Get Restated Financials",
        "score": 94,
        "url": "https://www.reddit.com/r/stocks/comments/1gkgqx3/super_micro_computer_smci_26_avoid_till_we_get/",
        "content": "**I think Super Micro Computer, (SMCI) should be avoided for the following reasons:**\n\n**Restatements could alter the financials significantly:** The odds are high that the company will end up restating past financials. The Auditor’s resignation, its CEO’s pay package, and its past settlement with the SEC in 2018 all suggest that SMCI will have to restate its financial statements.\n\n**No 10K:** SMCI has delayed its annual 10-K filing and without an audited 10K, we have precious little faith in the numbers. \n\n**SMCI has priors:** This was not their first time. In 2018, the company settled charges with the [SEC for improper accounting](https://www.sec.gov/newsroom/press-releases/2020-190). As stated in the article from the SEC website….\n\n>\n\n**Tainted:** To me the alleged malfeasance creates significant doubts for investors that will not go away for a while, and it's very likely that Wall Street will not touch it, fearing liability for not doing enough due diligence. Also, I can’t imagine SMCI getting a decent multiple in the future for the same reasons until faith is restored in management and its books.\n\n**Possible Loan Default:**  There is a significant risk of Super Micro defaulting on the company's Term Loan Agreement with Bank of America. \n\n**Compensation tied to aggressive revenue targets**: The CEO’s unusual compensation package, with virtually no base salary and bonuses tied to very aggressive revenue and share price targets, is a dangerous and potentially abusive practice.\n\n**Possible delisting from the Nasdaq, and getting thrown out of the S&P 500**: The chances of both are high as a new auditor needs to be found, and a substantial amount of restatement work needs to be done.\n\n**A great business:** Sure, SMCI has a great server liquid cooling business, which has tremendous potential and demand for server racks for AI GPUs, right now and for the foreseeable future. However, as we saw Nvidia has already started shifting this business.\n\n**Ignore the low valuation:** I’m going to ignore the current low valuation of 8x earnings and 0.5x sales, which are much lower than competitors such as Dell (DELL) and Oracle (ORCL), simply because I have no idea what the restated financials will look like, and the valuation could be a lot different\n\nThe only way I would invest is the possibility of a merger/acquisition/White Knight, that will keep the stock afloat. The CEO owns close to 10% of the company so I doubt if he would let this go without a fight.\n\nThe other problem I foresee is the difficulty of getting good and timely information. For the most part, we rely on analysts who expect a proper set of books. Instead of focusing on the fundamentals, we’ll be spending far too much time, and worse without success trying to figure out what is genuine or not, It would make better sense to invest in other GPU/semiconductor businesses. ",
        "created_utc": 1730839261.0,
        "subreddit_name": "stocks",
        "comments": 50
    },
    {
        "title": "Do I sell my stock and dump the money into ETFs like VOO and VIG?",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gk9vg0/do_i_sell_my_stock_and_dump_the_money_into_etfs/",
        "content": "My YTD return on my portfolio is currently 12.6% compared to VOO at 21.81% or VIG at 15.79%. I am a long-term investor and my thesis for each stock still holds strong, but I am certainly drawn to the higher returns and diversification in ETFs. Should I maintain my current holdings and continue to dump future money into ETFs or just sell now, and put all of the money into ETFs? Some of my stocks include NVIDIA, Delta, Disney, Amazon, American Express, Capital One, HCA, and others to list a few. ",
        "created_utc": 1730822017.0,
        "subreddit_name": "stocks",
        "comments": 33
    },
    {
        "title": "Remember remember the 5th of November",
        "score": 90,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gk4gj2/remember_remember_the_5th_of_november/",
        "content": "SIRI has done that split-off with Liberty Media and Berkshire Hathaway just increased their stake to 33%. SiriusXM has more users than Spotify when including Pandora and is sitting rather undervalued ie. Warren Buffet takes advantage. And he’s picky. Something appears to be cooking. Acquisition target? Cause the ER wasn’t that good and he’s not really the yolo’ing kind is he?\n\nKeep in mind the recent reverse split. You don’t want to buy those cause that’s the pennystock playbook. However, in rare cases prior to an acquisition it may be a term for the acquisition itself to take place. They had no non-compliamce issues and the price was not below $2 pre-split. \n\nSo that is clearly unusual. When a reverse split, which is THE most important tool for scamming predators, appears to NOT be used for the sole intent of diluting to get paid and live like kings, that sticks out to me. I know how pennystocks operate and this is not how.\n\nEx-date is today Nov 5 and I’ve heard something about FTD’s outstanding. Can anyone confirm?\n\nI’m not saying it will go to the moon and not before a 30% drop. Maybe it’s too obvious to happen idk. Or maybe we’re supposed to think it’s too obvious to happen so we’re like “naah” and then when it happens we’re like “God damn it I knew it!”. \n\nEither way I see it as a stamp of approval and I started a small position Friday in the PM. I hope it’ll drop honestly. I’d like a larger position in this particular case. And Yesterday it did drop so I’ve added a little bit more.\nNot easy to find a good management and Warren Buffet is known for his and Charlie Munger’s need to like a company’s management and the way they run the business.\n\nEDIT: The 200MA on the 1hr chart or 50MA on the 4hr chart MAY provide support. Placed a little extra buy order at 25 if/when it closes the gap.\n\nGOLD EDIT: My man just brought it to my attention that their new Sirius 360L and OEM radios transmit and receive on a decent bandwith. Perfect for telemetry, diagnostics, GPS - data that is valuable to first responders, insurance companies, law enforement etc.\nAnd they have a legal monopoly in satellite radio. \n\nTHAT’s what Berkshire Hathaway sees coming - the value of the data only SiriusXM can provide. Meet the next generation of road safety:\n[RapidSOS](https://rapidsos.com/the-next-generation-of-road-safety-sirius-xm-and-rapidsos/)\n\nNews from Nov 14\nhttps://www.idaireland.com/latest-news/press-release/siriusxm-opens-dublin-technology-hub\n\n[Sirius is hiring a Senior Security Incident Response Engineer](https://imgur.com/a/HLPKyKV)\n\n[“Sirius is a legal monopoly”](https://www.fool.com/investing/2024/11/04/1-stock-split-stock-to-buy-in-november-2-to-avoid/)\n\n[Maintained at Outperform with a $40/share by Barrington Research](https://www.tradingview.com/news/DJN_DN20241104007623:0/)\n\n[After Its Reverse Stock Split, Is SiriusXM Satellite Radio a Buy?](https://finance.yahoo.com/news/reverse-stock-split-siriusxm-satellite-154100152.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmRrLw&guce_referrer_sig=AQAAAJTi3290W4fe_e_MrmJjxBJCraylAsodWVjitdyapgHy2VLnLr4jiDZgdBmqPbG3rJ-w3lHTT_O_s77nknuv4a6nhkYFIT_K3ISu03YG5uvTrhwa6FJP4hh-mvURjMSAdPZAuJuMFOr3zWGWM8_5DjVwSmRSmysxjfRRrD3sG_P2)\n",
        "created_utc": 1730805796.0,
        "subreddit_name": "wallstreetbets",
        "comments": 62
    },
    {
        "title": "For the first time ever, AMD outsells Intel in the datacenter space",
        "score": 243,
        "url": "https://www.reddit.com/r/investing/comments/1gke6xh/for_the_first_time_ever_amd_outsells_intel_in_the/",
        "content": "https://www.tomshardware.com/pc-components/cpus/for-the-first-time-ever-amd-outsells-intel-in-the-datacenter-space\n\n> AMD's datacenter segment revenue reached $3.549 billion in the third quarter, whereas Intel's datacenter and AI group's earnings were $3.3 billion in Q3 2024. Just two years ago, Intel's DCAI group earned $5 billion - $6 billion per quarter. But as AMD's EPYC processors have gained competitive advantages over Intel's Xeon CPUs, Intel has had to sell its server chips at significant discounts, which has reduced the company's revenue and profit margins.\n> \n> It is noteworthy that Intel's flagship 128-core Xeon 6980P 'Granite Rapids' processor costs $17,800, making it the company's most expensive standard CPU ever. By contrast, AMD's most expensive 96-core EPYC 6979P processor costs $11,805. If demand for Intel's Xeon 6900-series processors remains high and the company can supply these CPUs in decent volumes, then Intel's datacenter revenue will likely get back on track and surpass AMD's datacenter sales. However, Intel still has to ramp up production of its Granite Rapids products. ",
        "created_utc": 1730832811.0,
        "subreddit_name": "investing",
        "comments": 4
    },
    {
        "title": "Stocks tracker app - Yahoo Finance alternative, so done with them ",
        "score": 1,
        "url": "https://www.reddit.com/r/investing/comments/1gk0k4b/stocks_tracker_app_yahoo_finance_alternative_so/",
        "content": "Yahoo Finance keeps breaking what's not broken. Been using them for years...\n\nRecent changes - adding \"for you\" tab on home page that takes almost one third of the view away (WTF yahoo are you doing) and removing multiple portfolios view on a single page in collapsing mode, made me looking for another alternative. I need app with clean UI that shows pre / after market price movement and allows to build multiple watchlists on a single page if possible. Any similar alternatives on the market?\n\n\n\n\n\n\nUpdate: if you use YF app and don't like recent UI revamp keep complaining in the reviews on Apple / google store about what you don't like. They generally listen. It's just amazing that these changes that decrease usability are approved to be deployed into Production. I guess UI designers / product managers need to stay busy but come on. ",
        "created_utc": 1730788268.0,
        "subreddit_name": "investing",
        "comments": 5
    },
    {
        "title": "The M4 Mac mini could be the best offer Apple has ever made PC switchers",
        "score": 1914,
        "url": "https://9to5mac.com/2024/11/05/the-m4-mac-mini-could-be-the-best-offer-apple-has-ever-made-pc-switchers/",
        "content": "",
        "created_utc": 1730831234.0,
        "subreddit_name": "apple",
        "comments": 341
    },
    {
        "title": "Apple News will use Live Activities to track election results live on iPhone",
        "score": 1717,
        "url": "https://appleinsider.com/articles/24/11/04/apple-news-will-use-live-activities-to-track-election-results-live-on-iphone",
        "content": "",
        "created_utc": 1730778461.0,
        "subreddit_name": "apple",
        "comments": 225
    },
    {
        "title": "Rumor: Apple developing 90Hz display tech for iPad Air, Studio Display, and iMac",
        "score": 1259,
        "url": "https://9to5mac.com/2024/11/04/rumor-90hz-display-imac-studio-display-ipad-air/",
        "content": "",
        "created_utc": 1730769663.0,
        "subreddit_name": "apple",
        "comments": 326
    },
    {
        "title": "Why GM is ditching Apple CarPlay, with software boss Baris Cetinok",
        "score": 950,
        "url": "https://www.theverge.com/24285581/gm-software-baris-cetinok-apple-carplay-android-auto-google-cars-evs-decoder-podcast",
        "content": "",
        "created_utc": 1730823824.0,
        "subreddit_name": "apple",
        "comments": 637
    },
    {
        "title": "Apple Silicon Unified Memory: How Much Mac RAM Do You Need?",
        "score": 625,
        "url": "https://www.macrumors.com/guide/how-much-mac-ram/",
        "content": "",
        "created_utc": 1730826985.0,
        "subreddit_name": "apple",
        "comments": 343
    },
    {
        "title": "Apple offers Indonesia US$10 million sweetener to reverse its iPhone ban",
        "score": 529,
        "url": "https://www.scmp.com/news/asia/southeast-asia/article/3285194/apple-offers-indonesia-us10-million-sweetener-reverse-its-iphone-ban",
        "content": "",
        "created_utc": 1730795947.0,
        "subreddit_name": "apple",
        "comments": 60
    },
    {
        "title": "Apple Preparing for Upcoming Siri Onscreen Awareness Feature With New iOS 18.2 API for Developers",
        "score": 298,
        "url": "https://www.macrumors.com/2024/11/04/apple-onscreen-awareness-ios-18-2-api-developers/",
        "content": "",
        "created_utc": 1730775216.0,
        "subreddit_name": "apple",
        "comments": 18
    },
    {
        "title": "Google may bring its file sharing client to Apple devices so you can transfer files to and from iPhones and MacBooks",
        "score": 225,
        "url": "https://www.androidauthority.com/quick-share-for-ios-macos-rumor-3496057/",
        "content": "",
        "created_utc": 1730826442.0,
        "subreddit_name": "apple",
        "comments": 39
    },
    {
        "title": "Apple to Face First EU Fine Under Bloc’s Digital Markets Act",
        "score": 171,
        "url": "https://www.bloomberg.com/news/articles/2024-11-05/apple-to-face-first-eu-fine-under-bloc-s-digital-markets-act",
        "content": "",
        "created_utc": 1730842973.0,
        "subreddit_name": "apple",
        "comments": 136
    },
    {
        "title": "Daily Advice Thread - November 05, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/apple/comments/1gk4401/daily_advice_thread_november_05_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1730804428.0,
        "subreddit_name": "apple",
        "comments": 42
    },
    {
        "title": "Apple offers Indonesia US$10 million sweetener to reverse its iPhone ban",
        "score": 347,
        "url": "https://www.scmp.com/news/asia/southeast-asia/article/3285194/apple-offers-indonesia-us10-million-sweetener-reverse-its-iphone-ban?utm_source=rss_feed",
        "content": "",
        "created_utc": 1730777335.0,
        "subreddit_name": "technology",
        "comments": 61
    },
    {
        "title": "\"Apple Intelligence is not available when starting your Mac from an external volume.\"",
        "score": 34,
        "url": "https://www.reddit.com/r/mac/comments/1gk8ylz/apple_intelligence_is_not_available_when_starting/",
        "content": "Just got this message in settings after updating to the Dev 15.2 Beta 2 on my base M2 Max Studio, I haven't been on any of the other betas until now.\n\nIronic that my external storage is larger & faster than the base internal storage is.  \nGuess I'm not going to be using AI anytime soon ¯\\\\\\_(ツ)\\_/¯",
        "created_utc": 1730819654.0,
        "subreddit_name": "mac",
        "comments": 21
    },
    {
        "title": "is this MacBook Pro 16” worth the price?",
        "score": 28,
        "url": "https://www.reddit.com/gallery/1gjv850",
        "content": "Hi everyone! I found a MacBook Pro 16” (2019) that is sold 1000€ on eBay and i wanna buy it. Here the specs: \n-CPU: Intel Core I9 8 Core 2,3 GHz\n-GPU: AMD Radeon Pro 5500M\n-SSD: 2TB\n-Ram: 64Gb DDR4\nIt worth the price? And before i buy it, what should i do? \n",
        "created_utc": 1730770243.0,
        "subreddit_name": "mac",
        "comments": 73
    },
    {
        "title": "Does Apple stock the 10GBe models at the store?",
        "score": 7,
        "url": "https://www.reddit.com/r/mac/comments/1gkjury/does_apple_stock_the_10gbe_models_at_the_store/",
        "content": "I'm looking to pick up a M4 on Friday at the store, and I'm wondering if they stock the base models with the 10GBe upgrade in-store? Or will I have to order no matter what?",
        "created_utc": 1730847302.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "M3 Pro vs M4 base",
        "score": 5,
        "url": "https://www.reddit.com/r/mac/comments/1gkhenl/m3_pro_vs_m4_base/",
        "content": "I’ve seen so many comparisons within the various levels of CPUs, but never a cross comparison. Yes, M4 [insert pro or max] is going to do better than M3 of the same level, but does anyone know how it will stack up between levels? Is the M4 base only slightly less powerful than the M3 Pro?\n\nI’m interested because I’m wondering if it would be better to save some money and preorder a MacBook Pro M4 with an education discount or pay the couple hundred extra for a MacBook Pro M3 Pro now.",
        "created_utc": 1730840950.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "with new rumors of MBA M4, should i wait or go for MBA M3?",
        "score": 5,
        "url": "https://www.reddit.com/r/mac/comments/1gkf4cp/with_new_rumors_of_mba_m4_should_i_wait_or_go_for/",
        "content": "Yesterday, a new rumor from the reliable source \"Bloomberg reporter Mark Gurman\" suggested that the MacBook Air M4 might be released in early 2025. With this news, I'm wondering—should I wait a few more months for the M4 or go ahead and buy the M3 now? Both would cost me about the same.",
        "created_utc": 1730835117.0,
        "subreddit_name": "mac",
        "comments": 24
    },
    {
        "title": "RAM usage with Apple Intelligence",
        "score": 5,
        "url": "https://www.reddit.com/r/mac/comments/1gk4tfa/ram_usage_with_apple_intelligence/",
        "content": "With the new Mac’s base models starting at 16gb of RAM to support Apple Intelligence, does that mean a computer with 16gb and Apple intelligence will always be using more ram than a 16gb model without it?\n\nHow much of an impact would this be on the RAM?\n\n\n\n\n",
        "created_utc": 1730807237.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "Water (coffee) damage cleaning solution",
        "score": 4,
        "url": "https://www.reddit.com/gallery/1gk3j74",
        "content": "Today I spilled coffee all over the keyboard of my 21 macbook pro. I've disassembled it to clean it up and let it dry but was wondering what would be the best cleanup solution for the dried coffee? Would it be safe to use alcohol, isopropyl alc or demineralised water?\n\nThanks in advance! ",
        "created_utc": 1730801959.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "New Studio Display with Improved Camera?",
        "score": 4,
        "url": "https://www.reddit.com/r/mac/comments/1gk0yu4/new_studio_display_with_improved_camera/",
        "content": "I noticed that the new Macbooks and iMacs all came with upgraded cameras (and the iMac now has a slightly bigger \"camera hole\"). I know the Studio Display already has a 12MP Center Stage camera, but does this mean that we could expect a v2 for the Studio Display (even if silently announced / upgraded, similar to the keyboards and mice)?\n\nhttps://preview.redd.it/4dfa3h6q61zd1.png?width=1348&format=png&auto=webp&s=529f0b53416cab8708fa6f7bcbd9e99c204db3e4\n\nI feel like Apple used to ship quiet upgrades in the past more, but now it looks less and less likely.",
        "created_utc": 1730790035.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Macbook reads Toshiba hard drive but won't load?",
        "score": 4,
        "url": "https://i.redd.it/6axusz3lt3zd1.jpeg",
        "content": "I have a 2TB Toshiba External Hard Drive and it has always worked fine since I got. Both the cable and the Hard Drive are fine physically but today it just says \"loading...\" in the finder window and i can't access any of my files. I've tried loading it on different Macs but nothing is working. I was wondering if it might literally just be because there's a lot on there?? (86.76GB used)\n\nany help would be appreciated because i really don't want to have to reformat it :(",
        "created_utc": 1730821715.0,
        "subreddit_name": "mac",
        "comments": 17
    },
    {
        "title": "Mac Mini M4 Pro in a Windows Environment & Parallels Desktop",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gk8a44/mac_mini_m4_pro_in_a_windows_environment/",
        "content": "I've been a Mac power user at home but have always had to use a Windows PC at work because all the other users are Windows PCs connected to a Windows Domain Controller.\n\nI now have the ability to use a Mac at work and am jumping in with a Mac Mini M4 Pro. I have everything sorted out with file sharing and connecting to the Windows Domain Controller, but I am going to have to use some exclusive Windows programs such as Quickbooks Desktop and some other Windows programs that take roughly the same (though probably slightly more) amount of resource power as Quickbooks Desktop.\n\nI went with a Mac Mini M4 Pro with 48GB of RAM, and I plan on using Parallels Desktop for these Windows programs, but I have not used that software before. I will need to allocate CPU and RAM to Parallels, and I am looking for recommendations on how much I should allocate. My initial thoughts were 6 cores and 16 GB of RAM, but that may be too little. I really want it to be like I don't even realize I'm running a virtual machine or feel any lag when running these programs. I want it to be seamless, hopping between programs, file folders, etc. Basically how it feels when I am on my current Windows PC.\n\nAny other tips for this integration would be appreciated.",
        "created_utc": 1730817836.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "I need help with system data taking too much space.",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gkevzn/i_need_help_with_system_data_taking_too_much_space/",
        "content": "***Fixed (maybe)***\n\nMy system data is taking 200-300 go of space and I am unable to clear it.\n\nI have tried everything : clearing caches from multiple places, restarting my computer, updating my computer, using other apps, nothing seems to work.\n\nI suspect this is perhaps a feature implemented intentionally, and I am looking for a way to disable it, or if it's not intentional, a way to get rid of the problem *forever*.\n\nI am honestly desperate.\n\nMac info :\n\nMacbook air, 13 inch, M3, 2024, macOS Sonoma 14.6 (I have so little space left I can't even update to see if that fixes the issue)\n\nI'm doomed, I tried everything again and I literally have less than 1go of space left.\n\nEdit : It seems to be a problem with the system. Updating to the latest version, after I've been able to make enough space for it, was enough to fix the problem. (Permanently? I don't know.)",
        "created_utc": 1730834527.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Is there a site or tool that helps me compare performance across generations of Macs? For instance M4 Pro Mini vs. M2 Studio?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gkcyay/is_there_a_site_or_tool_that_helps_me_compare/",
        "content": "I’m going to be in the market for a refresh soon. I’ve been daily driving a 16” M1 Pro MacBook Pro but I’ve been doing more work at a desk with a big monitor so I’m thinking of refreshing with a desktop Mac and a 15” MacBook Air.\n\nMy feeling is a tricked out M4 Mini will be more performant than an M2 Studio in the same price range, but I’d like to be sure since money is tight. Is there a good site that lets me compare CPU/GPU/disk/etc. performance across generations of Macs like I want to do? Or am I asking a question with a blindingly obvious answer and the M4 Mini is clearly superior? Or is an M4 Studio right around the corner with a reasonable price?\n\nI do have a CalDigit TS4 that I would swap to the Mini so the issue of fewer ports isn’t really a concern. ",
        "created_utc": 1730829727.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Mac mini or Mac Studio...",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gkaady/mac_mini_or_mac_studio/",
        "content": "Hi all \n\nLooking for some thoughts on this, I was holding off to see what we got in the October event and as soon as the new Mac mini was announced it seemed like a no brainer for me (video editor, currently on an M1 Mac mini) but I'm now wondering could the Mac Studio might be a better choice.\n\nMachine's I'm looking at; \n\n**Mac mini specs:**\n\nApple M4 Pro chip with 14‑core CPU, 20‑core GPU, 16-core Neural Engine\n\n48GB unified memory\n\n2TB SSD storage\n\n10 Gigabit Ethernet\n\nThree Thunderbolt 5 ports, HDMI port, two USB‑C ports, headphone jack\n\n**Price - £2,699.00**\n\n  \n**Mac Studio specs:**\n\nApple M2 Max with 12‑core CPU, 30‑core GPU, 16‑core Neural Engine\n\n32GB unified memory\n\n2TB SSD storage\n\nFront: Two USB-C ports, one SDXC card slot\n\nBack: Four Thunderbolt 4 ports, two USB-A ports, one HDMI port, one 10Gb Ethernet port, one 3.5mm headphone jack\n\n**Price - £2,699.00**\n\nThoughts please!",
        "created_utc": 1730823072.0,
        "subreddit_name": "mac",
        "comments": 15
    },
    {
        "title": "Macbook Pro M1 Camera Green Light shown but Camera display is black",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gk4gh6/macbook_pro_m1_camera_green_light_shown_but/",
        "content": "Hi!  \nMy macbook which i have been using for years is having a problem where the green light near the camera works and is green when i use it on apps like zoom but the camera shows only a black screen.  \nI tried on Many apps like photobooth, facetime etc. and even tried resetting. What could be the issue and please tell me some solutions\n\n",
        "created_utc": 1730805790.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Should I Switch My Setup to Apple Full-Time? Seeking Advice!",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gk2wfr/should_i_switch_my_setup_to_apple_fulltime/",
        "content": "Hey everyone,\n\nI'm looking to make the switch to Apple full-time and could use some advice. Right now, I have an M2 MacBook Air and a Windows desktop PC, but I'm considering moving fully into the Apple ecosystem. I'm weighing two options and would love some insights:\n\n1. **Option 1:** Keep the M2 MacBook Air and add the latest Mac Mini to my setup.\n2. **Option 2:** Sell the M2 MacBook Air and upgrade to the new M4 MacBook Pro, which would give me a single device for everything.\n3. I did consider the new iMac. If I didn't have a nice ultrawide and requires a multimonitor environment, I would've snagged up an iMac!\n\nI also want a smooth way to sync data across devices. Is iCloud the best solution for this, or are there better options for an all-Apple setup?\n\nFor anyone who’s made a similar switch, which setup do you find works best? Pros and cons of either route?\n\nPs. Reason for switching cause I am tired of having to reboot every now and then. My wife's iMac is rock stable and only time it needs a reboot is software update. Which is amazing. \n\nThanks in advance!",
        "created_utc": 1730799024.0,
        "subreddit_name": "mac",
        "comments": 13
    },
    {
        "title": "Battery optimization problem",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gk16b4/battery_optimization_problem/",
        "content": "Hi,\nI have a problem with macOS battery optimization feature.\nMy Mac is connected to a charger most of the time and it always have \"Charging on hold\" and says \"Rarely Used On Battery\" then it starts to drain the battery to 95% or so, then it starts charging again and as soon as it reaches 100% it says again \"Charging on hold\" and \"Rarely Used On Battery\" and the same thing happens again and again.\nIt’s M1 Air and I'm using the original 30W charger, I was suspecting that it might not be enough for keeping the laptop charged and powering it at peak, but I tried a third-party 65W charger and the same issue happened!\nAny ideas how to solve this? \n\n\n\n",
        "created_utc": 1730790947.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Yellow Lines on Mid-2007 24-inch iMac Display",
        "score": 2,
        "url": "https://www.reddit.com/gallery/1gjxadv",
        "content": "Hi there, I got this Mac recently, and discovered horizontal yellowed lines (with intermittent small vertical lines, closer to the centre) all over the display. The lines are apparent at all times of the display being on. \nThe display is very yellowed in general (i.e. the lines are just a higher saturation of yellow, compared to the rest of the display space).\nI’ve adjusted the colour filter to maximum blue hue; although this helped, the issue is still very apparent.\n\nI’m not at all computer-versed, so my assumptions may be invalid, but I was wondering if anyone has any idea of:\n1. what might be causing it\n2. how to fix it\nI assume that it’s either LCD degradation or issues with the backlight (both due to age).\n\nEveryone I know has told me that fixing it is not worth it. However, I want to turn it into a little passion project, so I’d be willing to dump some cash (into this exact Mac).\n\nThanks in advance!",
        "created_utc": 1730776584.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "My M1 Macbook screen randomly goes black for a second",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gjwcnu/my_m1_macbook_screen_randomly_goes_black_for_a/",
        "content": "3 days ago I noticed that randomly, my screen will turn black for less that a second. It happens quite often. I thought restarting would fix it but it still happens. Doesn't seem to be a connection problem since it happens when the MacBook is sitting still on my desk, sometimes when im not even touching it.\n\nWhen its black, everything still works normally (audio will keep playing for example).\n\nAnyone know what could be causing this?",
        "created_utc": 1730773622.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "iMac 15,1 hard drive went out. Is this thing worth fixing?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gjv5uc/imac_151_hard_drive_went_out_is_this_thing_worth/",
        "content": "A friend of the family's 27 inch iMac died. From what i can tell, the hard drive failed and can't boot into the OS. He said i can have it after he gets a new one. From what i can find, it's about 10 years old at this point. Is there any point in salvaging this thing? If I were to buy a replacement SSD, is it easy to swap out the hard drive that's in the now? Display looks perfect, just doesn't boot. ",
        "created_utc": 1730770051.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Vanguard deposes BlackRock as provider of world’s second-largest ETF",
        "score": 242,
        "url": "https://www.reddit.com/r/stocks/comments/1gkjlaq/vanguard_deposes_blackrock_as_provider_of_worlds/",
        "content": "Inflows to VOO look set to smash records as observers predict it will soon overtake SPY to become the biggest\n\nVanguard has deposed its rival BlackRock, the world’s largest asset manager, from its position as manager of the second-largest exchange traded fund in the world.\n\nIn a rare setback for the fund giant, BlackRock’s iShares Core S&P 500 ETF (IVV) has been overtaken by Vanguard’s equivalent S&P 500 ETF (VOO), which had assets of $540.76bn at Friday’s close, according to data from Morningstar, marginally ahead of IVV’s $540.66bn.\n\n“I expect VOO to catch SPY and become the largest ETF in the world in 2025, or 2026, at the latest,” Bryan Armour, director of passive strategies research for North America at Morningstar added. “VOO is set to smash the single-year inflows record, having already pulled in $85bn this year. In contrast, SPY has seen $5bn in outflows. The $125bn gap between the two ETFs [VOO and SPY] has shrunk to under $50bn in 2024. Were that pace to continue, VOO would easily be crowned king in 2025.”\n\n[**Financial Times**](https://www.ft.com/content/3067c4ce-8d0e-4307-8b1a-a7edd21639ff)\n",
        "created_utc": 1730846587.0,
        "subreddit_name": "stocks",
        "comments": 33
    },
    {
        "title": "r/Stocks Daily Discussion & Technicals Tuesday - Nov 05, 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/stocks/comments/1gk3ojg/rstocks_daily_discussion_technicals_tuesday_nov/",
        "content": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on technical analysis (TA), but if TA is not your thing then just ignore the theme.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\n**Technical analysis (TA)** uses historical price movements, real time data, indicators based on math and/or statistics, and charts; all of which help **measure the trajectory of a security.**  TA can also be used to interpret the actions of other market participants and predict their actions.\n        \nThe main benefit to TA is that everything shows up in the price (commonly known as **\"priced in\"**):  All news, investor sentiment, and changes to fundamentals are reflected in a security's price.\n\nTA can be useful on any timeframe, both short and long term.\n\nIntro to technical analysis by [Stockcharts chartschool](https://stockcharts.com/school/doku.php?id=chart_school:technical_indicators:introduction_to_technical_indicators_and_oscillators#benefits_and_drawbacks_of_leading_indicators) and their [article on candlesticks](https://stockcharts.com/school/doku.php?id=chart_school:chart_analysis:introduction_to_candlesticks)\n\nIf you have questions, please see the following word cloud and click through for the wiki:\n\n[Indicator - Trade Signals - Lagging Indicator - Leading Indicator - Oversold - Overbought - Divergence - Whipsaw - Resistance - Support - Breakout/Breakdown - Alerts - Trend line - Market Participants - Moving average - RSI - VWAP - MACD - ATR - Bollinger Bands - Ichimoku clouds - Methods - Trend Following - Fading - Channels - Patterns - Pivots](https://www.reddit.com/r/stocks/wiki/ta-themed-post)\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1730802610.0,
        "subreddit_name": "stocks",
        "comments": 186
    },
    {
        "title": "Covered calls 0DTE Rollover",
        "score": 4,
        "url": "https://www.reddit.com/r/investing/comments/1gkhe95/covered_calls_0dte_rollover/",
        "content": "I’ve been selling a CC SPY 0DTE OTM for about $1 per contract and then if SPY increases, rolling over to the next day for a $100 credit. For example:\n \n1. bought CC for $1 \n2. If SPY decreases, no action. Let expire. +$100\n3. If SPY increases CC, goes to $1.5 (possibly ITM). Don’t want my shares called away. \n4. Rollover to next day OTM CC, $2.5. Place limit order for $100 credit. \n5. Repeat.\n\nAlmost seems too easy to make $100/day.\n\nIs there anything I should be concerned about doing this or am missing in my analysis? \n\nIs there a way to make more profit?",
        "created_utc": 1730840921.0,
        "subreddit_name": "investing",
        "comments": 4
    },
    {
        "title": "VTI/VXUS/BND vs. SCHG/SCHD/IAU vs. SPY+Covered Calls",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gjw1g0/vtivxusbnd_vs_schgschdiau_vs_spycovered_calls/",
        "content": "Considering best approach for long-term investment (~15-20 years) to build taxable investment holdings for use before retirement / support early semi-retirement \n\nTraditional 3 fund VTI/VXUS/BND, but already have this in my retirement setup\n\nAlternative 3 fund SCHG/SCHD/IAU\n\nOr build SPY position and enhance return with covered call strategy \n\nWhat do you think?",
        "created_utc": 1730772668.0,
        "subreddit_name": "investing",
        "comments": 7
    },
    {
        "title": "sector rotation (objective)",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gjzbz3/sector_rotation_objective/",
        "content": "When trump was in office healthcare stocks were strong 140% better then biden at 16%. When biden was in office energy did better at 86% waay better then trump at -36%. All the support trump has for oil and the support biden has for health insurance has a totally inverse effect on prices. What are your thoughts on a harris administration? \n\nsources:\nequal weighted spy sector etfs 2017-2021 and 2021-2024.",
        "created_utc": 1730783527.0,
        "subreddit_name": "investing",
        "comments": 10
    },
    {
        "title": "Fisker EVs Hired an IT Spy Who Funneled Millions to N. Korea's Missile Program",
        "score": 1785,
        "url": "https://www.torquenews.com/1084/fisker-evs-hired-it-spy-who-funneled-millions-north-koreas-missile-program-case-fbi",
        "content": "",
        "created_utc": 1730841242.0,
        "subreddit_name": "technology",
        "comments": 22
    }
]