[
    {
        "title": "It's not just me right?",
        "score": 6952,
        "url": "https://www.reddit.com/r/stocks/comments/mceprg/its_not_just_me_right/",
        "content": "For the past month I've been getting absolutely crushed little by little each day it seems like in every sector.  I feel like I have a pretty well diversified portfolio.  I'm not really heavy on any one particular stock out of the ones below, so I'm not even sure where the majority of the losses are coming from.  I'm still green on most everything but I've given back a lot of gains, these definitely aren't all my investments but a majority of the bigger positions.    \nTech/Growth:  AAPL, GOOG, PLTR, TSLA, AMZN, AMD, UBER, BABA, JD etc. \\~35%  \nTravel/Rebound (cyclical):  UAL, AAL, OXY, MGM, MAR, NCLH, TRIP, ABNB \\~30%  \nFinancials: WFC, BCS, JPM, BAC\\~10%  \nRetail stocks for stimulus check play:  UAA, NKE, M, LULU, etc.  \\~10%  \nOther positions making up less than 15%   \n\n\nSomehow I've lost about 20% of my portfolio with these names in the last month, it doesn't feel like it but every day it goes down 1 or 2% and that starts to add up.  I know I know, in 5 years who cares but I just wanted to know if other people seem to be in the same boat.  I haven't seen the main indexes see that kind of loss so I'm not getting where it seems to be coming from.  Even today when all looked great in the morning now somehow I'm deep red again (another 2%) despite indexes being mostly stable.",
        "created_utc": 1616615045.0,
        "subreddit_name": "stocks",
        "comments": 2767
    },
    {
        "title": "What Happened?",
        "score": 4209,
        "url": "https://www.reddit.com/r/apple/comments/mcjezy/what_happened/",
        "content": "Yesterday, we locked the subreddit in solidarity with a site-wide protest against Reddit. Here is some context from yesterday\n\n> r/Apple will go private in protest of Reddit’s recent decision to hire an admin who supports child sex crimes. We will open again eventually, but for now, the subreddit will be closed in solidarity with other large communities across Reddit. \n> \n> Aimee Knight (née Challenor) is an ex-politician from the UK Green party, who resigned from the party after it was revealed she kept her father on her election team after he was convicted of raping and torturing a child. Her spouse has also been known to tweet pro-pedophilic statements, but she is also the latest admin to be hired at Reddit, and she used her power to surpress and permanently suspend a moderator of r/ukpolitics who posted an article exposing her links to pedophilia and support of child sex crimes.\n> \n> Before you ask how long until the sub reopens, the answer is however long it takes for Reddit to take action. The decision by Reddit to protect a known proponent of child rape through censorship and suspension is absolutely disgusting and intolerable. We will remain private until further notice, and we apologize for any inconvenience.\n> \n> Read this post for more info: https://redd.it/mbmthf\n\n\nEarlier this evening, Reddit has fired that employee, so r/apple is now open. \n\nWe want to thank everyone for their understanding and for their support over the past day.",
        "created_utc": 1616627146.0,
        "subreddit_name": "apple",
        "comments": 268
    }
]