[
    {
        "title": "Thoughts on ESTC (Elastic) as the next hot AI Search play",
        "score": 5,
        "url": "https://www.reddit.com/r/stocks/comments/1gy6eir/thoughts_on_estc_elastic_as_the_next_hot_ai/",
        "content": "As AI investment shifts from infra and GPUs to software, I believe Elastic is uniquely positioned as a red hot software company for the decades to come. Its AI ELK Search Platform is a hot commodity and powers a lot of Generative AI work. The company upped its full-year revenue forecast to as high as $1.457 billion (making analysts revise their projections upward). Elastic's high-value customer count (contracts over $100k) went up by 16% to 1420. The stock is trading at a premium (6+ times sales; 12 times book value) but it is growing fast (600m in 2020 to 1.45b this fiscal year). Gross margins are great at 74%.",
        "created_utc": 1732386856.0,
        "subreddit_name": "stocks",
        "comments": 7
    },
    {
        "title": "Isn't rebalancing selling your winners and keeping your losers?",
        "score": 38,
        "url": "https://www.reddit.com/r/investing/comments/1gy2mfa/isnt_rebalancing_selling_your_winners_and_keeping/",
        "content": "I've been thinking about the philosophy of rebalancing. The purpose of rebalancing your portfolio (just buy all stocks bro, excluded) is to maintain a risk profile that's consistent with your goals. \n\nSo say if NVDA went up by 300% and INTC got halved and now NVDA is 80% of your portfolio. The philosophy of rebalancing would demand you to sell a large portion of NVDA and invest in INTC. \n\nThat strategy if we look at the chart, doesn't work so well for your wallet. \n\nSo here's me wondering if rebalancing on the surface is \"buy low sell high\" when in reality it's just \"sell your winners and buy more losers\". \n\nOn the converse with an outsized NVDA position you just increased your risk on one company big time so if NVDA gets hit by say an antitrust or Jensen's brain scan AI go Skynet, you're gonna get decimated. \n\nThere's a lot of moving gears in this decision. ",
        "created_utc": 1732377013.0,
        "subreddit_name": "investing",
        "comments": 91
    },
    {
        "title": "I want to keep myself well informed",
        "score": 12,
        "url": "https://www.reddit.com/r/investing/comments/1gxxalz/i_want_to_keep_myself_well_informed/",
        "content": "As the title suggests, I want to stay up to date regarding economic business and political news, I am a novice investor, just 2 days ago I bought my first ever ETF (sp500) so my initial step is simply to be up to date so I can make better choices. Is it worth buying a subscription to for example the Wall Street Journal, or any other news service? In that case which one do you use?\n\n  I've checked some services dedicated to investment but they are very expensive, like 50 euros per month or so (52$ or so)  and because I am a novice they may be hard for me to understand initially, so I would like to start with a simple news service.\n\nWhat do you think? Is this a good approach?",
        "created_utc": 1732360082.0,
        "subreddit_name": "investing",
        "comments": 29
    },
    {
        "title": "Thoughts on this allocation? (AI Theme)",
        "score": 4,
        "url": "https://www.reddit.com/r/investing/comments/1gxrmgx/thoughts_on_this_allocation_ai_theme/",
        "content": "# Core AI Investment\n\n* **Nvidia (NVDA)** – 4%\n\n# Cloud Service Providers\n\n* **Amazon (AMZN)** – 5%\n* **Google (GOOGL)** – 5%\n* **Meta (META)** – 3%\n\n# Enterprise AI Adoption\n\n* **Salesforce (CRM)** – 3%\n\n# Software\n\n* **Snowflake (SNOW)** – 2%\n\n# Data Center and Hardware\n\n* **Dell (DELL)** – 10%\n* **Super Micro (SMCI)** – 7%\n* **HP (HPQ)** – 3%\n* **Micron Technology (MU)** – 3%\n* **TSS Inc (TSSI)** – 2%\n* **Arista Networks Inc (ANET)** – 2%\n\n# Semiconductors\n\n* **TSMC (TSM)** – 3%\n* **Marvell (MRVL)** – 2%\n* **ASML (ASML)** – 3%\n* **Foxconn (FXCOF)** – 2%\n\n# Consumer Goods\n\n* **Costco (COST)** – 8%\n* **Cava (CAVA)** – 3%\n\n# Media\n\n* **Spotify (SPOT)** – 2%\n* **Reddit (RDDT)** – 2%\n\n# Space\n\n* **RocketLab (RKLB)** – 2%\n\n# Power and Thermal Management\n\n* **Eaton Corporation (ETN)** – 3%\n* **Emerson Electric Co. (EMR)** – 3%\n* **Hubbell Incorporated (HUBB)** – 3%\n* **Cameco Corporation (CCJ)** – 3%\n* **Quanta Services, Inc. (PWR)** – 2%\n* **Vertiv (VRT)** – 2%\n\n# Nuclear Energy (Supporting AI Infrastructure)\n\n* **Constellation Energy Corp (CEG)** – 2%\n* **Talen Energy Corporation (TLN)** – 2%\n* **NuScale Power Corporation (SMR)** – 2%\n* **Oklo Inc. (OKLO)** – 2%",
        "created_utc": 1732336903.0,
        "subreddit_name": "investing",
        "comments": 6
    },
    {
        "title": "Any non-AI or IT related stocks or ETF with decent growth potential?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gy4235/any_nonai_or_it_related_stocks_or_etf_with_decent/",
        "content": "I’ve basically put all my money in SPY after losing some money playing popular stocks. Now, I have a feeling that SPY is also the popular stock everyone recommends to buy and it is also very IT centred. I believe in AI being the next big thing . But, i am also afraid of losing all my savings if the market bursts. Any recommendations ?",
        "created_utc": 1732380774.0,
        "subreddit_name": "investing",
        "comments": 7
    },
    {
        "title": "Understanding the Lifecycle of Mining Stocks",
        "score": 1,
        "url": "https://www.reddit.com/r/investing/comments/1gxsj90/understanding_the_lifecycle_of_mining_stocks/",
        "content": "I have recently had some pretty good luck with AI stocks picks, and I'd like to continue to expose myself to the trend of robotics and AI/Renewable energy by investing in some companies that harvest the raw materials used in the manufacture of those goods.  I have some questions about mining companies that I haven't been able to find any decent answers to online though, and I was hoping you all would have some resources to point me towards or best practices. \n\n1. I'm currently invested in $TMQ.  It's performing very well right now, though I have no idea why.  I am chalking it up to sentiment, U.S. located mine, and restricted copper supply.  $TMQ is an exploration company though.  Eventually, that company will need to actually mine the minerals, and my understanding is that the mining is done through a separate, new company.  Is there a standard practice to this?  Will there be a spin off, or will $TMQ create a wholly owned subsidiary and I will continue to hold just the one stock?  I assume this is an \"it depends\" situation, but is there a general case?  \n\n  \n2. Mining companies are unique in that even the best run mines have a shelf life (the amount of metals available in the land holdings).  How do mining companies dispense value to share holders over the life of the mine?  Are they generally high dividend stocks or is the impetus on me to sell at some magical valuation moment.  I doubt that the value of the stock is ownership in the underlying commodity, I just don't understand how the shareholder captures value, and what the timing of that capture is. ",
        "created_utc": 1732340178.0,
        "subreddit_name": "investing",
        "comments": 0
    },
    {
        "title": "Metro bosses 'committed' to iPhone ticket plan",
        "score": 172,
        "url": "https://www.bbc.com/news/articles/c87xn3vp9l1o",
        "content": "",
        "created_utc": 1732376256.0,
        "subreddit_name": "apple",
        "comments": 44
    },
    {
        "title": "New MacBook Pro Speakers Are Most Affordable to Repair Since 2015",
        "score": 30,
        "url": "https://www.macrumors.com/2024/11/23/macbook-pro-speaker-repairs-more-affordable/",
        "content": "",
        "created_utc": 1732394599.0,
        "subreddit_name": "apple",
        "comments": 3
    },
    {
        "title": "Daily Advice Thread - November 23, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/apple/comments/1gxx6do/daily_advice_thread_november_23_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1732359625.0,
        "subreddit_name": "apple",
        "comments": 27
    },
    {
        "title": "Billie Eilish is Apple Music’s Artist of the Year for 2024",
        "score": 0,
        "url": "https://www.apple.com/li/newsroom/2024/11/billie-eilish-is-apple-musics-artist-of-the-year-for-2024/",
        "content": "",
        "created_utc": 1732352571.0,
        "subreddit_name": "apple",
        "comments": 22
    },
    {
        "title": "MKBHD - An Honest review of Apple intelligence… So far",
        "score": 0,
        "url": "https://youtu.be/haDjmBT9tu4?si=rNpkTsxc7DAWMjNO",
        "content": "",
        "created_utc": 1732323335.0,
        "subreddit_name": "apple",
        "comments": 62
    },
    {
        "title": "Google stock thoughts ",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gy9591/google_stock_thoughts/",
        "content": " think that google depends on Apple , if apple products fail, or if apple partner with another search engine then Google would fail\n\nEdge and Bing are really good now , comes installed in 80% of the machines sold , if its good enough why bother downloading chrome ? and Bing looks almost exactly the same as google , \n\nChrome Os is failing also, Android might get antitrust..  \n\n\n\nWhat do you think? ",
        "created_utc": 1732394058.0,
        "subreddit_name": "stocks",
        "comments": 53
    },
    {
        "title": "Battery drains to 0% for 2 nights in a row after I update from Sonoma to Sequoia - how to check what apps caused it?",
        "score": 1,
        "url": "https://i.redd.it/ia6h24qz8k2e1.jpeg",
        "content": "2 days ago I was on Sonoma, and regularly just left the MacBook unplugged the whole night, and would pick up again in the morning with no issues.\n\nThen I unfortunately decided to update to the latest Sequoia. And for the last 2 nights its drained to 0%. Usually on iPhone I can click on the green graph and I can see the apps causing the drain on iPhone. But it doesn't show on Mac OS, does anyone have any ideas to get a breakdown of this historical data",
        "created_utc": 1732328149.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Nano-texture display and outdoors?",
        "score": 1,
        "url": "https://www.reddit.com/r/mac/comments/1gxonm4/nanotexture_display_and_outdoors/",
        "content": "I am looking to buy a new 16” MacBook Pro and I find myself on the fence as to whether to spend the extra money on the nano-texture display. Some people I’ve spoken to say it’s probably not worth it, while others say go for it. \n\nKnowing that my current Intel 16” MacBook Pro is hard to use in strong sunlight, would the nano-texture improve things here?\n\nOther than the outdoors use-case are there other situations where the screen improves things and are there any down sides? \n\n",
        "created_utc": 1732327041.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "What's a good wireless mouse for Macbooks & Mac Mini?",
        "score": 1,
        "url": "https://www.reddit.com/r/mac/comments/1gxo58y/whats_a_good_wireless_mouse_for_macbooks_mac_mini/",
        "content": "I've looked at Logiech reviews, and many claim that they have input lag. I need something for graphic and web design, and input lag wouldn't be good for this, especially graphic design. Anyone use anything else that's good with low input lag? I'd prefer not to use Apple's mouse.",
        "created_utc": 1732325488.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "/r/Stocks Weekend Discussion Saturday - Nov 23, 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/stocks/comments/1gxwqkj/rstocks_weekend_discussion_saturday_nov_23_2024/",
        "content": "This is the weekend edition of our stickied discussion thread.  Discuss your trades / moves from last week and what you're planning on doing for the week ahead.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1732357816.0,
        "subreddit_name": "stocks",
        "comments": 28
    },
    {
        "title": "Is trading really as risky as they say?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gy53if/is_trading_really_as_risky_as_they_say/",
        "content": "I’ve always been fairly cautious with my investments. My investment breakdown looks like:\n65% VTI\n20% VOO\n15% QQQ\n\n\nI have a lot of friends who trade individual stocks and also buy crypto. It’s been ~5 years of us all investing consistently and they seem to all be vastly outperforming me. If my friends are able to outperform the market so much, professionals must destroy the market. \n\nI’m starting to think that the statement “most money managers don’t outperform the market” is not true. \n\nDoes anyone else have similar thoughts and experience?",
        "created_utc": 1732383467.0,
        "subreddit_name": "investing",
        "comments": 35
    }
]