[
    {
        "title": "Thoughts on ESTC (Elastic) as the next hot AI Search play",
        "score": 5,
        "url": "https://www.reddit.com/r/stocks/comments/1gy6eir/thoughts_on_estc_elastic_as_the_next_hot_ai/",
        "content": "As AI investment shifts from infra and GPUs to software, I believe Elastic is uniquely positioned as a red hot software company for the decades to come. Its AI ELK Search Platform is a hot commodity and powers a lot of Generative AI work. The company upped its full-year revenue forecast to as high as $1.457 billion (making analysts revise their projections upward). Elastic's high-value customer count (contracts over $100k) went up by 16% to 1420. The stock is trading at a premium (6+ times sales; 12 times book value) but it is growing fast (600m in 2020 to 1.45b this fiscal year). Gross margins are great at 74%.",
        "created_utc": 1732386856.0,
        "subreddit_name": "stocks",
        "comments": 7
    },
    {
        "title": "Isn't rebalancing selling your winners and keeping your losers?",
        "score": 38,
        "url": "https://www.reddit.com/r/investing/comments/1gy2mfa/isnt_rebalancing_selling_your_winners_and_keeping/",
        "content": "I've been thinking about the philosophy of rebalancing. The purpose of rebalancing your portfolio (just buy all stocks bro, excluded) is to maintain a risk profile that's consistent with your goals. \n\nSo say if NVDA went up by 300% and INTC got halved and now NVDA is 80% of your portfolio. The philosophy of rebalancing would demand you to sell a large portion of NVDA and invest in INTC. \n\nThat strategy if we look at the chart, doesn't work so well for your wallet. \n\nSo here's me wondering if rebalancing on the surface is \"buy low sell high\" when in reality it's just \"sell your winners and buy more losers\". \n\nOn the converse with an outsized NVDA position you just increased your risk on one company big time so if NVDA gets hit by say an antitrust or Jensen's brain scan AI go Skynet, you're gonna get decimated. \n\nThere's a lot of moving gears in this decision. ",
        "created_utc": 1732377013.0,
        "subreddit_name": "investing",
        "comments": 91
    },
    {
        "title": "I want to keep myself well informed",
        "score": 12,
        "url": "https://www.reddit.com/r/investing/comments/1gxxalz/i_want_to_keep_myself_well_informed/",
        "content": "As the title suggests, I want to stay up to date regarding economic business and political news, I am a novice investor, just 2 days ago I bought my first ever ETF (sp500) so my initial step is simply to be up to date so I can make better choices. Is it worth buying a subscription to for example the Wall Street Journal, or any other news service? In that case which one do you use?\n\n  I've checked some services dedicated to investment but they are very expensive, like 50 euros per month or so (52$ or so)  and because I am a novice they may be hard for me to understand initially, so I would like to start with a simple news service.\n\nWhat do you think? Is this a good approach?",
        "created_utc": 1732360082.0,
        "subreddit_name": "investing",
        "comments": 29
    },
    {
        "title": "Thoughts on this allocation? (AI Theme)",
        "score": 4,
        "url": "https://www.reddit.com/r/investing/comments/1gxrmgx/thoughts_on_this_allocation_ai_theme/",
        "content": "# Core AI Investment\n\n* **Nvidia (NVDA)** – 4%\n\n# Cloud Service Providers\n\n* **Amazon (AMZN)** – 5%\n* **Google (GOOGL)** – 5%\n* **Meta (META)** – 3%\n\n# Enterprise AI Adoption\n\n* **Salesforce (CRM)** – 3%\n\n# Software\n\n* **Snowflake (SNOW)** – 2%\n\n# Data Center and Hardware\n\n* **Dell (DELL)** – 10%\n* **Super Micro (SMCI)** – 7%\n* **HP (HPQ)** – 3%\n* **Micron Technology (MU)** – 3%\n* **TSS Inc (TSSI)** – 2%\n* **Arista Networks Inc (ANET)** – 2%\n\n# Semiconductors\n\n* **TSMC (TSM)** – 3%\n* **Marvell (MRVL)** – 2%\n* **ASML (ASML)** – 3%\n* **Foxconn (FXCOF)** – 2%\n\n# Consumer Goods\n\n* **Costco (COST)** – 8%\n* **Cava (CAVA)** – 3%\n\n# Media\n\n* **Spotify (SPOT)** – 2%\n* **Reddit (RDDT)** – 2%\n\n# Space\n\n* **RocketLab (RKLB)** – 2%\n\n# Power and Thermal Management\n\n* **Eaton Corporation (ETN)** – 3%\n* **Emerson Electric Co. (EMR)** – 3%\n* **Hubbell Incorporated (HUBB)** – 3%\n* **Cameco Corporation (CCJ)** – 3%\n* **Quanta Services, Inc. (PWR)** – 2%\n* **Vertiv (VRT)** – 2%\n\n# Nuclear Energy (Supporting AI Infrastructure)\n\n* **Constellation Energy Corp (CEG)** – 2%\n* **Talen Energy Corporation (TLN)** – 2%\n* **NuScale Power Corporation (SMR)** – 2%\n* **Oklo Inc. (OKLO)** – 2%",
        "created_utc": 1732336903.0,
        "subreddit_name": "investing",
        "comments": 6
    },
    {
        "title": "Any non-AI or IT related stocks or ETF with decent growth potential?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gy4235/any_nonai_or_it_related_stocks_or_etf_with_decent/",
        "content": "I’ve basically put all my money in SPY after losing some money playing popular stocks. Now, I have a feeling that SPY is also the popular stock everyone recommends to buy and it is also very IT centred. I believe in AI being the next big thing . But, i am also afraid of losing all my savings if the market bursts. Any recommendations ?",
        "created_utc": 1732380774.0,
        "subreddit_name": "investing",
        "comments": 7
    },
    {
        "title": "Understanding the Lifecycle of Mining Stocks",
        "score": 1,
        "url": "https://www.reddit.com/r/investing/comments/1gxsj90/understanding_the_lifecycle_of_mining_stocks/",
        "content": "I have recently had some pretty good luck with AI stocks picks, and I'd like to continue to expose myself to the trend of robotics and AI/Renewable energy by investing in some companies that harvest the raw materials used in the manufacture of those goods.  I have some questions about mining companies that I haven't been able to find any decent answers to online though, and I was hoping you all would have some resources to point me towards or best practices. \n\n1. I'm currently invested in $TMQ.  It's performing very well right now, though I have no idea why.  I am chalking it up to sentiment, U.S. located mine, and restricted copper supply.  $TMQ is an exploration company though.  Eventually, that company will need to actually mine the minerals, and my understanding is that the mining is done through a separate, new company.  Is there a standard practice to this?  Will there be a spin off, or will $TMQ create a wholly owned subsidiary and I will continue to hold just the one stock?  I assume this is an \"it depends\" situation, but is there a general case?  \n\n  \n2. Mining companies are unique in that even the best run mines have a shelf life (the amount of metals available in the land holdings).  How do mining companies dispense value to share holders over the life of the mine?  Are they generally high dividend stocks or is the impetus on me to sell at some magical valuation moment.  I doubt that the value of the stock is ownership in the underlying commodity, I just don't understand how the shareholder captures value, and what the timing of that capture is. ",
        "created_utc": 1732340178.0,
        "subreddit_name": "investing",
        "comments": 0
    },
    {
        "title": "Metro bosses 'committed' to iPhone ticket plan",
        "score": 172,
        "url": "https://www.bbc.com/news/articles/c87xn3vp9l1o",
        "content": "",
        "created_utc": 1732376256.0,
        "subreddit_name": "apple",
        "comments": 44
    },
    {
        "title": "New MacBook Pro Speakers Are Most Affordable to Repair Since 2015",
        "score": 30,
        "url": "https://www.macrumors.com/2024/11/23/macbook-pro-speaker-repairs-more-affordable/",
        "content": "",
        "created_utc": 1732394599.0,
        "subreddit_name": "apple",
        "comments": 3
    },
    {
        "title": "Daily Advice Thread - November 23, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/apple/comments/1gxx6do/daily_advice_thread_november_23_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1732359625.0,
        "subreddit_name": "apple",
        "comments": 27
    },
    {
        "title": "Billie Eilish is Apple Music’s Artist of the Year for 2024",
        "score": 0,
        "url": "https://www.apple.com/li/newsroom/2024/11/billie-eilish-is-apple-musics-artist-of-the-year-for-2024/",
        "content": "",
        "created_utc": 1732352571.0,
        "subreddit_name": "apple",
        "comments": 22
    },
    {
        "title": "MKBHD - An Honest review of Apple intelligence… So far",
        "score": 0,
        "url": "https://youtu.be/haDjmBT9tu4?si=rNpkTsxc7DAWMjNO",
        "content": "",
        "created_utc": 1732323335.0,
        "subreddit_name": "apple",
        "comments": 62
    },
    {
        "title": "Google stock thoughts ",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gy9591/google_stock_thoughts/",
        "content": " think that google depends on Apple , if apple products fail, or if apple partner with another search engine then Google would fail\n\nEdge and Bing are really good now , comes installed in 80% of the machines sold , if its good enough why bother downloading chrome ? and Bing looks almost exactly the same as google , \n\nChrome Os is failing also, Android might get antitrust..  \n\n\n\nWhat do you think? ",
        "created_utc": 1732394058.0,
        "subreddit_name": "stocks",
        "comments": 53
    },
    {
        "title": "Battery drains to 0% for 2 nights in a row after I update from Sonoma to Sequoia - how to check what apps caused it?",
        "score": 1,
        "url": "https://i.redd.it/ia6h24qz8k2e1.jpeg",
        "content": "2 days ago I was on Sonoma, and regularly just left the MacBook unplugged the whole night, and would pick up again in the morning with no issues.\n\nThen I unfortunately decided to update to the latest Sequoia. And for the last 2 nights its drained to 0%. Usually on iPhone I can click on the green graph and I can see the apps causing the drain on iPhone. But it doesn't show on Mac OS, does anyone have any ideas to get a breakdown of this historical data",
        "created_utc": 1732328149.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Nano-texture display and outdoors?",
        "score": 1,
        "url": "https://www.reddit.com/r/mac/comments/1gxonm4/nanotexture_display_and_outdoors/",
        "content": "I am looking to buy a new 16” MacBook Pro and I find myself on the fence as to whether to spend the extra money on the nano-texture display. Some people I’ve spoken to say it’s probably not worth it, while others say go for it. \n\nKnowing that my current Intel 16” MacBook Pro is hard to use in strong sunlight, would the nano-texture improve things here?\n\nOther than the outdoors use-case are there other situations where the screen improves things and are there any down sides? \n\n",
        "created_utc": 1732327041.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "What's a good wireless mouse for Macbooks & Mac Mini?",
        "score": 1,
        "url": "https://www.reddit.com/r/mac/comments/1gxo58y/whats_a_good_wireless_mouse_for_macbooks_mac_mini/",
        "content": "I've looked at Logiech reviews, and many claim that they have input lag. I need something for graphic and web design, and input lag wouldn't be good for this, especially graphic design. Anyone use anything else that's good with low input lag? I'd prefer not to use Apple's mouse.",
        "created_utc": 1732325488.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "/r/Stocks Weekend Discussion Saturday - Nov 23, 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/stocks/comments/1gxwqkj/rstocks_weekend_discussion_saturday_nov_23_2024/",
        "content": "This is the weekend edition of our stickied discussion thread.  Discuss your trades / moves from last week and what you're planning on doing for the week ahead.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1732357816.0,
        "subreddit_name": "stocks",
        "comments": 28
    },
    {
        "title": "Is trading really as risky as they say?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gy53if/is_trading_really_as_risky_as_they_say/",
        "content": "I’ve always been fairly cautious with my investments. My investment breakdown looks like:\n65% VTI\n20% VOO\n15% QQQ\n\n\nI have a lot of friends who trade individual stocks and also buy crypto. It’s been ~5 years of us all investing consistently and they seem to all be vastly outperforming me. If my friends are able to outperform the market so much, professionals must destroy the market. \n\nI’m starting to think that the statement “most money managers don’t outperform the market” is not true. \n\nDoes anyone else have similar thoughts and experience?",
        "created_utc": 1732383467.0,
        "subreddit_name": "investing",
        "comments": 35
    },
    {
        "title": "Beginners checklist",
        "score": 7,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gxto3z/beginners_checklist/",
        "content": "I’m sure there has been tons of posts about this in the past but I couldn’t find them. What do I need to start my day trading journey? Here’s the things I’ve gathered\n\nLaptop\nWorking internet\nStock trading account\nTrading software\n\nI understand the the structural mindset and psychology of trading as well as I can from what I’ve read so far of How to Daytrade for a Living by Andrew Aziz. Probably gonna sign up for his educational package on Bear Bull Traders\n\nThanks everyone! Any advice is appreciated 😊",
        "created_utc": 1732344666.0,
        "subreddit_name": "Daytrading",
        "comments": 9
    },
    {
        "title": "NinjaTrader Users ",
        "score": 2,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gy7j24/ninjatrader_users/",
        "content": "I am looking for your take on the desktop version vs the web version. \n\nPros and cons and which one you prefer and why? ",
        "created_utc": 1732389747.0,
        "subreddit_name": "Daytrading",
        "comments": 3
    },
    {
        "title": "Stock Market Today: Amazon Throws Another $4 Billion Into Anthropic + Gap Jumps After Lifting Outlook Ahead of Key Shopping Season",
        "score": 0,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gxoahe/stock_market_today_amazon_throws_another_4/",
        "content": "* The Dow climbed 0.97% on Friday, closing at an all-time high of 44,296.51 and marking its third straight winning session. The S&P 500 added 0.35% for its fifth consecutive gain, while the Nasdaq inched up 0.2%, held back by a rough day for big tech.\n* November’s economic activity showed strong momentum, with services posting the fastest growth since April 2022. Meanwhile, Bitcoin continued its climb toward $100,000, keeping investors on edge as stocks wrapped up the week on a high note.\n\n# \n\n# Winners & Losers\n\n# What’s up 📈\n\n* **Elastic** surged 14.77% after the software company exceeded Wall Street’s expectations for its fiscal second-quarter earnings, driven by rising demand for AI applications. ($ESTC)\n* **Texas Pacific Land** climbed 14.15% after the announcement that it will be joining the S&P 500, replacing Marathon Oil. ($TPL)\n* **Super Micro Computer** continued its rebound, rising 11.62% as investors regained confidence in the server maker after a week of strong updates, including a new auditor. ($SMCI)\n* **MicroStrategy** rose 6.19%, reversing steep losses from the previous session as bitcoin neared $100,000. ($MSTR)\n* **Carpenter Technology** gained 5.68% after JPMorgan initiated coverage with an overweight rating, highlighting strong demand for its premium steel products. ($CRS)\n* **Deckers Outdoor** added 5.63%, reaching an all-time high after Needham initiated coverage with a buy rating, calling it a top-quality company. ($DECK)\n\n# What’s down 📉\n\n* **Reddit** dropped **7.18%** after Tencent Holdings reduced its stake, and Advance Magazine Publishers made moves to establish a credit facility tied to its Reddit shares while retaining control. ($RDDT)\n* **Intuit** sank **5.68%** despite beating earnings expectations last quarter, as the company forecasted weaker results in its consumer group for the next quarter. ($INTU)\n* **Palo Alto Networks** fell **3.61%** despite exceeding earnings estimates, with investors unimpressed by its full-year guidance. ($PANW)\n* **Nvidia** slid 3.22%. ($NVDA)\n\n# \n\n# Amazon Throws Another $4 Billion into the AI Ring\n\nAmazon is going all-in on artificial intelligence, tossing an additional $4 billion into Anthropic’s war chest. \n\nThis San Francisco-based AI upstart, known for its Claude chatbot, has already secured $8 billion in Amazon investments—making it clear the tech giant wants a piece of the AI action. And the partnership isn’t just about cash. Anthropic is doubling down on AWS as its primary cloud provider, fully embracing Amazon’s Trainium and Inferentia chips to supercharge its AI ambitions.\n\nThis investment positions Amazon as a heavyweight in the generative AI arms race, where Anthropic competes head-to-head with OpenAI’s ChatGPT and Google’s Gemini. \n\nAs Claude gains traction in industries like finance and healthcare, Amazon is banking on Anthropic to help boost its AI credentials while offering businesses tailored AI solutions through AWS.\n\n# Claude Gets a Cloud Boost\n\nAWS isn’t just hosting Anthropic’s AI models; it’s adding exclusive perks to woo enterprise clients. For instance, AWS customers will soon get early access to a new Anthropic feature allowing them to fine-tune AI models using their own data. This unique offering sets AWS apart in a crowded cloud market and ensures Amazon gets a return on its massive investment.\n\nMeanwhile, Anthropic has been busy leveling up Claude. Recent updates allow the AI assistant to perform human-like tasks on computers—think navigating websites and managing complex workflows. Add to that the launch of Claude Enterprise, and it’s clear Anthropic is aiming to dominate the AI-for-business space.\n\n# AI’s Billion-Dollar Boom\n\nAmazon’s big bet underscores the sheer scale of AI’s financial demands. Anthropic’s CEO predicts the cost of developing next-gen models could hit $100 billion in the near future—a steep climb from this year’s $100 million. But with the generative AI market expected to rake in $1 trillion within a decade, it’s a gamble Amazon is willing to take.\n\nStill, not everyone’s cheering. Regulators are increasingly wary of tech giants gobbling up the AI market, with U.S. officials scrutinizing deals like this for potential anti-competitive behavior. \n\nBut for Amazon, the playbook is clear: dominate AI, bolster AWS, and make sure it’s the cloud behind all the big brains of tomorrow.\n\n# \n\n# Market Movements\n\n* **💻 X’s New Terms of Service Spark Backlash:** Elon Musk’s platform, X, has introduced controversial terms of service requiring users to allow their data to train AI models and imposing a $15,000 liability for excessive usage. These changes are driving some users, including celebrities, to alternative platforms like Bluesky.\n* **📺 DirecTV Ends Dish Deal:** DirecTV has scrapped its bid to acquire Dish TV and Sling TV after Dish bondholders rejected a $1.6 billion debt swap integral to the deal. The proposed $9.8 billion debt exchange and $1 purchase price faced regulatory hurdles and resistance from stakeholders, ending DirecTV's long-standing pursuit of a merger. ($SATS)\n* **Google Cancels Tablet Line:** Google has reportedly canceled the Pixel Tablet 2, marking another exit from the tablet market following poor sales of its first-gen model. ($GOOGL)\n* **💳 Retailers Boost Store Card Rates:** Over 50 U.S. retailers, including Macy’s, Gap, and Nordstrom, raised store credit card APRs to record highs. Rates now exceed 30% on average, helping protect profit margins ahead of the Fed's rate cuts. ($M) ($GPS) ($JWN)\n* **🔍 Potential Amazon Probe:** Amazon may face an E.U. antitrust investigation in 2025 over alleged self-preferencing of its products. ($AMZN)\n* **📉 Container Store Deal Collapses:** The Container Store announced that its $40M funding deal with Beyond is unlikely to close due to lender issues. ($TCS)\n* **🔎 Treasury Probes JPMorgan:** The U.S. Treasury is investigating JPMorgan Chase for alleged ties to a hedge fund linked to Iranian oil trader Hossein Shamkhani, raising compliance concerns under strict sanctions. ($JPM)\n\n# \n\n# Gap Jumps After Lifting Outlook Ahead of Key Shopping Season\n\nGap Inc. is on a roll. Shares of the retail giant jumped 12% today after it raised its full-year outlook, marking a strong start to the all-important holiday shopping season. \n\nThe company’s fiscal Q3 results outperformed Wall Street’s expectations, with earnings per share hitting $0.72 compared to the forecasted $0.58 and revenue climbing 2% to $3.83 billion. CEO Richard Dickson, who took the reins in 2023, credited the company’s turnaround to stronger brand identities, better pricing strategies, and nostalgic marketing campaigns.\n\nDespite challenges like unseasonably warm weather and hurricanes that temporarily closed 180 stores, Gap’s holiday season is already looking promising. Dickson emphasized the company’s improved execution and momentum compared to a year ago, stating, “Our brands are in a much more pronounced place than they were last year.”\n\n# Breaking Down the Brand Performance\n\nGap’s eponymous brand saw a 3% increase in comparable sales, boosted by improved marketing and product offerings. Meanwhile, Old Navy, its largest revenue generator, posted flat comparable sales, slightly missing analysts’ expectations. \n\nWarmer weather impacted kids’ outerwear sales, but Dickson noted a rebound as conditions normalized. Banana Republic, the trendy workwear line, reported a 2% rise in sales but struggled with a 1% drop in comparable sales, reflecting ongoing efforts to refine its fundamentals.\n\nAthleta, Gap’s athleisure brand, stood out with a 4% sales increase and a 5% boost in comparable sales, signaling a recovery under new leadership. The turnaround is particularly notable given last year’s 19% drop in comparable sales for the brand.\n\n# Gearing Up for the Holidays\n\nWith four consecutive quarters of sales growth, Gap is banking on a strong holiday season to sustain its momentum. The company has raised its full-year guidance, now projecting sales growth of 1.5% to 2%—far above analysts’ expectations of 0.4%. Operating income forecasts were also bumped up, signaling confidence in profitability.\n\nLooking ahead, Dickson’s strategy of leveraging nostalgia and celebrity partnerships seems to be paying off. While the company still faces challenges, particularly in product assortment and full-price selling, Gap’s recent performance shows it’s heading in the right direction. \n\nInvestors and holiday shoppers alike will be watching closely to see if the comeback story continues.\n\n# \n\n# On The Horizon\n\n# Next Week\n\nNext week is a quick one, thanks to Thanksgiving shutting down markets on Thursday and trimming Friday’s trading to a half day. With only a few reports to track, the action is packed into just two trading days.\n\nTuesday brings real estate updates like the S&P Case-Shiller home price index and new home sales, alongside a snapshot of consumer confidence. On Wednesday, brace for a flood of data: initial jobless claims, durable goods orders, a GDP revision, and the main event—PCE inflation.\n\nEarnings are similarly crammed into two days:\n\n* **Monday**: Bath & Body Works ($BBWI), Zoom ($ZM), and Agilent Technologies ($A).\n* **Tuesday**: Best Buy ($BBY), HP ($HPQ), Dell Technologies ($DELL), CrowdStrike ($CRWD), Analog Devices ($ADI), Abercrombie & Fitch ($ANF), Macy’s ($M), Burlington Stores ($BURL), Dick’s Sporting Goods ($DKS), Kohl’s ($KSS), and Manchester United ($MANU).\n\nAfter that, it’s all turkey, touchdowns, and terriers in the Thanksgiving home stretch. ",
        "created_utc": 1732325924.0,
        "subreddit_name": "Daytrading",
        "comments": 0
    },
    {
        "title": "Am I on the right path to Intraday Trading?",
        "score": 0,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gxv0pj/am_i_on_the_right_path_to_intraday_trading/",
        "content": "It's going to be a bit lengthy post so please bare with me. I started swing trading, held stocks for a week or month then sold (I'm from India but I am going to use the USD so that everyone can understand). I had bout $9500 in the broker app and used about 30-50% of the funds and left the rest of it for average if the LTP dropped more than my Average. Made quiet a return from it (I don't really want to calculate how much return it was in %), though I bought myself my very own Honda Motorcycle, my very first Gaming Laptop, Gaming chair and desk, new Air conditioner for my room, Mobile phone for my Dad, paid all the electricity bills throughout the year and groceries for the month (I ain't flexing anything, just want to let you guys know that I bought all of this from my very own profit). \n\nThen the whole year ended and with the new year I wanted to learn about Intraday trading coz why not? I want funds for my college and for that swing trading isn't enough so I thought let me try Intraday trading. I started off the year with a $118 loss and then recovered it the next week (it was gambling off-course, as I had almost no knowledge about Intraday). Then lost a bit and recovered and then I went a bit deep into what we call as \"Revenge Trading\" and lost about $1700 and then I stopped for 2-3 months coz I was actually scared and started studying the market doing paper trading trying indicators for the first 2 weeks and then gave up on them. \n\nThen I went on to try all of those fundamental or technical analysis techniques I saw on You tube, Blogs, Articles. And finally after 2.5 months, I read some books, so I can figure out how do I calm myself to stop revenge trading? Made some rules to strictly follow during trading session and absolutely got the calmness. Next step was to conquer the \"Trading part\", for which I watched live sessions of almost all of the people worldwide, saw what they were doing, read some more books, tried some combinations and started using stoploss (I never used it when I lost those $1700, it was basically all scalping rather than actual Intraday trading). \n\nNow, I'm able to make at least $23 with bout $296 of investment (using leverage) daily and that's just 25% of the funds that I'm using so I can buy more number of stocks in an Intraday session rather than going all in-in just a single stock. Even if I lose, let's say about $30 in 2-3 days , a single trade comes by always (I don't even think now that I want to get back my lost money) and I get an easy stress-free profit of $50+ easily. My question here is: I get a lot demotivated every time whenever I think bout the time I lost those $1700 and there are thoughts that start building in my mind like \"what if I lose\", even though I don't. I don't to hear the comments of people saying to start investing in mutual funds or something (I'm doing that from the profit I get from my Day Trading) nor do I want to hear people saying to stop Trading and all that stuff, I really need some positivity. I want to know if now, what I'm doing is right or not. And how do I overcome that past experience? Thanks.",
        "created_utc": 1732350429.0,
        "subreddit_name": "Daytrading",
        "comments": 10
    },
    {
        "title": "  QRVO...someday $AAPL might take over.",
        "score": 0,
        "url": "https://www.reddit.com/r/AAPL/comments/1gxwi3r/qrvosomeday_aapl_might_take_over/",
        "content": "Qrvo....takeover soon...",
        "created_utc": 1732356804.0,
        "subreddit_name": "AAPL",
        "comments": 1
    }
]