[
    {
        "title": "Thoughts on ESTC (Elastic) as the next hot AI Search play",
        "score": 5,
        "url": "https://www.reddit.com/r/stocks/comments/1gy6eir/thoughts_on_estc_elastic_as_the_next_hot_ai/",
        "content": "As AI investment shifts from infra and GPUs to software, I believe Elastic is uniquely positioned as a red hot software company for the decades to come. Its AI ELK Search Platform is a hot commodity and powers a lot of Generative AI work. The company upped its full-year revenue forecast to as high as $1.457 billion (making analysts revise their projections upward). Elastic's high-value customer count (contracts over $100k) went up by 16% to 1420. The stock is trading at a premium (6+ times sales; 12 times book value) but it is growing fast (600m in 2020 to 1.45b this fiscal year). Gross margins are great at 74%.",
        "created_utc": 1732386856.0,
        "subreddit_name": "stocks",
        "comments": 7
    },
    {
        "title": "Isn't rebalancing selling your winners and keeping your losers?",
        "score": 38,
        "url": "https://www.reddit.com/r/investing/comments/1gy2mfa/isnt_rebalancing_selling_your_winners_and_keeping/",
        "content": "I've been thinking about the philosophy of rebalancing. The purpose of rebalancing your portfolio (just buy all stocks bro, excluded) is to maintain a risk profile that's consistent with your goals. \n\nSo say if NVDA went up by 300% and INTC got halved and now NVDA is 80% of your portfolio. The philosophy of rebalancing would demand you to sell a large portion of NVDA and invest in INTC. \n\nThat strategy if we look at the chart, doesn't work so well for your wallet. \n\nSo here's me wondering if rebalancing on the surface is \"buy low sell high\" when in reality it's just \"sell your winners and buy more losers\". \n\nOn the converse with an outsized NVDA position you just increased your risk on one company big time so if NVDA gets hit by say an antitrust or Jensen's brain scan AI go Skynet, you're gonna get decimated. \n\nThere's a lot of moving gears in this decision. ",
        "created_utc": 1732377013.0,
        "subreddit_name": "investing",
        "comments": 91
    },
    {
        "title": "I want to keep myself well informed",
        "score": 12,
        "url": "https://www.reddit.com/r/investing/comments/1gxxalz/i_want_to_keep_myself_well_informed/",
        "content": "As the title suggests, I want to stay up to date regarding economic business and political news, I am a novice investor, just 2 days ago I bought my first ever ETF (sp500) so my initial step is simply to be up to date so I can make better choices. Is it worth buying a subscription to for example the Wall Street Journal, or any other news service? In that case which one do you use?\n\n  I've checked some services dedicated to investment but they are very expensive, like 50 euros per month or so (52$ or so)  and because I am a novice they may be hard for me to understand initially, so I would like to start with a simple news service.\n\nWhat do you think? Is this a good approach?",
        "created_utc": 1732360082.0,
        "subreddit_name": "investing",
        "comments": 29
    },
    {
        "title": "Thoughts on this allocation? (AI Theme)",
        "score": 4,
        "url": "https://www.reddit.com/r/investing/comments/1gxrmgx/thoughts_on_this_allocation_ai_theme/",
        "content": "# Core AI Investment\n\n* **Nvidia (NVDA)** – 4%\n\n# Cloud Service Providers\n\n* **Amazon (AMZN)** – 5%\n* **Google (GOOGL)** – 5%\n* **Meta (META)** – 3%\n\n# Enterprise AI Adoption\n\n* **Salesforce (CRM)** – 3%\n\n# Software\n\n* **Snowflake (SNOW)** – 2%\n\n# Data Center and Hardware\n\n* **Dell (DELL)** – 10%\n* **Super Micro (SMCI)** – 7%\n* **HP (HPQ)** – 3%\n* **Micron Technology (MU)** – 3%\n* **TSS Inc (TSSI)** – 2%\n* **Arista Networks Inc (ANET)** – 2%\n\n# Semiconductors\n\n* **TSMC (TSM)** – 3%\n* **Marvell (MRVL)** – 2%\n* **ASML (ASML)** – 3%\n* **Foxconn (FXCOF)** – 2%\n\n# Consumer Goods\n\n* **Costco (COST)** – 8%\n* **Cava (CAVA)** – 3%\n\n# Media\n\n* **Spotify (SPOT)** – 2%\n* **Reddit (RDDT)** – 2%\n\n# Space\n\n* **RocketLab (RKLB)** – 2%\n\n# Power and Thermal Management\n\n* **Eaton Corporation (ETN)** – 3%\n* **Emerson Electric Co. (EMR)** – 3%\n* **Hubbell Incorporated (HUBB)** – 3%\n* **Cameco Corporation (CCJ)** – 3%\n* **Quanta Services, Inc. (PWR)** – 2%\n* **Vertiv (VRT)** – 2%\n\n# Nuclear Energy (Supporting AI Infrastructure)\n\n* **Constellation Energy Corp (CEG)** – 2%\n* **Talen Energy Corporation (TLN)** – 2%\n* **NuScale Power Corporation (SMR)** – 2%\n* **Oklo Inc. (OKLO)** – 2%",
        "created_utc": 1732336903.0,
        "subreddit_name": "investing",
        "comments": 6
    },
    {
        "title": "Any non-AI or IT related stocks or ETF with decent growth potential?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gy4235/any_nonai_or_it_related_stocks_or_etf_with_decent/",
        "content": "I’ve basically put all my money in SPY after losing some money playing popular stocks. Now, I have a feeling that SPY is also the popular stock everyone recommends to buy and it is also very IT centred. I believe in AI being the next big thing . But, i am also afraid of losing all my savings if the market bursts. Any recommendations ?",
        "created_utc": 1732380774.0,
        "subreddit_name": "investing",
        "comments": 7
    },
    {
        "title": "Understanding the Lifecycle of Mining Stocks",
        "score": 1,
        "url": "https://www.reddit.com/r/investing/comments/1gxsj90/understanding_the_lifecycle_of_mining_stocks/",
        "content": "I have recently had some pretty good luck with AI stocks picks, and I'd like to continue to expose myself to the trend of robotics and AI/Renewable energy by investing in some companies that harvest the raw materials used in the manufacture of those goods.  I have some questions about mining companies that I haven't been able to find any decent answers to online though, and I was hoping you all would have some resources to point me towards or best practices. \n\n1. I'm currently invested in $TMQ.  It's performing very well right now, though I have no idea why.  I am chalking it up to sentiment, U.S. located mine, and restricted copper supply.  $TMQ is an exploration company though.  Eventually, that company will need to actually mine the minerals, and my understanding is that the mining is done through a separate, new company.  Is there a standard practice to this?  Will there be a spin off, or will $TMQ create a wholly owned subsidiary and I will continue to hold just the one stock?  I assume this is an \"it depends\" situation, but is there a general case?  \n\n  \n2. Mining companies are unique in that even the best run mines have a shelf life (the amount of metals available in the land holdings).  How do mining companies dispense value to share holders over the life of the mine?  Are they generally high dividend stocks or is the impetus on me to sell at some magical valuation moment.  I doubt that the value of the stock is ownership in the underlying commodity, I just don't understand how the shareholder captures value, and what the timing of that capture is. ",
        "created_utc": 1732340178.0,
        "subreddit_name": "investing",
        "comments": 0
    }
]