[
    {
        "title": "Google's AMP pages/links are outrageously annoying, so with iOS 15 I built a way to block them entirely with an app called Amplosion. It's 33% off for Reddit today, is open source, and as a bonus includes has a Tamagotchi dog that lives in the Settings screen.",
        "score": 7228,
        "url": "https://www.reddit.com/r/apple/comments/pvvi83/googles_amp_pageslinks_are_outrageously_annoying/",
        "content": "Download link: https://itunes.apple.com/app/id1585734696\n\nHey r/Apple,\n\nI'm that guy that builds Apollo for Reddit, and a very common request has been to block those annoying AMP links. Until now that's been very tricky with just the link to go off of, but with iOS 15 Apple added Safari extensions which allow you to do more with intercepting these pages directly, so I built an app/extension to block AMP pages.\n\nI'm calling it Amplosion. It's private, with everything happening on-device and it's [open source](https://github.com/christianselig/Amplosion) to prove it. And today for Reddit, I knocked 33% off the already low price to make it just $2.\n\nFor some extra fun, it includes a Tamagotchi style dog named that lives in the Settings screen for you to play with. His name is Lord Waffles and he's very cute. 🐶\n\n# AMP pages? Huh?\n\nFor the uninitiated, AMP pages are a project Google makes where they basically re-host the webpage with the claimed goal of trying to make it load faster.\n\nThe reality is that it often creates an inconsistent, or [often outright broken experience](https://i.imgur.com/gPIhe7x.mp4), that then mangles the URL for sharing with people by making it three times as long with a bunch of Google junk added. It also adds more ways [for Google to track you](https://i.imgur.com/wbCQXoV.png).\n\nHere's another [article by Daring Fireball](https://daringfireball.net/linked/2017/01/17/schreiber-amp) on AMP's annoyingness.\n\n# Delightful\n\nBlocking AMP pages from your life is very delightful in and of itself, but I wanted the app to go above and beyond to be even more delightful. \n\n- A beautiful 3D flip counter at the top that counts how many AMP articles it's blocked\n- Can show you a breakdown of how many times it's activated for specific sites\n- Customizable, allowing you to enable AMP for specific websites if you so choose\n- As mentioned, everything happens on-device and is open source for transparency\n- In addition to having a loving dog (designed by [Lux](https://twitter.com/thisislux/status/1414982550121062402)), it has a short story about his adventures with his friend who is a turtle\n- Awesome widgets, so you can see your total Amplosions on your home screen (or the status of Lord Waffles)\n- Gorgeous, included [customizable home screen icons](https://i.imgur.com/xdMm6As.png) by Matthew Skiles\n- Works right in Safari and automatically redirects you, no external browser needed\n- No ads, subscriptions, in-app purchases, or funny business. Just pay $2 and enjoy it all. :)\n\nI really, really hope you like the app. It's been such a breath of fresh air to be using for the last few months and I'd love any feedback/input you have. I'll hang around here as long as you want if you have any questions so feel free to AMA me as well haha.\n\nDownload link: https://itunes.apple.com/app/id1585734696",
        "created_utc": 1632668444.0,
        "subreddit_name": "apple",
        "comments": 687
    }
]