[
    {
        "title": "JPMorgan is suing customers accused of theft in viral 'infinite money glitch'",
        "score": 603,
        "url": "https://www.reddit.com/r/stocks/comments/1ge82cr/jpmorgan_is_suing_customers_accused_of_theft_in/",
        "content": "JPMorgan Chase has begun suing customers who allegedly stole thousands of dollars from ATMs by taking advantage of a technical glitch that allowed them to withdraw funds before a check bounced.\n\nThe bank on Monday filed lawsuits in at least three federal courts, taking aim at some of the people who withdrew the highest amounts in the so-called infinite money glitch that went viral on TikTok and other social media platforms in late August.\n\nA Houston case involves a man who owes JPMorgan $290,939.47 after an unidentified accomplice deposited a counterfeit $335,000 check at an ATM, according to the bank.\n\n“On August 29, 2024, a masked man deposited a check in Defendant’s Chase bank account in the amount of $335,000,” the bank said in the Texas filing. “After the check was deposited, Defendant began withdrawing the vast majority of the ill-gotten funds.”\n\nJPMorgan, the biggest U.S. bank by assets, is investigating thousands of possible cases related to the “infinite money glitch,” though it hasn’t disclosed the scope of associated losses. Despite the waning use of paper checks as digital forms of payment gain popularity, they’re still a major avenue for fraud, resulting in $26.6 billion in losses globally last year, according to Nasdaq’s Global Financial Crime Report.\n\nThe infinite money glitch episode highlights the risk that social media can amplify vulnerabilities discovered at a financial institution. Videos began circulating in late August showing people celebrating the withdrawal of wads of cash from Chase ATMs shortly after bad checks were deposited.\n\nNormally, banks only make available a fraction of the value of a check until it clears, which takes several days. JPMorgan says it closed the loophole a few days after it was discovered.\n\nMiami and California\n\nThe other lawsuits filed Monday are in courts including Miami and the Central District of California, and involve cases where JPMorgan says customers owe the bank sums ranging from about $80,000 to $141,000.\n\nMost cases being examined by the bank are for far smaller amounts, according to people with knowledge of the situation who declined to be identified speaking about the internal investigation.\n\nIn each case, JPMorgan says its security team reached out to the alleged fraudster, but it hasn’t been repaid for the phony checks, in violation of the deposit agreement that customers sign when creating an account with the bank.\n\nJPMorgan is seeking the return of the stolen funds with interest and overdraft fees, as well as lawyers’ fees and, in some cases, punitive damages, according to the complaints.\n\nCriminal cases?\n\nThe lawsuits are likely to be just the start of a wave of litigation meant to force customers to repay their debts and signal broadly that the bank won’t tolerate fraud, according to the people familiar. JPMorgan prioritized cases with large dollar amounts and indications of possible ties to organized crime, they said.\n\nThe civil cases are separate from potential criminal investigations; JPMorgan says it has also referred cases to law enforcement officials across the country.\n\n“Fraud is a crime that impacts everyone and undermines trust in the banking system,” JPMorgan spokesman Drew Pusateri said in a statement to CNBC. “We’re pursuing these cases and actively cooperating with law enforcement to make sure if someone is committing fraud against Chase and its customers, they’re held accountable.”\n\nSource: https://www.cnbc.com/2024/10/28/jpmorgan-suing-customers-over-infinite-money-glitch.html",
        "created_utc": 1730136967.0,
        "subreddit_name": "stocks",
        "comments": 240
    },
    {
        "title": "Bloomberg’s estimates on the big four tech giants ",
        "score": 32,
        "url": "https://www.reddit.com/r/stocks/comments/1ge79db/bloombergs_estimates_on_the_big_four_tech_giants/",
        "content": "The big four tech giants are expected to spend a record $56 billion in total capital expenditures in the third quarter, according to the average estimate of analysts aggregated by Bloomberg. Much of that spending will go to NVIDIA and other AI-related device makers, with further increases expected in the coming quarters.\nAll signs point to continued strong AI-related spending. From chip device maker Asmax (ASML.US) to TSMC (TSM.US), AI has been a big part of this earnings season.\nThat backdrop has pushed NVIDIA shares higher, while Chief Executive Jen-Hsun Huang has assured that production of its new Blackwell chips is going well and demand is strong. NVIDIA is the biggest beneficiary of the big investment in artificial intelligence computing devices. The stock hit an all-time high last week and now has a market capitalization of about $3.5 trillion, slightly less than Apple (AAPL.US), which is still the world's most valuable company.\nTo be sure, there are concerns about the big tech companies' spending on artificial intelligence, as investors believe the billions of dollars these companies are investing are generating relatively little revenue. As such, this will be another focus of attention this week when these companies report earnings.\nYou have to walk the fine line of investing,“ said Paul Marino, chief revenue officer at Themes ETFs, ‘so that investors understand that you're ’not going too far”.\nNvidia's revenue is expected to more than double this year to $125.6 billion, according to the average forecast of analysts compiled by Bloomberg. Next year, the chipmaker's fiscal year 2026, sales are expected to grow 44 percent to $181 billion.\nOf course, there are other companies benefiting from high AI spending, including Broadcom, Ultra Micro Computer and Dell Technologies.",
        "created_utc": 1730135004.0,
        "subreddit_name": "stocks",
        "comments": 20
    },
    {
        "title": "PYPL & CROX earnings play (feat. 2 bonus lotto gambles)",
        "score": 171,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1ge36fw/pypl_crox_earnings_play_feat_2_bonus_lotto_gambles/",
        "content": "Big fucking week ahead guys, look at the earnings calendar: AMD, GOOG, SNAP, RDDT, MSFT, META, COIN, HOOD, ETSY, UBER, PTON, AMZN, AAPL, INTC—all reporting this week. Let me lube you guys up with a small play this monday to get in the mood.\n\nToday I got 2 earnings plays for y'all: **Crocs** and **PayPal**, both reporting tomorrow before the open. I also have 2 bonus lotto plays on 2 no-name trash companies that report today after the bell; they’ll be in the TLDR at the bottom.\n\n1. **CROX** \\- In my last post, I opened a long position on DECK since I noticed a big trend with Uggs all over social media, and it paid off. Now I'm seeing the same thing with Crocs. People don’t care that they look like shit anymore; they think it's fashion now. You know those charms you put in the holes of Crocs? Every kid wants them these days. They don’t realize you can get the exact same charms from China for 5% of the price. That’s what I did, and I’ve been rocking the same Crocs for 6 years now. Those crocodiles know how to make shoes man...... Also McDonalds put mini Crocs toys in their happy meals. Expect green dildos.\n2. **PYPL -** PayPal is notorious for having big expectations but then underdelivering. Mfs are trading at a 52W high right now, really poised for a big correction. Apple pay, Google pay, Adyen, Stripe, Square—they're all getting a slice of the cake now. Intel nana is praying for PayPal's downfall. Do not be surprised if this stock goes tits up.\n\nhttps://preview.redd.it/hu87v4wtghxd1.jpg?width=4271&format=pjpg&auto=webp&s=fb91dc692518920b8eb71299312b68113b2e6be8\n\n**tldr:  PYPL go down, CROX go up**\n\n**bonus plays:** I'm shorting both **CDNS** (Cadence Design Systems), and **AMKR** (Amkor Technology). Smaller position.\n\nMy positions:\n\n[Using 5x leveraged CFD's \\(europoor\\). Total position of $28.5k](https://preview.redd.it/1phkmlps5ixd1.png?width=1351&format=png&auto=webp&s=137e122bb78552b0461de5f2dfc05ee759e88715)\n\n*This is not financial advice, do not follow these plays, you will lose money, pleas do not sue me*\n\nGod bless America\n\nEDIT: (3:20 PM EST)\n\n[Covered my PYPL short 40 min before close, not feeling confident anymore. ](https://preview.redd.it/eya5sklvrjxd1.png?width=635&format=png&auto=webp&s=ecf8a8b8181559d8842da41940f4501f13c997fd)\n\n[Only holding these now](https://preview.redd.it/fenv1628sjxd1.png?width=1043&format=png&auto=webp&s=038f82ab4165d078d86d4af9322870d0a04027d7)\n\nResults\n\nhttps://preview.redd.it/hy230toc7pxd1.png?width=639&format=png&auto=webp&s=abffdbf773ec22133d2eeb77d149681b106f304c\n\n  \nEdit 2:\n\nIm very busy today so no post sry, ill be back tomorrow😈",
        "created_utc": 1730125080.0,
        "subreddit_name": "wallstreetbets",
        "comments": 100
    },
    {
        "title": "$NVDA - xAI to Double Down with 100,000 More NVIDIA GPUs, Building World’s Largest AI Supercomputer at Record Speed",
        "score": 628,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1ge8ze6/nvda_xai_to_double_down_with_100000_more_nvidia/",
        "content": "NVIDIA and Elon Musk's xAI are ramping up their colossal supercomputer, *Colossus*, to an unprecedented 200,000 Hopper GPUs—doubling the current 100,000 GPU setup in a scale never before seen. Leveraging NVIDIA's advanced Spectrum-X Ethernet networking for seamless data throughput and zero packet loss, Colossus has already set records, becoming operational in just 122 days. As xAI’s Grok large language models expand, the additional 100,000 GPUs will enable faster, more efficient AI model training, accelerating xAI’s generative AI solutions for consumers and enterprises alike.\n\n[https://nvidianews.nvidia.com/news/spectrum-x-ethernet-networking-xai-colossus](https://nvidianews.nvidia.com/news/spectrum-x-ethernet-networking-xai-colossus)\n\n",
        "created_utc": 1730139199.0,
        "subreddit_name": "wallstreetbets",
        "comments": 254
    },
    {
        "title": "Google Q3 Earnings Preview: Advertising, Cloud and Capex",
        "score": 46,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1ge3xvv/google_q3_earnings_preview_advertising_cloud_and/",
        "content": "Google is set to announce its Q3 earnings on October 29th, after U.S. markets close. Here are key focal points:\n\nhttps://preview.redd.it/cr5hbq1wfixd1.png?width=1080&format=png&auto=webp&s=0ff6f4e0fed7df1b00513c9079e04ecc89b8b18f\n\n**Advertising:**\n\nGoogle remains the world's undisputed leader in search. Data shows that as of September 30th, Google's web traffic rose 1% from the previous quarter, reaching 2.7 billion visits, while Bing, its closest competitor, saw a 3% drop to just 58 million visits. Google's daily active users (DAU) for Q3 grew about 1% quarter-over-quarter and 6% year-over-year.\n\nHowever, even Google must remain vigilant. Google's search dominance is being challenged as fast-rising competitors like TikTok and Amazon capture market share. In fact, Google's share of the U.S. search ad market is expected to dip below 50% next year—a first in over a decade.\n\n**Google Cloud:**\n\nIn the second quarter, Alphabet's results revenue from Google Cloud surged 28% YoY. Can such high growth be sustained? Let's wait and see.\n\n**YouTube:**\n\nYouTube outpaced Instagram and TikTok in DAU growth over the last quarter. In July, August, and September, YouTube maintained positive DAU growth, while its three main competitors saw declines. Additionally, YouTube extended the maximum length of Shorts from 1 minute to 3 minutes, improving monetization potential.\n\n**Other Growth Areas:**\n\nAlphabet has several potential revenue drivers that have yet to impact its bottom line. Waymo, Alphabet's autonomous driving unit, has partnered with Uber to offer driverless rides in Atlanta and Austin. Additionally, Alphabet's Cloud division, which posted $10 billion in revenue and $1 billion in operating profit in Q2, holds strong growth potential.\n\n**Capital Expenditure:**\n\nIn July, CEO Sundar Pichai stated, \"The risk of underinvesting is dramatically greater than the risk of overinvesting for us.\" However, Wall Street's patience is limited; investors are looking for returns on AI investments sooner rather than later. Progress in AI commercialization will be a key focus in this earnings report.\n\n**Antitrust Concerns:**\n\nThe U.S. Department of Justice has launched an antitrust investigation into Google, hinting at a potential breakup. However, history suggests that forced breakups are rare. Google's relatively low valuation already reflects the policy risks it faces.",
        "created_utc": 1730127030.0,
        "subreddit_name": "wallstreetbets",
        "comments": 16
    },
    {
        "title": " Russia is getting Nvidia AI chips from an Indian pharma company | Times of India",
        "score": 6048,
        "url": "https://timesofindia.indiatimes.com/india/russia-is-getting-nvidia-ai-chips-mumbai-drugmaker-putin-shreya-life-sciences-importgenius/articleshow/114672764.cms",
        "content": "",
        "created_utc": 1730145369.0,
        "subreddit_name": "worldnews",
        "comments": 237
    },
    {
        "title": "Apple introduces new iMac supercharged by M4 and Apple Intelligence",
        "score": 2968,
        "url": "https://www.apple.com/newsroom/2024/10/apple-introduces-new-imac-supercharged-by-m4-and-apple-intelligence",
        "content": "",
        "created_utc": 1730127852.0,
        "subreddit_name": "apple",
        "comments": 818
    },
    {
        "title": "Apple put the Magic Mouse’s charging port on the bottom again",
        "score": 2923,
        "url": "https://www.theverge.com/2024/10/28/24276043/apple-new-usb-c-magic-mouse-charging-port-bottom",
        "content": "",
        "created_utc": 1730133350.0,
        "subreddit_name": "apple",
        "comments": 1009
    },
    {
        "title": "The iPhone’s AI Features Launched Today. They’re (Mostly) Unremarkable.",
        "score": 1087,
        "url": "https://www.nytimes.com/wirecutter/reviews/iphone-apple-intelligence-ai-features-launch/",
        "content": "",
        "created_utc": 1730151960.0,
        "subreddit_name": "apple",
        "comments": 255
    },
    {
        "title": "iPhone 16 now banned in Indonesia over Apple’s unfulfilled investment commitments",
        "score": 1000,
        "url": "https://9to5mac.com/2024/10/27/iphone-16-indonesia-ban/",
        "content": "",
        "created_utc": 1730113547.0,
        "subreddit_name": "apple",
        "comments": 234
    },
    {
        "title": "Apple Updates Magic Mouse, Magic Keyboard, and Magic Trackpad With USB-C Ports",
        "score": 813,
        "url": "https://www.macrumors.com/2024/10/28/apple-announces-usb-c-magic-accessories/",
        "content": "",
        "created_utc": 1730128062.0,
        "subreddit_name": "apple",
        "comments": 290
    },
    {
        "title": "Apple Promises Two More Mac Announcements This Week Following New iMac Today",
        "score": 793,
        "url": "https://www.macrumors.com/2024/10/28/apple-promises-two-more-mac-announcements/",
        "content": "",
        "created_utc": 1730140795.0,
        "subreddit_name": "apple",
        "comments": 222
    },
    {
        "title": "Apple Confirms iOS 18.2 With Image Playground, Genmoji and Siri ChatGPT Integration Will Launch in December",
        "score": 595,
        "url": "https://www.macrumors.com/2024/10/28/apple-confirms-ios-18-2-december-launch/",
        "content": "",
        "created_utc": 1730143178.0,
        "subreddit_name": "apple",
        "comments": 60
    },
    {
        "title": "Apple confirms in the new press release that Apple Intelligence is coming to the EU this spring.",
        "score": 580,
        "url": "https://www.apple.com/ke/newsroom/2024/10/apple-introduces-new-imac-supercharged-by-m4-and-apple-intelligence/",
        "content": "Point 7 in the bulletpoints at the bottom.",
        "created_utc": 1730134358.0,
        "subreddit_name": "apple",
        "comments": 92
    },
    {
        "title": "Apple releases iOS/iPadOS 18.1, macOS 15.1, tvOS 18.1 and HomePod 18.1",
        "score": 388,
        "url": "https://www.reddit.com/r/apple/comments/1ge4hox/apple_releases_iosipados_181_macos_151_tvos_181/",
        "content": "**EDIT: watchOS 11.1 is also out**\n\nEarlier than usual, but these updates are now rolling out!\n\nThe release build differs from the RC released last week, so there should be an update available for those on the RC build",
        "created_utc": 1730128367.0,
        "subreddit_name": "apple",
        "comments": 219
    },
    {
        "title": "iMac Announcement - October 28",
        "score": 370,
        "url": "https://youtu.be/eaB7nCdId0Y?si=AE6SrT1JC-ISZBFg",
        "content": "",
        "created_utc": 1730129531.0,
        "subreddit_name": "apple",
        "comments": 113
    },
    {
        "title": "iMac With 10-Core M4 Chip is First Mac to Support 8K Display at 120Hz",
        "score": 340,
        "url": "https://www.macrumors.com/2024/10/28/10-core-m4-imac-supports-8k-display-at-120hz/",
        "content": "",
        "created_utc": 1730150337.0,
        "subreddit_name": "apple",
        "comments": 65
    },
    {
        "title": "AirPods Pro 2 just got these powerful new features with iOS 18.1",
        "score": 265,
        "url": "https://9to5mac.com/2024/10/28/airpods-pro-2-just-got-these-powerful-new-features-with-ios-181/",
        "content": "",
        "created_utc": 1730129844.0,
        "subreddit_name": "apple",
        "comments": 64
    },
    {
        "title": "New Entry-Level iPad Now Expected to Arrive in Spring 2025",
        "score": 256,
        "url": "https://www.macrumors.com/2024/10/28/new-entry-level-ipad-coming-spring-2025/",
        "content": "",
        "created_utc": 1730113315.0,
        "subreddit_name": "apple",
        "comments": 33
    },
    {
        "title": "Forget Apple Intelligence – iOS 18.2 will bring a new Sudoku game to your iPhone",
        "score": 255,
        "url": "https://www.techradar.com/phones/iphone/forget-apple-intelligence-ios-18-2-will-bring-a-new-sudoku-game-to-your-iphone?utm_source=flipboard&utm_content=topic/ios",
        "content": "",
        "created_utc": 1730133937.0,
        "subreddit_name": "apple",
        "comments": 32
    },
    {
        "title": "Lower-End Apple Silicon Macs With 10-Core M4 Chip to Fully Support Two External Displays",
        "score": 182,
        "url": "https://www.macrumors.com/2024/10/28/m4-chip-two-external-displays/",
        "content": "",
        "created_utc": 1730150792.0,
        "subreddit_name": "apple",
        "comments": 24
    },
    {
        "title": "Apple's 10/28/2024 updates's security release details are out now!",
        "score": 87,
        "url": "https://support.apple.com/en-us/100100",
        "content": "",
        "created_utc": 1730134232.0,
        "subreddit_name": "apple",
        "comments": 3
    },
    {
        "title": "Apple Intelligence | Writing Tools | iPhone 16",
        "score": 82,
        "url": "https://youtu.be/3m0MoYKwVTM?si=VydSVG04u2vHXyob",
        "content": "",
        "created_utc": 1730147158.0,
        "subreddit_name": "apple",
        "comments": 77
    },
    {
        "title": "How Apple developed the world’s first end-to-end hearing health experience",
        "score": 83,
        "url": "https://www.apple.com/newsroom/2024/10/how-apple-developed-the-worlds-first-end-to-end-hearing-health-experience/",
        "content": "",
        "created_utc": 1730131702.0,
        "subreddit_name": "apple",
        "comments": 8
    },
    {
        "title": "Apple Intelligence is available today on iPhone, iPad, and Mac ",
        "score": 65,
        "url": "https://www.reddit.com/r/apple/comments/1gedrwn/apple_intelligence_is_available_today_on_iphone/",
        "content": "[https://www.apple.com/newsroom/2024/10/apple-intelligence-is-available-today-on-iphone-ipad-and-mac/](https://www.apple.com/newsroom/2024/10/apple-intelligence-is-available-today-on-iphone-ipad-and-mac/)",
        "created_utc": 1730151035.0,
        "subreddit_name": "apple",
        "comments": 39
    },
    {
        "title": "Daily Advice Thread - October 28, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/apple/comments/1gdybne/daily_advice_thread_october_28_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1730109643.0,
        "subreddit_name": "apple",
        "comments": 30
    },
    {
        "title": "EU to Apple: “Let Users Choose Their Software”; Apple: “Nah”",
        "score": 1070,
        "url": "https://www.eff.org/deeplinks/2024/10/eu-apple-let-users-choose-their-software-apple-nah",
        "content": "",
        "created_utc": 1730155523.0,
        "subreddit_name": "technology",
        "comments": 576
    },
    {
        "title": "Apple’s $1,299 M4 iMac at long last bumps the base model to 16GB of RAM",
        "score": 563,
        "url": "https://arstechnica.com/apple/2024/10/apples-1299-m4-imac-at-long-last-bumps-the-base-model-to-16gb-of-ram/",
        "content": "",
        "created_utc": 1730138349.0,
        "subreddit_name": "technology",
        "comments": 224
    },
    {
        "title": "Electronics boffin creates slot-in MacBook SSD module system — breaks storage limits for every modern MacBook",
        "score": 60,
        "url": "https://www.tomshardware.com/pc-components/storage/electronics-boffin-creates-slot-in-macbook-ssd-module-system-breaks-storage-limits-for-every-modern-macbook",
        "content": "",
        "created_utc": 1730124299.0,
        "subreddit_name": "technology",
        "comments": 26
    },
    {
        "title": "Apple introduces new iMac M4 ",
        "score": 1266,
        "url": "https://www.apple.com/newsroom/2024/10/apple-introduces-new-imac-supercharged-by-m4-and-apple-intelligence/",
        "content": "",
        "created_utc": 1730127747.0,
        "subreddit_name": "mac",
        "comments": 340
    },
    {
        "title": "I am glad that Apple has finally set 16GB RAM as the base memory for the M4 chip...",
        "score": 1149,
        "url": "https://i.redd.it/89rm66ptljxd1.png",
        "content": "",
        "created_utc": 1730141283.0,
        "subreddit_name": "mac",
        "comments": 68
    },
    {
        "title": "When Apple made gorgeous servers 🤩 90 Xserves and 40 Xserve RAIDs on display at NAB 2007 (more photos in comments)",
        "score": 1102,
        "url": "https://i.redd.it/grakuq2j8exd1.jpeg",
        "content": "",
        "created_utc": 1730076613.0,
        "subreddit_name": "mac",
        "comments": 67
    },
    {
        "title": "NEW iMac! Will you be getting one?",
        "score": 1081,
        "url": "https://i.redd.it/ca73gwz4vjxd1.jpeg",
        "content": "",
        "created_utc": 1730144267.0,
        "subreddit_name": "mac",
        "comments": 346
    },
    {
        "title": "Apple continues the easter egg: new iMacs' default wallpaper says \"iMac\"",
        "score": 713,
        "url": "https://www.apple.com/v/imac/q/images/overview/closer-look/colors_pf_blue__bshbmf5v5rki_large_2x.jpg",
        "content": "",
        "created_utc": 1730137778.0,
        "subreddit_name": "mac",
        "comments": 51
    },
    {
        "title": "iMac M4 Color Refresh Comparison",
        "score": 353,
        "url": "https://www.reddit.com/gallery/1ge8g3x",
        "content": "",
        "created_utc": 1730137922.0,
        "subreddit_name": "mac",
        "comments": 139
    },
    {
        "title": "What is this black port thingy on my 2011 MacBook pro",
        "score": 165,
        "url": "https://i.redd.it/6le1vu46lhxd1.jpeg",
        "content": "I have never had a MacBook in my life so any tips are accepted",
        "created_utc": 1730116684.0,
        "subreddit_name": "mac",
        "comments": 49
    },
    {
        "title": "Apple has finally changed the layout of the extended magic keyboard. LET’S GO!!!!",
        "score": 80,
        "url": "https://i.redd.it/jjp6ecsjdjxd1.jpeg",
        "content": "",
        "created_utc": 1730138336.0,
        "subreddit_name": "mac",
        "comments": 84
    },
    {
        "title": "The New M4 iMac at a Glance",
        "score": 74,
        "url": "https://i.redd.it/8fdj0xsn6jxd1.jpeg",
        "content": "",
        "created_utc": 1730136032.0,
        "subreddit_name": "mac",
        "comments": 17
    },
    {
        "title": "Why are there transistors only on one side of the logic board in MacBook Air M2",
        "score": 29,
        "url": "https://i.redd.it/tj4zpa2i2fxd1.jpeg",
        "content": "Rest all other Macs like the m1 Air and m1/m2/m3 pro have components on both sides of the logic board. Why do only the m2/m3 Air defer in this regard. Is it because of the thinner chassis? Can someone with little knowledge about electronics explain this thing to me?",
        "created_utc": 1730086192.0,
        "subreddit_name": "mac",
        "comments": 41
    },
    {
        "title": "iMac",
        "score": 22,
        "url": "https://i.redd.it/gxtln9mbzixd1.jpeg",
        "content": "New color and M4 chip. Don’t use your new iMac M4 at home at night with anti glare and anti reflection glass. It just might be a killer experience ",
        "created_utc": 1730133549.0,
        "subreddit_name": "mac",
        "comments": 10
    },
    {
        "title": "The original Apple Polishing Cloth?",
        "score": 16,
        "url": "https://i.redd.it/qd1ay4h0qexd1.jpeg",
        "content": "",
        "created_utc": 1730087005.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "MacAir M1 overheating when running heavytask",
        "score": 12,
        "url": "https://i.redd.it/ey4vlaswhhxd1.jpeg",
        "content": "I am running a python script from the terminal and the macbook  becomes super hot. I am afraid about the memory. Anything I should be looking out for?\n\nFor info the script parses pdfs creating interrelation maps between different documents. I run it on around 1600 pdfs. It takes around 2hours to run. ",
        "created_utc": 1730115588.0,
        "subreddit_name": "mac",
        "comments": 13
    },
    {
        "title": "Hot take: Apple should include \"write aggressively\" option in proofread AI",
        "score": 11,
        "url": "https://www.reddit.com/r/mac/comments/1ge671w/hot_take_apple_should_include_write_aggressively/",
        "content": "https://preview.redd.it/r6ajlflavixd1.png?width=1008&format=png&auto=webp&s=70906c177ed86f3b6259dfb9036602975261a61d\n\nlook how beautifully passive aggressive this text is. Apple clearly knew people who would write this message, and I think they should include option to make it even more aggressive. ",
        "created_utc": 1730132439.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Is it just me or are some apps not showing up as notifications on the mac from the iPhone?",
        "score": 10,
        "url": "https://www.reddit.com/r/mac/comments/1gec9v3/is_it_just_me_or_are_some_apps_not_showing_up_as/",
        "content": "I had apps like Duo Mobile and others that would pop up as notifications on my Mac, but after updating to 15.1, it kinda messed it all up. Is it just me? \n\nM1 Max ",
        "created_utc": 1730147264.0,
        "subreddit_name": "mac",
        "comments": 14
    },
    {
        "title": "Is Apple going to do a presentation releasing Apple Intelligence and M4 chips EST 1pm today?",
        "score": 10,
        "url": "https://www.reddit.com/r/mac/comments/1ge26y7/is_apple_going_to_do_a_presentation_releasing/",
        "content": "Is Apple going to do a presentation releasing Apple Intelligence and M4 chips EST 1pm today?",
        "created_utc": 1730122515.0,
        "subreddit_name": "mac",
        "comments": 10
    },
    {
        "title": "Do you guys have a Mac that runs windows? If so, do you prefer macOS or windows?",
        "score": 7,
        "url": "https://i.redd.it/9x973cusfkxd1.jpeg",
        "content": "Here’s a picture of mine.",
        "created_utc": 1730151205.0,
        "subreddit_name": "mac",
        "comments": 71
    },
    {
        "title": "So there had to be some guy who did it… and today I’m that guy. (I recently bought an iMac M3)",
        "score": 4,
        "url": "https://www.reddit.com/r/mac/comments/1gedf4n/so_there_had_to_be_some_guy_who_did_it_and_today/",
        "content": "So yeah, my iMac M3 arrived today. Hours before the announcement of the M4.\n\nI could return it, no questions asked, and put a pre-order on the M4. But, as of a couple of weeks ago I’m without a computer, so I’m not too keen on postponing this endeavor a couple of more weeks. And I also got to know that apple actually (probably?) offers a price-protection for situations like these (Although a bit unclear yet as of how much).\n\nNow for the discussion, how big of a difference HAS it been before in incremental improvements like these? Am I being absolutely stupid for considering NOT returning it for an M4? The M3 I ordered was  upgraded with 24GB RAM, and when I compare the specs to the M4 there’s really nothing that stands out to me as an absolute must-have.\n\nOf course no one can answer how the M4 will measure up to the M3, but it would be interesting to hear how others would consider and if someone has been in a similar situation before.",
        "created_utc": 1730150134.0,
        "subreddit_name": "mac",
        "comments": 7
    },
    {
        "title": "Dying GPU on Macbook M3 Air? ",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gdzryo/dying_gpu_on_macbook_m3_air/",
        "content": "Hi everybody\n\nMy Macbook Air M3 8gb model has been crashing like this during more intense 3D work / trying to run videogames for longer periods of time\n\nI took it to get serviced **twice** (!!!) and both times they told me they could detect **no errors** and that nothing was wrong with the hardware - I guess because the diagnostics they ran didnt stress the system enough, as it doesnt appear right away necessarily\n\nI posted once already some time ago because I was also getting graphical artifacts during some benchmarks. Somehow and someway - that no longer occurs. But still crashes with weird flashing colors\n\nPictures are some tests : 1) Crash during No Man's Sky - sound and game keep running in background, display freezes on that color abomination\n\n[https://imgur.com/a/5y9qeGO](https://imgur.com/a/5y9qeGO)\n\n2) Past flickering artifacts during OpenGL benchmark\n\nI understand the Air models are not gaming laptops nor do i use them for gaming, but I don't think the laptop should behave like this if i decide to play something once in a while. I am at a loss because the apple certified service places refuse to acknowledge that there is a problem....",
        "created_utc": 1730115220.0,
        "subreddit_name": "mac",
        "comments": 11
    },
    {
        "title": "Do business and companies still use Mac servers in production?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gdxk4q/do_business_and_companies_still_use_mac_servers/",
        "content": "Hi everyone,\n\nI just saw [this post](https://reddit.com/r/mac/comments/1gdpzg2/when_apple_made_gorgeous_servers_90_xserves_and/) mentioning that Apple had designed and manufactured these gorgeous several years back then.\n\nSo I went to check Apple website and it seems that the “Mac servers” now are Mac Pro, and to a some extent, a Mac Studio. I was also lurking on r/homelab and it seems that popular choices from second-hand markets are Dell, HP, or Lenovo servers.\n\nFrom my understanding and reading, Mac products seem to be used a lot in media industry, for instance, for rendering. So I was wondering that do people still use Mac servers, eg Mac Pro, in business and/or in production, like software business or web apps? If so, what is your field? Do you still use macOS or just install Linux/BSD?\n\nMany thanks!",
        "created_utc": 1730106181.0,
        "subreddit_name": "mac",
        "comments": 14
    },
    {
        "title": "Word document completely disappeared from Mac after doing a force quit - any ideas?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1geg7qk/word_document_completely_disappeared_from_mac/",
        "content": "Hello,\n\nI lost an important word document earlier today when working on my Mac (MacBook Pro 2017 running Ventura 13.6) in Word version 16.78 from 2021 and am hoping someone has ideas on how I could recover the data! \n\nThe document is fairly large (~380 pages) and it was responding very slowly, so I did a force quit. When I went to reopen, the document had completely vanished from my machine. \n\nI have tried troubleshooting by searching in Spotlight, looking at Word recents and Word auto recovery, and searching temporary folders. I can’t find anything. I have been doing monthly backups to Time Machine, but I just learned that Time Machine never backs up anything that is open for writing (and unfortunately this document was always open. I never close it.) \n\nI called someone in data recovery who said it was a very low chance to recover this document, but he was shocked that something so big could have never been saved and wasn’t showing up in any temporary folders. \n\nPlease help!! Does anyone have any other ideas I can try to recover this document? \n\nThank you! ",
        "created_utc": 1730157315.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Help with restoring my late 2016 Macbook Pro ",
        "score": 2,
        "url": "https://i.redd.it/bhj6efm3ijxd1.jpeg",
        "content": "hey y’all, i have had this sweet machine since 2016 and have taken immaculate care of the hardware. \n\nonce i moved over to a desktop for my work about a year and a half ago, i stopped using the Macbook pretty much cold turkey. now, i want to return to using it for lower cpu tasks like writing so i can work outside the house. \n\nbasically, i spent 2 hours with Apple support on the phone on friday. the issue began with my being locked out of the computer, though i was 100% sure of the password. even the “reset password with Apple ID” pop up did not work, and the very helpful customer service person verified that. \n\non the phone, as we tried to unlock the computer, things unraveled and revealed some larger issues. i was locked out because the OS installed (it was running bug sur) was corrupted, according to the cs person. \n\nanyway, we resolved the corruption by clearing all the drives and uninstalling OS. however, now that it’s at a point of being ready to reinstall, i keep getting this pop up that says it can’t be installed for some reason. i have now tried this about 5 times with slight variations and nothing has worked. \n\nApple customer service told me the only way to fix it now is to bring it to a “vintage” repair place which is located 90 minutes from my home… \n\nhas anyone had an experience like this?? is there any way to restore it to big sur before updating, or would there be any reason to do so? how would y’all go about resolving this? \n\nand please don’t shame or blame me for running an old OS… that’s not helpful. \n\nthank you!!",
        "created_utc": 1730139872.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Uneven Local Dimming in HDR on MacBook Pro M3 Mini-LED Display",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ge8uno/uneven_local_dimming_in_hdr_on_macbook_pro_m3/",
        "content": "https://preview.redd.it/mmyceou3fjxd1.jpg?width=2048&format=pjpg&auto=webp&s=a1a5f04bd6cc4666b5343b50a761dda096468673\n\nhttps://preview.redd.it/19jnplw4fjxd1.jpg?width=2048&format=pjpg&auto=webp&s=12db9490e7e131de7ff5f5d7ad10d9cc17589fa5\n\nI've noticed that in dark scenes, certain areas appear much darker than others, like shadows within the dark scenes, and it looks unnatural. Is this a characteristic of the Mini-LED display, or could it be a software/hardware issue? If you look closely at the images, you’ll notice these darker sections that stand out from the rest.  \n",
        "created_utc": 1730138891.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Running Sidecar on Ventura?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ge7v4m/running_sidecar_on_ventura/",
        "content": "Attempting to use my new iPad Pro M4 as an extended display (wired) for my 2019 MacBook Pro running Ventura. I cannot update to the latest software as I do not have 15 GB of free storage and was hoping it would work on Ventura since it is newer than Catalina, which are the requirements. I was able to connect my iPad through my Mac's system settings and do see my Mac's desktop on the iPad; however, I cannot move my mouse over to my iPad or open anything. Advice please!",
        "created_utc": 1730136477.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "Macbook Pro M2 crashed with a glitchy screen, is this serious?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ge3jbd/macbook_pro_m2_crashed_with_a_glitchy_screen_is/",
        "content": "https://preview.redd.it/73nw11vpcixd1.jpg?width=1536&format=pjpg&auto=webp&s=d80bb82f4e628b2daf61d96ccdcba9f1c486c29e\n\nMy friend's 14\" Macbook Pro M2 crashed while she was away from the screen for a moment. When she came back, the screen was all glitchy (see image).\n\nI guess it's something GPU related, but is this something to be worried about or just a normal crash. I'm asking because Apple Care+ is ending in a month. Should she have it checked or can she just assume it was some process that went haywire?",
        "created_utc": 1730125997.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "Apple M1 Broken Screen",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ge06wq/apple_m1_broken_screen/",
        "content": "My friend gave me his MacBook Pro m1 since the screen recently gave out. But it still turns on and everything still works. There is a second hand place that will repair it for around 280 dollars where as apple will be 700. Is that worth it? Should I do that or is it sketchy doing it from a place other then apple. The guy at the store said he would get all apple products same as the old screen. ",
        "created_utc": 1730116676.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "MacBook Pro 2015 mid stuck on an infinite boot-loop with Apple logo and 3/4 boot progress bar",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gdzn8u/macbook_pro_2015_mid_stuck_on_an_infinite/",
        "content": "I can use safe mode to enter the system, but the operation is a bit laggy.\n\nThe battery on the mac is damaged, tried removing the battery and booting with only the power cable also stuck on an infinite boot-loop.\n\nAny ideas on how to fix this situation? Thank you!",
        "created_utc": 1730114763.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Disable spatial audio when Mac is acting as Airplay receiver?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gdxia3/disable_spatial_audio_when_mac_is_acting_as/",
        "content": "Does anyone know how to disable spatial audio when a Mac is recieving Airplay from e.g. an iPhone? I think it is tracked spatial audio, it seems to change as I move my head (though doesn't do a great job tracking!).\n\nThere doesn't seem to be any way to get from full screen playback to the menu bar (where the setting lives) without stopping playback, at which point the spatial audio option disappears. I tried disabling \"Spatial audio follows head movements\" in Accessibility but it didn't help.\n\nOnly a minor annoyance as I only use it for the Nike Training Club app, but was curious if anyone knew of a solution!",
        "created_utc": 1730105969.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "New to Mac. Why is my 5GHz network not connecting?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gdt1iq/new_to_mac_why_is_my_5ghz_network_not_connecting/",
        "content": "Title says most of it. I got a MacBook air sent to me for school and half the time the dang thing won't connect to my 5GHz wifi network. 2.4 is completely fine besides saying my network isn't secure (it is). But I'm having the worst time getting my wifi to actually transmit data over the internet. Every single other device in my apartment is fine, from googleOS, Windows, Linux, and even iOS phones and tablets. So it HAS to be how things are configured. \n\nI'd like to mention that both networks come from the same modem. Sometimes the network is completely fine. Other times it only connects and says \"no internet\".\n\n",
        "created_utc": 1730086578.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "Lightning struck: Apple migrates all of its accessories to USB-C",
        "score": 2820,
        "url": "https://www.androidauthority.com/apple-migrates-accessories-usb-c-3494669/",
        "content": "",
        "created_utc": 1730140042.0,
        "subreddit_name": "gadgets",
        "comments": 317
    },
    {
        "title": "Animal tracking made affordable with 7 dollar Bluetooth beacons, thanks to Apple's Find My network | A more efficient alternative to the GPS trackers generally used by conservationists",
        "score": 592,
        "url": "https://www.techspot.com/news/105317-animal-tracking-made-affordable-7-bluetooth-beacons-thanks.html",
        "content": "",
        "created_utc": 1730104998.0,
        "subreddit_name": "gadgets",
        "comments": 34
    },
    {
        "title": "Apple iPhone SE 4 leaks: March 2025 release, iPhone 16 chip, larger screen, and higher price | A pretty big screen for an iPhone SE",
        "score": 357,
        "url": "https://www.techspot.com/news/105325-tapple-iphone-se-4-leaks-march-2025-release.html",
        "content": "",
        "created_utc": 1730125242.0,
        "subreddit_name": "gadgets",
        "comments": 188
    },
    {
        "title": "Apple may tap into a beloved retro design for its smart home display / The device resembles the iMac G4, according to Mark Gurman.",
        "score": 288,
        "url": "https://www.engadget.com/home/smart-home/apple-may-tap-into-a-beloved-retro-design-for-its-smart-home-display-210412601.html",
        "content": "",
        "created_utc": 1730104022.0,
        "subreddit_name": "gadgets",
        "comments": 43
    },
    {
        "title": "Apple updates the iMac with new colors and an M4 chip | The company has introduced an update of its all-in-one desktop computer.",
        "score": 278,
        "url": "https://www.theverge.com/2024/10/28/24273124/apple-imac-m4-chip-announced-price-release-date",
        "content": "",
        "created_utc": 1730128982.0,
        "subreddit_name": "gadgets",
        "comments": 50
    },
    {
        "title": "Meta Quest 3S review: Apple would never make this - 9to5Mac",
        "score": 0,
        "url": "https://9to5mac.com/2024/10/27/meta-quest-3s-review/",
        "content": "",
        "created_utc": 1730103478.0,
        "subreddit_name": "gadgets",
        "comments": 5
    },
    {
        "title": "r/Stocks Daily Discussion Monday - Oct 28, 2024",
        "score": 12,
        "url": "https://www.reddit.com/r/stocks/comments/1gdxwsd/rstocks_daily_discussion_monday_oct_28_2024/",
        "content": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1730107808.0,
        "subreddit_name": "stocks",
        "comments": 140
    },
    {
        "title": "Lurker who lost their life savings ",
        "score": 8409,
        "url": "https://www.reddit.com/gallery/1gef8bh",
        "content": "I'm in so much despair. I know there'll be a bunch of Wendy's jokes coming my way, but this really hurt. \n\nI must've lost my mental at the sight of losing a little, that I risked all of it trying to get that little bit back. I would do anything to go back to where I was before the big sell off on Friday. \n\nYes it was SPY calls that killed me. ",
        "created_utc": 1730154723.0,
        "subreddit_name": "wallstreetbets",
        "comments": 1556
    },
    {
        "title": "Here's how the boring LEAPS are doing",
        "score": 217,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gebbyz/heres_how_the_boring_leaps_are_doing/",
        "content": "https://preview.redd.it/lx1z1zz5pjxd1.jpg?width=1080&format=pjpg&auto=webp&s=0d625c098c5be7eba147ffd0790b2deef1a8ae4e\n\nhttps://preview.redd.it/9vhliyy7pjxd1.jpg?width=1080&format=pjpg&auto=webp&s=5575e592dbbb8460261c602c65677eadd7292369\n\nIt's been one year since I bought my last batch of LEAPS. Here's the basic rundown of my strategy:\n\n1. stocks only go up\\*\n\n2. when stocks go up calls go up more\\*\\*\n\n3. hold calls for at least 1 year (LEAPS) to pay less on capital gains tax\n\n  \\* usually\n\n  \\*\\* sometimes\n\nNow that we have the best strategy to maximize our gains we should also take a few steps to minimize our  losses. No matter how many gains you get it's all over if you multiply by 0 a single time. The best way to avoid that is with diversification.\n\nfour-step diversification process:\n\n1. buy calls on etfs instead of stocks so any one company can't bankrupt you\n\n2. buy different etfs WITH LOW CORRELATION. I considered hedging QQQ with SPY but...\n\nhttps://preview.redd.it/hi0kdnskpjxd1.png?width=492&format=png&auto=webp&s=a8e4283533b12dc738964d3e619aa7ef37593bd1\n\nit wouldn't be much of a hedge at all at .84 correlation. Instead I went with XLP:\n\nhttps://preview.redd.it/z4xsm39ppjxd1.png?width=254&format=png&auto=webp&s=0f977779a87e372d3f2668c2f393b1274e204e1d\n\n3. buy calls at different expiration dates so you don't get blown up by one freak event (like March 2020)\n\n4. leave some money \"on the sidelines\" (in QQQ shares) so you can still buy the dip if stocks go down or sideways for 2 or more years\n\nWith those rules in mind the two etfs I picked were QQQ and XLP as the LEAPS offerings were pretty limited on Robinhood 6 years ago and these two backtested the best given my strategy.  \n\n\n\"Show all time\"\n\nRobinhood's all time chart sucks and makes it look like I started with 160k in 2018. I actually started with 3k and made steady deposits every few months since then.\n\nhttps://preview.redd.it/7fimq74iqjxd1.jpg?width=1080&format=pjpg&auto=webp&s=866eadc4b89dbfa6040c708247a0db8f83ef600d\n\nIf you wanted to see the real %return of my strategy over the past 6 years you would have to track every buy, sell, deposit, and withdrawal so you could adjust the % gains based on my total cost basis at the time... which I attempted here: [Supplemental Post](https://www.reddit.com/user/lightStoleMyName/comments/1geawok/an_attempt_at_adjusting_total_return_for_deposits/)\n\nIn the end it was more like +350% all time for a 27% average annual return. Compared to QQQ shares in the same timeframe (+160% for 15% annual) it's not half bad. Compare it to TQQQ on the other hand (+390%) and yeah maybe I'm just massively over-complicating the process of getting leverage. As expected QQQ calls outperformed by a lot accounting for 180k of my gains but my underperforming XLP calls (just 78k of gains) are the price I pay for being a wuss.\n\nBelow is the screenshot after selling everything that was up for long term gains cuz I know you're supposed to sell for a gain post. The QQQ calls are staying a litter longer because technically I bought them on Oct 27 but the dividend event makes robinhood mark them as Dec 28th so I wanna be real sure they won't miss-categorize them as short term capital gains before I sell. I reached out to customer support at 10:00AM and they'll \"check with the back office team and email me within the hour\"\n\nhttps://preview.redd.it/mo2x3mq4tjxd1.jpg?width=1080&format=pjpg&auto=webp&s=0563852d35c888d7b4a7557a2bc411ab98b99f04\n\nTLDR: everyone is a genius in a bull market and this is just one way of getting leverage, but it's my way and I like it.",
        "created_utc": 1730144940.0,
        "subreddit_name": "wallstreetbets",
        "comments": 40
    },
    {
        "title": "Selling VOO calls thinking market will go down or flat in 2025",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gdsv8j/selling_voo_calls_thinking_market_will_go_down_or/",
        "content": "I think there is a good chance that 2025 will be negative or a small gain. I’d be surprised if 2025 has a strong 15-20% return like this year.\n\nWith this in mind would it make sense to sell out of the money covered calls?\n\nBasically sell December 2025 covered calls that have a strike price 10% higher than the current price. That will pay out about a 3.5% premium.\n\n\nIf the market goes down I out perform the market by at least 3.5%. Then I can use the premium to buy shares at a depressed price.\n\nIf the market goes up less than 13.5% I still outperform the market.\n\nI only lose if the market goes up over 13.5%. Not the best but at least I got a nice return. \n\nWith more volatile investments like QQQ or individual stocks you can higher premiums and higher strike prices.\n\nQQQ - strike price 15% higher than current price. Premium is 4.5%. Basically the only way you lose is if the QQQ goes up more than 20%\n\nDoes this strategy make sense?\n\nI would think the majority of years you would win out. Especially if it’s something like QQQ. How many years does it go up over 20%? How many years does it go down or go up less than 20%? I’d say at least 70% of the time you will win.\n\nAnd even if you ‘lose’ you could roll the options one year into the future and you won’t have to sell your shares\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
        "created_utc": 1730085980.0,
        "subreddit_name": "investing",
        "comments": 32
    },
    {
        "title": "28/10 - PREMARKET REPORT - All the major market moving news  from hours of premarket reading all condensed into one 5 minute read. ",
        "score": 43,
        "url": "https://www.reddit.com/r/Daytrading/comments/1ge01y7/2810_premarket_report_all_the_major_market_moving/",
        "content": "**MACRO DATA:**\n\n* China industrial profits numbers come in at -3.5% vs 0.3% expected. Hence weak China industrial profit numbers. \n* Treasury auctions today for 6 month, 3 month, 2 year and 5 year. \n* With bonds a key focus at the moment in the market, being elevated, these treasury auctions are going to be that much more important. \n\n**MARKETS AND FX:**\n\n* Japan’s Ruling LDP loses majority - uncertainty in parliament and markets. \n* Fell short of the 233 seat majority, only secured 215 seats. This means SHigeru Ishiba has to find new allies within 30 days to keep power. **The Bank of Japan’s rate path may face added complications with a weaker government. So less rate hikes.**\n* Yen down today on this, nikkei higher on this. \n* Oil down as ISrael attack on Iran didnt target any oil facilities but instead focused on military bases. This reduces supply disruption which removes a tailwind for oil. Iran also downplayed the attack saying they do not want war. Traders had been bullish on oil on fri, v strong flow, but now IV crush lower. Traders caught out. nearing next support zone at 65.5-67\n* SPX: Slightly higher, trading above the 5835 key level. \n* Nasdaq: Bounced off of 20,500 level in premarket. Most major big tech names higher. \n* Dow Jones: After sell off over last week, is just trying to recover the breakout at 42,300. \n* HKG50 - flat, despite China’s announcement of more stimulus. This shows that the stimulus announced did little to wet the appetite of investors. \n* GER40: gapped up but pared all the gains now flat on the day. \n* VIX: maintaining at 19.24.\n* bond yields elevated. I will be hoping to see bond yields cool off as a result of plunging oil prices. Higher bond yields are a headwind to teh amrket as they attract invstor capital away from equities. We want to see bond yields fall asap, which should happen if we look at historical data on rising bond yields following the first rate cut.\n\n**MAG 7:**\n\n* TSLA - Bernstein gives another underperform rating, price target at 120. I think Bernstein can basically be ignored at this point. They are Tesla perma bulls and it’s just getting boring at this point. Said that margin strength in last quarter was driven by one off deferred revenue recognitions and commodity contract renewals. Said 20-30% unit growth as Tesla suggested is unlikely.\n* TSLA - Price target raised to 298 from 278 at Canaccord, who maintain their buy rating. \n* TSLA - price target raised to 285 from 225 at Daiwa. Maintained at Buy. \n* These are more respectable price targets although I think Canaccord are closer to the mark. \n* TSLA.- extends its 5 year 0% interest loan offer in China until November 30th - increasing incentives on China demand. Applies to rear wheel drive and long range versions. \n* MST ahead of earnings, Truist mark as a buy, says they are set to outperform across key enterprise categories. Price target 600. \n* AAPL - JPM say that in their tracker of Apple product availability (as a proxy of demand), they see that lead times are more or less in line with iPhone 15, hence demand resilient. \n\nOTHER COMPANIES:\n\n* Crypto names all higher in premarket again on strong bitcoin price action.\n* Oil stocks all lower obviously on oil dumping.  \n* CORZ - Jefferies initiated with buy rating, price target of 19. Said journey is impressive post bankruptcy comeback story. Said they are now utilising their power for Ai focused data centres. \n* HOOD - launching contracts that allow users to bet on the 2024 presidential election, following federal court ruling that cleared the way for election betting in the US. \n* INTC - expanding their facility in Chengdu, China in order to boost server chip packaging. \n* GPN - Bernstein says that they are rated at market perform, and represent a potential activist investor play. \n* LLY - received approval to sell Mounjaro in Hong Kong with sales expected to start by year end. This is their weight management and diabetes drug. They got ahead of NVO who haven’t launched their weight loss drug in Hong Kong yet. \n* Volkswagen is planning to cut costs, considering a 10% wage bill reduction and 2 year wage freeze. Also potential to cap bonuses for top employees\n* TSM has suspended shipments to chinese chipmaker Sophgo after the TSM chips were found on Huawei’s Ascend. They say that Sophgo illegally redistributed TSM chips.\n* Bigger news, TSM founder says the firm can still see most severe challenges from US restrictions. \n* MCD - ahead of earnings tomorrow, they announce they are bringing back quarter pounders next week after e coli outbreak is contained. Said that the contaminated products are no longer in their supply chain. \n* Boeing is planing a $15B+ capital raise in order to avoid junk credit rating. They will raise this through. Mix of equity dn convertible debt. Wants to boost liquidity and keep investment grade status. \n* SSNC - Citi raises their price target to 86 from 81, maintains at buy \n* AVTR higher after earnings related sell off on Friday. Currently higher as they got bullish price targets from Morgan Stnaley, Baird, RBC and Wells Fargo\n* AAL - higher as Citigroup raises price target to 16 from 13.5.\n\nOTHER NEWS:\n\n* Japan’s Ruling LDP loses majority - uncertainty in parliament and markets. \n* Fell short of the 233 seat majority, only secured 215 seats. This means SHigeru Ishiba has to find new allies within 30 days to keep power. **The Bank of Japan’s rate path may face added complications with a weaker government. So less rate hikes.**\n* Yen down today on this, nikkei higher on this. \n* BOJ will be on this week, expectation is for holding. \n* UK BUDGET WILL BE ANNOUNCED THIS WEEK. EXPECTATION IS FOR HIGHER BORROWING, TAX HIKES AND HIGHER SPENDING. Likely will see net growth positive budget, so more likely for cautious BoE cuts. \n* Big tech earnings this week - generally, major desks are optimistic going into the week.  JPM says the fact that any earnings question marks are being overlooked entirely with NFLX, NOW and VRT, bodes well for Mega cap earnings this week. \n* Apple in my opinion the one most likely to disappoint. \n* China announces a new outright open market reverse repo tool, targeting primary dealers. \n* Note that in truth this is useless. China here want to look like they are doing QE without actually doing QE it seems. I can’t imagine this measure will have any notable impact on the Chinese economy, which explains why the Hong Kong market is trading entirely flat. \n* Musk says that he can cut at least $2T from the federal budget if Tru-mp is elected as president. Trum-p has said that Musk will be head of cost cutting. \n* MOODYS cuts France’s rating outlook to negative over deficit woes. France are moving like Italy now. \n* NYSE to extend ARCA trading hours to 22 hours a day. Still pending regulatory approval. \n* North Korean troops sent to Russia\n* Russia say they are trying to de-escalate the Israel and Iran situation\n* ECB’s Knot says that they are taking a meeting by meeting approach still. ",
        "created_utc": 1730116204.0,
        "subreddit_name": "DayTrading",
        "comments": 5
    },
    {
        "title": "Apple Intelligence is available today on iPhone, iPad, and Mac",
        "score": 12,
        "url": "https://www.stocktitan.net/news/AAPL/apple-intelligence-is-available-today-on-i-phone-i-pad-and-mhk5fpfhgzx8.html",
        "content": "",
        "created_utc": 1730127602.0,
        "subreddit_name": "AAPL",
        "comments": 0
    },
    {
        "title": "Apple unveils the new iMac with M4, supercharged by Apple Intelligence and available in fresh colors",
        "score": 9,
        "url": "https://www.stocktitan.net/news/AAPL/apple-unveils-the-new-i-mac-with-m4-supercharged-by-apple-pgjpm4iacke4.html",
        "content": "",
        "created_utc": 1730128563.0,
        "subreddit_name": "AAPL",
        "comments": 0
    },
    {
        "title": "Apple $245 11/1 calls will print? ",
        "score": 2,
        "url": "https://www.reddit.com/r/AAPL/comments/1gegh0l/apple_245_111_calls_will_print/",
        "content": "Do you think near earnings calls will print ? ",
        "created_utc": 1730158025.0,
        "subreddit_name": "AAPL",
        "comments": 12
    }
]