[
    {
        "title": "JPMorgan is suing customers accused of theft in viral 'infinite money glitch'",
        "score": 603,
        "url": "https://www.reddit.com/r/stocks/comments/1ge82cr/jpmorgan_is_suing_customers_accused_of_theft_in/",
        "content": "JPMorgan Chase has begun suing customers who allegedly stole thousands of dollars from ATMs by taking advantage of a technical glitch that allowed them to withdraw funds before a check bounced.\n\nThe bank on Monday filed lawsuits in at least three federal courts, taking aim at some of the people who withdrew the highest amounts in the so-called infinite money glitch that went viral on TikTok and other social media platforms in late August.\n\nA Houston case involves a man who owes JPMorgan $290,939.47 after an unidentified accomplice deposited a counterfeit $335,000 check at an ATM, according to the bank.\n\n“On August 29, 2024, a masked man deposited a check in Defendant’s Chase bank account in the amount of $335,000,” the bank said in the Texas filing. “After the check was deposited, Defendant began withdrawing the vast majority of the ill-gotten funds.”\n\nJPMorgan, the biggest U.S. bank by assets, is investigating thousands of possible cases related to the “infinite money glitch,” though it hasn’t disclosed the scope of associated losses. Despite the waning use of paper checks as digital forms of payment gain popularity, they’re still a major avenue for fraud, resulting in $26.6 billion in losses globally last year, according to Nasdaq’s Global Financial Crime Report.\n\nThe infinite money glitch episode highlights the risk that social media can amplify vulnerabilities discovered at a financial institution. Videos began circulating in late August showing people celebrating the withdrawal of wads of cash from Chase ATMs shortly after bad checks were deposited.\n\nNormally, banks only make available a fraction of the value of a check until it clears, which takes several days. JPMorgan says it closed the loophole a few days after it was discovered.\n\nMiami and California\n\nThe other lawsuits filed Monday are in courts including Miami and the Central District of California, and involve cases where JPMorgan says customers owe the bank sums ranging from about $80,000 to $141,000.\n\nMost cases being examined by the bank are for far smaller amounts, according to people with knowledge of the situation who declined to be identified speaking about the internal investigation.\n\nIn each case, JPMorgan says its security team reached out to the alleged fraudster, but it hasn’t been repaid for the phony checks, in violation of the deposit agreement that customers sign when creating an account with the bank.\n\nJPMorgan is seeking the return of the stolen funds with interest and overdraft fees, as well as lawyers’ fees and, in some cases, punitive damages, according to the complaints.\n\nCriminal cases?\n\nThe lawsuits are likely to be just the start of a wave of litigation meant to force customers to repay their debts and signal broadly that the bank won’t tolerate fraud, according to the people familiar. JPMorgan prioritized cases with large dollar amounts and indications of possible ties to organized crime, they said.\n\nThe civil cases are separate from potential criminal investigations; JPMorgan says it has also referred cases to law enforcement officials across the country.\n\n“Fraud is a crime that impacts everyone and undermines trust in the banking system,” JPMorgan spokesman Drew Pusateri said in a statement to CNBC. “We’re pursuing these cases and actively cooperating with law enforcement to make sure if someone is committing fraud against Chase and its customers, they’re held accountable.”\n\nSource: https://www.cnbc.com/2024/10/28/jpmorgan-suing-customers-over-infinite-money-glitch.html",
        "created_utc": 1730136967.0,
        "subreddit_name": "stocks",
        "comments": 240
    },
    {
        "title": "Bloomberg’s estimates on the big four tech giants ",
        "score": 32,
        "url": "https://www.reddit.com/r/stocks/comments/1ge79db/bloombergs_estimates_on_the_big_four_tech_giants/",
        "content": "The big four tech giants are expected to spend a record $56 billion in total capital expenditures in the third quarter, according to the average estimate of analysts aggregated by Bloomberg. Much of that spending will go to NVIDIA and other AI-related device makers, with further increases expected in the coming quarters.\nAll signs point to continued strong AI-related spending. From chip device maker Asmax (ASML.US) to TSMC (TSM.US), AI has been a big part of this earnings season.\nThat backdrop has pushed NVIDIA shares higher, while Chief Executive Jen-Hsun Huang has assured that production of its new Blackwell chips is going well and demand is strong. NVIDIA is the biggest beneficiary of the big investment in artificial intelligence computing devices. The stock hit an all-time high last week and now has a market capitalization of about $3.5 trillion, slightly less than Apple (AAPL.US), which is still the world's most valuable company.\nTo be sure, there are concerns about the big tech companies' spending on artificial intelligence, as investors believe the billions of dollars these companies are investing are generating relatively little revenue. As such, this will be another focus of attention this week when these companies report earnings.\nYou have to walk the fine line of investing,“ said Paul Marino, chief revenue officer at Themes ETFs, ‘so that investors understand that you're ’not going too far”.\nNvidia's revenue is expected to more than double this year to $125.6 billion, according to the average forecast of analysts compiled by Bloomberg. Next year, the chipmaker's fiscal year 2026, sales are expected to grow 44 percent to $181 billion.\nOf course, there are other companies benefiting from high AI spending, including Broadcom, Ultra Micro Computer and Dell Technologies.",
        "created_utc": 1730135004.0,
        "subreddit_name": "stocks",
        "comments": 20
    },
    {
        "title": "PYPL & CROX earnings play (feat. 2 bonus lotto gambles)",
        "score": 171,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1ge36fw/pypl_crox_earnings_play_feat_2_bonus_lotto_gambles/",
        "content": "Big fucking week ahead guys, look at the earnings calendar: AMD, GOOG, SNAP, RDDT, MSFT, META, COIN, HOOD, ETSY, UBER, PTON, AMZN, AAPL, INTC—all reporting this week. Let me lube you guys up with a small play this monday to get in the mood.\n\nToday I got 2 earnings plays for y'all: **Crocs** and **PayPal**, both reporting tomorrow before the open. I also have 2 bonus lotto plays on 2 no-name trash companies that report today after the bell; they’ll be in the TLDR at the bottom.\n\n1. **CROX** \\- In my last post, I opened a long position on DECK since I noticed a big trend with Uggs all over social media, and it paid off. Now I'm seeing the same thing with Crocs. People don’t care that they look like shit anymore; they think it's fashion now. You know those charms you put in the holes of Crocs? Every kid wants them these days. They don’t realize you can get the exact same charms from China for 5% of the price. That’s what I did, and I’ve been rocking the same Crocs for 6 years now. Those crocodiles know how to make shoes man...... Also McDonalds put mini Crocs toys in their happy meals. Expect green dildos.\n2. **PYPL -** PayPal is notorious for having big expectations but then underdelivering. Mfs are trading at a 52W high right now, really poised for a big correction. Apple pay, Google pay, Adyen, Stripe, Square—they're all getting a slice of the cake now. Intel nana is praying for PayPal's downfall. Do not be surprised if this stock goes tits up.\n\nhttps://preview.redd.it/hu87v4wtghxd1.jpg?width=4271&format=pjpg&auto=webp&s=fb91dc692518920b8eb71299312b68113b2e6be8\n\n**tldr:  PYPL go down, CROX go up**\n\n**bonus plays:** I'm shorting both **CDNS** (Cadence Design Systems), and **AMKR** (Amkor Technology). Smaller position.\n\nMy positions:\n\n[Using 5x leveraged CFD's \\(europoor\\). Total position of $28.5k](https://preview.redd.it/1phkmlps5ixd1.png?width=1351&format=png&auto=webp&s=137e122bb78552b0461de5f2dfc05ee759e88715)\n\n*This is not financial advice, do not follow these plays, you will lose money, pleas do not sue me*\n\nGod bless America\n\nEDIT: (3:20 PM EST)\n\n[Covered my PYPL short 40 min before close, not feeling confident anymore. ](https://preview.redd.it/eya5sklvrjxd1.png?width=635&format=png&auto=webp&s=ecf8a8b8181559d8842da41940f4501f13c997fd)\n\n[Only holding these now](https://preview.redd.it/fenv1628sjxd1.png?width=1043&format=png&auto=webp&s=038f82ab4165d078d86d4af9322870d0a04027d7)\n\nResults\n\nhttps://preview.redd.it/hy230toc7pxd1.png?width=639&format=png&auto=webp&s=abffdbf773ec22133d2eeb77d149681b106f304c\n\n  \nEdit 2:\n\nIm very busy today so no post sry, ill be back tomorrow😈",
        "created_utc": 1730125080.0,
        "subreddit_name": "wallstreetbets",
        "comments": 100
    },
    {
        "title": "$NVDA - xAI to Double Down with 100,000 More NVIDIA GPUs, Building World’s Largest AI Supercomputer at Record Speed",
        "score": 628,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1ge8ze6/nvda_xai_to_double_down_with_100000_more_nvidia/",
        "content": "NVIDIA and Elon Musk's xAI are ramping up their colossal supercomputer, *Colossus*, to an unprecedented 200,000 Hopper GPUs—doubling the current 100,000 GPU setup in a scale never before seen. Leveraging NVIDIA's advanced Spectrum-X Ethernet networking for seamless data throughput and zero packet loss, Colossus has already set records, becoming operational in just 122 days. As xAI’s Grok large language models expand, the additional 100,000 GPUs will enable faster, more efficient AI model training, accelerating xAI’s generative AI solutions for consumers and enterprises alike.\n\n[https://nvidianews.nvidia.com/news/spectrum-x-ethernet-networking-xai-colossus](https://nvidianews.nvidia.com/news/spectrum-x-ethernet-networking-xai-colossus)\n\n",
        "created_utc": 1730139199.0,
        "subreddit_name": "wallstreetbets",
        "comments": 254
    },
    {
        "title": "Google Q3 Earnings Preview: Advertising, Cloud and Capex",
        "score": 46,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1ge3xvv/google_q3_earnings_preview_advertising_cloud_and/",
        "content": "Google is set to announce its Q3 earnings on October 29th, after U.S. markets close. Here are key focal points:\n\nhttps://preview.redd.it/cr5hbq1wfixd1.png?width=1080&format=png&auto=webp&s=0ff6f4e0fed7df1b00513c9079e04ecc89b8b18f\n\n**Advertising:**\n\nGoogle remains the world's undisputed leader in search. Data shows that as of September 30th, Google's web traffic rose 1% from the previous quarter, reaching 2.7 billion visits, while Bing, its closest competitor, saw a 3% drop to just 58 million visits. Google's daily active users (DAU) for Q3 grew about 1% quarter-over-quarter and 6% year-over-year.\n\nHowever, even Google must remain vigilant. Google's search dominance is being challenged as fast-rising competitors like TikTok and Amazon capture market share. In fact, Google's share of the U.S. search ad market is expected to dip below 50% next year—a first in over a decade.\n\n**Google Cloud:**\n\nIn the second quarter, Alphabet's results revenue from Google Cloud surged 28% YoY. Can such high growth be sustained? Let's wait and see.\n\n**YouTube:**\n\nYouTube outpaced Instagram and TikTok in DAU growth over the last quarter. In July, August, and September, YouTube maintained positive DAU growth, while its three main competitors saw declines. Additionally, YouTube extended the maximum length of Shorts from 1 minute to 3 minutes, improving monetization potential.\n\n**Other Growth Areas:**\n\nAlphabet has several potential revenue drivers that have yet to impact its bottom line. Waymo, Alphabet's autonomous driving unit, has partnered with Uber to offer driverless rides in Atlanta and Austin. Additionally, Alphabet's Cloud division, which posted $10 billion in revenue and $1 billion in operating profit in Q2, holds strong growth potential.\n\n**Capital Expenditure:**\n\nIn July, CEO Sundar Pichai stated, \"The risk of underinvesting is dramatically greater than the risk of overinvesting for us.\" However, Wall Street's patience is limited; investors are looking for returns on AI investments sooner rather than later. Progress in AI commercialization will be a key focus in this earnings report.\n\n**Antitrust Concerns:**\n\nThe U.S. Department of Justice has launched an antitrust investigation into Google, hinting at a potential breakup. However, history suggests that forced breakups are rare. Google's relatively low valuation already reflects the policy risks it faces.",
        "created_utc": 1730127030.0,
        "subreddit_name": "wallstreetbets",
        "comments": 16
    },
    {
        "title": " Russia is getting Nvidia AI chips from an Indian pharma company | Times of India",
        "score": 6048,
        "url": "https://timesofindia.indiatimes.com/india/russia-is-getting-nvidia-ai-chips-mumbai-drugmaker-putin-shreya-life-sciences-importgenius/articleshow/114672764.cms",
        "content": "",
        "created_utc": 1730145369.0,
        "subreddit_name": "worldnews",
        "comments": 237
    }
]