[
    {
        "title": "Small Account Challenge - Week 3 Roundup - 230% Portfolio Gain - Strategy and Lessons learned so far!!!",
        "score": 233,
        "url": "https://www.reddit.com/r/Daytrading/comments/upl9vx/small_account_challenge_week_3_roundup_230/",
        "content": "NOTE TO MODS, spoke to a mod before reposting.\n\nHey all,\n\nWelcome to the end of the 3rd Week of the $1k to $10k Challenge, where I daytrade my way to $10k.\n\nA few notes before the update:\n\n1. I'm using a cash account to avoid PDT\n2. I mostly day trade 0DTE QQQ options, but not opposed to any opportunity that comes up\n3. I use Support/Resistances, VWAP, 50/200 MA, and RSI to daytrade.\n4. I use the 1-minute chart\n\n**Challenge Overview**\n\n*Before  we start, I have a question to ask you guys, is better to continue   with  weekly breakdowns or should I go back to daily breakdowns?*  \n\n\nhttps://preview.redd.it/25a4crqm0hz81.jpg?width=470&format=pjpg&auto=webp&s=b836e3da72d91f9c9d291fa643b36cdefaa09275\n\nAnyway,  a great end to the week, we are up 230% so far since I started. What a    journey this has been. Following the strategy has proven very    successful, coupled with keeping an eye on the economic calendar and    other macroeconomic events, scalping QQQ has been very profitable. Other    people started following the strategy that I outlined last week and    they have been seeing success, which honestly is the best feeling in  the   world.\n\nA  weekly  goal of  40% means we need to hit $2744, so we completely  crushed that  goal  ending the week at $3354. If you look at the table  below, this is   based on a 40% weekly gain. Compounding gains are a  sucessful traders   best friend. IF and that's a big IF we are able to  maintain 40% for the   next 21 weeks, we would turn $1k to $1M.\n\nhttps://preview.redd.it/1nx9ds1q0hz81.png?width=340&format=png&auto=webp&s=ce398738fb397f0761321f521dbf94d2043d87e4\n\nWhile    that's easier said than done. It's important to visualize this, as  you   can see it takes 7 weeks to get $10K but only another 7 weeks to  get  10x  that amount at $100k. That's why I believe, what I'm going to   outline  below is critical to continued weekly gains and success. Once   we  established we have a winning strategy, we should focus on the most    important thing that almost no one focuses on. **How to minimize losses.**    If traders spent as much time figuring out how to minimize their   losses  as to increase their gains, most people would be very   profitable.\n\n**Trimming is Key to maximizing Profits, how do avoid missing runners?**\n\nI    touched on this last week and said that now that I have more capital I    can trim and that this was a milestone. I got a lot of questions   asking  why it was huge deal?\n\nTrimming   is  critical in that it allows you to stay in a position longer. We   spoke  last week about how to make sure your trade doesn't turn red on   you, and  this is a key part of that.\n\nThe  way I do it is as follows,At   20% gain (which is my daily goal, and  goal for every trade), I trim  50%  of my total position and move my  stop loss to entry or a little  below.\n\nNow   a 20% move usually  means we are about to hit an MA or   support/resistance. And as our  strategy dictates usually there is a   retest when trying to break  through these. A lot of people freak out   there, think there is a  reversal and end up selling at a lower price,   only to see the stock  running again.\n\nWhat   we did above  is secure profits, and protect myself if there is a   reversal. No matter  what happens I'm getting out of this trade   profitable.BUT\n\nIf  it retests  and  breaks through im now still in with a great entry, and  according to   our strategy it will continue moving past the retest zone.  \\*(Now  if  you are smart you would  couple this with the ‘’average up and not   down’’ section below and you  are buying more here as you normally would   if you werent already in  this trade. This is what trading is really  all  about, combining  different strategies together).\\*Now at 40-50%   gain I would trim  25% and move my stop loss to the point where it is   retested and broke  through. So no matter what happens now I'm getting   out with a 20% gain  even if it hits my stop loss on top of what i   trimmed already\n\nKeep doing this until you are all out or stop loss hits. If you follow this you will never miss a runner again!\n\n**Don't Average Down:**\n\nDon't    throw good money after bad, I'm very guilty of this in the past.    Contrary to popular belief you should average up and not down. Averaging    down is ok with long-term positions, but if you are daytrading, you    have only a limited time to get out of the positions and thats doubly    true if you are trading options. If you are averaging down, 99% of the    time means that the trade is not going your way and building on what  the   how to minimize losses strategy outlined in week 2. If a trade is  not   going your way then you are now gambling and hoping that it will    eventually turnaround, there are no fundamentals or technicals backing    your play, and more often than not you fall into the rabbit hole of    averaging down more and more hoping you get out of the hole, we all have    been there before I'm sure.\n\nThink  of it this way, why not cut and buy at a lower price if your strategy    still holds. OR if your charts are showing a reversal then go the other    way and make your money back the smart way. This mostly stems from  the   fear of booking a loss. You need to accept the fact that you will  lose   money eventually. Repeat this to yourself every day, I will lose   money,  and it's OK.\n\nWhat you   should be  doing is averaging up, and now that I have more capital I'm   able to do  this. When you see a confirmation, take a starter position,   and the more  the stock moves your way average up, buy more when your   strategy is  going your way. Double down on a winner, not a loser.\n\n**Capital Preservation**\n\nThis    is the most important mode you should be in especially when you hit    your targets, ideally you should walk away and stop trading. Imagine    this.\n\nYou get your daily goal in    the first 10 minutes of trading, now endorphins and dopamine are    flooding your brain after a huge win.\n\nYou    are now fantasizing of getting your weekly goal today, BUT you take a    loss on the next trade, so you try to make it back, you are now  scared   you are losing the money made .....\n\n...... and down the rabbit hole, you go.\n\nI'm    guilty of this, actually it happened as soon as the last trading day    look at these trades, got my 10% daily target in the first 15 mins,  and   started thinking how cool it is, if I was writing this post and   boasting  that I got 2 weeks' gains in 1 week.\n\n&#x200B;\n\nhttps://preview.redd.it/qn3zpd1s0hz81.jpg?width=473&format=pjpg&auto=webp&s=fca6c7551d4c9af7d316599a8ed6636f82095f5b\n\nWhat    happened is that I lost right on the next trade, I was lucky to make   it  back on the one after and I immediately stopped trading after. I  was   high on the win and not thinking straight.\n\nWins  can knock you off your game as much as losses. Any emotion will ruin   your trading. So starting today, the second I hit my goal I’m 100%    stopping trading and walking away.\n\nAs  I said the last time, for some this is basic trading stuff, for   others,  it is not, but as you can see trading is really all about   combining  multiple basic strategies together and making it your own.   Anyone  selling you a $xxxx course with a secret method is lying to you.   All you  need to trade is within these posts for free. This is   literally what I  use to make the gains you see so far and what I use to   make enough money  to live off.\n\nTrading   information  should always be free because trading can be a tool to   liberate a lot of  people from the chains of financial bondage.\n\nI  have got nothing to sell you, and I plan on writing more stuff like   this in the future if enough people like it, so if you gained anything from this or enjoyed all I ask is please join my Youtube Channel, the link is in my profile.",
        "created_utc": 1652546983.0,
        "subreddit_name": "Daytrading",
        "comments": 102
    }
]