[
    {
        "title": "Meta Is Preparing to Notify Employees of Large-Scale Layoffs This Week",
        "score": 5213,
        "url": "https://www.reddit.com/r/stocks/comments/yo2j3k/meta_is_preparing_to_notify_employees_of/",
        "content": "Meta [US:META] Platforms Inc. is planning to begin large-scale layoffs this week, according to people familiar with the matter, in what could be among the largest round in a recent spate of tech job cuts after the industry’s rapid growth during the pandemic.\n\nThe layoffs are expected to affect many thousands of employees and an announcement is planned to come as soon as Wednesday, according to the people. Meta reported more than 87,000 employees at the end of September. Company officials already told employees to cancel nonessential travel beginning this week, the people said.\n\nThe planned layoffs would be the first broad headcount reductions to occur in the company’s 18-year history. While smaller on a percentage basis than the cuts at Twitter Inc. this past week, which hit about half of that company’s staff, the number of Meta employees expected to lose their jobs could be the largest to date at a major technology corporation in a year that has seen a tech industry retrenchment. \n\nA spokesman for Meta declined to comment, referring The Wall Street Journal to Chief Executive Mark Zuckerberg’s recent statement that the company would “focus our investments on a small number of high priority growth areas.”\n\n“So that means some teams will grow meaningfully, but most other teams will stay flat or shrink over the next year,” he said on the company’s third-quarter earnings call on Oct. 26. “In aggregate, we expect to end 2023 as either roughly the same size, or even a slightly smaller organization than we are today.”\n\nThe Journal reported in September that Meta was planning to cut expenses by at least 10% in the coming months, in part through staff reductions.\n\nhttps://www.wsj.com/articles/meta-is-preparing-to-notify-employees-of-large-scale-layoffs-this-week-11667767794?mod=hp_lead_pos1",
        "created_utc": 1667768276.0,
        "subreddit_name": "stocks",
        "comments": 880
    },
    {
        "title": "Apple’s Next Change for Siri: Dropping ‘Hey’ From ‘Hey Siri’ Trigger",
        "score": 4221,
        "url": "https://www.bloomberg.com/news/newsletters/2022-11-06/apple-s-next-change-for-siri-dropping-the-hey-in-hey-siri-trigger-phrase-la5gup9j",
        "content": "",
        "created_utc": 1667746076.0,
        "subreddit_name": "apple",
        "comments": 778
    }
]