[
    {
        "title": "Meta Is Preparing to Notify Employees of Large-Scale Layoffs This Week",
        "score": 5213,
        "url": "https://www.reddit.com/r/stocks/comments/yo2j3k/meta_is_preparing_to_notify_employees_of/",
        "content": "Meta [US:META] Platforms Inc. is planning to begin large-scale layoffs this week, according to people familiar with the matter, in what could be among the largest round in a recent spate of tech job cuts after the industry’s rapid growth during the pandemic.\n\nThe layoffs are expected to affect many thousands of employees and an announcement is planned to come as soon as Wednesday, according to the people. Meta reported more than 87,000 employees at the end of September. Company officials already told employees to cancel nonessential travel beginning this week, the people said.\n\nThe planned layoffs would be the first broad headcount reductions to occur in the company’s 18-year history. While smaller on a percentage basis than the cuts at Twitter Inc. this past week, which hit about half of that company’s staff, the number of Meta employees expected to lose their jobs could be the largest to date at a major technology corporation in a year that has seen a tech industry retrenchment. \n\nA spokesman for Meta declined to comment, referring The Wall Street Journal to Chief Executive Mark Zuckerberg’s recent statement that the company would “focus our investments on a small number of high priority growth areas.”\n\n“So that means some teams will grow meaningfully, but most other teams will stay flat or shrink over the next year,” he said on the company’s third-quarter earnings call on Oct. 26. “In aggregate, we expect to end 2023 as either roughly the same size, or even a slightly smaller organization than we are today.”\n\nThe Journal reported in September that Meta was planning to cut expenses by at least 10% in the coming months, in part through staff reductions.\n\nhttps://www.wsj.com/articles/meta-is-preparing-to-notify-employees-of-large-scale-layoffs-this-week-11667767794?mod=hp_lead_pos1",
        "created_utc": 1667768276.0,
        "subreddit_name": "stocks",
        "comments": 880
    },
    {
        "title": "Apple’s Next Change for Siri: Dropping ‘Hey’ From ‘Hey Siri’ Trigger",
        "score": 4221,
        "url": "https://www.bloomberg.com/news/newsletters/2022-11-06/apple-s-next-change-for-siri-dropping-the-hey-in-hey-siri-trigger-phrase-la5gup9j",
        "content": "",
        "created_utc": 1667746076.0,
        "subreddit_name": "apple",
        "comments": 778
    },
    {
        "title": "Pattern Recognition Part II - How to Buy the Dip: Trends and Pullbacks",
        "score": 269,
        "url": "https://www.reddit.com/r/Daytrading/comments/ynzqoz/pattern_recognition_part_ii_how_to_buy_the_dip/",
        "content": "A month ago, I made a post about Breakouts. A few people asked me to write a similar one for **Pullbacks.** Although this is a very simple setup, there are a lot of nuances which I will try to explain without writing an entire article. Here goes...\n\nMuch like the Breakout, the Pullback is also **one of the most popular and oldest setups around.** Jesse Livermore—who I love to quote—traded this pattern **over 100 years ago**. In his words:\n\n>*I become a buyer as soon as a stock makes a new high on its movement after having had a normal reaction.*\n\nLet’s translate that to 2022 English, Fam.\n\n[Livermore is probably rolling over in his grave right now](https://i.redd.it/74jg5qodcdy91.gif)\n\n# A Framework to View the Markets: The Market Cycle\n\nBefore we look at pullbacks in detail, we first must understand **a fundamental concept called the Market Cycle.** In laymen’s terms, there are four stages that an instrument goes through in some shape or form. \n\n[Four Stages of the Market Cycle - Applies to all tradable assets](https://preview.redd.it/sqneq47gcdy91.png?width=646&format=png&auto=webp&s=9d194a399725b803fc8c930b82de8e981efc4f66)\n\nI won’t bore you with the human psychology and emotions behind this theory; please look into **Richard Wyckoff's** body of work for more information. Just know that many institutional traders view the market through this lens. When *'they'* initiate buy/sell programs, that moves prices. And **when big money acts in unison, that creates trends.**\n\nPrice can do one of three things: it can go up (Stage 2), down (Stage 4), or sideways (Stages 1 & 3). Pullbacks are trend-following patterns and therefore can only occur in stage 2 and 4. **Here are two simple rules that should keep most traders out of trouble:**\n\n1. During Stage 2 Uptrends: **Buy the Pullbacks and Breakouts**\n2. During Stage 4 Downtrends: **Sell the Rallies and Breakdowns**\n\n# The Fundamental Pattern\n\nOn a micro scale, the Market Cycle presents itself as buying and selling waves. Price rarely goes up/down in a straight line. **It ebbs and flows** as Bulls/Bears rotate between buying, adding, taking profit, shorting, and covering. This is the beautiful symphony also known as **Price Action.**\n\nWhen buying waves are stronger than selling waves, there is more demand pressure (market buy orders hitting the Ask). This causes price to go up. **Bulls are in control.** When the opposite occurs, there is more supply pressure (market sell orders hitting the Bid). This causes price to go down. **Bears are in control.**\n\n[The Fundamental Pattern - The Art and Science of Technical Analysis, by Adam Grimes](https://preview.redd.it/kwmz71atcdy91.png?width=986&format=png&auto=webp&s=739a8d4cb6ffeeebbee4a4761d1e658323272f88)\n\n**A lot of money is required to keep price moving in one direction.** That usually means institutional involvement—they don’t like to lose. So, guess who buys the next pullback to keep the trend going? That’s right: those who are already holding positions from earlier (and those who missed out and are now FOMO’ing). Not to mention all the traders caught on the wrong side of the move. When they are forced to stop out, **it adds fuel to the fire.** The side which is currently in control is now better able to sustain control; **there's a snowball effect.**\n\n# Fractal and Multiple Timeframe Analysis\n\nThe fundamental price action pattern of **impulse, retracement, impulse** exists on all timeframes. Each leg is composed of smaller iterations of the same pattern. This is called **a fractal.** I’ve zoomed down to the 10-second—and even 1-second chart—to observe this magical dance occurring in real-time.\n\n[The fractal nature of markets—there's levels to this](https://preview.redd.it/a5z37abxcdy91.png?width=990&format=png&auto=webp&s=8b205ccab9bce16923083dd11fd45583df291855)\n\n**Price action in the wild is never as clean as described in literature.** But once you start viewing the market in cycles which ebb and flow, the day-to-day movement rarely surprises you. Here’s the post-FOMC chart from November 2. It shows a failed continuation move up (oops), followed by multiple legs down. **Impulse, retracement, impulse.**\n\n[November 2, 2022 - The fundamental pattern still visible during post-FOMC chaos](https://preview.redd.it/2tvoxspkldy91.png?width=850&format=png&auto=webp&s=3558ea2e640205d703fa6d16cef4ad84a8fb28f8)\n\n# Pivots and Building Blocks\n\nBelow are two very basic shapes. They are little arrowheads—**or pivots**—each with a green line to indicate strong buying, and a red line to indicate strong selling. The apex is the point where control was lost to the opposing side.\n\n[Two simple pivots where price reversed](https://preview.redd.it/xzuohf66ddy91.png?width=362&format=png&auto=webp&s=58af849c5bc109679a29fe84994c0a099c8de33b)\n\nYou may remember this shape from such charts as: '***I Bought the Absolute Top’*** or ***‘I Sold at the Very Bottom.’*** And who can forget, ***‘Every Time I Enter a Trade the Market Immediately Goes Against me!’***\n\nJokes aside—pivots are typically not a cause for concern. They are **normal market behavior** as new entrants join the trade, existing positions take profit, add, trim, etc. **Not every turn in price is a reversal.** By definition, a trend must pullback before going on to make a new high/low.\n\nLook at what happens when I start stacking or combining these basic pivots to build a trend.\n\n[The development of a classical uptrend, with price respecting prior resistance as new support](https://i.redd.it/wwh9yquvddy91.gif)\n\nLet’s use these exact same building blocks to construct my favorite pattern, the **Base Breakdown.**\n\n[Rectangle base breakdown - Impulse, sideways, impulse](https://i.redd.it/je2l6oaxddy91.gif)\n\nThe best breakouts/breakdowns rarely offer a second entry on the re-test. Once they go, they are gone.\n\n# Trading the Pullback\n\nThat was fun. Let's snap back to reality, oh there goes gravity! Here are illustrations using **candlesticks** rather than MS Paint (still my favorite software since Windows 95 was launched).\n\n[Uptrend: Higher-highs and higher-lows. Buy the pullbacks](https://preview.redd.it/n06xwq2zddy91.png?width=609&format=png&auto=webp&s=126f846d9e49c8e8685c16a19b9daa6722ece1a5)\n\n[Downtrend: Lower-highs and lower-lows. Sell the rallies](https://preview.redd.it/36j63p00edy91.png?width=609&format=png&auto=webp&s=42d11185da14daa05c047854c1660217892ac754)\n\nThe textbook entry is *after the pullback* is complete once **the pivot has formed.** That means when the current candle has taken out the prior bar’s range by making a new high (uptrend), or new low (downtrend). Some traders draw a trendline during the pullback and enter on the break of that diagonal line. Both methods are valid since they are relative to price action. **Note that the stop loss is below the pivot low for long, and above the pivot high for short.**\n\nSome traders enter *during the pullback,* before confirmation that a pivot has formed. But how do you know the retracement is complete if a new high/low hasn’t printed? **You don’t.**\n\n[Entry off the rising 20 MA and $60 whole dollar](https://i.redd.it/gc6lbk5yedy91.gif)\n\nThis style of pullback trading requires timing and experience. The main reason behind entering *during the reversal* is to **tighten the stop and have a better reward-to-risk.** You must be willing to re-enter if you are initially wrong. Personally, I do this at key levels as seen above. You can fine-tune the entry by going down to a smaller timeframe for better resolution. **Often there is a pullback pattern on the 1 or 2-minute chart not visible on the 5-minute.**\n\n# Two-Legged\n\nSometimes when price gets too extended, one pullback isn’t enough. Despite an initial attempt to rally, buyers fail to push price higher and there is a **second corrective leg.** If you zoom into a lower timeframe, these are often miniature downtrends in their own right.\n\n[Two-legged pullback, aka the Bi-pedal Pullback](https://preview.redd.it/9q0bjsocfdy91.png?width=852&format=png&auto=webp&s=600445c9b5e4765b48c83bd6739131fe33044ba1)\n\nWhen you start seeing more than 2 legs of retracements, it’s probably time to start questioning the integrity of the trend (change of character). Are there enough lower-highs and lower-lows to signal the beginning of downtrend? Break in pivot structure **often leads to trend termination**—and sometimes reversals—but this is the topic for another day.\n\n# Moving Averages\n\nYou may have noticed most of the above charts contain moving averages (MA). These squiggly lines are useful to gauge the trend at a glance. **I use them as visual shortcuts.** If price is **surfing above a 45-degree sloping MA**, it means we are most likely in an uptrend. This is when we look for pullbacks to go long. If price is **bobbing below a 45-degree sloping line**, we are probably in a downtrend. This is when we look for rallies to go short.\n\nI use two MA’s to monitor the quality of a trend. When both lines are parallel, the trend is moving at a healthy pace relative to time (not extended). These directional moves are considered sustainable until there is evidence to believe otherwise; **the trend is your friend till the end.**\n\n[November 3, 2022 - $FIS 5-minute chart downtrend with multiple pullbacks](https://preview.redd.it/n9sglg9mfdy91.png?width=857&format=png&auto=webp&s=94f52a45f408d39c71c707df049d446187901e62)\n\nThere’s very little difference between using the 8, 9, or 10 as your small MA. The same goes for using the 20 or 21 as your big MA. Also, EMA vs. SMA is a matter of preference. Any combination of common MA’s should provide the same picture. **The slope simply measures the velocity at which buying or selling is occurring.**\n\nNote: Some trend traders use moving averages as their trailing stop. **They wait for a candle to close below the MA during an uptrend.** Using trade management criteria such as this allows them to capture the **bulk of a move.** Traders who don’t have clear exit rules often lament about *leaving money on the table.* **How can you know if a move is over if you have no objective way of measuring?!**\n\n[October 28, 2022 - $SPY all-day trend. Can you spot the pullback entries and stops?](https://preview.redd.it/knsdm3ptfdy91.png?width=856&format=png&auto=webp&s=724dca71c736035e6125199a291163034027ff99)\n\n# Don’t Go Chasing Waterfalls\n\nI’ve stated before that **trading patterns without context is like trading in a vacuum.** These shapes and setups appear countless times throughout the day. However, there are **additional criteria that make some pullbacks better than others.** They include:\n\n* Fresh catalyst or good daily chart with room to run\n* Position relative to key areas (intraday levels, pre-market, VWAP, etc.)\n* Number of candles during the retracement (2, 3, 4, etc.)\n* Cleanliness of the pullback (fluid with minimal wicks)\n* Depth of retracement (Fibonacci anyone?)\n* Low volume during pullback and increasing volume upon triggering\n* Bottoming/topping tail on the reversal candle that forms the pivot\n* Doji/indecision/narrow candle before a new high/low is made\n* Change in color bar before the turn (aka the pivot)\n* Respecting prior support/resistance areas in pivot structure\n* Trend maturity (the probability of continuation decreases on each subsequent impulse leg)\n* Distance from MA’s (extended or not)\n* At major support/resistance areas on the higher timeframes\n\nRegarding that last point: One crucial skill every trader should learn is the **ability to draw relevant levels.** Below is the 60-min chart of SPY from Friday. I use this example because somebody asked me why the uptrend stalled where it did.\n\n[November 4, 2022 - $SPY hourly chart showing relevant levels for the day](https://preview.redd.it/y4lowch6gdy91.png?width=846&format=png&auto=webp&s=87021eb760700e63ba6ef5a05ccc72d7e41023f9)\n\nHere’s the 2-minute chart showing HOD hit that level at 378.50-ish. LOD also turned out to be the 371 area from above. **Those two zones became the spots where the Stage 2 uptrend and Stage 4 downtrend terminated, respectively.**\n\n[November 4, 2022 - Levels respected on $SPY during the Market Cycle Phases](https://preview.redd.it/hd6yyce7gdy91.png?width=858&format=png&auto=webp&s=7da2fb2eb768df67b4e8b1381657c6d2227cfccc)\n\n**Significant levels are like magnets**—price is attracted to them due to the market's natural tendency to chase liquidity. The trend's final leg pushed into those areas and rejected them. And that formed the **apexes for the day.** It would have been useful to be aware of these zones beforehand if you are a pullback trader, no?\n\n# I See Dead People...They’re Everywhere\n\nIf the entire market is composed of the fundamental pattern on all timeframes, then shouldn’t day trading be an ATM for anyone who can catch every single pivot? The first part of that statement is true—**the market consists of the same patterns over and over.** Only a small portion are worth trading, however.\n\nNot every chart looks as clean as the examples I presented above. **Knowing when NOT to get involved is half the battle in trading.** Additionally, the lower the timeframe, the more noise is observed in price action. This is why I believe that **beginners should first learn to read price action on at least a 5 or 15-minute chart** before attempting to scalp off the 1-minute.\n\nLastly, the market spends more time ranging than trending. Trying to trade pullbacks in these types of conditions will lead to you **getting chopped up—in both directions.**\n\n[A ranged, or trendless, market - Equal highs and equal lows](https://preview.redd.it/rfpmw1segdy91.png?width=505&format=png&auto=webp&s=c88c4fb06269269ce5721f1d354b8ed1c9eb814d)\n\nThere are many traders who actually prefer to trade ranges. The peaks and troughs are well-defined and offer great reward-to-risk from end-to-end. Personally, that isn't my cup of tea. **I scan for individual stocks** which are trending and **have the potential to keep moving in one direction.**\n\nEven while day trading, my analysis always starts from the top-down: Daily, Hourly, 15-min, 5-min, and finally the 2-min for entry. It's much easier to catch intraday moves when **institutional, position, and swing traders are on the same side as you.**\n\nAnd there you have it: my second favorite day/swing trading setup of all-time. Yikes—looks like I just wrote another article! Please feel free to share your own charts since we can now add images to comments :)",
        "created_utc": 1667762361.0,
        "subreddit_name": "Daytrading",
        "comments": 50
    }
]