[
    {
        "title": "AAPL and High Beta: Downside Reversal and Continuation",
        "score": 6,
        "url": "https://www.reddit.com/r/AAPL/comments/vw6qop/aapl_and_high_beta_downside_reversal_and/",
        "content": "[AAPL Chart](https://www.tradingview.com/x/c8NBPSxy/) \\- Downside Targets for AAPL and High Beta.\n\nNQ-100: https://www.tradingview.com/x/PaXafiQq/\n\nThe market complexion has changed greatly from \"there is no chance of a recession\" to \"well, maybe there could be a recession\" as the economic data continues to deteriorate. Continuing Jobless Claims in the United States increased to 1.375M in the week ending June 25 of 2022 from 1.324M in the previous week. The number of Americans filing new claims for unemployment benefits rose by 4K to 235K in the week that ended July 2nd, compared to market expectations of 230K, suggesting labor market conditions could be moderating.\n\nBut, I think it is just getting started as many companies are laying off and cancelling employment offers. These activities take time to get into the system and \"The Counting Rule\" is... they must be actively looking in-order to be counted. So, don't hold your breadth. And keep in mind the Fed will remain hiking rates, while the ECB will eventually need to jump on this wagon.\n\nSpeaking of the ECB.\n\nThe United States is acting as-if The Federal Reserve Raising Interest Rates solves everything. Government Debt in the [United ](https://www.tradingview.com/symbols/TSX-UNC/)States increased to 30,499,619 Trillion in May from 30,374,155 Trillion in April of 2022.\n\nThe US Debt to GDP increased to 137% from 128%. They act as-if there is nothing for the public to worry about; however, many issues have not begun to trickle into the US, as far as we're concerned.🥶Winter is going to be a huge test for the US and so will the household debt crisis -- not yet discussed in media as companies are trying to figure out how to keep consumers spending (e.g. buy now; pay later).\n\nBut, raising rates does not stop the government from spending, nor does it stop the government from issuing more debt. We also have other factors in play such as the Federal Reserve Balance Sheet , [M2](https://www.tradingview.com/ideas/m2/) Money Supply, and WH Executive Orders at play here.\n\nHOWEVER.... The point of this post is the \"very tight\" interconnection between the US and UK. Remember it is a global market and just like the global market crash of 1929 we are more connected today than ever before.\n\n👉 The US and UK are at EXTREME levels of government debt and both facing economic collapse scenarios.😳 If the UK goes down - don't think for a minute that the US cannot go along with it. You have seen my recent post about the US Liquidity Swaps, right? If not, scroll down the news feed and you'll see it.\n\nNevertheless, through my external analysis of the markets (with annotated charts) there remains a very-strong conviction that the recent lows of the financial markets will be tested and broken. This also takes into account the Federal Reserve [Balance Sheet](https://www.tradingview.com/ideas/fundamental/) and the fact the Government Debt continues to expand against the GDP.\n\nDownside targets for the SPX and NDXNDX = T1 9,538; T2 8,200 (current price is at 12,109.05) SPX T1 3,040; T2 = 2,750 (current price is at 3,902)\n\nI GET IT... Many will not be supportive of the above. I am not here to say, \"see, I told you so\" or anything of that nature - as I'm providing my thesis into all the posts I provide with thorough assessments into the global markets and not based on raw emotions.\n\nI really hope this post (and others) have been informative, helpful, or at least worthy enough for your review. I \"value your time\" and am humbled that you took the time to read, comment, etc. on any of my posts.\n\nThank you",
        "created_utc": 1657503783.0,
        "subreddit_name": "AAPL",
        "comments": 5
    }
]