[
    {
        "title": "Netflix third-quarter subscribers barely beat estimates as ad-tier members jump 35%",
        "score": 341,
        "url": "https://www.reddit.com/r/stocks/comments/1g609hk/netflix_thirdquarter_subscribers_barely_beat/",
        "content": "Netflix posted third-quarter earnings that beat on the top and bottom line Thursday after the bell.\n\nThe company’s advertising business continued to grow in the third-quarter, with ad-tier memberships jumping 35% quarter-over-quarter. It’s on track to launch this service in Canada in the coming quarter and more broadly in 2025.\n\nHere are the results:\n\nEarnings per share: $5.40 compared with the $5.12 expected by LSEG.\n\nRevenue: $9.83 billion compared with the $9.77 billion expected by LSEG.\n\nPaid memberships: 282.7 million compared to 282.15 million expected, according to StreetAccount\n\nSource: https://www.cnbc.com/2024/10/17/netflix-nflx-earnings-q3-2024.html",
        "created_utc": 1729196097.0,
        "subreddit_name": "stocks",
        "comments": 146
    },
    {
        "title": "Google CEO names new search and ads boss, slides predecessor to chief technologist",
        "score": 216,
        "url": "https://www.reddit.com/r/stocks/comments/1g5yk19/google_ceo_names_new_search_and_ads_boss_slides/",
        "content": "Google is replacing Prabhakar Raghavan, the company’s search and ads boss, with longtime Google executive Nick Fox.\n\nThe move was announced by Alphabet CEO Sundar Pichai, who said in a blog post on Thursday that Raghavan will be moving into the role of chief technologist after 12 years of leading teams across the search company. Raghavan will continue to report to Pichai in the new role, the company told CNBC in a statement.\n\n“Prabhakar has decided it’s time to make a big leap in his own career,” Pichai wrote in the post. “In this role, he’ll partner closely with me and Google leads to provide technical direction and leadership and grow our culture of tech excellence.”\n\nThe move comes as Google continues to restructure its teams to move more quickly in the artificial intelligence arms race, where it faces increased competition. The company is also dealing with several antitrust lawsuits related to its search and ads business.\n\nFox has long been a member of Raghavan’s leadership team. He will be leading Google’s Knowledge and Information division, which includes the company’s search, ads and commerce products, Pichai said.\n\nA Google employee since 2003, Fox has been vice president for product and design for the company’s Assistant product in recent years. He previously worked within the company’s ads business unit.\n\n“Over the past few years, Nick has been instrumental in shaping Google’s AI product roadmap and collaborating closely with Prabhakar,” Pichai wrote.\n\nRaghavan led the knowledge and information unit since 2018. Earlier this year, he told employees to prepare for a different market reality because “things are not like they were 15-20 years ago,” CNBC reported.\n\nAdditionally, Pichai announced that the team working on Google’s Gemini app, which includes Google’s AI direct-to-consumer products, will join Google DeepMind under AI head Demis Hassabis.\n\n“Bringing the teams closer together will improve feedback loops, enable fast deployment of our new models in the Gemini app,” Pichai wrote.\n\nThe move also means the Assistant teams focused on devices and home experiences will move to the Platforms and Devices unit “so they can sit closer to the product surfaces they’re building for,” Pichai wrote.\n\nSource: https://www.cnbc.com/2024/10/17/google-replaces-its-search-and-ads-boss.html",
        "created_utc": 1729191685.0,
        "subreddit_name": "stocks",
        "comments": 47
    },
    {
        "title": "ASML’s issues should have been a positive for TSMC and Intel",
        "score": 79,
        "url": "https://www.reddit.com/r/stocks/comments/1g5kjql/asmls_issues_should_have_been_a_positive_for_tsmc/",
        "content": "If the China export restrictions are the primary cause for ASML’s weakness, then that must mean that TSMC and Intel will have an easier time acquiring ASML machines. \n\nOne of the biggest costs for chip fabs is the machines. It’s the reason TSMC has not invested heavily into high NA EUV machines because they are simply too expensive to make sense economically right now. \n\nWith nearly half of ASML’s market wiped out over night, TSMC and Intel should have a much easier time securing these machines faster and at a lower price due to less competition. \n\nTherefore, the analysts were wrong. They should have saw this and bought up TSMC and Intel instead of selling all semiconductor stocks after ASML’s report. ",
        "created_utc": 1729146444.0,
        "subreddit_name": "stocks",
        "comments": 40
    }
]