[
    {
        "title": "Intel is now trading at the same price it was at in 1997",
        "score": 6959,
        "url": "https://www.reddit.com/r/stocks/comments/1eig2u5/intel_is_now_trading_at_the_same_price_it_was_at/",
        "content": "To me that is so insane, 27 years and it's back to these levels. I'm not touching it, but is anyone else shocked by this? They're a big name in the industry. It really makes me want to average up my $90 average on AMD. Just goes to show for 99% of investors the S&P 500 is just the best investment.\n\nEdit: Charts account for Stock splits, compare market cap to see for yourself. \nAny dividend gains would be wiped out from inflation.",
        "created_utc": 1722619994.0,
        "subreddit_name": "stocks",
        "comments": 975
    },
    {
        "title": "Berkshire sells $3.8 billion worth of Bank of America in 12-day selling spree ",
        "score": 363,
        "url": "https://www.reddit.com/r/stocks/comments/1eibnoe/berkshire_sells_38_billion_worth_of_bank_of/",
        "content": "Warren Buffett is not done selling Bank of America.\n\nBerkshire Hathaway shed a total of 19.2 million BofA shares on Tuesday, Wednesday, and Thursday for almost $779 million at an average selling price of $40.52 per share, according to a new regulatory filing.\n\nThe conglomerate has now been offloading the bank stock for 12 consecutive days with total sales now exceeding $3.8 billion. Its remaining 942.4 million shares have a market value of $37.2 billion at Thursday’s close of $39.50.\n\nAs of Thursday’s close, Bank of America fell to the No.3 spot on Berkshire’s list of top holdings, trailing behind Apple and American Express, which is currently valued at $37.7 billion. Before the selling spree, BofA had long been Berkshire’s second biggest holding.\n\nBerkshire remains the bank’s largest shareholder with a 12.1% stake.\n\nThe bank stock has dropped 5.2% so far this week, going as low as $38.98 in Thursday’s trading as recession fears plague the financial sector. Year to date, BofA is up more than 17%, outperforming the S&P 500.\n\nBuffett famously bought $5 billion worth of BofA’s preferred stock and warrants in 2011 in the aftermath of the financial crisis, shoring up confidence in the embattled lender struggling with losses tied to subprime mortgages. He converted those warrants in 2017, making Berkshire the largest shareholder in BofA, vowing that it would be a “long, long time” before he would sell.\n\nThe legendary investor said then that he liked the business, valuation and management of the Charlotte-based bank “very much.”\n\nBofA, under the leadership of Brian Moynihan since 2010, recently reported blowout results for the second quarter that showed rising investment banking and asset management fees as well as a positive outlook on net interest income.\n\nSource: https://www.cnbc.com/2024/08/02/buffetts-berkshire-sells-3point8-billion-worth-of-bank-of-america-in-12-day-selling-spree.html",
        "created_utc": 1722609389.0,
        "subreddit_name": "stocks",
        "comments": 49
    }
]