[
    {
        "title": "Will Nvidia suffer due to increased tensions with China?",
        "score": 230,
        "url": "https://www.reddit.com/r/stocks/comments/1gl3byx/will_nvidia_suffer_due_to_increased_tensions_with/",
        "content": "I want to be clear this is not a political post. Not looking for political opinions.\n\n  \nPost-January, we're likely to be entering a period of increased tensions with China. This seems bad for Nvidia in multiple ways.\n\n1. Beijing has previously expressed desire to urgently switch away from NVDA chips and invest locally. Obviously that's easier said than done, but with China being such a huge market for NVDA, increased tensions over tariffs could push this mandate further. The amount of revenue NVDA gets from China has already decreased, but this further deceleration could be negative. [https://archive.is/v40zX](https://archive.is/v40zX)\n\n  \n2. Trump has accused Taiwan of stealing the U.S. chip industry. He wants to put tariffs on chips from Taiwan. Obviously, everyone is relying on TSMC, so this seems clearly bad news. [https://www.cnbc.com/2024/10/28/trump-accuses-taiwan-of-stealing-us-chip-business-on-joe-rogan-podcast.html](https://www.cnbc.com/2024/10/28/trump-accuses-taiwan-of-stealing-us-chip-business-on-joe-rogan-podcast.html)\n\n  \nI'm completely open to being told I'm wrong and being called a moron, but please don't spam downvote if you disagree with my take. This is a popular stock on this subreddit, and others will have similar posts. \n\n\n\nLet's just get this discussion over with now, yeah?",
        "created_utc": 1730912652.0,
        "subreddit_name": "stocks",
        "comments": 158
    },
    {
        "title": "Qualcomm pops on chipmaker's earnings and revenue beat",
        "score": 91,
        "url": "https://www.reddit.com/r/stocks/comments/1glceac/qualcomm_pops_on_chipmakers_earnings_and_revenue/",
        "content": "Qualcomm reported fourth-quarter earnings on Wednesday that beat Wall Street expectations for earnings and revenue, and the company guided to a strong December quarter.\n\nThe shares rose 10% in extended trading at one point before falling to a gain of about 4%.\n\nHere’s how the company did versus Refinitiv consensus expectations for the quarter ending Sept. 29:\n\nEarnings per share: $2.69, adjusted $2.56 expected\n\nRevenue: $10.24 billion versus $9.90 billion expected\n\nQualcomm said it expects revenue in the current quarter of between $10.5 billion and $11.3 billion, with the midpoint of that range beating LSEG consensus expectations of $10.59 billion.\n\nThe company reported $2.92 billion in net income, or $2.59 per share, a sharp jump from last year’s $1.49 billion, or $1.23 per share. Qualcomm reported $33.19 billion in total revenue in its fiscal 2024, a 9% increase from 2023.\n\nQualcomm’s fortunes have historically been tied to the smartphone industry, where the company provides a range of chips to handset makers, including system-on-a-chip processors, modems, and antennas. The company makes the chip at the heart of most high-end Android devices, and many lower-end phones as well. Qualcomm also sells modems and related chips to Apple for its iPhones, and last year said its contract for 5G chips ran through 2026.\n\nQualcomm reported a 12% increase in handset chip sales to $6.1 billion, in line with FactSet estimates. Qualcomm introduced its high-end chip for 2025, called Snapdragon 8 Elite, in October.\n\n“In handsets we delivered greater than 20% year-over-year growth in Android revenues,” said Qualcomm CFO Akash Palkhiwala on a call with analysts.\n\nUnder CEO Cristiano Amon, the company has diversified away from being a smartphone supplier and has introduced and invested heavily in producing chips for PCs, cars, and industrial machines.\n\n“We will continue to transform Qualcomm from a wireless communications company into a connected computing company for the age of AI,” Qualcomm CEO Cristiano Amon said on the earnings call with analysts.\n\nQualcomm has also made efforts to brand itself as a leader in AI, having developed smartphone chips with specialized parts for machine learning since 2017. But unlike Nvidia, the company doesn’t produce the kind of graphics processors for data centers that are used for big AI programs like OpenAI’s ChatGPT.\n\nThe automotive business grew 86% on an annual basis to $899 million in sales. Qualcomm says it has billions of dollars in business with automakers currently in its development pipeline, and highlighted it was the fifth consecutive quarter of growth. Qualcomm said that it expected automotive sales in the current quarter to rise 50% on an annual basis.\n\nThe company’s “internet of things” business includes both chips for industrial purposes as well as the chips Meta uses in its Quest handsets and Ray-Ban Smart Glasses. It also includes the new business selling chips for laptops running Microsoft Windows. The division reported $1.68 billion in revenue, a 22% increase from a year earlier.\n\nQualcomm’s chip business, including its handset, automotive, and other chips, which together is reported as QCT, saw sales rise 18% during the quarter to $7.37 billion in total. \n\nThe company’s profitable technology licensing business, QTL, reported $1.52 billion in revenue, a 21% increase over the same period last year.\n\nQualcomm said its board had approved $15 billion in additional buybacks. During the fourth quarter, it repurchased $1.3 billion worth of shares and paid out $947 million in dividends.\n\nSource: https://www.cnbc.com/2024/11/06/qualcomm-qcom-earnings-report-q3-2024.html",
        "created_utc": 1730935673.0,
        "subreddit_name": "stocks",
        "comments": 10
    },
    {
        "title": "300 to 26k in 3 weeks",
        "score": 7651,
        "url": "https://www.reddit.com/gallery/1gl19u0",
        "content": "Been doing options since the beginning of this summer, started out with around 1.8k. Was down to my last $300 and decided to all in tesla before earnings 10/24 landing me 3.2k. It just snowballed from there and I finally reached 26k today! Never give up my fellow regards!",
        "created_utc": 1730907375.0,
        "subreddit_name": "wallstreetbets",
        "comments": 522
    },
    {
        "title": "Cathie Wood Sells Tesla Before Election; Musk Cabinet Position 'Not What Shareholders Want To See'",
        "score": 1730,
        "url": "https://www.investors.com/news/tesla-stock-cathie-wood-elon-musk-election/",
        "content": "",
        "created_utc": 1730894278.0,
        "subreddit_name": "wallstreetbets",
        "comments": 335
    },
    {
        "title": "Thanks Papa Elon, Trump ",
        "score": 1281,
        "url": "https://www.reddit.com/gallery/1gl0cru",
        "content": "Been in $TSLA leaps since July. Decided to open, and DCA 11/29 $270 calls after $TSLA red for 6 days straight after the earning. Closed the 11/29 calls. Hold the leaps for now. ",
        "created_utc": 1730904955.0,
        "subreddit_name": "wallstreetbets",
        "comments": 248
    },
    {
        "title": "Netflix offices in Europe raided by tax fraud investigators",
        "score": 756,
        "url": "https://www.forbes.com.au/news/world-news/netflix-offices-in-europe-reportedly-raided-by-tax-fraud-investigators/",
        "content": "",
        "created_utc": 1730852993.0,
        "subreddit_name": "wallstreetbets",
        "comments": 41
    },
    {
        "title": "35k Gains Tesla Calls",
        "score": 443,
        "url": "https://i.redd.it/97anwzqp3bzd1.jpeg",
        "content": "Dropped 4k 1 day before elections into Tesla $257.5 Calls expiring friday. Doubled my portfolio overnight with over 35k in gains.",
        "created_utc": 1730909868.0,
        "subreddit_name": "wallstreetbets",
        "comments": 24
    },
    {
        "title": "Bought $15K in 3:1 Kamala Bets and then 50k in OTM Tesla calls. Up >200K",
        "score": 363,
        "url": "https://www.reddit.com/gallery/1gl2362",
        "content": "I placed $15,000 on 3:1 Kamala Harris Bets and then bought 50K OTM TSLA for Mid to Late Nov. $5K downside for 200K upside?\nI'll take it",
        "created_utc": 1730909497.0,
        "subreddit_name": "wallstreetbets",
        "comments": 66
    },
    {
        "title": "For the first time ever, AMD outsells Intel in the datacenter space",
        "score": 265,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gklmy6/for_the_first_time_ever_amd_outsells_intel_in_the/",
        "content": "This victory means AMD has become the leader in the data center processor market, a significant achievement in a sector that Intel has dominated for years. AMD’s success reflects a shift in corporate preferences toward processors that offer high performance and energy efficiency, making AMD’s EPYC processors a more attractive option for businesses. \n\nhttps://www.tomshardware.com/pc-components/cpus/for-the-first-time-ever-amd-outsells-intel-in-the-datacenter-space",
        "created_utc": 1730852270.0,
        "subreddit_name": "wallstreetbets",
        "comments": 21
    },
    {
        "title": "Zuck gets cucked by a rare species of bee ",
        "score": 90,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gkxvsi/zuck_gets_cucked_by_a_rare_species_of_bee/",
        "content": "[https://www.engadget.com/big-tech/bees-reportedly-stopped-meta-from-building-a-nuclear-powered-ai-data-center-143050114.html](https://www.engadget.com/big-tech/bees-reportedly-stopped-meta-from-building-a-nuclear-powered-ai-data-center-143050114.html)\n\nJust bee happy\n\n  \nEdit: Remove first link as it was paywalled and sucked ",
        "created_utc": 1730897877.0,
        "subreddit_name": "wallstreetbets",
        "comments": 10
    },
    {
        "title": "For the First Time Ever, Intel outsold in Datacenter Market by AMD",
        "score": 76,
        "url": "https://www.tomshardware.com/pc-components/cpus/for-the-first-time-ever-amd-outsells-intel-in-the-datacenter-space",
        "content": "",
        "created_utc": 1730882294.0,
        "subreddit_name": "wallstreetbets",
        "comments": 12
    },
    {
        "title": "Another $TSLA election bet",
        "score": 58,
        "url": "https://i.redd.it/bvw8hvro8czd1.jpeg",
        "content": "I figured $TSLA calls would either go to the moon or turn into dust depending on who won.  Had some vibes Trump was going to  have a big win.   Sold all 40 right after this screenshot for $7.03 ",
        "created_utc": 1730923647.0,
        "subreddit_name": "wallstreetbets",
        "comments": 16
    },
    {
        "title": "Follow-Up Post on Earnings Day: $IONQ Set for a Massive Rally with Multiple Catalysts Ahead",
        "score": 56,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gl2dp1/followup_post_on_earnings_day_ionq_set_for_a/",
        "content": "**TL;DR:** Still long $IONQ on earnings day and not planning to sell anytime soon. Nothing in this post is financial advice, as I consistently lose money.  \n  \n**Ticker:** $IONQ  \n**Industry:** Computer Hardware  \n**Current Price:** $16.35\n\nA month ago, I [posted](https://www.reddit.com/r/wallstreetbets/comments/1g3rx6h/ionq_will_experience_a_massive_rally_and_has/) about IonQ, and since then, the stock has rallied from $10 to $16. Today, the company is holding its earnings call after hours, and I expect a positive reaction in the stock price, followed by consolidation before a potential higher move later this year. Coined as the Nickelback of DD, I made a few nickels on this trade.\n\nI won’t dive into the tech behind quantum or why it’s game-changing, but from an investment perspective, the time to position is now (though ideally, it was 6 months ago). I believe FOMO is about to kick in.\n\nAll the technical slides and key info are publicly available on IonQ’s investor website, PowerPoints, corporate presentations, and interviews with management over the years.\n\nhttps://preview.redd.it/6lj4rzyh0bzd1.png?width=959&format=png&auto=webp&s=895a8e6b55df96f34886886d734f8659b9472f57\n\n# Sources I recommend:\n\n* Shawn Kwon: A Korean YouTuber who traveled to the States to [interview](https://www.youtube.com/watch?v=YldqcQ35NlQ) IonQ’s management. He recently posted an insightful [interview](https://www.youtube.com/watch?v=OezQl80rloU) with them.\n* Peter Chapman: IonQ’s CEO has had some interviews that are really hyping me up. In a [recent](https://www.youtube.com/watch?v=dSVRPDrI8aI) one, he discusses how quantum is gaining commercial traction, especially due to having the right product at the right time, solving AI's growing energy needs.\n* Forbes Interview on Quantum AI: Forbes recently [covered](https://www.forbes.com/sites/torconstantino/2024/10/02/is-quantum-computing-an-unlikely-answer-to-ais-looming-energy-crisis/) the role of quantum AI in addressing AI's energy demands, with IonQ revealing that they're launching a quantum-AI chip prototype in the coming months aimed at reducing power consumption.\n* IonQ's Technical Roadmap: IonQ is ahead by 1 year on its ambitious [roadmap](https://ionq.com/resources/ionq-technology-and-performance-updates-milestones-commercial-advantage?utm_source=x&utm_medium=social&utm_campaign=Q2-2024-webinar&utm_content=webinar&utm_term=45474) and consistently overdelivers, which gives me even more confidence in their future progress.\n\n# Revenue Growth and Business Progress\n\nAfter all, this is what we’re all here for. IonQ has consistently grown its revenue quarter over quarter. I heard Chapman mention that Q3 and Q4 are expected to be their strongest quarters, so I’m expecting a double beat today as well.\n\nhttps://preview.redd.it/5wcagdfyxazd1.png?width=1979&format=png&auto=webp&s=cb8b94b8151b001a4926163c7c79e7b1d6f5ea55\n\nThis is their roadmap based on the qubits they plan to achieve. They’ve mentioned that they expect to gain a commercial advantage starting in 2026, but after today, good results could lead to forward pricing.\n\nQubits, like bits in classical computers, determine the computational power of quantum computers. In quantum computing, qubits scale exponentially in potential, as each additional qubit doubles the system's computational capacity. This is because a quantum system with multiple qubits can represent a superposition of all possible combinations of the qubit states, making quantum systems exponentially more powerful with each added qubit.\n\nBottom line: For a more powerful system, revenue is expected to scale exponentially as well, unlocking more applications that were previously unattainable.\n\nhttps://preview.redd.it/blkjixeayazd1.png?width=1440&format=png&auto=webp&s=1fcc97293e73bded17a2447ba82232142133eca0\n\nJust two days ago, their latest [system](https://status.ionq.co/), **Forte**, became accessible on their cloud. This will likely drive more revenue, as anyone can now test their systems through IonQ’s cloud or other major cloud providers.\n\nhttps://preview.redd.it/jrla5dymzazd1.png?width=916&format=png&auto=webp&s=4d75c3e90390ded079954b4eb76be0ba50484289\n\nWith hyperscalers now planning to literally build nuclear reactors to power their data centers, I believe this is the perfect moment to introduce a new kind of computing product to the market. All made in the USA.\n\n# Business Applications\n\nI’ve heard a lot of people say that applications are at least 10 years away, and value creation will take 10-15 years. But I disagree with that perspective.\n\nThis is their landing page on quantum [applications](https://ionq.com/applications-services), and it looks solid. They’re focusing on areas that Nvidia is also targeting right now: digital twins, hybrid computing, and machine learning. Many of their staff come from top companies like Nvidia, Amazon, and Dell.\n\nhttps://preview.redd.it/asslamcuuazd1.png?width=1200&format=png&auto=webp&s=a18728c7dbfa500838c003f7e6fe1ec449d02abe\n\nRecently, they’ve posted some interesting job openings: one for **Quantum AI** and the other for **Quantum Applications Chemistry**, both for scientist positions.\n\nhttps://preview.redd.it/plbtkkamtazd1.png?width=917&format=png&auto=webp&s=78a67ea32c71e9e122de2f29c3ad126ccba93f78\n\nhttps://preview.redd.it/syiuz5ertazd1.png?width=901&format=png&auto=webp&s=8b26d7531a88554803c333a0f28f51fcfca52cf1\n\nIt seems like they’re ready to develop apps for customers right away. As mentioned in the previous post, **today** they will showcase their first application, presumably focused on the healthcare industry. Personally, I think it will be related to pharma, especially since they’ve partnered with Quantum Basel in Switzerland to provide quantum access to nearby organizations.\n\nThe good thing is that after today, investors will immediately know whether this showcased app is something of value or not. We’ll find out if it’s commercially viable and applicable to the industry or just a prototype far from commercialization. Either way, it's better to clarify this quickly.\n\n# Options Chain\n\nI’m sharing this to highlight that institutions are taking an interest, not to promote options gambling. In recent months, IonQ’s chain has shifted from being sh\\*tty to balanced. This is the chain for the 2026 LEAPS. The OTM $35 strikes have attracted significant attention over the past few weeks, going from no open interest to 3k contracts for a $3B company since late summer.\n\nhttps://preview.redd.it/ln9ryu8duazd1.png?width=1200&format=png&auto=webp&s=e0da88dfcb6c3b7d26615e06abf5dc9d97c59973\n\n# Institutional and Government Interest\n\nIn a recent interview on [CNBC](https://www.youtube.com/watch?v=78JiA4ealks), Amy Raslin discussed why her fund went long on IonQ. This decision came after the stock rallied from $10 to $14 just a week ago.\n\nAdditionally, Congressman Glenn Ivey [spoke](https://www.youtube.com/watch?v=E27cYheKQHE) with Bloomberg and Peter Chapman about the growing support for IonQ.\n\n# Competitors\n\nFor those saying that Dell or Microsoft are leading the way in quantum hardware, they don’t know what they’re talking about.\n\nIonQ has the highest gate fidelity and error correction in the industry, along with the largest contracts from government institutions like ARLIS. The White House has even highlighted IonQ’s efforts to scale up their manufacturing facility in Bothell as part of their \"[Investing in America](https://www.whitehouse.gov/wp-content/uploads/2024/05/Washington-IIA-State-Fact-Sheet.pdf)\" agenda.\n\nhttps://preview.redd.it/zhb8fjh7wazd1.png?width=988&format=png&auto=webp&s=fd8a2eff6f5f04780723c99178ebc67d3ba404d0\n\n# Bear Thesis\n\nThe bear thesis, largely pushed by day traders these days, focuses on technical analysis charts and claims that IonQ is overbought. A few years ago, Scorpion Capital published a short report, which was promptly [responded](https://ionq.com/posts/may-12-2022-ionq-founders-respond) to by the founders. Since then, no large short positions have emerged with a solid thesis against IonQ. It's a bet against the technology and IonQ's ability to commercialize it.\n\nBears often argue that IonQ is expensive based on valuation metrics and negative EPS. This argument makes no sense since they’re just starting out and went public before generating revenue.\n\nBut this is exactly the moment to make a decision in my opinion: do you believe IonQ will continue to execute its roadmap? If so, do you enter now, before the revenue starts to come in and the price catches up to projections, or do you wait until the stock is trading at higher multiples but miss the current $16 entry point?\n\nI think that a lot of the bearish articles are laughable, especially when they keep repeating that quantum is \"10 years away.\" Beyond timing and valuation, no other real bear arguments seem to make it into the debate.\n\n# Founders\n\nI’ve seen some people argue that the founders leaving IonQ to continue their research signals that the ship is sinking and is an obvious short sell. However, the reality is that the founders didn't leave because the company is failing; they transitioned to focus on their academic work after 20 years of research. The company is now in the hands of a commercial and specialized quantum team focused on scaling up the commercialization efforts.\n\nIt all started 20 years ago in a lab in Maryland, when an investor approached the founders after reading their paper in a journal. That investor proposed creating a company based on their groundbreaking technology, and here we are today.\n\n# Conclusion\n\nThat said, the run on the stock is far from over. It will last for years, with investors cashing out at various price levels along the way. I have no idea what will be said during earnings or what we can expect from the application that is to be showcased, but I’m eagerly waiting to find out.",
        "created_utc": 1730910245.0,
        "subreddit_name": "wallstreetbets",
        "comments": 67
    },
    {
        "title": "Yall keep yappin about your Tesla so here’s my pltr instead",
        "score": 26,
        "url": "https://i.redd.it/hwt507ljcbzd1.jpeg",
        "content": "Bottom text money printer make big money money make big me like big money money. Man how many words do I need to add to this ok well yahoo and a bunch of yahoos said sell sell sell but I didn’t and I made big money.",
        "created_utc": 1730912837.0,
        "subreddit_name": "wallstreetbets",
        "comments": 3
    },
    {
        "title": "TSLA - how to price calls today, given the high volatility? ",
        "score": 22,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gkx5ty/tsla_how_to_price_calls_today_given_the_high/",
        "content": "So our planet and efforts to combat climate change took a massive hit today... but - gotta find the silver lining - at least my TSLA calls are going to print. \n\nSince I left a lot of money on the table after earnings by having paper hands and selling right at open - and not pricing those calls well to boot - I want to avoid repeating the same mistake. Any advice on pricing the below correctly? (I still have paper hands, so might still sell at open... haha, some trading mistakes are not easy to fix.)\n\nStock price difference × delta is what I typically use, but that obviously doesn't account for the massive volatility spike today. Any advice on how much to add in for that? Long time lurker, first time poster - thank you in advance!!! \n\nPositions:\nTSLA $270 12/20/24\nTSLA $260 1/17/25\nTSLA $265 1/17/25\nTSLA $300 1/17/25",
        "created_utc": 1730895440.0,
        "subreddit_name": "wallstreetbets",
        "comments": 34
    },
    {
        "title": "TSM, buy the dip baby",
        "score": 13,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gl5wim/tsm_buy_the_dip_baby/",
        "content": "Anyone else getting in on TSM?\n\nSeems oversold, we are close to pre-earnings levels. Great profit margin around 40%, growing revenues, stable debt, and forward p/e around 21. Seems like a steal!\n\nI get the onshoring trade, but lets get real, NVDA has been working with TSM for a very long time and their processes won't be replicated overnight. The standards for these chips are astronomical to get it right and NVDA has accelerated their manufacturing process with synopsys to speed up their progress.\n\nI get the geopolitical risks as well, but isn't big boy T supposed to bring calm and comfort to the world (or so his supporters think).\n\nPapa Elom also using NVDA chips and likely wants to protect the pipeline as TSM gradually creates new fabs in the USA. As long as they are making progress towards this goal, seems like a reasonable investment. Big boy and Elom wont let the pipeline get disrupted overnight, its too valuable and there would be huge repercussions for china I am sure.\n\nTarrifs likely to be paid by NVDA and hyperscalers but sure they will get a carve out and pay no tarrifs.",
        "created_utc": 1730919077.0,
        "subreddit_name": "wallstreetbets",
        "comments": 55
    },
    {
        "title": "ARBB IOT & ASTERA LABS",
        "score": 8,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gl0xkj/arbb_iot_astera_labs/",
        "content": "Couple rockets that it seems like no one is talking about.\n\nALAB\n\nI found out about ALABs a few weeks ago around 60\\~. Fresh AI/chip company. They just had their earnings, BOOM. I feel like they're going to be on par with Palantir/NVIDIA level growth.\n\nARBB\n\nARB IOT does AI with IOT I think, which I personally see as a bit part of the future. They're already putting the internet in everything, next thing you know your smart oven will perfectly roast your duck. POPPING OFF RIGHT NOW\n\nplease let me know if yall know anything about these I'm just trying to put the community on",
        "created_utc": 1730906469.0,
        "subreddit_name": "wallstreetbets",
        "comments": 6
    },
    {
        "title": "Do I have too much in NVDA?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gkn79v/do_i_have_too_much_in_nvda/",
        "content": "So, my account is worth about 127k right now. I have it split up into 12 different stocks. \n\nMost of my stocks are in the tech sector, I have 5k in MU, INTC, Disney, HD, Nflx, up to 10k in META, FB, MSFT, AAPL, TSLA, and other large cap stocks.\n\nNvda exploded up and I have atleast 40k on them right now. It keeps gaining though so I don't sell it. But, I'm a little afraid I have to much in it. \n\nWhat do you think?",
        "created_utc": 1730857066.0,
        "subreddit_name": "investing",
        "comments": 56
    },
    {
        "title": "2024 U.S. 🇺🇸 ELECTION: ANTICIPATED IMPACTS ON STOCKS, THE DOLLAR, AND TREASURY BONDS",
        "score": 525,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gkra3a/2024_us_election_anticipated_impacts_on_stocks/",
        "content": "🟩 POSITIVE IMPACTS:\n\n1. TRUMP, SPLIT GOVERNMENT:\n‣ Energy: Fossil fuel support; Less regulations\n‣ Dollar Impact: Likely stronger due to pro-business policies\n‣ Consumer Discretionary: Boost from deregulation and tax cuts\n‣ Financials: Regulatory relief and M&A growth\n‣ Transportation: Increased transport volumes from domestic production\n‣ Industrial REITs: Benefits from infrastructure and near-shoring policies\n‣ Payments: Lower regulatory focus\n‣ Retailers: Corporate tax cuts may increase consumer spending\n\n2. REPUBLICAN SWEEP:\n‣ Energy: Rollback of clean energy policies\n‣ Financial Exchanges: Higher trading volumes with lighter regulation\n‣ Major Banks: Permanent tax cuts\n‣ U.S. Based Manufacturer: Substantial China 🇨🇳 Tariffs\n‣ Defense Contractors: Substantial increase in defense spending\n‣ Tobacco: Lighter regulation\n‣ Consumer Discretionary: Tax policies and deregulation boost profits\n‣ Transportation: Increased freight demand from tariffs\n‣ REITs: Consumer spending support\n‣ Payments: Reduced compliance costs\n‣ Retailers: Tax cuts boost consumer spending\n\n3. HARRIS, SPLIT GOVERNMENT:\n‣ Private Equity: Benefits from increased transaction activity\n‣ Major Banks: Clarity in policy supports growth\n‣Cannabis Industry: Benefits from legalization discussions\n‣ Renewable Energy: Clean energy incentives\n‣ Healthcare Providers: Continued Medicaid expansion\n‣ Homebuilders: Affordable housing initiatives\n‣ Packaging: Boost from domestic manufacturing\n‣ Payments: Regulatory relief with CCCA delay\n‣ Retailers: Increased consumer demand from supportive immigration policies\n‣ Bonds: Could see a rise in value as yields may decrease under dovish fiscal policy\n‣ Mexican 🇲🇽 Markets: Stable U.S.-Mexico trade relations could strengthen the peso and benefit Mexican equities\n\n4. DEMOCRATIC SWEEP:\n‣ Social Media: Possible TikTok ban enforcement\n‣ Cannabis Industry: Strong legalization push\n‣ Renewable Energy: Expanded clean energy tax credits\n‣ Healthcare Providers: Expansion of Medicaid and ACA\n‣ Homebuilders: Homebuyer support programs\nIndustrial REITs: Higher demand for industrial spaces\n‣ Packaging: Demand driven by sustainability initiatives\n‣ Bonds: Bond prices may rise with lower yield expectations from fiscal spending expansion\n\n⭕ NEGATIVE IMPACTS:\n\n1. HARRIS, SPLIT GOVERNMENT:\n‣ Financials: Higher regulatory burdens\n‣ Tobacco: Uncertainty in tobacco regulation\n‣ Social Media: Increased content moderation scrutiny\n‣ Dollar Impact: Possible weakness with policy gridlock impacting confidence\n‣ Bonds: May benefit from low yields amid political gridlock\n\n2. DEMOCRATIC SWEEP:\n‣ Financials: Increased regulation and taxes\n‣ Tobacco: Stricter regulations\n‣ Tech Giants: Heightened regulatory scrutiny\n‣ Retailers: Higher corporate taxes\n‣ Dollar Impact: Weaker dollar with increased spending and dovish monetary policy\n‣ Bonds: Likely to appreciate as investors seek safety amidst tax hikes\n\n3. TRUMP, SPLIT GOVERNMENT:\n‣ Renewable Energy: Reduced support for clean energy\n‣ Healthcare Providers: Rollbacks in Medicaid and ACA\n‣ Homebuilders: Labor shortages from immigration policies\n‣ Packaging: Increased international competition risk\n‣ Dollar Impact: Stronger dollar expected\n‣ Bonds: Potential decrease with expected rate hikes tied to trade policies\n‣ Mexican 🇲🇽 Markets: Potential tariffs and stricter immigration policies may disrupt trade, negatively impacting Mexican stocks\n\n4. REPUBLICAN SWEEP:\n‣ Substantial China Tariffs --> Supply Chain Disruption\n‣ Renewable Energy: Rollback of clean energy subsidies\n‣ Tech Giants: Continued regulatory scrutiny\nHealthcare Providers: Medicaid cuts affect healthcare\n‣ Bonds: Likely decline with expectations of higher yields\nMexican Markets: Aggressive trade policies and tariffs could weaken the peso and negatively impact Mexican equities\n\nNote: These projections are based on anticipated policy changes and historical market reactions. Actual outcomes may vary.",
        "created_utc": 1730871348.0,
        "subreddit_name": "wallstreetbets",
        "comments": 222
    },
    {
        "title": "5,868% Gains",
        "score": 322,
        "url": "https://i.redd.it/utgalsf2hczd1.jpeg",
        "content": "To the LLM mods, the pictures says everything that needs to be said. Thank god we have AI mods. Wouldn’t want all the dog shit posts to flood the platform…",
        "created_utc": 1730926465.0,
        "subreddit_name": "wallstreetbets",
        "comments": 44
    },
    {
        "title": "Lyft beat earnings: yolo’d into earnings. Not this time AV overlords",
        "score": 66,
        "url": "https://www.reddit.com/gallery/1gl9p8m",
        "content": "Been posting my piece about Lyft for awhile. Essentially it’ll be years until AI is widely adopted and while that happens the rideshare market and use cases will expand. \n\nEverybody has been fear mongering about AVs taking over but here’s a reality check. People aren’t giving up their vehicles any time soon and these AVs cost too much to set up for them to spend millions on advertising for a new Lyft style app to generate demand. \n\nJust the beginning. ",
        "created_utc": 1730928611.0,
        "subreddit_name": "wallstreetbets",
        "comments": 15
    },
    {
        "title": "Nvidia passes Apple as world's most valuable company",
        "score": 5275,
        "url": "https://www.nbcnews.com/business/business-news/nvidia-passes-apple-worlds-valuable-company-rcna178874",
        "content": "",
        "created_utc": 1730869622.0,
        "subreddit_name": "news",
        "comments": 104
    },
    {
        "title": "iOS 18 could soon show you how long it will take for your iPhone to charge",
        "score": 1641,
        "url": "https://9to5mac.com/2024/11/05/ios-18-how-long-iphone-charge/",
        "content": "",
        "created_utc": 1730894353.0,
        "subreddit_name": "apple",
        "comments": 229
    },
    {
        "title": "Apple intelligent servers expected to start using M4 chips next year after M2 ultra this year.",
        "score": 1057,
        "url": "https://www.macrumors.com/2024/11/06/apple-intelligence-servers-with-m4-chips-report/",
        "content": "Apple Intelligence Servers Expected to Start Using M4 Chips Next Year After M2 Ultra This Year\n",
        "created_utc": 1730917912.0,
        "subreddit_name": "apple",
        "comments": 84
    },
    {
        "title": "Apple Continues Working to Get Blood Oxygen Sensing Back in U.S. Apple Watches as Next Masimo Trial Begins",
        "score": 505,
        "url": "https://www.macrumors.com/2024/11/05/masimo-apple-california-trade-secret-trial/",
        "content": "",
        "created_utc": 1730864365.0,
        "subreddit_name": "apple",
        "comments": 39
    },
    {
        "title": "Apple Planning ‘Ten Year Celebration’ Activity Achievement for Apple Watch",
        "score": 345,
        "url": "https://www.macrumors.com/2024/11/05/apple-watch-anniversary-activity-achievement/",
        "content": "⌚️🔟",
        "created_utc": 1730888229.0,
        "subreddit_name": "apple",
        "comments": 30
    },
    {
        "title": "Apple Seeds First Public Betas of iOS 18.2, iPadOS 18.2 and macOS Sequoia 15.2 With New Apple Intelligence Features",
        "score": 322,
        "url": "https://www.macrumors.com/2024/11/06/ios-18-2-first-public-beta/",
        "content": "",
        "created_utc": 1730917060.0,
        "subreddit_name": "apple",
        "comments": 75
    },
    {
        "title": "iPhone Glass Supplier Corning Faces EU Antitrust Probe",
        "score": 311,
        "url": "https://www.macrumors.com/2024/11/06/iphone-glass-supplier-corning-eu-antitrust-probe/",
        "content": "",
        "created_utc": 1730903725.0,
        "subreddit_name": "apple",
        "comments": 161
    },
    {
        "title": "Apple Intelligence Siri voices suck — Why?",
        "score": 178,
        "url": "https://www.reddit.com/r/apple/comments/1glbkgw/apple_intelligence_siri_voices_suck_why/",
        "content": "Am I the only one who finds the new Siri voices a horrible step backwards? I can’t quite explain what is wrong, but maybe the tone and intonations are off?  In a practical example, the speaking seems more difficult to understand, and it’s worse from further away from a device. Do others the new voices an improvement? \n\nI’ve tried many English language voices, including all US and UK voices, plus some Australia, India, etc. They all sound weird and worse compared with the non-AI versions. After a few days I end up changing because earch voice ends up grating on my ears. Meanwhile, my non AI-capable iPad continues to use the old, better voice.\n\nSometimes Siri 4 sounds almost resentful when responding, which might be more understandable if the responses were better… ",
        "created_utc": 1730933447.0,
        "subreddit_name": "apple",
        "comments": 100
    },
    {
        "title": "Daily Advice Thread - November 06, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/apple/comments/1gkvwou/daily_advice_thread_november_06_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1730890834.0,
        "subreddit_name": "apple",
        "comments": 47
    },
    {
        "title": "Apple warns investors its new products might never be as profitable as the iPhone",
        "score": 3549,
        "url": "https://techcrunch.com/2024/11/05/apple-warns-investors-its-new-products-might-never-be-as-profitable-as-the-iphone/",
        "content": "",
        "created_utc": 1730891539.0,
        "subreddit_name": "technology",
        "comments": 277
    },
    {
        "title": "Nvidia is making a new PC CPU to take on Intel, AMD, and Apple, says report | The gaming GPU maker reportedly has a new consumer PC Arm CPU in the works, set to challenge the AMD Ryzen and Intel Core duopoly.",
        "score": 1816,
        "url": "https://www.pcgamesn.com/nvidia/pc-arm-cpu-rumor",
        "content": "",
        "created_utc": 1730902639.0,
        "subreddit_name": "technology",
        "comments": 154
    },
    {
        "title": "Apple reportedly facing first-ever EU fine over App Store rules",
        "score": 168,
        "url": "https://www.theverge.com/2024/11/5/24289067/apple-eu-fine-digital-markets-act-app-store",
        "content": "",
        "created_utc": 1730929665.0,
        "subreddit_name": "technology",
        "comments": 15
    },
    {
        "title": "The EU is looking into Corning for alleged anti-competitive practices / The company is the dominant provider of glass to smartphone manufacturers.",
        "score": 69,
        "url": "https://www.engadget.com/mobile/the-eu-is-looking-into-corning-for-alleged-anti-competitive-practices-140328416.html",
        "content": "",
        "created_utc": 1730902782.0,
        "subreddit_name": "technology",
        "comments": 9
    },
    {
        "title": "Apple to Face First EU Fine Under Bloc’s Digital Markets Act",
        "score": 48,
        "url": "https://www.bloomberg.com/news/articles/2024-11-05/apple-to-face-first-eu-fine-under-bloc-s-digital-markets-act",
        "content": "",
        "created_utc": 1730857640.0,
        "subreddit_name": "technology",
        "comments": 1
    },
    {
        "title": "What's your favorite app that's included with macOS?",
        "score": 418,
        "url": "https://i.redd.it/i9glf2ur8dzd1.jpeg",
        "content": "",
        "created_utc": 1730935788.0,
        "subreddit_name": "mac",
        "comments": 385
    },
    {
        "title": "Brand new Apple Studio Display. Would you say this is an acceptable amount of light bleed? This is full brightness to illustrate the issue. Mega pissed as this display was expensive! ",
        "score": 229,
        "url": "https://i.redd.it/anb27l95uazd1.jpeg",
        "content": "",
        "created_utc": 1730906650.0,
        "subreddit_name": "mac",
        "comments": 77
    },
    {
        "title": "Apple Silicon Unified Memory: How Much Mac RAM Do You Need? - MacRumors",
        "score": 156,
        "url": "https://www.macrumors.com/guide/how-much-mac-ram/",
        "content": "",
        "created_utc": 1730861880.0,
        "subreddit_name": "mac",
        "comments": 39
    },
    {
        "title": "Someone gifted me this hand me down. Thoughts?",
        "score": 116,
        "url": "https://i.redd.it/uxzi0ik3m6zd1.jpeg",
        "content": "Someone gifted me this. Thoughts?\n\nGot this for free from a friend. Retired business use. It works amazingly well for a 9 year old model. Didn’t come with a keyboard or mouse, but I found an old Bluetooth AA battery Apple keyboard at a thrift store for $7. And I had a Logitech ultra thin mouse laying around from an old MacBook. Any thoughts. How about open core, it was already on here when I got it. This shud be good for a while right? ",
        "created_utc": 1730855516.0,
        "subreddit_name": "mac",
        "comments": 77
    },
    {
        "title": "I don't know why but Mac OS looks more stunning with windows 11 wallpapers. so I was a lifetime windows user till this July when I purchased MacBook Air M2 and ohhh boy.. what's I'm missing my whole lifetime (mainly becuase of the money 😅).. a sleek look, a great battery life.",
        "score": 101,
        "url": "https://www.reddit.com/gallery/1gkqcl7",
        "content": "",
        "created_utc": 1730867862.0,
        "subreddit_name": "mac",
        "comments": 18
    },
    {
        "title": "My computer sc. book says Mac was not developed by Apple, rather it was Potato Inc.",
        "score": 99,
        "url": "https://i.redd.it/uicwlkwvbbzd1.png",
        "content": "",
        "created_utc": 1730912628.0,
        "subreddit_name": "mac",
        "comments": 49
    },
    {
        "title": "Unknown MacOS productivity tools available in default terminal",
        "score": 17,
        "url": "https://www.reddit.com/r/mac/comments/1gkwsxe/unknown_macos_productivity_tools_available_in/",
        "content": "There are apparently many - not commonly known - utilities built in MacOS. TIL there's for example \\`networkQuality\\` command that will measure your network speed.\n\n[https://x.com/lukasf0rst/status/1854106073474408948](https://x.com/lukasf0rst/status/1854106073474408948)\n\n  \nedit: non paywalled [https://threadreaderapp.com/thread/1854106073474408948.html](https://threadreaderapp.com/thread/1854106073474408948.html)",
        "created_utc": 1730894243.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Magic Trackpad + 144hz = Disaster? ",
        "score": 4,
        "url": "https://www.reddit.com/r/mac/comments/1gkzmv9/magic_trackpad_144hz_disaster/",
        "content": "Is it too much to ask for a smooth experience from Apple's Magic Trackpad when using a modern 144 Hz monitor? Here we are in 2024, still dealing with this unsynced, jittery mess. Come on, Apple, it’s time to wake up and match your premium prices with some actual premium performance",
        "created_utc": 1730902955.0,
        "subreddit_name": "mac",
        "comments": 15
    },
    {
        "title": "Is this normal on the screen? M1 max 16 MacBook Pro",
        "score": 3,
        "url": "https://i.redd.it/wzjuimwxpbzd1.jpeg",
        "content": "As you can see on all 4 sides there is a small shadow on the display near the frames! Is it normal? My mb is almost 3 years old ",
        "created_utc": 1730917343.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "LCD screen replacement cost? (UK)",
        "score": 1,
        "url": "https://i.redd.it/tmygisxw1dzd1.jpeg",
        "content": "Opened my laptop up today, bear in mind there’s no outer damage, and suddenly there was a crack pop like noise and the screen has broken but it seems to be inside? I assume this is the LCD screen. I have an appointment with Apple tomorrow to look at it but wanted to ask here what the price for this fix would be.. it’s a macbook pro 2020 13 inch and honestly it’s been overheating and when charging giving me electric shocks anyway so maybe it could be worth just buying a new laptop, however the new pros are like £1499 with the education deal.. so need opinions as I really prefer the touch bar over the buttons. ",
        "created_utc": 1730933476.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "27\" 5k iMac 2020",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gl9jwv/27_5k_imac_2020/",
        "content": "I bought one if these lovely machines at precisely the wrong time.  My MBPRet couldn't manage what I was throwing at it.  Bought it just before the Apple silicon chips were announced.  \n\nSo here I am 4 years later not ready to move on from a (still) lovely piece of tech.  I'm currently running on 16gb of RAM...and looking to max out the RAM capacity at 128gb.  What sort of gains can I expect with a bump in RAM?  ",
        "created_utc": 1730928231.0,
        "subreddit_name": "mac",
        "comments": 12
    },
    {
        "title": "What kind of Wacom tablet models work with a 2021 M1 iMac (desktop)",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gl6vti/what_kind_of_wacom_tablet_models_work_with_a_2021/",
        "content": "Just bought a very cheap second hand 2013 Wacom Intuous for the iMac but had to put it on a PC laptop as a) the wires didn’t match (no US-C ten years ago) and b) wasn’t sure that it would even work with a dongle as it is so old. \n\nMy last (2011) iMac would have worked with the tablet as it had multiple ports including USB. Unfortunately can’t use that anymore. \n\nCurrent Mac: 2021 iMac Apple M1 running Sonoma 14.5",
        "created_utc": 1730921539.0,
        "subreddit_name": "mac",
        "comments": 7
    },
    {
        "title": "macbook pro m4 vs macbook pro m4 pro",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gl6gr6/macbook_pro_m4_vs_macbook_pro_m4_pro/",
        "content": "I am a programmer so my work mainly revolves around code and very rarely, phone simulators. So, getting the top top processing power from the chip doesn't really matter to me. However, RAM is my main concern. I'm sure the performance of M4 will be more than enough for me, and M4 pro might just be an overkill.  \nShould I go for Macbook Pro M4 or Macbook Pro M4 Pro?\n\nP.S. I would've gone for M3 air but I'm greedy for 2 external displays, better display, speakers etc. BTW, currently I'm running an M1 air with 8 gigs of ram 💀",
        "created_utc": 1730920490.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Can't install Microsoft365 on macOS Monterey 12.7.6?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gl55mw/cant_install_microsoft365_on_macos_monterey_1276/",
        "content": "I have an older Mac, about 2016. But it's currently up to date with Monterey 12.7.6. I'm trying to install Microsoft 365 but I get a message saying I need macOS13 or later. Has anyone else had this issue? If my OS is up to date why can't I install 365? As far as I'm aware, it's not like I can just switch OS's, but I don't understand why I would even need to in the first place. From what I've seen 365 runs on Monterey. Any one know what's up with this? Thanks! ",
        "created_utc": 1730917231.0,
        "subreddit_name": "mac",
        "comments": 10
    },
    {
        "title": "Using external SSD as startup disk for new iMac ",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gl4xww/using_external_ssd_as_startup_disk_for_new_imac/",
        "content": "I’m looking to buy the new 10-core iMac with 16g memory. I have a 2021 MacBook with 16g of memory and 1tb of storage—it runs perfectly for my use. \n\nBut with the new iMac, I’m hoping to save some money by buying the 256g and then using a SanDisk 2tb external SSD as the startup disk. Because it’s my desktop computer, having an external drive plugged in is no issue, and I’d never have to use it with my MacBook. \n\nI’ve been running my old 8g memory iMac on the external SSD and haven’t noticed any worse performance than normal. So I assume going from an M1 to an M4 and doubling my memory will be enough of an upgrade that I won’t regret running a new iMac from an external SSD. \n\nBut before I pull the trigger, do you think I’ll notice slower speeds or worse performance booting up the new iMac from an external SSD? If the new iMac like this would have similar performance to my 16g memory M1 MacBook Pro, I’d love to save the money on this new iMac. ",
        "created_utc": 1730916687.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "Running Windows with Parallels on M4",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gl48uu/running_windows_with_parallels_on_m4/",
        "content": "I have an Intel iMac that I will be replacing with a Mini.  Most of my job is run on Windows on Parallels.  Has anyone had issues with that?  Do you have to update your images?   Do you need a different version of Windows, or does the regular installer work?  Thanks in advance.",
        "created_utc": 1730914942.0,
        "subreddit_name": "mac",
        "comments": 12
    },
    {
        "title": "How big of a difference is a m4 versus an m4 pro (assuming each has 24 gb ram)",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gkqnw2/how_big_of_a_difference_is_a_m4_versus_an_m4_pro/",
        "content": "Debating between a MacBook air and Mac mini",
        "created_utc": 1730869062.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "So my iMac 18.3 (5K, 27\", 2017) Shat itself like this one day... turns out HD crashed. I am considering OWC Aura Pro X2 as an upgrade from the 128GB SSD. Any recommendations? Any issues you faced? Some pros and cons compared to Sintech adapter + M.2 NVMe SSD?  Thanks.",
        "score": 2,
        "url": "https://i.redd.it/605sjv4yy6zd1.jpeg",
        "content": "",
        "created_utc": 1730860845.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "How to install Kerberos on MacOS Sonoma with Apple Silicon and zsh shell ",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gkmh5l/how_to_install_kerberos_on_macos_sonoma_with/",
        "content": "Error: It seems like you are using **MIT Kerberos** but do not have the `krb5kdc` daemon installed. This is a common issue because **Homebrew's MIT Kerberos** installation might not include the **KDC** (Key Distribution Center) component. In fact, the Homebrew formula for MIT Kerberos may only install the Kerberos client tools like `kinit`, `klist`, and `krb5-config`, but not the full KDC server (`krb5kdc`).",
        "created_utc": 1730854776.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "r/Stocks Daily Discussion Wednesday - Nov 06, 2024",
        "score": 27,
        "url": "https://www.reddit.com/r/stocks/comments/1gkvhgy/rstocks_daily_discussion_wednesday_nov_06_2024/",
        "content": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1730889010.0,
        "subreddit_name": "stocks",
        "comments": 579
    },
    {
        "title": "DOWN TO MY LAST $400",
        "score": 192,
        "url": "https://i.redd.it/uromcv5ijbzd1.jpeg",
        "content": "The recovery begins now, all I can do is trade 0DTE QQQ options and pray",
        "created_utc": 1730915177.0,
        "subreddit_name": "wallstreetbets",
        "comments": 117
    },
    {
        "title": "$450 ---> $6,150 in two days",
        "score": 130,
        "url": "https://www.reddit.com/gallery/1gl9pae",
        "content": "25 SPY Day after election $588 calls bought the day before election.  Just had a feelin 🤷‍♂️🙏",
        "created_utc": 1730928615.0,
        "subreddit_name": "wallstreetbets",
        "comments": 25
    },
    {
        "title": "Price can keep going up even when you think it can't",
        "score": 64,
        "url": "https://i.redd.it/q0b703e8hczd1.jpeg",
        "content": "\nSpy had been trending up all day after two pull backs starting at 11:05 EST. \n\nJust when one might think \"damn, it can't have much more gas left\", look what happens at 15:05, two large green bars and then another time at 15:40 and 15:45. \n\nThis is why we should try and trade what the price is actually doing, not what you think it should do.",
        "created_utc": 1730926522.0,
        "subreddit_name": "DayTrading",
        "comments": 25
    },
    {
        "title": "I invested in 2003 in apple... it has done well for me but now I think I'm parting ways.......",
        "score": 12,
        "url": "https://www.reddit.com/r/AAPL/comments/1glahsv/i_invested_in_2003_in_apple_it_has_done_well_for/",
        "content": "Normally Apple would be there for the all time market highs....or leading the way.. now it is just an afterthought....not even solid earnings move the needle...\n\nSame incremented products.....refusal to make a \"splash\"\n\nAlways late to the game......\n\nI just don't have the confidence I once did in this great company....",
        "created_utc": 1730930622.0,
        "subreddit_name": "AAPL",
        "comments": 35
    },
    {
        "title": "Here We Go Again with Tariffs 2.0",
        "score": 7,
        "url": "https://www.reddit.com/r/AAPL/comments/1gl78u2/here_we_go_again_with_tariffs_20/",
        "content": "I was researching tariffs after the election. Seems like Cook was able to avoid a $150 levy per iPhone five or six years ago.\n\nThe stock also took a hit, dropping 6%.\n\nI hope Cook can navigate this incoming new world again...\n\n[https://www.reddit.com/r/apple/search/?q=tariffs&cId=f9b5899c-18a8-4693-b2d5-315b376feea6&iId=a40c06a2-ba14-4717-83ca-0cba48a1fc37](https://www.reddit.com/r/apple/search/?q=tariffs&cId=f9b5899c-18a8-4693-b2d5-315b376feea6&iId=a40c06a2-ba14-4717-83ca-0cba48a1fc37)",
        "created_utc": 1730922452.0,
        "subreddit_name": "AAPL",
        "comments": 7
    },
    {
        "title": "Does a path exist to repeat last 10 years of returns? What % probability do you give this happening, if at all?",
        "score": 6,
        "url": "https://www.reddit.com/r/AAPL/comments/1gkydci/does_a_path_exist_to_repeat_last_10_years_of/",
        "content": "Can someone explain with detail your view of a possible scenario where Apple can repeat last 10 years of returns and what would Apple need to do to make that happen?  How likely is this?\n\nI’m a bit confused as I’m reading various sources say because of apples size, market cap etc now and because they don’t have an innovative product like the iPhone, it’s impossible for them to grow as much. \n\nHowever on the other hand even with stagnant or declining revenue growth last couple of years, Apple stock has managed to get great returns (given that was also partially due to stock buybacks)\n\nNumbers wise what level of product /service growth do you need at Apple’s current market cap to replicate similar stock price appreciation? Does the large market cap most likely prevent such appreciation from happening again or not necessarily because Apple does buybacks? Like what factor do buy backs play in Apple not required to have a crazy high % product/service revenue growth?  \n\nSeems like a lot of people are doubting Apples future in terms of providing similar returns, however thats also happened in the past, with Apple proving everyone wrong. Why is it different this time? I also get why everyone is thinking along these lines as you need to continuously innovate to grow.\n\nAppreciate the insights!\n",
        "created_utc": 1730899361.0,
        "subreddit_name": "AAPL",
        "comments": 14
    }
]