[
    {
        "title": "I downgraded from a 2017 MacBook Pro to a 2015 MacBook Pro and my productivity soared.",
        "score": 5722,
        "url": "https://www.reddit.com/r/apple/comments/7w781l/i_downgraded_from_a_2017_macbook_pro_to_a_2015/",
        "content": "A bit of backstory:\n\nFor the longest time, I used my old 2012 MacBook Pro, even though the battery died very quickly, it was bulky compared to the newer MacBooks, and had started to slow down quite significantly.\n\nEven so, I was able to be really productive using it, specifically when it came to writing... I could type for hours on my old 2012 MacBook Pro and not get tired. I loved using it, loved typing on it, loved working on it, would bring it with me everywhere. \n\nFinally, I decided to upgrade and switched to a top-of-the-line 2017 MacBook Pro 13\" with TouchBar. It was sexy, it was thin, the keyboard wasn't as comfortable to type on, but hey, it made a nice 'clack' sound when you pressed the keys.\n\nOver the next few months, though, I realized my productivity had been significantly falling. I had stopped writing for pleasure, and would only type when I absolutely had to. I used my MacBook more like an iPad — browsing, clicking, scrolling. I 'liked' my new MacBook, but I didn't love it like my old 2012 MacBook.\n\nI suspected the keyboard was holding me back, but I didn't realize how bad it really was. After all, I was using the second-generation butterfly keyboard. Wasn't it supposed to be better than the first one?\n\nThen I read a post by [/u/7506blasting](https://www.reddit.com/r/apple/comments/7fke97/why_apple_wont_do_what_marco_wants_to_fix_the/dqcuaxy/):\n\n> The [butterfly] keyboard is objectively bad. We've had decades of research into ergonomics, we know what works. The mac pro keyboard puts all the shock of a key impact, and more strain on your fingers than any other keyboard I've used. It's only marginally better than typing on a tablet. No travel means no cushioning. It's like punching a wall instead of a bag.\n> \n> Of course we get used to it (we can get used to anything, even typing on phones - doesn't mean it isn't hugely inferior) but all the strain is now on your finger. You have to press lightly - but try doing that when you're in the flow, tired at the end of the day, when you've already put out thousands of words and just want to be done. I'm genuinely concerned a year or two of using this keyboard would bring me very close to RSI, arthritis, or any other joint issues in my hands. \n\nAnd that was it. I finally saw how bad the keyboard was (for me).\n\nI couldn't go back to my 2012 MacBook Pro (it really was slow at this point), so I went on eBay and found a top-of-the-line MacBook Pro 2015... the last MacBook with a comfortable, usable, meant-for-writing keyboard.\n\nHoly shit.\n\nThe difference stunned me. The 'old' keyboard was so much better than the 'butterfly keyboard' that I had to put up with for months. I didn't have to hammer away at the keys. My fingers danced across the keyboard and the familiar 'mushy' keys responded quickly and easily. It was an absolute joy.\n\nAll the love I felt for the Mac came back. This was a real laptop. This was a real machine that I could use for work, that was designed to be typed on.\n\nAnd on top of that, the little things. Having dedicated volume buttons on the top row. Dedicated pause/play button. And USB-A ports. Wow. Being able to use *any* old cable or external drive, without thinking of finding an adapter? It was pure luxury.\n\nI am never giving up this laptop. I'm even thinking of buying another one and just keeping it in my closet for the eventual day that this one might die.\n\nI don't see Apple going back to the old, comfortable, fantastic keyboards, like the one on the 2015 model. They're too obsessed with thinness and too proud to reverse a decision like that. (And some people do seem to like the butterfly keyboard, which makes the whole situation even more muddled).\n\nWhich basically means that... the 2015 MacBook Pro is the last MacBook I'll ever truly love. If we're gonna keep using the butterfly keyboard in the 2018, 2019, 2020 MacBooks, there's no way that I can go back to that hell. (And it is hell, for me, when your work depends on you typing and you're given a sub-par keyboard.)\n\nI don't know at what point Apple shifted from aesthetics/usability balance to just the aesthetics, but I find it extremely sad. I love the Mac, I love macOS, I want to keep using the platform. For now, I still can. But I don't know what I'm gonna do five or ten years from now.\n\nIf you're using one of the 2016 or 2017 MacBooks and you find your productivity falling or you're not writing as much as you used to, I urge you to look into switching back to an older Mac or at least a different external keyboard. The difference for me was night and day.",
        "created_utc": 1518116774.0,
        "subreddit_name": "apple",
        "comments": 1160
    }
]