[
    {
        "title": "Weekend GME Thread + Homework for all: Let's stop using brokerages that halted trading",
        "score": 36199,
        "url": "https://www.reddit.com/r/stocks/comments/l8rhr3/weekend_gme_thread_homework_for_all_lets_stop/",
        "content": "Hello all,\n\nLet's use this thread to discuss the GameStop situation this weekend, please don't open new threads about it unless it is a unique perspective or brings very valuable information.\n\nDo note, posts and comments are still restricted to users with a higher Karma and account age.\n\n##Important information\n\nFirst, let's get some things out of the way:\n\n* The short squeeze has not squoze yet, short interest estimates are still extremely high, I won't post the sources and encourage you to search for it yourself.\n* The gamma squeeze has not happened, it may happen Monday, it may happen gradually, it may not happen (if their positions have already been covered), it isn't necessary for anything to happen, however.\n* The establishment is still lying about many things for the purpose of market manipulation (Jim Cramer, CNBC, etc.). These people are SOLD. Read Canadian news channels regarding the situation, they are much less biased! \n* Google and Apple and removing negative reviews from bad brokers from their app stores, put a calendar reminder in 2-6 weeks to add your review at that time, instead of now.\n\n---\n\n##Let's make a list of the Brokers that restricted the purchasing of specific tickers\n\nThe worst thing that happened this week were the restrictions that our brokers put on buying specific tickers. This, obviously, affected the stock market, tanked those tickers, and significantly reduced our trust in the institutions at hand.\n\nNow, I'm aware the reasons for this are complicated, we know that for many of them, they were forced to restrict these tickers by their Clearing Houses (Apex being the main one), we don't exactly know why, or whether that is legal or not, however.\n\n**One thing for certain, the communication by the brokers and clearing houses was very, very, very bad. This, in turns, significantly harmed the public's trust in them, as well as the institutions in charge of regulating this.**\n\nHere is my list, please comment below and let me know which ones I've missed:\n\n### Horrible Brokers - Restricted purchasing of certain tickets and lied/gloated about it\n\n* Robinhood - [Now Blocking 50 Equities](https://seekingalpha.com/news/3656437-robinhoods-50-stock-limit-list?mail_subject=bb-ino-robinhood-s-50-stock-limit-list-with-spacs-makes-mass-exodus-likelier-alpha-tactics&utm_campaign=rta-stock-news&utm_content=link-73&utm_medium=email&utm_source=seeking_alpha) - [CEO lying saying they have no liquidity issues, 1 day before getting a 1 billion bailout](https://www.youtube.com/watch?v=6fs_lyGn4YA) - [Join the lawsuit against them if you were affected](https://robinhoodgamestopclassaction.com/) \n* Interactive Brokers (US/CAN) - [Display visible contempt for Retail traders, wants GME to go to 17 before re-enabling trading](https://www.youtube.com/watch?v=7RH4XKP55fM) - [Blocked Trading212, as their acting intermediary](https://www.financemagnates.com/forex/brokers/trading-212-blames-interactive-brokers-for-trade-execution-delay/)\n* E-Toro - [Proof](https://markets.businessinsider.com/news/stocks/robinhood-webull-m1-reopen-gamestop-stock-trading-2021-1-1030019926) - [Forced stop-losses](https://www.etoro.com/posts/0__entry__df95e7f0-1772-4ec7-a271-69b13ca229dd?utm_medium=Direct&utm_source=55714&utm_content=0&utm_serial=SocialSharePostcopyLink_918269&utm_campaign=SocialSharePostcopyLink_918269&utm_term)\n\n### Bad Brokers - Restricted purchasing of certain tickers\n\n* E-Trade - [Proof](https://www.theverge.com/2021/1/28/22254863/etrade-gamestop-amc-stock-reddit-wallstreetbets-robinhood)\n* Ally - [Proof](https://www.wsj.com/articles/online-brokerages-restrict-trading-on-gamestop-amc-amid-frenetic-trading-11611849934)\n* Public.com -  [Proof](https://techcrunch.com/2021/01/28/webull-and-public-remove-restrictions-on-memestocks-after-citing-trade-settlement-firm-as-the-cause/)\n* Merrill Edge - [Proof](https://www.streetinsider.com/Momentum+Movers/Merrill+Edge+said+to+have+put+restrictions+on+trading+in+AMC+Entertainment+%28AMC%29%2C+GameStop+%28GME%29/17879212.html)\n* IG Broker - [Proof](https://finance.yahoo.com/news/gamestop-amc-uk-trading-platform-163546937.html)\n* Trade Republic - [Proof](https://www.tellerreport.com/business/2021-01-29-%0A---trade-republic-and-gamestop--patronizing-investors-%0A--.BJNYXthWl_.html)\n* Webull - [Admitted they were forced to by clearing firm](https://finance.yahoo.com/news/we-bull-ceo-explains-why-trading-was-restricted-amid-the-game-stop-market-mania-172539318.html) - [Clearing firm is Apex](https://www.youtube.com/watch?v=4RS4JIEVyXM&feature=youtu.be) - They'll be moved to neutral once they publicly confirm Apex was sole reason the trades were restricted.\n* Stake - [Proof](https://hellostake.com/au/stake-updates/understanding-trading-suspensions/)\n* Trading212 - [Proof](https://inews.co.uk/news/business/gamestop-uk-trading-robinhood-trading-212-gme-stock-restricted-legal-action-850465) - [re-enabled, caused by intermediary](https://twitter.com/Trading212/status/1355074914202628098) - [Intermediary is IB](https://www.financemagnates.com/forex/brokers/trading-212-blames-interactive-brokers-for-trade-execution-delay/) - [Restricted purchasing of other securities previous](https://community.trading212.com/t/gold-buying-restricted-in-larger-quantities/27987) - Based on them restricting securities before this, and countless complaints regarding other restrictions, I've put them back in the bad list.\n\n### Neutral Brokers - Restricted trading, publicly naming their intermediary\n\n\n* Freetrade - [Proof, blames Barclays](https://www.cnbc.com/2021/01/29/gamestop-saga-uk-trading-app-freetrade-halts-purchases-of-us-stocks.html) - [CMO Interview](https://www.youtube.com/watch?v=V76UGdYAdcI&feature=youtu.be) - [CMO Tweets](https://twitter.com/v18n/status/1355258696885030915?s=19)\n* M1 Finance - [Proof](https://markets.businessinsider.com/news/stocks/robinhood-webull-m1-reopen-gamestop-stock-trading-2021-1-1030019926) - [Blames Apex Clearing](https://twitter.com/m1_finance/status/1354837064072753152)\n\n* Tastyworks - [Proof, blame Apex Clearing](https://twitter.com/thetastyworks/status/1354879706991128578)\n* Stash -  [Proof, blamex Apex Clearing](https://twitter.com/Stash/status/1354839916761518083?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1354839916761518083%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.newsweek.com%2Fwebull-blocks-gamestop-amc-transactions-stock-market-robinhood-1565172)\n* TD Ameritrade/Canada - [Proof](https://www.cnet.com/news/reddits-amc-and-gamestop-stocks-swing-wildly-after-robinhood-td-ameritrade-restrict-trades/) - [Proof2](https://www.cbc.ca/news/business/robinhood-gamestop-1.5891363) - (Margin requirements increased, Covered call and short put orders may only be placed with a broker and support times are > 2h, other trades restricted) - Neutral because they didn't restrict the purchase of stocks with cash.\n* Revolut - [Proof](https://www.financemagnates.com/forex/brokers/gamestop-buyers-suffer-another-setback-as-revolut-bans-trading/) - Blames DriveWealth LCC\n\n### Good Brokers - Did not restrict trading\n\n* Most Canadian Brokers (Questrade, Qtrade, Disnat, BMO, HSBC, RBC, TD, etc.)\n* Most European Brokers (Swissquote, TradeStation, Degiro)\n* Fidelity \n* Vanguard\n* WealthSimple (CAN, US)\n* Schwab (Margin requirements increased)\n* You Invest (JP Morgan/Chase)\n* Capital.com\n* Wells Fargo - [allowed trades but banned its advisors from talking about GameStop](https://www.barrons.com/articles/wells-fargo-blocks-advisors-from-recommending-gamestop-amc-51611870929)\n* Nordnet\n* Citibank\n\n---\n### Note regarding the clearing houses\n\nThe first step is to know why brokers restricted the trading. The second step is to investigate what happened with the clearing houses. Currently, the following clearing houses seem to have had the most issues:\n\n* Apex Clearing\n* Barclays\n* IKBR\n\nWe don't know if these firms acted maliciously (protecting themselves before protecting the free market), or because they literally had no choice. If the former, they need to be punished. If the later, then laws need to change. EITHER WAY, something needs to change, this post is merely here to put attention on the problem, I don't claim to have the solution.\n\nAdditionally, there needs to be open communication about this issue, currently, they are not saying anything on social media regarding this. Once they do, I'll update this post with it.\n\nNote: /r/ THICC_DICC_PRICC tried to explain this in some detail [here](https://www.reddit.com/r/stocks/comments/l90an8/an_explanation_of_what_caused_the_trading_halt/). I cannot attest to the accuracy/validity of his explanation, feel free to discuss that on his post.\n\n---\nWe might keep this information on the sidebar...forever. Please help me build this list to completion. If you are using a broker in the bad list, even if you are not invested in the tickers that have been restricted, please consider moving to a better broker.\n\nThank you all for your patience, we are sorry new members are not able to comment yet, we promise you will be allowed to once this is over!",
        "created_utc": 1612029808.0,
        "subreddit_name": "stocks",
        "comments": 4289
    },
    {
        "title": "By popular demand: official “I hate Robinhood and want a new broker thread”",
        "score": 7264,
        "url": "https://www.reddit.com/r/investing/comments/l8nntv/by_popular_demand_official_i_hate_robinhood_and/",
        "content": "Honestly, I didn’t want to post this myself since there’s probably two dozen of these posts in the queue, but all of the recent ones look like they’re written by 8 year olds. \n\nNormally this belongs in the daily advice thread, but because of recent events and concerns over Robinhood’s ability to serve customer(I been telling y’all for years) we can have a thread in it\n\n\nSo here we are: recommend and discuss brokers, fees, features, mobile apps, whatever.  In general I think everyone is best served by Fidelity, Schwab, or Vanguard.  TD is another major player but for those unaware they are in the process of being acquired by schwab.  All three of those actually have phone numbers where you can call and speak to a person about your account.\n\nFor the younger crowd; a phone call is similar to voice to text, but instantaneous. \n\nAlso, feel free to chat apps or whatever too,\n\nE: [here is an overview of what happened with Robinhood](https://reddit.com/r/investing/comments/l7t4pg/an_explanation_of_why_robinhoodapp_nonnefariously/).  No conspiracy theories or anything included, just a technical explanation. \n\nAlso, [my comment and subsequent conversation around liquidity concerns at Robinhood](https://reddit.com/r/investing/comments/l7qlfh/_/gl88dzj/?context=1)\n\nPlease note - I don’t have any special insight here, this is strictly my and others interpretation of the tea leaves.  Feel free to discuss, and explore other interpretations.  Whatever broker choice you make is up to you, the important thing is that it is an educated choice since it’s ultimately your money. \n\n\n\n#**No referral codes. Posting a referral code will result in an immediate no questions asked permanent ban** \n\nThanks.",
        "created_utc": 1612019568.0,
        "subreddit_name": "investing",
        "comments": 1942
    }
]