[
    {
        "title": "According to a Morgan Stanley analyst, the Optimus robots at Tesla's cybercab event were tele-operated by humans.",
        "score": 4145,
        "url": "https://www.theverge.com/2024/10/13/24269131/tesla-optimus-robots-human-controlled-cybercab-we-robot-event",
        "content": "",
        "created_utc": 1728862330.0,
        "subreddit_name": "stocks",
        "comments": 271
    },
    {
        "title": "Strong AI and Semiconductor weeks ahead",
        "score": 75,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1g30ztz/strong_ai_and_semiconductor_weeks_ahead/",
        "content": "Hi all,\n\nI think that AI and esp. Semiconductor Stocks have a couple of strong weeks ahead. Starting on Tuesday, October 15th 2024, the [Open Compute Project (OCP) global summit](https://www.opencompute.org/summit/global-summit) takes place in San Jose, California. Between 9 AM and 11:30 AM there'll be short keynotes (each 12 mins) presented by Meta, NVidia, AI Clusters, Intel, AMD, Microsoft and Google (full schedule [here](https://2024ocpglobal.fnvirtual.app/a/schedule/#)). Now, I don't think that there'll be any big surprises. But the Summit still presents an opportunity for public remarks about how strong the demand is or what so ever. Also, there's an [article ](https://finance.yahoo.com/news/broadcom-inc-avgo-showcase-cutting-104612051.html?guce_referrer=aHR0cHM6Ly9maW5hbmNlLnlhaG9vLmNvbS9xdW90ZS9BVkdPLz9fZ3VjX2NvbnNlbnRfc2tpcD0xNzI4ODU0NDU2&guce_referrer_sig=AQAAAKqTmr_oqY7_RMid-YuYH-NWHYEacoobdBjWziLlvZPiA7iILBRd-lo7X9KXAZjgy5w-h3UleFvekLyyq8_xnp6qPaiSm_Zcbts2F5zfEtE-6faSgzbLuTu-_jZFaA5wXE26LZR81IYJnp9F3qqNZ_r7RkXaZ8GLTsvPT3HSz-1B&_guc_consent_skip=1728854471)that says that Broadcom (AVGO) is going to show case cutting-edge AI infrastructure.\n\nFurther it is expected that Taiwan Semiconductor Company (TSM) and ASML Holding (ASML) will publish their Q3 earnings next week. TSM will present its earnings on [October 17th 2024 at 14:00 Taiwan time / 02:00 Eastern Time](https://investor.tsmc.com/english/quarterly-results/2024/q3). So pre-market movements will most likely be wild on Thursday as a large part of the industry relies on TSM.\n\nIf TSM reports a great Q3 revenue, this could push Nvidia over the current all time high. Also according to Moore's law is dead, the first RTX 5000 series GPUs are ready to be sold, but are not released because of business reasons ([here ](https://www.youtube.com/watch?v=sZmki-4xaWE)at 22:22). So they could still change their mind and ship in Q4.\n\nNext, it is [rumored (by moore's law is dead) ](https://www.youtube.com/watch?v=EbEPwJvtA5M)that AMD will release a new CPU by the end of October or early November, the 9800X3D which is an 8 Core Gaming CPU with 3D cache and it is expected that it will be the fastest gaming CPU releasing this year. Although Client is not as important for AMD, it will still be beneficial to have this CPU released before the holiday season. Especially since Zen5 Rysen has so far been viewed as rather disappointing. Moore's law is dead also mentions an RX 7650 GRE GPU, which could launch alongside Ryzen 9800X3D. Releasing a slightly refreshed and cheap RDNA3 GPU could be a good move by AMD to get rid of RDNA3 stock ahead of the RDNA4 launch in 2025. Since the Ryzen 9800X3D has not yet been anounced, I don't think that it has been priced in and could give the stock a slight boost to recover from the -4% last Thursday.\n\nAlso, I although Investors were not excited about AMDs Advancing AI event, I think AMDs position in the market is still solid. According to the slides shown at the event, AMD Epic has increased its market share to 34%. And according to [tests ](https://www.techpowerup.com/327600/amd-epyc-turin-with-192-cores-and-384-threads-delivers-almost-40-higher-performance-than-intel-xeon-6)AMD Epyc Turin obliterates Xeon 6 Granite Rapids, while being cheaper. Because of this, I think AMD is in a good position to gain more server market share. Further, the news about [Nvidia Blackwell being sold out for the next 12 Months](https://www.datacenterdynamics.com/en/news/nvidias-blackwell-gpus-sold-out-for-12-months/) is not only good news for Nvidia but also for AMD. Sure, everyone wants blackwell. but if one can't get blackwell and if AMD Instinct MI325X is faster than Nvidia Hopper (H200), then they might be able to win over customers from nvidia, who would like to buy blackwell but can't in due time.\n\nAlso, AMDs earnings should be reported on October 29 2024. Due to Ryzen Zen5 being disappointing and there being apparently a large RDNA3 stock remaining.\n\nIf AMDs Instinct systems are selling well, this would also be good news for Micron Industries (MU), which produces high bandwith memory (HBM3e).\n\nAnd then there's Intel. Their newest releases seem to have been disappointing. But they claim to be making progress with their foundries.\n\nSo I'm going Calls on Semiconductor Stocks (NVDA, AMD, MU, AVGO, TSM, ARM)\n\nThoughts or objections?",
        "created_utc": 1728856816.0,
        "subreddit_name": "wallstreetbets",
        "comments": 42
    }
]