[
    {
        "title": "$400k+ profit, 20,000% account growth in 1.5 years daytrading",
        "score": 2476,
        "url": "https://www.reddit.com/r/Daytrading/comments/ru9gin/400k_profit_20000_account_growth_in_15_years/",
        "content": "If I had read this when I first started off I would probably not believe it myself. I hope after sharing my results people will believe what can be achieved if you work hard to get into the top 0.5% of traders.\n\nI paper traded for one month and started live trading in June 2020 with a $1500 account. As someone using TradeZero International (non-US based) there are no PDT rule restrictions for under $25k accounts. After reloading several times (total deposits under $10k) I became profitable from January 2021.\n\n## Stats\n\n* Started 01/01/2021 with $1800 account equity\n* 160 green days\n* 91 red days\n* 2 days off\n* Note below graphs do not include commissions and borrow fees which is why net profit is less\n\n[All time PnL](https://preview.redd.it/4le3jd16x9981.png?width=454&format=png&auto=webp&s=b750fe524cf2d0886b3c8ae050e2f521e6e8d7c0)\n\n&#x200B;\n\n[2021 by month](https://preview.redd.it/7u1zuvhcx9981.png?width=942&format=png&auto=webp&s=a58d67a69e8cf53f0904591ce91b4820d133477c)\n\nDecember was my best month so far (note average holding time stats are not accurate for daytrades due to some overnight/swing trades affecting the average)\n\n[December stats](https://preview.redd.it/say8lpvdx9981.png?width=946&format=png&auto=webp&s=5263759e70bd6b839129f757206b1066c3796426)\n\n[December calendar](https://preview.redd.it/qotzqicex9981.png?width=851&format=png&auto=webp&s=b8974f3faaf15e46f528fd400f3e8663d345f91b)\n\n## Kinfo verification\n\n[https://kinfo.com/portfolio/17188/performance](https://kinfo.com/portfolio/17188/performance)\n\n\"Viewing and sharing on kinfo is only possible through direct integration with brokers. There is no way to add manual transactions, remove transactions or in any way manipulate the data which comes from the broker. This makes data on kinfo 100% authentic and there is no way for a user on kinfo to provide fake results on their trading performance.\" [https://kinfo.com/verified-trades/](https://kinfo.com/verified-trades/)\n\n# Trading Style\n\n## Market\n\nPrimarily daytrading US equities both long and short. Recently started expanding to short term swing trading and simple option strategies (long call, long put).\n\n## Stock Selection\n\nI trade most stocks that have volume and volatility, from small cap low float gappers to large caps. When I started off with a small account I primarily traded sub $10 stocks. Now I have moved onto midcaps and higher priced stocks since I don't want to pay as much short locate fees.\n\nEvery stock trades differently, some trade cleaner than others than others. For example, tickers like AMC and TSLA have plenty of volume and liquidity, respects technical levels often, leading to frequent opportunities on a daily basis.\n\n## Style\n\nI believe there are many different profitable ways to trade, from scalping to swing trading, shorting parabolics to buying dips. You can find edge in any strategy. I would describe my style as:\n\n* Rooted in technical analysis\n* Price action based\n* Discretionary systematic\n\nGeneral types of trade setups:\n\n* Breakouts, breakdowns (from ranges)\n* Mean reversion on \"extension\" (reversals, short and long)\n* Trend following\n\n## Indicators\n\nChart\n\n* Standard candlestick chart - using various time intervals\n* VWAP - session, anchored\n* Moving averages - simple, exponential\n* Volume\n* Volume profile with point of control (PoC)\n\nMarket sentiment\n\n* SPY - relevant for large caps and market names\n* IWM - relevant for small caps\n* VIX - volatility index\n* BTCUSD - when trading crypto stocks\n\n## Level 2, Time & Sales/Tape\n\nMy entries are 100% based off the chart. I always have Level 2 (market depth) and Time & Sales (tape) on screen with the order windows and look at them but they are not crucial for me. I can read tape but would not say I'm good at it.\n\n## Fundamentals\n\nFundamentals can be important: when trading small caps many are not \"great\" companies and often dilute shares to the public market which can affect the price of the stock. In large caps, news events and earnings can drive volatility, so understanding these earnings reports can help. I only have a basic understanding of SEC filings, offerings and other dilution, as there are many tools out there that help with this. Fundamental knowledge can help with understanding why a stock is moving/gapping but technical analysis is still key in timing entries and exits. In trading, being early is the same as being wrong.\n\n## Risk\n\nMy risk and scaling strategy is pretty basic compounding: max risk per trade is 2% of my current equity, which I adjust at the beginning of each trading day.\n\n* At $1,500 account my risk per trade was $30.\n* At $25,000 it was $500.\n* At $50,000 it was $1000 etc.\n\nSince there is a discretionary aspect to my trading I don't take the same risk every single trade. For example I may risk 1% on okay setups, 2% risk on great setups, and on rare occassions 3% on A+ setups. Look up Kelly criterion to understand why 2% is often used by many systems.\n\n## R/R & winrate\n\nThere are lots of threads out there on this topic. The default consensus when people talk about RR is to only take trades with a RR higher than 2:1 as it allows you to be profitable with any winrate over 33%. As your RR decreases your winrate must be higher.\n\nI sometimes take profit before 2R. I sometimes don't take any profit until after 2R. Obviously I try to aim for at least 2R+ targets in order to have a positive expectancy overall, but mostly I base my decisions off the chart and potential support/resistance zones, how price action is forming when inside the trade, so I do not rigidly take profit at fixed multiples of the risk amount.\n\n## Review & Journalling\n\nThe process of reviewing is crucial to a trader's progression. People do it different ways; some people track large amounts of quantitive data in excel, others are more qualitative in their analysis of executions and charts.\n\nI use TraderVue to import my trades daily and tag them with labels based on setups and characteristics. Every weekend I review my trades of the week, biggest winners, biggest losers and missed opportunities, annotating and screenshotting charts which are saved to a OneNote notebook.\n\n# Tools I use\n\n* Benzinga Pro - news\n* Twitter - news, other traders\n* TradingView - charts\n* TradingView - scanner\n* Finviz - scanner\n* TradeZero - broker\n* Discord - community\n* Tradervue - journal\n* OneNote - journal\n* Excel - risk calculator\n* DilutionTracker - fundamentals\n* BamSEC - fundamentals\n\n# Some advice to newer traders\n\n* Find a mentor\n\nMentors have been through all the mistakes a beginner trader will encounter, and can offer invaluable advice to speed up the learning curve. Even so, nothing can replace real world experience and most traders will still go on to experience the same mistakes themselves before learning\n\n* Join a community\n\nTrading can be a solitary job. It can be beneficial to talk ideas with other traders. Communities/chatrooms are also good for idea generation, and acting as scanners. Essentially you have many other traders looking at similar stocks and talking about tradeable charts. You should not join chatrooms to chase alerts as the end goal is to become independent in your trading\n\n* Put in the effort, accumulate screen time\n\nFor most trading days I have watched the charts for the majority of market hours (9:30 to 4:00). I say this to show the amount of screen time I have personally accumulated. On top of that the time spent on weekends reviewing and journalling trades, charting potential setups for the week ahead (even though a lot can change on Monday).\n\n* Practice\n\nWatching the markets is good, but nothing will beat real trading experience. I missed 2 trading days this year out of 252 days, with a total 8136 trades (granted, the first half of the year I was overtrading massively in learning stages)\n\n* Start with very small capital while having a stable income\n\nGrowing 10k to 50k should be the same as growing 50k to 250k (for the most part, unless your strategy runs into liquidity issues). Prove you can do it with a smaller account first. Then you must conquer emotion and discipline once you are trading bigger dollar amounts.\n\nIt's easier to learn while having another source of income rather than trying to become profitable while living paycheck to paycheck on trading income.\n\n## End\n\nThe best part about trading is that the only limit to your success is yourself. Compared to many other traders I am still only a beginner and have so much yet to learn. The potentials of trading are huge and my journey has only just begun. My goal next year is to cross $1M profits and keep scaling up.\n\nHope this helps those starting out just like I did in the beginning. Feel free to ask any questions! I also post trades & charts daily on my twitter [Valckrie](https://twitter.com/Valckrie)",
        "created_utc": 1641129582.0,
        "subreddit_name": "Daytrading",
        "comments": 466
    }
]