[
    {
        "title": "'Nightmare' U.S. stock valuations driven by 'young, dumb' investors, fund manager says",
        "score": 2029,
        "url": "https://www.reddit.com/r/stocks/comments/jbnkzh/nightmare_us_stock_valuations_driven_by_young/",
        "content": "U.S. equity valuations have become a \"total nightmare\" fueled by \"young and dumb\" investors, according to Cole Smead, president and portfolio manager at Smead Capital Management.\n\nAt present, investors are paying 22 times forward earnings to purchase stocks on the S&P 500, 50% higher than the 10-year average valuations across the index.\n\nThe forward price-to-earnings (P/E) ratio divides the current share price of a company by its estimated future earnings per share (EPS).\n\nMuch of the market rally which took the U.S. benchmark from correction territory in March to an all-time high in August was driven by tech megastocks and a bullish options market.\n\n\"The buying that went on in August and September is a 10-year phenomenon the likes of which we have never seen, among millennials and in the risk-taking among people that don't want to own bonds and want to own overpriced U.S. quality businesses, it is of record proportions,\" Smead told CNBC's \"Squawk Box Europe\" on Thursday.\n\nHe added that current valuations were an example of \"stock market failure\" driven by millennials speculating in the stock market for the first time. Smead projected that markets could be in for a nosedive since despite its monetary policy shoring up credit markets, the Federal Reserve \"can't save a stock market.\"\n\n\"They are buying bullish call options that expire inside two weeks. There was ($500 billion) of bullish call options bought in a four-week stretch by small retail traders,\" Smead said.\n\nA call option is a contract between the buyer and seller of the call to exchange a security, in this case a stock, at an agreed price.\n\n\"In '99 it was $100 billion, in '07, it was $100 billion. That is what young, dumb investors are doing and when the market makers see those (call buying) out there, they sell that call to that person and they buy the stock,\" Smead added.\n\nHe suggested that the willingness of wealthy investors and the baby boomer generation to \"ride the index to a fault\" and overpay for stalwart American businesses such as Costco and Microsoft was also detrimental.\n\n\"Microsoft is a wonderful company, but at 40 times earnings, there is a 0% chance of that producing wealth for someone over the next 10 years that will meet their needs.\"\n\nDespite a sharp tech sell-off in early September, Microsoft shares remain 40% higher since the turn of the year, while fellow tech titans Apple, Amazon, Alphabet, Facebook and Netflix have all been on a tear since March's crash.\n\n[Source](https://www.cnbc.com/2020/10/15/smead-nightmare-us-stock-valuations-driven-by-young-dumb-investors.html)",
        "created_utc": 1602768683.0,
        "subreddit_name": "stocks",
        "comments": 656
    },
    {
        "title": "How long until Samsung copies Apple, stops including chargers, and deletes this ad? - 9to5Mac",
        "score": 7742,
        "url": "https://9to5mac.com/2020/10/15/samsung-mocks-apple-no-charger-iphone-12/",
        "content": "",
        "created_utc": 1602802376.0,
        "subreddit_name": "apple",
        "comments": 1003
    },
    {
        "title": "Apple’s revived MagSafe charging standard opens the door for a portless iPhone",
        "score": 6494,
        "url": "https://www.theverge.com/2020/10/14/21515789/apple-portless-iphone-magsafe-wireless-charging",
        "content": "",
        "created_utc": 1602737000.0,
        "subreddit_name": "apple",
        "comments": 1248
    },
    {
        "title": "iPhone 12 Pro Models Around 20-25% Faster Than iPhone 11 Pro Models in Early Benchmark Results",
        "score": 5251,
        "url": "https://www.macrumors.com/2020/10/15/iphone-12-pro-benchmarks-geekbench/",
        "content": "",
        "created_utc": 1602773301.0,
        "subreddit_name": "apple",
        "comments": 1013
    }
]