[
    {
        "title": "Sink It for Reddit, a totally free iOS Safari extension to make Reddit less user hostile.",
        "score": 5729,
        "url": "https://www.reddit.com/r/apple/comments/14inaut/sink_it_for_reddit_a_totally_free_ios_safari/",
        "content": "Hey /Apple\n\nIf you're having déjà vu, I posted a couple of weeks back, a couple of hours before the blackout. I'm posting here again with the mods' permission.\n\nI'm sure most of you know the BS going on with third party apps. Reddit wants me, and by extension, you to use their damned app to consume the content people like us generate. As a matter of principle, I refuse to install their native app where I have zero control over what's shown to me.\n\nHarder for us to block ads and much easier for them to scoop up your data, right? To further that agenda, simply browsing their web version on Safari now means we’re inundated with, well, waves of crap. \n\nIt might be a modal covering half the screen with links to the App Store, an immediate popup asking you to login, or a header screaming “the app is 10x better”. Bottomline: it has to go. \n\n&nbsp;\n\n\n**Introducing Sink It**\n\nFinally fed up, I’ve built a super tiny, super minimal Safari web extension to deal with this BS. It’s called Sink It for Reddit. You can get it on the [App Store](https://apps.apple.com/us/app/sink-it-for-reddit/id6449873635).\n\nSink It is completely free and has **no BS — no ads, no in-app purchases, and no subscriptions**. It really is free. \n\n&nbsp;\n\n\n**What does it do?**\n\nCurrently, it removes most \"zomg please use our app” banners as well as login nags from Reddit. It also removes most (not all) \"promoted\" posts. \n\nIf you're up against companies as big as Reddit, it's a constant tug of war. Reddit particularly hates it when we tinker with the web version and does some shenanigans internally to break the extension. I've listed down [a few issues](https://gorekt.com/sinkit/common-issues) users are facing and how to fix them. \n\nIf you're facing the scroll freeze issue specially, I have an update in the works that promises to reduce the frequency of these. Sadly, probably impossible to prevent it from happening altogether. If you're a JS/TS dev and want to help, please reach out!\n\nIt’s also extremely minimal by design. The app *doesn’t track behavioral or usage history* including keeping a count of how many times it has blocked pop ups or have fancy widgets or analytics. \n\n&nbsp;\n\n**Privacy First**\n\nAll the functionality/pattern matching/blocking happens on your device with no data getting exfiltrated. Even something as regular as app analytics or telemetry has been stripped away in the name of privacy. \n\n\n&nbsp;\n\n**👋🏼**\n\nThanks for reading this wall of text and I do hope you’ll give Sink It a shot. I know a lot of you have gotten equally annoyed as me with what Reddit is doing these days.\n&nbsp;\n\nPS: If you're going to DM me reporting issues, don't be a muppet. Last time, someone sent \"your app sucks\" and it ruined my day. :(",
        "created_utc": 1687702386.0,
        "subreddit_name": "apple",
        "comments": 454
    }
]