[
    {
        "title": "Trump taps big tech critic Carr to lead US communications agency",
        "score": 795,
        "url": "https://www.yahoo.com/news/trump-taps-big-tech-critic-034951400.html",
        "content": "How do you think MSFT, META, GOOGL, and AAPL will fare next year? ",
        "created_utc": 1731943563.0,
        "subreddit_name": "wallstreetbets",
        "comments": 143
    },
    {
        "title": "MCD and SOUN?",
        "score": 20,
        "url": "https://www.reddit.com/r/stocks/comments/1gu6rqi/mcd_and_soun/",
        "content": "https://careers.mcdonalds.com/director-ai-engineering/job/28631538\n\nMcDonald’s is ramping its AI efforts back up and all signs point to SoundHound AI as their next major partner. Their recent job posting for a Director of AI Engineering focuses on integrating Generative AI (GenAI) and large language models (LLMs) into existing systems, rather than building proprietary solutions from scratch. This aligns perfectly with SoundHound’s expertise in conversational AI and their dominance in the foodservice sector. Notably, McDonald’s previously ended its AI collaboration with IBM, leaving room for a more specialized partner to enhance its drive-thru, kiosk, and mobile ordering systems.\n\nAdding fuel to the speculation, SoundHound recently announced on their earnings call that they’ve secured a major new client in the restaurant industry—one they are not yet able to name and negotiating with others. Given McDonald’s history of partnering with established tech leaders like Dynamic Yield and the timing of this hiring, it’s hard not to connect the dots. If this is indeed a McDonald’s x SoundHound collaboration, it could mark a transformative leap forward in customer experience with cutting-edge conversational AI. I’m expecting an announcement in the next month on who the new logo is and I think it’s pretty likely the largest name in the industry!",
        "created_utc": 1731942329.0,
        "subreddit_name": "stocks",
        "comments": 3
    },
    {
        "title": "EQIX and DLR - are they benefitting at all from AI datacenter buildouts?",
        "score": 4,
        "url": "https://www.reddit.com/r/stocks/comments/1gu8ztm/eqix_and_dlr_are_they_benefitting_at_all_from_ai/",
        "content": "I had been wondering if datacenter REIT's such as EQIX and DLR would benefit from the big AI datacenter rollouts - specifcally from AMZN AWS and MSFT Azure.  \n\nPulling up some data, I found that AMZN is listed as a top customer for both EQIX and DLR.  But MSFT/GOOGL/FB are nowhere to be found on those lists.  \n\nI know both MSFT and AMZN have both recently acquired land to build their own datacenters which makes more sense for them in the long run. But not sure if they can scale quickly enough on their own.  \n\nAnyone have more insight into EQIX/DLR datacenter expansion and customer base?",
        "created_utc": 1731947978.0,
        "subreddit_name": "stocks",
        "comments": 7
    },
    {
        "title": "Trump Team Eyes Rule Overhaul for Self-Driving Regulations, Potential Catalyst to Boost Tesla's Subscription Revenue",
        "score": 529,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gtutsd/trump_team_eyes_rule_overhaul_for_selfdriving/",
        "content": "The Trump transition team is prioritizing the development of a federal framework for fully self-driving vehicles, aiming to revise current regulations that limit the deployment of autonomous cars without human controls. This move aligns with the interests of Elon Musk, Tesla’s CEO and a prominent Trump supporter, who is heavily invested in autonomous technology, including plans to launch driverless Tesla robotaxis by 2026.\n\nCurrent regulations by the National Highway Traffic Safety Administration (NHTSA) allow only 2,500 self-driving vehicles per year under exemptions, creating barriers for Tesla and other manufacturers aiming for large-scale deployment. The Trump team is exploring leadership options for the Transportation Department, including former Uber executive Emil Michael, to craft policies that could facilitate mass adoption. Bipartisan legislative efforts to increase deployment caps and establish federal rules for autonomous vehicles have faced repeated setbacks, including challenges in Congress and failed compromises during the Biden administration.\n\nMusk, who has been appointed alongside entrepreneur Vivek Ramaswamy to lead Trump’s \"Department of Government Efficiency,\" is advocating for streamlined regulations and has pledged to push for policies enabling nationwide use of autonomous vehicles. The initiative has raised concerns among rideshare companies like Uber and Lyft, whose stock prices dipped following Musk’s announcements.\n\nThe push reflects broader ambitions to dismantle regulatory hurdles and advance emerging technologies under the Trump administration, though significant legislative and bureaucratic challenges remain.\n\n  \nSource - [https://www.bloomberg.com/news/articles/2024-11-17/trump-team-said-to-want-to-ease-us-rules-for-self-driving-cars?embedded-checkout=true](https://www.bloomberg.com/news/articles/2024-11-17/trump-team-said-to-want-to-ease-us-rules-for-self-driving-cars?embedded-checkout=true)\n\nArchive - [https://archive.is/S9qOq#selection-1391.0-1915.60](https://archive.is/S9qOq#selection-1391.0-1915.60)  \n",
        "created_utc": 1731898091.0,
        "subreddit_name": "wallstreetbets",
        "comments": 355
    },
    {
        "title": "NVIDIA is next-gen Blackwell chips delayed again, exposed to overheating issues？",
        "score": 28,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gu6sxq/nvidia_is_nextgen_blackwell_chips_delayed_again/",
        "content": "NVDA's next-generation Blackwell AI chips had serious overheating issues in high-capacity server racks. These issues have led to design adjustments and program delays, leaving major customers such as Google, Meta and Microsoft concerned about being able to deploy Blackwell servers as planned.\n\nBlackwell GPUs, designed for AI and high-performance computing (HPC), experienced overheating issues in servers configured with 72 processors, which can consume up to 120 kilowatts of power per rack. The overheating issue forced NVIDIA to modify the rack design several times, which not only limited GPU performance but also potentially damaged the hardware. Customers were concerned that these technical issues were delaying processor deployments in data centers.\n\nTo address this challenge, NVIDIA asked suppliers to adjust rack designs and worked with partners to optimize cooling systems. While such engineering improvements are a routine step in large-scale technology releases, they also further delayed product delivery.\n\nI think the overheating issues with the Blackwell chips reflect the technical complexities and challenges in the development of advanced AI hardware, but NVIDIA is responding to these issues with design adjustments and enhanced collaboration. While the delays may have some negative impact on customers and NVIDIA's results in the short term, the Blackwell chips are still expected to be a significant driver of the AI and HPC markets as optimizations are completed and products are shipped at scale.",
        "created_utc": 1731942419.0,
        "subreddit_name": "wallstreetbets",
        "comments": 64
    },
    {
        "title": "Palantir $PLTR is extremely overpriced.",
        "score": 267,
        "url": "https://www.reddit.com/r/investing/comments/1gu77l5/palantir_pltr_is_extremely_overpriced/",
        "content": "**1. Valuation Metrics Are Sky-High**  \nPalantir currently trades at a Price-to-Sales (P/S) ratio of approximately 53.13, significantly higher than industry peers.\n\n[GuruFocus](https://www.gurufocus.com/term/ps-ratio/PLTR) Even for a growth company, this level of valuation is extreme and implies future growth rates that may be unattainable.\n\n\n\n**2. Revenue Growth Isn’t Scaling as Expected**  \nWhile Palantir’s revenue growth has been solid, it’s showing signs of deceleration:\n\n* FY 2022: 24% year-over-year growth\n* FY 2023 (projected): 18% year-over-year growth\n\nThis deceleration doesn’t justify its premium valuation. Additionally, the company remains heavily reliant on government contracts, which are often lumpy and unpredictable.\n\n**3. Profitability Is Still Questionable**  \nDespite boasting about achieving GAAP profitability recently, Palantir has heavily relied on stock-based compensation (SBC). In fact, SBC accounted for approximately 30% of their operating expenses last quarter, which dilutes shareholder value and raises questions about true profitability.\n\n**4. AI Hype Is Inflating the Bubble**  \nThe market has been overly optimistic about Palantir’s AI capabilities. While their AI Platform (AIP) sounds promising, actual adoption metrics and revenue contribution from AIP remain vague. It’s easy to talk AI; it’s harder to monetize it sustainably.\n\n**5. Insider Selling Signals Lack of Confidence**  \nExecutives have been offloading shares at a significant rate. For instance, Chairman Peter Thiel sold a substantial portion of his holdings recently.\n\n[Yahoo Finance](https://finance.yahoo.com/news/insiders-lead-sell-palantir-stock-223000919.html)If the leadership team doesn’t see long-term upside at these prices, why should we?\n\n\n\n**6. Competitive Pressure Is Mounting**  \nPalantir operates in a crowded space with competitors like Snowflake ($SNOW), Databricks, and Microsoft ($MSFT) offering similar or better solutions. Palantir’s dependence on government clients limits its commercial reach in comparison.\n\n**TL;DR:**  \nPalantir is an interesting company with solid tech, but the stock price is disconnected from fundamentals. High valuations, slowing growth, heavy SBC, and reliance on government contracts make $PLTR a risky bet at current levels. AI hype has driven the price into bubble territory, and insiders don’t seem confident in its future.\n\nWhat do you think? Is $PLTR worth its valuation, or are we seeing another overhyped tech bubble? Let’s discuss! 👇\n\n*Note: All financial figures are based on the latest available data as of November 2024.*\n\nSources",
        "created_utc": 1731943495.0,
        "subreddit_name": "investing",
        "comments": 190
    },
    {
        "title": "Thoughts on Biotech short term?  Long term?  ",
        "score": 2,
        "url": "https://www.reddit.com/r/investing/comments/1gubxk2/thoughts_on_biotech_short_term_long_term/",
        "content": "What is everyones thoughts on the biotech sector right now?  As AI becomes more and more influential in our day to day life it made me rather bullish in the biotech sector.   So much of testing is done by repetition I figure more automation and AI is going to accelerate our discovery of new protein structures, etc.  I know Trumps election and RFK has a lot of people spooked but will the shake up in regulations be beneficial in the short term? ",
        "created_utc": 1731955072.0,
        "subreddit_name": "investing",
        "comments": 6
    },
    {
        "title": "How do you determine your split ratio between different companies in the same industry? For example, in AI, I mainly have PLTR and NVDA in 10:1 ratio (in dollars). But I think I'm too heavy on the PLTR side.",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1guc2qg/how_do_you_determine_your_split_ratio_between/",
        "content": "I’ve been thinking about my portfolio allocation strategy of PLTR and NVDA. It’s a simple metric, but it can give a good sense of how we’re positioning ourselves between two AI juggernauts. For me, I’m currently sitting at a 10:1 ratio. I believe its data-driven approach and its growing relevance in sectors like national defense, intelligence, and even healthcare give it a unique competitive edge for long-term growth. I'm seeing it as a large part of my 10+ year retirement holding.     \n  \nObviouly, NVDA is the largest in the AI space, but I see it as more of a stable growth play due to its already dominant position in the AI market. I’ve allocated less to NVDA because, while I believe in its long-term growth, the stock price is already higher, and I see PLTR as having more upside potential from its current valuation.    \n    \nCurious to hear how others are structuring their portfolios between different companies in the AI space.",
        "created_utc": 1731955421.0,
        "subreddit_name": "investing",
        "comments": 2
    },
    {
        "title": "Brendan Carr - \"vocal critic of Big Tech\" - to Lead FCC",
        "score": 209,
        "url": "https://www.reddit.com/r/stocks/comments/1gttj8j/brendan_carr_vocal_critic_of_big_tech_to_lead_fcc/",
        "content": "> Mr. Carr, 45, was the author of a chapter on the F.C.C. in the conservative Project 2025 planning document, in which he argued that the agency should also regulate the largest tech companies, such as Apple, Meta, Google and Microsoft.\n> \n> “The censorship cartel must be dismantled,” Mr. Carr said last week in a post on X.\n> \n> Mr. Carr could drastically reshape the independent agency, expanding its mandate and wielding it as a political weapon for the right, telecommunications attorneys and analysts said. They predicted Mr. Carr would test the legal limits of the agency’s power by pushing to oversee companies like Meta and Google, setting up a fierce battle with Silicon Valley.\n\n[LINK](https://www.nytimes.com/2024/11/17/technology/fcc-nominee-brendan-carr-trump.html)\n\n --\n\nMAG7 punished tomorrow?\n\nQuoting myself from a few months back on [this thread](https://www.reddit.com/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/) \n\n\n> I still hold a ton of both META & AMZN that I bought in late 2022. Huge gains.\n> \n> To me they're forever holds except for one thing which is a government/regulation interruption of their business models. Up to & including (however small the chance) full monopolistic breakup.\n> \n> The businesses themselves are strong and led by incredibly competent and forward-thinking execs.\n> \n> It's annoying to have to worry about that element as a long-term investor in both.",
        "created_utc": 1731894039.0,
        "subreddit_name": "stocks",
        "comments": 88
    },
    {
        "title": "QUESTION: Warren Buffet annualized returns without Apple?",
        "score": 94,
        "url": "https://www.reddit.com/r/stocks/comments/1gu76al/question_warren_buffet_annualized_returns_without/",
        "content": "warren buffet has an average annualized ~20% return for over the last 5 decades. BUT what would be his adjusted average returns if he never invested in apple? I’m curious to know how key apple was to his success. \n\nI have been trying to google all morning for this, but google’s search engine only shows recent articles about how warren buffet has dropped apple from his portfolio. I’m sure there’s a study or article somewhere that’s done the math? ",
        "created_utc": 1731943398.0,
        "subreddit_name": "stocks",
        "comments": 56
    },
    {
        "title": "Apple Intelligence on M1 chips happened because of a key 2017 decision, Apple says",
        "score": 2548,
        "url": "https://9to5mac.com/2024/11/18/apple-intelligence-on-m1-chips-happened-because-of-a-key-2017-decision-apple-says/",
        "content": "",
        "created_utc": 1731971015.0,
        "subreddit_name": "apple",
        "comments": 240
    },
    {
        "title": "No, Apple CEO Tim Cook Didn't Say He Prefers Logitech's MX Master 3 Over the Magic Mouse",
        "score": 1663,
        "url": "https://www.macrumors.com/2024/11/17/tim-cook-didnt-say-that/",
        "content": "",
        "created_utc": 1731888953.0,
        "subreddit_name": "apple",
        "comments": 307
    },
    {
        "title": "'iPhone 17 Air' Rumored to Surpass iPhone 6 as Thinnest iPhone Ever",
        "score": 787,
        "url": "https://www.macrumors.com/2024/11/18/iphone-17-air-could-be-thinnest-iphone-ever/",
        "content": "",
        "created_utc": 1731965268.0,
        "subreddit_name": "apple",
        "comments": 428
    },
    {
        "title": "Rumors of an Apple-made TV are back again",
        "score": 629,
        "url": "https://appleinsider.com/articles/24/11/17/rumors-of-an-apple-made-tv-set-are-back-again",
        "content": "",
        "created_utc": 1731950461.0,
        "subreddit_name": "apple",
        "comments": 297
    },
    {
        "title": "As of December 18th, 2024 iCloud backups will require iOS 9 or higher. Devices running iOS 8 or earlier can't backup to the cloud and their backups will be deleted.",
        "score": 509,
        "url": "https://www.macrumors.com/2024/11/18/apple-icloud-backup-ios-9-minimum/",
        "content": "",
        "created_utc": 1731962364.0,
        "subreddit_name": "apple",
        "comments": 43
    },
    {
        "title": "Apple's old headphone adapter is out of stock, never to return.",
        "score": 462,
        "url": "https://arstechnica.com/gadgets/2024/11/apples-headphone-adapter-for-older-iphones-sells-out-possibly-never-to-return/",
        "content": "",
        "created_utc": 1731961882.0,
        "subreddit_name": "apple",
        "comments": 136
    },
    {
        "title": "M4 Macs Unable to Run macOS VMs Earlier Than Ventura 13.4",
        "score": 459,
        "url": "https://www.macrumors.com/2024/11/18/m4-macs-do-not-run-early-macos-vms/",
        "content": "",
        "created_utc": 1731932728.0,
        "subreddit_name": "apple",
        "comments": 61
    },
    {
        "title": "Install Mac Apps on External Storage in macOS Sequoia",
        "score": 250,
        "url": "https://www.macrumors.com/how-to/install-mac-apps-external-storage-macos/",
        "content": "",
        "created_utc": 1731949713.0,
        "subreddit_name": "apple",
        "comments": 21
    },
    {
        "title": "Tata takes control of Pegatron's sole iPhone plant in India",
        "score": 147,
        "url": "https://appleinsider.com/articles/24/11/17/tata-takes-control-of-pegatrons-sole-iphone-plant-in-india",
        "content": "",
        "created_utc": 1731970840.0,
        "subreddit_name": "apple",
        "comments": 11
    },
    {
        "title": "Daily Advice Thread - November 18, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/apple/comments/1gu27ut/daily_advice_thread_november_18_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1731927640.0,
        "subreddit_name": "apple",
        "comments": 41
    },
    {
        "title": "Apple TV+ will license its movies to other services to reduce losses, per report ",
        "score": 1664,
        "url": "https://9to5mac.com/2024/11/18/apple-tv-will-license-its-movies-to-other-services-to-reduce-losses-per-report/",
        "content": "",
        "created_utc": 1731948854.0,
        "subreddit_name": "technology",
        "comments": 249
    },
    {
        "title": "Dialogue from more than 139,000 movies and TV shows has been used without permission to train generative-AI tools, including by companies such as Apple and Anthropic (of Claude), a new investigation in The Atlantic reveals",
        "score": 179,
        "url": "https://www.theatlantic.com/technology/archive/2024/11/opensubtitles-ai-data-set/680650/?taid=673b33284dd3f400014c8d71",
        "content": "",
        "created_utc": 1731933182.0,
        "subreddit_name": "technology",
        "comments": 39
    },
    {
        "title": "Taiwan’s Pegatron sells majority stake in India iPhone plant to Tata, sources say",
        "score": 61,
        "url": "https://www.scmp.com/tech/big-tech/article/3286976/taiwans-pegatron-sells-majority-stake-india-iphone-plant-tata-sources-say?module=top_story&pgtype=homepage",
        "content": "",
        "created_utc": 1731907702.0,
        "subreddit_name": "technology",
        "comments": 0
    },
    {
        "title": "The 2007 iMac had the sleekest design.",
        "score": 504,
        "url": "https://i.redd.it/ll9yofbwxp1e1.jpeg",
        "content": "The screen with the curved corners fits perfectly within the frame. Honestly this design was way ahead of its time. I really hope Apple revisits this style in the future. Absolutely stunning.",
        "created_utc": 1731961211.0,
        "subreddit_name": "mac",
        "comments": 103
    },
    {
        "title": "Got this device added to my iCloud",
        "score": 307,
        "url": "https://i.redd.it/ttrng6bhum1e1.jpeg",
        "content": "don't own an iMac, weird that serial number is zero and macOS is 10.15.6, like my previous MacBook Pro. What to do?",
        "created_utc": 1731923741.0,
        "subreddit_name": "mac",
        "comments": 75
    },
    {
        "title": "Former Apple-haters—What do you think of Macs now?",
        "score": 169,
        "url": "https://www.reddit.com/r/mac/comments/1gudf7w/former_applehaterswhat_do_you_think_of_macs_now/",
        "content": "You used Windows. You hated Apple. Then something happened.\n\nWhat was that *something happened* that made you switch?\n\nAnd what do you think about the Mac-ecosystem now that you're in it?\n\nWhat's your wishlist?",
        "created_utc": 1731958673.0,
        "subreddit_name": "mac",
        "comments": 321
    },
    {
        "title": "Weird hot spot on MacBook Air",
        "score": 35,
        "url": "https://i.redd.it/09jbjs5gnq1e1.jpeg",
        "content": "Hello everyone, my girlfriend has a 2020 MacBook Air which is primarily used for university work. Her laptop is always overheating with this weird white circle getting the hottest. Does anyone know what is going on or have any tips for solving this? ",
        "created_utc": 1731969805.0,
        "subreddit_name": "mac",
        "comments": 22
    },
    {
        "title": "Macbook M1 Pro 32/1tb vs Studio M1 Max 64/1tb",
        "score": 34,
        "url": "https://i.redd.it/do74wcpbgp1e1.jpeg",
        "content": "Max is $300 more. What would you choose and why?\n\nIm tempted with the studio to use with three external monitors and lots of ram. Heavy machine is nice but in the end perhaps a laptop is better overall.. appreciate all input",
        "created_utc": 1731955301.0,
        "subreddit_name": "mac",
        "comments": 21
    },
    {
        "title": "Finally decided! Bought a refurbished 13” M2 Air w/ 16GB RAM and 1TB SSD",
        "score": 20,
        "url": "https://www.reddit.com/r/mac/comments/1gttegq/finally_decided_bought_a_refurbished_13_m2_air_w/",
        "content": "It will replace my dinosaur mid-2012 MBP with aftermarket upgraded 8 GB RAM and a 512 GB SSD. The new machine was $1,199 plus tax. \n\nFunnily enough, I paid I think $1100 (edu discount) in 2012 for a base 13” MBP with a 512 GB hard drive and 4 GB RAM.  \n\nI was really nervous about the purchase, but in light of potential Trump tariffs combined with an aging laptop, I thought I should just do it. RIP my wallet. ",
        "created_utc": 1731893628.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Any hope for retrieving files off 25-year-old iMac hard drive? If so, any pointers?",
        "score": 16,
        "url": "https://www.reddit.com/r/mac/comments/1gudwv9/any_hope_for_retrieving_files_off_25yearold_imac/",
        "content": "https://preview.redd.it/udj2citmtp1e1.jpg?width=720&format=pjpg&auto=webp&s=ba4f83f3692fd8d79aa7a4254f72dd6290976483\n\nhttps://preview.redd.it/nfo60jtmtp1e1.jpg?width=720&format=pjpg&auto=webp&s=1987b346f8e05513edcdf9a391af7aa1c636b4c1\n\nhttps://preview.redd.it/dj700itmtp1e1.jpg?width=4096&format=pjpg&auto=webp&s=bd5e2ac4b4c9867a7a1c5ab4b802f9bc4b123d73\n\n",
        "created_utc": 1731959892.0,
        "subreddit_name": "mac",
        "comments": 22
    },
    {
        "title": "MacBook malfunctioning ",
        "score": 10,
        "url": "https://i.redd.it/5fe9mffcrn1e1.jpeg",
        "content": "My MacBook is showing this screen. It has completely stopped working. I have read the site it says under the image, but it’s complicated. Is there an easier way to fix this ?  ",
        "created_utc": 1731934797.0,
        "subreddit_name": "mac",
        "comments": 16
    },
    {
        "title": "How to delete all photos from Mac without harming iCloud",
        "score": 9,
        "url": "https://www.reddit.com/r/mac/comments/1gtvoxn/how_to_delete_all_photos_from_mac_without_harming/",
        "content": "Hi everyone,\n\nI just got the new Mac Mini M4, and I noticed it automatically downloaded all of my iCloud photos onto the Mac. I don’t want these images stored on my Mac since they take up around 4GB of storage, and I already have plenty of space for them on my iPhone.\n\nI’ve already turned off iCloud Photo Syncing on the Mac, so it’s no longer uploading or downloading anything to/from iCloud. However, the 4GB of images are still sitting on my Mac’s local storage. I don't play any games on my phone, so I have a ton of storage and I like to just keep all images on my iPhone so my Mac can be my work station where I have tons of storage.\n\nMy question is: Is it safe to delete these images directly through Finder without affecting my iCloud Photo Library or the images on my iPhone? I want to ensure that deleting them from the Mac won’t accidentally remove them from iCloud or my other devices.\n\nThanks in advance for the help!",
        "created_utc": 1731900894.0,
        "subreddit_name": "mac",
        "comments": 10
    },
    {
        "title": "MS Teams not doing hardware video processing on Apple Silicon Macs?",
        "score": 8,
        "url": "https://www.reddit.com/r/mac/comments/1gug2vw/ms_teams_not_doing_hardware_video_processing_on/",
        "content": "Noticed today when using my M1 MacBook Air that MS Teams was painfully slow when on a video call.  Checked the call health and noticed under Video processing it listed \"software enabled\".  Activity monitor showed Teams with upwards of 92% CPU usage.   Most recent version of MS Teams and MacOS 15.1.\n\nCan't say I've ever paid any attention to this before to recall if it ever used hardware video processing. But was surprised it was all hitting the CPU instead of using hardware encoding.\n\nI also tried a teams video call on my M4 Pro Mac Mini and it was also only using software video processing, although the CPU usage for Teams was only around 50% and had no noticeable impact on the usability of the app.\n\nAnyone else seeing this?  Could be this nothing new, and I just happened to notice since the Teams app was crawling.  Just thought when Teams was optimized for Apple Silicon that it would take advantage of its hardware video encoders.",
        "created_utc": 1731965288.0,
        "subreddit_name": "mac",
        "comments": 14
    },
    {
        "title": "Help needed please!",
        "score": 3,
        "url": "https://www.reddit.com/gallery/1gudsbm",
        "content": "Here are my two Macs. I’m trying to connect my MacBook to my iMac so that I can use it as a display. From what I’ve read online, this should be possible with a Mini DisplayPort cable. I purchased a mini DisplayPort (to hdmi) cable. Plugged in the port to my iMac and the hdmi to my MacBook dongle. It’s not working when I use command F2 as indicated🙃 I’ve tried restarting both and still no dice. Can anyone help me trouble shoot?\nAm I missing something simple about this?\nWould I need the way more expensive Thunderbolt cable instead?\nI’d like to not have to use a regular monitor to connect to since this is my WFH set up and I already have limited space on my desk area. \nThanks in advance! ",
        "created_utc": 1731959577.0,
        "subreddit_name": "mac",
        "comments": 11
    },
    {
        "title": "Does NFS just not work on Macs anymore?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gtw0zh/does_nfs_just_not_work_on_macs_anymore/",
        "content": "On macos Sequoia, I'm doing this:\n\n- vi /etc/exports\n- Add an export path in the usual way, e.g. \"/foo -rw 192.168.0.99\"\n- nfsd restart\n- nfsd status (says \"nfsd is enabled\" & \"nfsd is running\")\n\nBut when I do \"showmount -e\" it just says \"Exports list on localhost:\" and nothing else.\n\nHuh?\n\nIs \"/etc/exports\" no longer the correct path? Maybe it got changed in Sequoia? (Google isn't helping at all with that question, sadly.)",
        "created_utc": 1731902007.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Help",
        "score": 5,
        "url": "https://i.redd.it/x1tyy0y5fk1e1.jpeg",
        "content": "I have a windows laptop and am thinking about moving to a MacBook. My job requires me to get signatures every so often from clients. These signatures are directly from the web browser. I know of the signature feature on Mac with PDFs. Does that same feature work on the Safari browser? If not, I'm open to ideas or I can just stick with a Windows touch screen laptop. Thank you!",
        "created_utc": 1731894378.0,
        "subreddit_name": "mac",
        "comments": 10
    },
    {
        "title": "Something goes turbo when in Idle",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gu6gkc/something_goes_turbo_when_in_idle/",
        "content": "Whenever I had put my MacBook Pro M1 on ventura 13.6.7 in locked mode (so that I need to put in my PW to use it again) i see a very high spike in usage after i unlocked it again. \n\nI did not manage to find any way to track backwards what software uses how much of my cpu. i can only see what uses the cpu at the moment. \n\n  \nIs there any way to see what software caused the spike?\n\nhttps://preview.redd.it/sf6oroh7bo1e1.png?width=136&format=png&auto=webp&s=281ffed765541f1b3173ec89754e57a602543fd1\n\n",
        "created_utc": 1731941505.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Turning on full keyboard access without a mouse",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gu524u/turning_on_full_keyboard_access_without_a_mouse/",
        "content": "So I just got the new iMac m4 but my mouse doesn't work, I'd like to at least somewhat use the mac so I tried to turn on full keyboard controls but it won't select the submenu no matter what I try to press\n\nHow do I turn on full keyboard access without being able to use a mouse ",
        "created_utc": 1731937612.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "how to free up storage space? ",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gu3wtz/how_to_free_up_storage_space/",
        "content": "i'm a first time mac user. i've noticed how slow and laggy my macbook has been lately. i wanna know why imovie takes up so much storage space and for what? anything else i can do to make my mac not be so laggy? (btw, i don't think i can upgrade any hardware, a bit low on money rn) :\")\n\nhttps://preview.redd.it/k4vgxsqqon1e1.png?width=974&format=png&auto=webp&s=39702a2370abb035f51fb0d43e4aa4ad4074811a\n\nhttps://preview.redd.it/2qpkku4son1e1.png?width=1292&format=png&auto=webp&s=2c0cb4034344be3d2de48dd2fe0bfffc37784430\n\n",
        "created_utc": 1731934054.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "What to do with old MacBook Pro 2020 Intel i5?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gu1b0n/what_to_do_with_old_macbook_pro_2020_intel_i5/",
        "content": "So i've replaced my MacBook Pro 2020 Intel i5/8Gb/512Gb with a new M4 MBP (base model). But I'm hesitating to sell the 2020 MacBook Pro! Every time I've upgraded MacBooks in the past, I've sold the old one without hesitation. But this time I'm wondering if I should hang on to it. \n\nPractically, I wonder if it would make a better Windows laptop, for times I do still need to run x86 Windows natively, than my current other Windows laptop? That is a Microsoft Surface Pro 7 given to me by work as it was out of warranty - which has a similar sounding 10th-gen i5 (although apparently clocked at only 1.5Ghz - the i5-1035G4) and 8Gb RAM. I hate the flappy keyboard of the Surfaces, and the higher clock CPU should make the Intel MBP snappier to run in Windows via Bootcamp? The Surface is officially supported in Windows 11 though, which seems significant with Win10 updates ending next year.\n\nBut it doesn't seem clear if the 2020 MBPs are really supported with Windows 11 via Bootcamp? And is the trackpad/gesture support in Windows any better than it used to be?\n\nI also can't help but wonder if the final gen Intel Macs will be \"future vintage classics\"? I'm quite into vintage PCs. Is it worth holding on to the Intel MBP in this light? Or is the battery design etc just going to mean it will turn into a \"spicy pillow\" sooner or later?",
        "created_utc": 1731923599.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Anyone recently switched from a MacBook Air or Pro to an iMac ? Looking for some feedback on pros and cons",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gugepk/anyone_recently_switched_from_a_macbook_air_or/",
        "content": "Hi everyone,\n\nI currently own an iPad Pro M4 and a MacBook Pro M1 Pro 14 inches.\n\nMy iPad Pro is my lightweight and small computer that I use on my couch or in bed, and that I carry with me when I go on holidays or leave for the week-end.\n\nMy MacBook Pro always stays at home, I have a Windows laptop for work, I use my MacBook only for personal things. I use it to edit and export photos in Lightroom, create maps or draw in Pixelmator Pro, write Notes, work on Numbers spreadsheets, use Maps to prepare future road trips. I also create photo albums to print on my MacBook.\n\nLately I have been wanting to have a bigger screen to do all that stuff while also feeling a bit frustrated that I don’t take advantage of my MacBook’s portability and power. I have an external 21 inch monitor that my work lent to me for remote work but it is low resolution and bad quality. A good external monitor like the Studio Display with high ppi and great color accuracy are very expensive.\n\nI’m really starting to consider to go desktop for Mac, and have the iPad as my only portable computer. I have considered the Mac mini but with a good monitor it’s more expensive than an iMac and I love the all-in-one design of the iMac. I can really see myself editing photos and creating albums on that bigger beautiful Retina screen.\n\nHas anyone recently switched from a MacBook to an iMac ? How was your experience ? Do you miss your MacBook ? What are the pros and cons of the iMac ?",
        "created_utc": 1731966101.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "Best approach to save my dying drive? ",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gufndr/best_approach_to_save_my_dying_drive/",
        "content": "i'm using a late 2012 imac, and i have 2 separate bootable drives (SSD1 and SSD2). I've been mainly using SSD2, which as of recently started failing. The computer would randomly just restart, and this behavior would slowly increase, until the computer would almost not boot anymore. Maybe every 5th or so attempt i could still boot the ino SSD2, but just selecting random documents on the desktop would make it shut down/restart. \n\nMy idea now was to plug in SSD2, while i'm booted into SSD1, initially make just a backup so i at least save the files (using Disk Drill or so), and after make a bite-by-bite copy, so i can ideally continue booting into SSD2 like i was before. \n\nMy conundrum now is that, plugging SSD2 into the computer, while booted into SSD1, also makes SSD1 freeze. Some times SSD2 appears in finder (interacting with it is not possible), and sometimes it does not. Disk Drill just shows a message saying that it's \"updating disk list...\" so i assume it is at least being detected? But nothing happens after this. This does make me feel that the drive is done for, however, i very occasionally can still boot into SSD2. Again, i cannot interact with it at all, but seeing all documents and folders when i'm able to boot into SSD2, still shows that the files are all there, so the drive is not completely done just yet? \n\n\n\nwhat is my best approach moving forward? ",
        "created_utc": 1731964208.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Advice on Selling Used MacBook Pro",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gu844p/advice_on_selling_used_macbook_pro/",
        "content": "I have a MacBook Pro (13-inch, 2017, Four Thunderbolt 3 Ports) I purchased in Dec 2017. It Has an intel core i5 with 8GB memory and 512 gb storage and does have a touch bar. I loved it until the display started to show black lines. It is definitely functional and usable with a monitor. I plan to sell it on eBay but unsure what would be a reasonable price. Any thoughts?",
        "created_utc": 1731945807.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Macbook Pro 2019 Sequoia Wallpaper not displaying correctly",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gu7ekv/macbook_pro_2019_sequoia_wallpaper_not_displaying/",
        "content": "https://preview.redd.it/n3uxsr82io1e1.png?width=3360&format=png&auto=webp&s=33d577d6e0322cbe4cdc33406e0653646a0a1424\n\nHello all! I have a MacBook Pro 2019 with macOS Sequoia Beta 15.2. For some reason when I use the Sequoia wallpaper/screensaver it shows up as this weird yellow/blue color instead of dynamically changing with the time of day like its supposed to? I was just wondering if anyone had encountered this and found a fix or might know what the problem is?",
        "created_utc": 1731943990.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "How many icloud+ accounts?",
        "score": 1,
        "url": "https://www.reddit.com/r/mac/comments/1gu5o6f/how_many_icloud_accounts/",
        "content": "My wife had 16gb icloud storage, I have 2TB, turned on family sharing so now she has 2TB of icloud storage. Should she cancel her 16gb account? Why pay for it if we have 2TB between us? She won't lose any of her data now, right? Wish Apple would make this a little more clear.",
        "created_utc": 1731939339.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "mid 2012 MacBook pro dead",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gu52ea/mid_2012_macbook_pro_dead/",
        "content": "My cousin brought me their Mac to see if I could repair it. They mentioned that it no longer responds at all: the charging indicator light doesn’t work, the battery level indicator light is also non-functional, and the device won’t power on. I checked for signs of overheating or liquid damage, but everything looks fine.\n\nWhat could be causing this issue?\n\n",
        "created_utc": 1731937632.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Using Multiple Displays w/USB-C Hub & MacBook Pro M4 ",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gu4mfo/using_multiple_displays_wusbc_hub_macbook_pro_m4/",
        "content": "Good morning,\n\nI just bought the new 14\" MPB M4 Pro, which has support for 4 external monitors. My desk setup has three monitors that I have routed through an Anker USB-C hub that supports up to 3 external monitors. When I connect the USB-C hub to my MBP, it identifies all three monitors as a single monitor (they're the same model) and mirrors them. I can change my display settings to extend my external display so that my MBP display is extended onto the external monitors, but the monitors mirror each other. The MBP will not identify them as different displays. I am able to connect all three monitors by using the various ports on my MBP, but I want to use my USB-C hub to eliminate the cable clutter. Please help!\n\nSolutions I've tried so far:\n\n* Identify displays in Settings\n* Plug in displays one at a time\n* Try only two monitors",
        "created_utc": 1731936323.0,
        "subreddit_name": "mac",
        "comments": 8
    },
    {
        "title": "Dual boot",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gtyx0s/dual_boot/",
        "content": "Hey all, so I have a 2011 mbp, obviously outdated. So wanted to install linux mint alongside high sierra (high sierra has ms office which I require).\nSo, after my research, I have identified the following steps\n1. Bootable usb\n2. Partition drive (smaller or larger than macos partition, to remember)\n3. Disable SIP\n4. Boot into live environment\n5. Click Install and choose the partitioned drive, with mount point '/'\nGood to go? Or am I missing smth?",
        "created_utc": 1731912595.0,
        "subreddit_name": "mac",
        "comments": 7
    },
    {
        "title": "Windows PC shows hidden files on external hard drive after copying photos from Macbook  ",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gttw98/windows_pc_shows_hidden_files_on_external_hard/",
        "content": "I copied some photos from my macbook to an external drive.\n\nI notice hidden files with the same file names as the photos with smaller file size.\n\nWhat are those and can I just delete it in windows PC?\n\nOr are they needed when opening it in macbook?\n\nhttps://preview.redd.it/k0pfaw1ehk1e1.png?width=1866&format=png&auto=webp&s=cb2ce802f1078a94133746003967511e465cc106\n\n  \n\n\n",
        "created_utc": 1731895150.0,
        "subreddit_name": "mac",
        "comments": 10
    },
    {
        "title": "How do games work on MacBook Air M2 chip MacOS sequoia?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gtt49r/how_do_games_work_on_macbook_air_m2_chip_macos/",
        "content": "\nSo I’m purchasing a MacBook Air M2 chip moving from a probook that can run game launchers like epic launcher Battle.net launcher and stream.\n\n and I can play almost any game obviously on low graphics and some lag.\n\nand my windows has access to open steam battle net and running overwatch ect.\n\n So my question is can I run games on my mac like overwatch and steam games like is the machine capable of downloading launchers and opening games.\n\nAnd what is the performance like?",
        "created_utc": 1731892772.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "Pre Loved iMac help",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gtruxi/pre_loved_imac_help/",
        "content": "Hello there 👋🏻 I'm just a regular person hoping to start a conversation that can help pointing me in the right direction.\n\nI am ready to purchase a pre loved all in one Mac. I have always had a MacBooks & I now want to sit at my feet in front of a 27\"+ screen. I know I want a 2tb with of storage, also something from no later than 2019. I see things like \"the 6-Core i5 3.0GHz\" or \"quad\" a bunch of other words I know are important but it's Latin to me.\n\nI just need something to load all my thousands of photos on. (No crazy editing or movie making I just like taking photos) maybe typing up a few documents & mayyybe a spread sheet or something. Then just watching YouTube videos or surf the web ( I'm a senior 35 year old) 😂😅\n\nI have had a lot of medical problems I have not been able to work for 11 years now. So I desperately need to stay around the $800-$1400. Plus it's hard doing more research & things for new doctors on my iPad or my little baby MacBook. \n\nSomeone please help me 😅🙌🏻",
        "created_utc": 1731889063.0,
        "subreddit_name": "mac",
        "comments": 19
    },
    {
        "title": "Apple Is Reportedly Thinking About Making Its Own TV Again",
        "score": 899,
        "url": "https://gizmodo.com/apple-is-reportedly-thinking-about-making-its-own-tv-again-2000525819",
        "content": "",
        "created_utc": 1731953975.0,
        "subreddit_name": "gadgets",
        "comments": 321
    },
    {
        "title": "Toshiba's all-in-one desktop crams a dot matrix printer and 3-minute power backup into a 50-poundunit | A retro machine with a touchscreen? Sign me up!",
        "score": 230,
        "url": "https://www.techspot.com/news/105613-toshiba-all-one-desktop-crams-dot-matrix-printer.html",
        "content": "",
        "created_utc": 1731936576.0,
        "subreddit_name": "gadgets",
        "comments": 40
    },
    {
        "title": "This retro PC case from Silverstone is bringing the beige box back from the dead | The Silverstone FLP01 is a beige desktop case for a modern PC build. It takes an ATX motherboard and ships next year for around 130USD.",
        "score": 115,
        "url": "https://www.pcgamesn.com/silverstone/flp01-retro-case",
        "content": "",
        "created_utc": 1731941625.0,
        "subreddit_name": "gadgets",
        "comments": 57
    },
    {
        "title": "It might be time to say goodbye to Apple's lightning to 3.5mm jack adapter",
        "score": 0,
        "url": "https://www.engadget.com/audio/headphones/it-might-be-time-to-say-goodbye-to-apples-lightning-to-35mm-jack-adapter-133014701.html",
        "content": "",
        "created_utc": 1731943367.0,
        "subreddit_name": "gadgets",
        "comments": 10
    },
    {
        "title": "r/Stocks Daily Discussion Monday - Nov 18, 2024",
        "score": 16,
        "url": "https://www.reddit.com/r/stocks/comments/1gu1svl/rstocks_daily_discussion_monday_nov_18_2024/",
        "content": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1731925810.0,
        "subreddit_name": "stocks",
        "comments": 207
    },
    {
        "title": "Tax Loss Harvesting",
        "score": 11,
        "url": "https://www.reddit.com/r/stocks/comments/1gu75r0/tax_loss_harvesting/",
        "content": "Question regarding hedging with tax loss harvesting. What are the pros and cons of this strategy? What am I missing? \n\nSay I buy $50,000 worth of VOOG today. \n\nIf it drops 6% and I sell, causing a $3k loss, I get to write that off on my taxes. Then, I would immediately purchase $47,000 in QQQ to avoid wash. 6% is mild correction territory, not a huge collapse, so I’d expect it to go back up soon after purchasing the QQQ and then I’m back to where I started plus $3k in negative capital gains to help my tax situation. \n\nIf VOOG goes up, then I happily hold onto the shares and let them rise. ",
        "created_utc": 1731943362.0,
        "subreddit_name": "stocks",
        "comments": 20
    },
    {
        "title": "YOLO 0DTE until I’m retired.",
        "score": 123,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1guj31g/yolo_0dte_until_im_retired/",
        "content": "[Day trading SPY 0DTE is nerve wracking](https://imgur.com/a/lt6uFvz)\n\nI’m the same dude that turned $348 into $8,705 throughout the week after the election. See you regards at $1m.",
        "created_utc": 1731972972.0,
        "subreddit_name": "wallstreetbets",
        "comments": 111
    },
    {
        "title": "SPY CALLS",
        "score": 36,
        "url": "https://i.redd.it/02t702uxuo1e1.jpeg",
        "content": "So far so good 💪🏼",
        "created_utc": 1731948117.0,
        "subreddit_name": "wallstreetbets",
        "comments": 14
    },
    {
        "title": "Basic investing using webull ",
        "score": 3,
        "url": "https://www.reddit.com/r/investing/comments/1gu8op7/basic_investing_using_webull/",
        "content": "Hello! I’m 28 and just starting investing admittedly I should’ve have  5-6 years ago. \n\nI’m 100% debt free and live in Latin America as an American. I make around $6,000/month and live off of 2500 or so. \n\nMy goal is to put $40,000 or so (roughly 40% of my net worth) into the sp500 and then monthly recurring payments of 750 and just keep this up for a long time! 15+ years. \n\nI tried signing up for vanguard and supposedly because I’m abroad I need to print a void check and mail it to them and do that anytime I want to put $ in? Which seems really over the top and impossible to put in monthly payments as I’d  need  to travel to the USA to do this.\n\nWebull allows me to invest,so far I’ve just put $1,000 into the SPY sp500 ETF. \n\nAccording to friends and ChatGPT there’s not a whole lot of difference between investing in the sp500 using vanguard and investing in it via ETFs using the webull app. \n\nIs this accurate? \n\nThanks! ",
        "created_utc": 1731947218.0,
        "subreddit_name": "investing",
        "comments": 2
    },
    {
        "title": "Approaching my $100k milestone.",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1guaot9/approaching_my_100k_milestone/",
        "content": "23 y.o male making about $115k a year. I’ve been investing pretty aggressively, allocating about $2,700 into investments/savings a month. I’m lucky to still be living with my parent and don’t have any car payments yet. I should be on track to hit $100k networth within the next two months (currently @ $96k now) and I’m wondering if I should then start to introduce new things into my portfolio. Currently, my portfolio consists of:\nVOO\nQQQ\nVTSAX\n401k\nLife insurance\nHYSA\nIndividual Stocks (blue chips)\n\nAny recommendations would be appreciated, I’m learning as I go. Sooner than later I will be having to purchase a car, until then, I want to invest as aggressively as possible. Thanks in advance!\n\n",
        "created_utc": 1731952061.0,
        "subreddit_name": "investing",
        "comments": 41
    }
]