[
    {
        "title": "Which stock is hidding in plain sight?",
        "score": 610,
        "url": "https://www.reddit.com/r/stocks/comments/1fwa7mg/which_stock_is_hidding_in_plain_sight/",
        "content": "Coming out of the Great Financial Crisis, Apple was a stock that was criminally undervalued, despite being a massive brand already. Over the years, there weren’t any groundbreaking inventions (outside of expanding their services), yet the stock still managed to significantly outperform the market. Even Warren Buffett, who bought in later, snagged it at a great valuation.\n\nNow that the Fed seems to be normalizing rates and the economy has shown resilience, I’m thinking about which companies might be \"hiding in plain sight\" today.\n\nA lot of people are betting on AI related plays, with many pointing to TSMC and ASML as indirect winners. I get the logic, but I believe that, no matter how successful they become, these companies will still trade at lower valuations compared to their U.S. counterparts. Money just tends to flow into U.S. equities first and foremost.\n\nPersonally, I think Meta is the best positioned among the \"Magnificent 7.\" The TikTok threat has mostly passed, and it could even be a net positive for Meta not to be viewed as a monopoly anymore. Plus, I don’t think their AI and AR/VR investments are fully priced into the stock yet.\n\nAmazon is lagging the other mega caps in terms of valuation, but there’s still some uncertainty around how well Andy Jassy will perform in the long term.\n\nAny stocks you guys are eyeing? I’m particularly interested in established companies with consistent growth that still seem under represented.\n\n\ntldr: Apple was once undervalued despite being a massive brand, and I'm wondering which companies today are in a similar position. AI stocks like TSMC/ASML seem popular, but I think Meta is well positioned due to AI/AR investments not yet fully priced in. Amazon also lags but could be worth watching under new leadership. What are your hidden gems?",
        "created_utc": 1728076969.0,
        "subreddit_name": "stocks",
        "comments": 1093
    },
    {
        "title": "I really wish the new Camera Control button on iPhone 16 could act like a shoulder button on a games controller",
        "score": 1226,
        "url": "https://www.pockettactics.com/iphone-16-camera-control-trigger",
        "content": "",
        "created_utc": 1728039697.0,
        "subreddit_name": "apple",
        "comments": 108
    },
    {
        "title": "Report: Apple may have found its supplier for the thin iPhone 17 Air display [Novatek, for Touch Controller and Display Driver Integration]",
        "score": 929,
        "url": "https://9to5mac.com/2024/10/04/report-apple-may-have-found-its-supplier-for-the-thin-iphone-17-air-display/",
        "content": "",
        "created_utc": 1728062722.0,
        "subreddit_name": "apple",
        "comments": 193
    }
]