[
    {
        "title": "Elon Musk’s Ultimatum to Tesla Execs: Return to the Office or Get Out",
        "score": 4569,
        "url": "https://www.reddit.com/r/stocks/comments/v2rnyn/elon_musks_ultimatum_to_tesla_execs_return_to_the/",
        "content": "&#x200B;\n\nTesla Inc. Chief Executive Officer Elon Musk sent an email late Tuesday to “Everybody” at his electric-car company, “Everyone at Tesla is required to spend a minimum of 40 hours in the office per week,” Musk wrote in an email titled “To be super clear.”...Musk went on to write, “Moreover, the office must be where your actual colleagues are located, not some remote pseudo office. **If you don’t show up, we will assume you have resigned**.\" .....“The more senior you are, the more visible must be your presence,” .... “That is why I lived in the factory so much -- so that those on the line could see me working alongside them. If I had not done that, Tesla would long ago have gone bankrupt.”\n\nIn recent weeks, Musk has praised Tesla China employees in Shanghai for “burning the 3 am oil” while saying that Americans are “trying to avoid going to work at all.” \n\n[(see article for details)](https://www.bnnbloomberg.ca/musk-s-ultimatum-to-tesla-execs-return-to-the-office-or-get-out-1.1773091)\n\n&#x200B;\n\n&#x200B;\n\n\\*\\*  Here is a [link](https://twitter.com/elonmusk/status/1531867103854317568?) to Elon Musks tweet where he defended his email by saying;  \"they should pretend to work somewhere else\" \\*\\*\n\n&#x200B;\n\nHere is the full email as transcribed by [CNBC](https://www.cnbc.com/2022/06/01/elon-musk-reportedly-tells-tesla-workers-to-be-in-office-full-time-or-resign.html) ;\n\n\\---------------------------------------------------------------------------------------------\n\n*From: Elon Musk*\n\n*To: “Everybody”*\n\n*Tue. 5/31/2022 \\[time stamp redacted\\]*\n\n*Subj: To be super clear*\n\n&#x200B;\n\n*Everyone at Tesla is required to spend a minimum of forty hours in the office per week. Moreover, the office must be where your actual colleagues are located, not some remote pseudo-office.*\n\n*If you don’t show up, we will assume you have resigned.*\n\n*The more senior you are, the more visible must be your presence. That is why I lived in the factory so much- so that those on the line could see me working alongside them. If I had not done that, Tesla would long ago have gone bankrupt.*\n\n*There are of course companies that don’t require this, but when was the last time they shipped a great new product? It’s been a while.*\n\n*Tesla has and will create and actually manufacture the most exciting and meaningful products of any company on Earth. This will not happen by phoning it in.*\n\n*Thanks,*\n\n*Elon*\n\n\\--------------------------------------------------------------------------------------------------\n\n&#x200B;",
        "created_utc": 1654118137.0,
        "subreddit_name": "stocks",
        "comments": 1666
    },
    {
        "title": "JPMorgan Chase CEO Jamie Dimon says ‘brace yourself’ for an economic hurricane caused by the Fed",
        "score": 2956,
        "url": "https://www.reddit.com/r/stocks/comments/v2ijze/jpmorgan_chase_ceo_jamie_dimon_says_brace/",
        "content": "https://www.cnbc.com/2022/06/01/jamie-dimon-says-brace-yourself-for-an-economic-hurricane-caused-by-the-fed-and-ukraine-war.html\n\nJPMorgan Chase CEO Jamie Dimon says he is preparing the biggest U.S. bank for an economic hurricane on the horizon and advised investors to do the same. “You know, I said there’s storm clouds but I’m going to change it… it’s a hurricane,” Dimon said Wednesday at a financial conference in New York. While conditions seem “fine” at the moment, nobody knows if the hurricane is “a minor one or Superstorm Sandy,” he added. “You better brace yourself,” Dimon told the roomful of analysts and investors. “JPMorgan is bracing ourselves and we’re going to be very conservative with our balance sheet.“",
        "created_utc": 1654094485.0,
        "subreddit_name": "stocks",
        "comments": 533
    }
]