[
    {
        "title": "Roblox is insanely overpriced",
        "score": 6364,
        "url": "https://www.reddit.com/r/stocks/comments/m3c0lk/roblox_is_insanely_overpriced/",
        "content": "I know that no one likes a bear and furthermore people feel connected to this stock since their kids play the game or because it's a video game and it's fun to invest in that stuff but facts over feelings when dealing with money because it has no feelings. So first we have to base our value, the company raised 528 million$ from private sources last year at a valuation of 28 billion dollars. It later went public via direct listing at a base valuation of 32 billion with 40$ stock price only to rise to 77$ and a market cap of 40.56 billion. The problem with this is Microsoft bought Mojang (so essentially the Minecraft IP) for 2.5 billion  in late 2014 when they had 38 million in revenue which is relatively nothing compared to RBLX now but when we go back in time to just 2017 it (Rblx) had relatively only 45 million in revenue vs Minecraft's 350 million. Now let's go to last year when Minecraft had a monthly active user base of 130 million players vs Rblx's 150 million. It also had 953 million dollars in revenue but with 253 million in net losses. Now compare that to Minecraft who had a revenue of 415 million which is up significantly from  the previous years 375 million and it becomes clear that Roblox is very overvalued. Furthermore to show the point we have another Microsoft purchase, this time of Zenimax  Media inc for 7.5 billion $ for properties like TES, DOOM, Fallout, Dishonored, Starfield and many more with a wide variety of studios included like Bethesda, Zenimax, Tango, Arkane (Deathloop), Id and Machine Games . Just in that bundle Doom Eternal (1 game) had revenue of 350 million dollars and Skyrim with lifetime revue of over 620 million. The last showing of this is Sony's purchase of Insomniac in 2018 for 229 million dollars and since then have created 2 games that have raked in more than the initial investment with Spiderman 2018 and Spiderman MM having brought in approximately 250-270 million $ and with another game in the pipeline with Ratchet and Clank A rift in Time. Final note: EA's entire market cap which consists of Madden, Battlefield, Fifa ( yearly releases with micro transactions) and many other titles is at 30 billion, Take Two which owns GTA, Red Dead,  NBA 2K and many others and is valued at 20 billion, the thought that Roblox is worth almost more than both these titans combined is insane and nonsensical.\n\nEdit: **This is my opinion not advice.** To play devils advocate since a lot of people like the stock here you go: Roblox has doubled it's earnings every year since 2017 and had record revenue of almost 950 million this past year. It's player base is also massive and almost doubling every year just like it's revenue. It also has 830 million in the bank right now and can easily grow by going to Asia and or incorporating more adult themes. Now other than the fact that it's trading 40x P/S you have to bet that the game will both keep growing and making profits at the same pace as now which I don't see but here there u go.",
        "created_utc": 1615531758.0,
        "subreddit_name": "stocks",
        "comments": 1467
    },
    {
        "title": "Morning Update for Friday, 03/12/21",
        "score": 379,
        "url": "https://www.reddit.com/r/Daytrading/comments/m3ho3o/morning_update_for_friday_031221/",
        "content": "Good morning everyone, it’s Friday!\n\n*This list is geared towards day trading. With the small cap stocks especially, I am typically in and out very quickly, only occasionally longer than 5 minutes, usually faster scalps.* I am also constantly watching the candlestick charts and observing price action and volume, and you should be doing the same if you want to trade these stocks. Always have a plan when you enter a trade (for profit taking and for taking a loss), and use proper risk management.\n\n**Stocks Over $10**\n\n* Gapping UP: GME, BA, NVAX, ALT, AVEO, MVIS, KOSS, GOEV, CANG, DDD \n* Gapping DOWN: POSH, CHPT, MARA, RIOT, CAN, EYES, SUNW, TSLA, RIDE, NIO, MGNI\n\n**Stocks Under $10**\n\n1. NLSP: Gapping up on news catalyst. Seeing strong volume and price action at the moment, we'll see if that momentum holds up. \n2. CFRX: Gapping up after announcing a contract. Seeing good volume and price action in premarket. Also had a strong day of trading yesterday, so it could get extended today, just don't go chasing trades. \n3. CCRC: Gapping up on news of merger agreement. Seeing decent volume and price action in premarket. \n4. BHAT: Gapping up but couldn't find a catalyst. Found support at 1.60 in premarket, and seeing decent volume at the moment. \n5. SEEL: Gapping up after a raised price target. Seeing good volume and decent price action in premarket. Showing a bit of weakness at the moment, I'll want to see a revival before market open. \n6. ENTX: Gapping up on momentum from yesterday. Could get a bit over-extended today, so just stay disciplined and don't chase.  \n\nWe are looking at opening in the red this morning. After two strong days in a row, this isn't too surprising. SPY is trading a little above 392 at the moment, after hitting ATH yesterday. Bitcoin is pulling back a bit, and currently trading at 55,600. It will be interesting to see how long this pullback lasts, but I'll be following Bitcoin-related stocks closely. Gold and silver are also down at the moment, and oil is cooling off a bit. GME figures to see some volatility today, I'll be watching mostly for entertainment purposes. We could see some choppiness in the market after the two strong days we just saw. If we do, it's okay to step back and wait patiently. There's also nothing wrong with sitting the whole day out and not making trades, sometimes it happens for the better. If the market resumes its strength, then business as usual.\n\nRemember to use proper risk management, make sure you size appropriately for your account, and have a plan for every trade you enter. Happy trading everyone :)",
        "created_utc": 1615556153.0,
        "subreddit_name": "Daytrading",
        "comments": 95
    }
]