[
    {
        "title": "Musk lays off Tesla senior executives",
        "score": 2633,
        "url": "https://www.reddit.com/r/stocks/comments/1cgt3v8/musk_lays_off_tesla_senior_executives/",
        "content": "Elon Musk has dismissed two Tesla senior executives and plans to lay off hundreds more employees, frustrated by falling sales and the pace of job cuts so far, The Information reported on Tuesday, citing the CEO’s email to senior managers.\n\nRebecca Tinucci, senior director of the electric vehicle maker’s Supercharger business, and Daniel Ho, head of the new vehicles program, will leave on Tuesday morning, the report said.\n\nMusk also plans to dismiss everyone working for Tinucci and Ho, including the roughly 500 employees who work in the Supercharger group, The Information said. It was not clear how many employees worked for Ho.\n\nTesla’s public policy team, which was led by former executive Rohan Patel, will also be dissolved, the report said.\n\n“Hopefully these actions are making it clear that we need to be absolutely hard core about headcount and cost reduction,” Musk wrote in the email, the report said. “While some on exec staff are taking this seriously, most are not yet doing so.”\n\nTesla, which had 140,473 employees globally as of end-2023, did not immediately respond to a Reuters’ request for comment.\n\nHo joined Tesla in 2013 and was a program manager in the development of the Model S, the 3, and the Y before being put in charge of all new vehicles, while Tinucci joined in 2018 as a senior product manager, according to their LinkedIn profiles.\n\nTwo other senior leaders — Patel and battery development chief Drew Baglino — announced their departures earlier this month, when Tesla also ordered the layoffs of more than 10% of its workforce.\n\nTesla is grappling with falling sales and an intensifying price war, which led to its quarterly revenue falling for the first time since 2020, the company reported last week.\n\nMusk made progress towards rolling out Tesla’s advanced driver-assistance package in China, the epicenter of the EV price war, during a surprise visit to Beijing on Sunday.\n\nThat trip came just over a week after he scrapped a planned trip to India, where Tesla has long sought to start operations, due to “very heavy Tesla obligations.”\n\nSource: https://www.cnbc.com/2024/04/30/musk-lays-off-tesla-senior-executives-in-fresh-job-cuts-report.html",
        "created_utc": 1714484414.0,
        "subreddit_name": "stocks",
        "comments": 686
    },
    {
        "title": "Apple to unveil AI-enabled Safari with iOS 18 & macOS 15",
        "score": 1040,
        "url": "https://appleinsider.com/articles/24/04/30/apple-to-unveil-ai-enabled-safari-browser-alongside-new-operating-systems",
        "content": "",
        "created_utc": 1714491933.0,
        "subreddit_name": "apple",
        "comments": 270
    }
]