[
    {
        "title": "Yet another sealed 4GB original iPhone brings in over $100,000 at auction",
        "score": 1735,
        "url": "https://appleinsider.com/articles/24/03/25/yet-another-sealed-4gb-original-iphone-brings-in-over-100000-at-auction",
        "content": "",
        "created_utc": 1711413874.0,
        "subreddit_name": "apple",
        "comments": 192
    },
    {
        "title": "iPhone 16 Pro may introduce ‘Space Black’ and ‘Rose’ Titanium colors, \"Blue\" discontinued",
        "score": 968,
        "url": "https://9to5mac.com/2024/03/26/iphone-16-pro-space-black-rose/",
        "content": "",
        "created_utc": 1711447709.0,
        "subreddit_name": "apple",
        "comments": 311
    },
    {
        "title": "Apple’s Worldwide Developers Conference returns June 10, 2024",
        "score": 964,
        "url": "https://www.apple.com/newsroom/2024/03/apples-worldwide-developers-conference-returns-june-10-2024/",
        "content": "",
        "created_utc": 1711472719.0,
        "subreddit_name": "apple",
        "comments": 191
    },
    {
        "title": "For me, learning to trade has been a series of lightbulbs I turn on to get further down a dark hallway, rather than one switch I turn on that lights the whole building. Here's a lightbulb I turned on a couple years ago",
        "score": 134,
        "url": "https://www.reddit.com/r/Daytrading/comments/1bolss5/for_me_learning_to_trade_has_been_a_series_of/",
        "content": "I remember this so clearly now. This was the Summer before the infamous October low. We were just off the highs of the June Low of 2022. (The June low of 2022 was also a key moment of my trading career, I'll have to leave that one for a different day.) I could see in the charts that we were primed for a solid run up on $SPY.\n\n  \nBut still, there was so much to be bearish about. Interest rates were still going up in the Summer of 2022, inflation was still high, gas prices were still outrageous, and we were all still certain we were about to fall into a pit of depression at any moment both emotionally and economically. But still, like an enthusiastic elevator operator the charts were screaming at me \"Going up!\". It was at this point I learned to trust the trust and my ability to listen to what they were telling me. So, in an act of what was faith at the time, I bought the calls. \n\nOh, and did we ever go up! It was one of those exciting months where my swing trades just went further in the money and I was constantly rolling them, I was buying every dip in sight on an intraday basis. I rode the wave all the way from about $385 to $410.   \n\n\nThen I got scared. I started to say \"This isn't rational, we're in a bear market. The shorts have been reset. We have Jackson Hole coming up and JPOW is gonna hammer the market. There's still too much inflation he doesn't want the wealth effect!\"  \n\n\nI sold, right on the verge of making a killing I sold. Had I rolled those calls up one more time I would have had an opportunity to be a much wealthier man. But I sold. I watched SPY march all the way to nearly $430. Wow. I knew it was irrational. I knew it was dumb for the market to do that.   \n\n\nAfter some hurting, and after some soreness at not letting my winners run I had what I regard to be one of the most important lightbulb moments in my trading career. Jesse LIvermore once said \"A man has to have experience, and he must pay for it.\" Did I ever pay for it! Here's what the experience I paid for: **I'd rather bet on the market doing something more irrational than it already has than bet that the market will come to it's senses.** \n\n&#x200B;\n\n**Epilogue**  \nThere was some guy on /r/WallStreetBets who posted about $NVDA being a bubble somewhere around $250. He said something along the lines of \"What, so we're just going to buy this stock all the way up to $500?\" I responded back, \"Why not $500\"?\" He sarcastically said, \"How about $750?\" \"I said, why not a $1,000?\"   \n\n\nOnly difference between him and I is that he thought I was in on his joke. No. I knew that if there was any stock that was going to do something irrational in 2023 is was NVDA. I was free. Free of thinking about stocks rationally. Free of trying to apply logic and reason to something that is guided by ignorance, fear, greed and hope. I was, in a way, trying to lead him to the place that I'm in now.   \n\n\n&#x200B;",
        "created_utc": 1711493478.0,
        "subreddit_name": "DayTrading",
        "comments": 30
    },
    {
        "title": "Apple’s Worldwide Developers Conference returns June 10, 2024",
        "score": 7,
        "url": "https://www.stocktitan.net/news/AAPL/apple-s-worldwide-developers-conference-returns-june-10-qf4ttyolm3bz.html",
        "content": "",
        "created_utc": 1711472401.0,
        "subreddit_name": "AAPL",
        "comments": 1
    }
]