[
    {
        "title": "TSLA: Get ready to cash out from the largest ongoing pump and dump in history",
        "score": 2136,
        "url": "https://www.reddit.com/r/investing/comments/k3unr7/tsla_get_ready_to_cash_out_from_the_largest/",
        "content": "Ok, so TSLA will be included in S&P 500 in Dec 21. Old news. Around $100B(almost 1/5th of its market cap) of TSLA would need to be purchased(some active funds may have already purchased) based on current stock price.\n\nThe only reason I have been holding TSLA after it split is the whole S&P 500 inclusion thingy. After that, I don't know what will even move this stock. They freakin surpassed Berkshire and could surpass Facebook(for a short time)!!!\n\nToday they will announce whether to include TSLA in two sessions or in one session.\n\n[This is what happened when Yahoo was included(which is comparable to TSLA's inclusion as they have had relatively comparable size in comparison to S&P 500's size). Although I believe TSLA will rise again after some time, unlike Yahoo.](https://imgur.com/a/1qj22eR)\n\nAfter the trading sessions, expect a big dip. As a lot of speculators this year have bought into TSLA precisely to front-run the index investors.\n\nAlso, the trade date Dec. 18, coincides with a once-quarterly event known as quadruple witching, the Friday near the end of each calendar quarter on which options and futures on both indexes and stocks expire simultaneously. Volume is usually heavy on those days and would help boost liquidity on the day of Tesla’s inclusion, investors said. (this paragraph copied straight from wsj)\n\nSo, I guess don't be a fool(unless there are some tax implications, which I don't have); buy the rumour, sell the news. TSLA will completely tank after the inclusion.\n\nAlso, remember NIO etc kind of benefit from the TSLA hype, so be very careful you all about them.\n\nI don't think if you don't have any immediate tax implications, there wouldn't be much value holding TSLA for the longer term as there are better long term plays. And when or if TSLA reaches $700 or higher(I know I am very bullish, but that's why I am still holding it) there would be almost no point in holding it any longer.\n\nSome special points to remember:\n\n* TSLA already jumped 40% after its inclusion news broke out and had been steadily climbing before it due to rumour that it will be included in the index and Softbank's trade earlier this year.\n* TSLA can issue more shares, especially in this valuation. I mean why wouldn't they, lol.\n\nI know posts that say anything negative about TSLA gets downvoted but be careful about your TSLA shares or options!\n\nDisclaimer: I am long TSLA shares and call options. I am also long PLTR(long leaps too) and some other meme stocks which I am not mentioning cause my post gets removed somehow and I am not sure why(so you know I don't give a damn about valuations, although I am kind of an early mover, so all of them are at a very profitable position).",
        "created_utc": 1606738256.0,
        "subreddit_name": "investing",
        "comments": 775
    }
]