[
    {
        "title": "What company will be a household name in the next 5-10 years?",
        "score": 874,
        "url": "https://www.reddit.com/r/stocks/comments/1alxfe7/what_company_will_be_a_household_name_in_the_next/",
        "content": "If you bought stock in a company that is a household name before it was a household name, you made A LOT of money. Plain and simple. \n\nWhat company do you see being a household name in the next 5-10 years. I’m talking Apple, Microsoft, Google, Amazon, Netflix, Spotify, Meta, Tesla, McDonalds, Nike, Coke etc. you get the idea. \n\nI know this questions gets asked a lot but I want to stimulate your brains a bit before you answer:\n\nThe correct answer to this question will most likely be part of a cutting edge industry. It seems like that was the key to success for all the companies I listed. \n\nApple / Microsoft  - personal computer boom\n\nGoogle / Amazon / Netflix / Meta - personal computer applications boom\n\nTesla - EV vehicle boom\n\nMcDonald’s - chain food restraunt boom \n\nNike - branded clothing boom\n\nCoke - soft drink boom\n\nSo the question is simple, what is about to go BOOM and what company will be the spark to ignite the gunpowder?\n\nEDIT - So far my top candidates from people’s responses are: \n\nSOFI (SOFI), Celsius energy drinks (CELH), Rocket Labs (RKLB), Sweet Green (SG), E.L.F Cosmetics (ELF) and Cava (CAVA)",
        "created_utc": 1707403861.0,
        "subreddit_name": "stocks",
        "comments": 1396
    },
    {
        "title": "Google rebrands Bard AI to Gemini and launches a new app and subscription",
        "score": 513,
        "url": "https://www.reddit.com/r/stocks/comments/1alyebr/google_rebrands_bard_ai_to_gemini_and_launches_a/",
        "content": "Google on Thursday announced a major rebrand of Bard, its artificial intelligence chatbot and assistant, including a fresh app and subscription options. Bard, a chief competitor to OpenAI’s ChatGPT, is now called Gemini, the same name as the suite of AI models that power the chatbot.\n\nGoogle also announced new ways for consumers to access the AI tool: As of Thursday, Android users can download a new dedicated Android app for Gemini, and iPhone users can use Gemini within the Google app on iOS.\n\nGoogle’s rebrand and app offerings underline the company’s commitment to pursuing — and investing heavily in — AI assistants or agents, a term often used to describe tools ranging from chatbots to coding assistants and other productivity tools.\n\nAlphabet CEO Sundar Pichai highlighted the firm’s commitment to AI during the company’s Jan. 30 earnings call. Pichai said he eventually wants to offer an AI agent that can complete more and more tasks on a user’s behalf, including within Google Search, although he said there is “a lot of execution ahead.” Likewise, chief executives at tech giants from Microsoft to Amazon underlined their commitment to building AI agents as productivity tools.\n\nGoogle’s Gemini changes are a first step to “building a true AI assistant,” Sissie Hsiao, a vice president at Google and general manager for Google Assistant and Bard, told reporters on a call Wednesday.\n\nGoogle on Thursday also announced a new AI subscription option, for power users who want access to Gemini Ultra 1.0, Google’s most powerful AI model. Access costs $19.99 per month through Google One, the company’s paid storage offering. For existing Google One subscribers, that price includes the storage plans they may already be paying for. There’s also a two-month free trial available.\n\nThursday’s rollouts are available to users in more than 150 countries and territories, but they’re restricted to the English language for now. Google plans to expand language offerings to include Japanese and Korean soon, as well as other languages.\n\nThe Bard rebrand also affects Duet AI, Google’s former name for the “packaged AI agents” within Google Workspace and Google Cloud, which are designed to boost productivity and complete simple tasks for client companies including Wayfair, GE, Spotify and Pfizer. The tools will now be known as Gemini for Workspace and Gemini for Google Cloud.\n\nGoogle One subscribers who pay for the AI ​​subscription will also have access to Gemini’s assistant capabilities in Gmail, Docs, Sheets, Slides and Meet, executives told reporters Wednesday. Google hopes to incorporate more context into Gemini from users’ content in Gmail, Docs and Drive. For example, if you were responding to a long email thread, suggested responses would eventually take in context from both earlier messages in the thread and potentially relevant files in Google Drive.\n\nAs for the reason for the broad name change? Google’s Hsiao told reporters Wednesday that it’s about helping users understand that they’re interacting directly with the AI ​​models that underpin the chatbot.\n\n“Bard [was] the way to talk to our cutting-edge models, and Gemini is our cutting-edge models,” Hsiao said.\n\nEventually, AI agents could potentially schedule a group hangout by scanning everyone’s calendar to make sure there are no conflicts, book travel and activities, buy presents for loved ones or perform a specific job function such as outbound sales. Currently, though, the tools, including Gemini, are largely limited to tasks such as summarizing, generating to-do lists or helping to write code.\n\n“We will again use generative AI there, particularly with our most advanced models and Bard,” Pichai said on the Jan. 30 earnings call, speaking about Google Assistant and Search. That “allows us to act more like an agent over time, if I were to think about the future and maybe go beyond answers and follow-through for users even more.”\n\nSource: www.cnbc.com/2024/02/08/google-gemini-ai-launches-in-new-app-subscription.html",
        "created_utc": 1707406479.0,
        "subreddit_name": "stocks",
        "comments": 141
    },
    {
        "title": "Bloomberg - Arm CEO Says AI Boom Just Beginning After Record-Setting Rally, \"AI is not in any way, shape or form a hype cycle.\"",
        "score": 422,
        "url": "https://www.reddit.com/r/stocks/comments/1am61h3/bloomberg_arm_ceo_says_ai_boom_just_beginning/",
        "content": "https://finance.yahoo.com/news/arm-soars-expansion-markets-buoys-211305491.html\n\nArm Holdings Plc shares surged as much as 64% on Thursday after artificial intelligence spending helped bolster the chip designer’s forecast. And the company’s chief executive officer said the remarkable opportunity presented by AI is still in its early stages.\n\n**“AI is not in any way, shape or form a hype cycle,” Rene Haas said in an interview on Bloomberg Television. “We believe that AI is the most profound opportunity in our lifetimes, and we’re only at the beginning.”**\n\nThe remarks followed a blockbuster earnings report Thursday, when Arm projected revenue of $850 million to $900 million for the March quarter. That far surpassed analysts’ projections of $778 million. Earnings will be roughly 30 cents, excluding some items, well ahead of Wall Street’s 21-cent estimate.\n\nArm’s technology is going into an ever-widening array of products, from phones to cars to appliances. The scramble to add AI technology promises to accelerate that expansion, Haas said. In some cases, electronics makers don’t yet know how they’ll fully harness AI — they just want to make sure they have enough computing capacity to handle whatever is coming.\n\nArm once concentrated on technology for smartphones, but now that market accounts for about a third of sales. Phones today also contain more of the company’s technology per device, helping lift the royalties that manufacturers pay to Arm.\n\n“This is the result of strategies that were put in place a number of years ago that are coming to fruition,” Haas said in the interview. “A lot of folks didn’t really understand the company well and where we fit in: But we’re in a Tesla vehicle, a Ford F-150, we are in a smart camera, a Samsung TV, the smart appliances.”\n\nArm’s bullish outlook, delivered late Wednesday, helped send the shares on their biggest intraday rally since an initial public offering last September. The stock traded as high as $126.59, adding tens of billions of dollars to Arm’s market valuation.\n\nAnother tailwind: The company’s customers are shifting to a new version of its technology called V9, which carries twice the royalty rate of its predecessors. They’re also using more Arm computing cores per device — more than 100 in Microsoft Corp.’s new server chips, for example — which amplifies royalties. Arm is also gaining market share from rival technology in the data-center and automotive markets, executives said.\n\nArm now expects sales of $3.16 billion to $3.21 billion in fiscal 2024, which runs through March. That’s up from a previous range that topped out at $3.08 billion.\n\nRevenue grew 14% to $824 million in the fiscal third quarter. Excluding some items, profit was 29 cents a share. Wall Street had predicted revenue of $760 million and earnings of 25 cents a share.\n\nArm’s joint venture in China was a “nice positive surprise” as well, according to Chief Financial Officer Jason Child. It contributed 25% of total revenue.\n\nArm has an unusual role in the semiconductor industry. It licenses the fundamental set of instructions that software uses to communicate with chips. The company also provides so-called design blocks that companies such as Qualcomm Inc. use to build their products.\n\nUnder Haas, Arm has been moving toward providing more complete layouts that can be taken directly to the manufacturing stage. That shift makes it more useful to some customers, such as cloud computing companies like Amazon.com Inc., but also more of a rival to some traditional clients, like Qualcomm.\n\nCambridge, England-based Arm is still 90%-owned by SoftBank Group Corp., which acquired the business in 2016 for $32 billion. An IPO in 2023 raised $4.9 billion, marking the biggest debut on a US exchange in 2023.\n\n\nArm’s licensing sales rose 18% to $354 million last quarter, and royalty revenue gained 11% to $470 million.\n\nArm’s customer list spans the technology industry. Apple Inc. uses its instruction set for the processors that power the iPhone and Mac computers. Amazon relies on Arm designs for its Graviton server processors for data centers. And Qualcomm and MediaTek Inc. are major users of Arm’s blueprints for smartphone processors.",
        "created_utc": 1707425811.0,
        "subreddit_name": "stocks",
        "comments": 137
    },
    {
        "title": "$APPL Vision Pro letting me short $BA from 30k feet in the sky",
        "score": 7459,
        "url": "https://v.redd.it/uuz3jjrhw9hc1",
        "content": "Gonna end up shorting Apple.  Cannot wear the Vision Pro for more than an hour without it smushing my head into a migraine.",
        "created_utc": 1707359562.0,
        "subreddit_name": "wallstreetbets",
        "comments": 539
    },
    {
        "title": "How to move to index investing when I'm sitting on enormous gains in cash account?",
        "score": 33,
        "url": "https://www.reddit.com/r/investing/comments/1am5ecm/how_to_move_to_index_investing_when_im_sitting_on/",
        "content": "About half my portfolio has ended up, not intentionally, concentrated into three stocks, where I have a 2000%+ gain (AAPL) and two 800%+ gains, respectively.  Unfortunately, these are all in my cash accounts, where I took larger risks in the years after the GFC.  If I sell all that in order to buy SPY, I'm looking at more than $300K in capital gains taxes, which would nullify any incremental benefit of being an index investor vs. a stock-picker (at least, based on how closely my performance has been vs. the S&P).  What to do? ",
        "created_utc": 1707424171.0,
        "subreddit_name": "investing",
        "comments": 66
    },
    {
        "title": "Apple Vision Pro Owners Are Struggling to Figure Out What They Just Bought",
        "score": 5913,
        "url": "https://nymag.com/intelligencer/article/apple-vision-pro-owners-are-wondering-what-they-bought.html",
        "content": "",
        "created_utc": 1707424157.0,
        "subreddit_name": "technology",
        "comments": 1360
    },
    {
        "title": "Apple employees who worked for the Vision Pro get a nice gift",
        "score": 2720,
        "url": "https://twitter.com/kaubin/status/1755312748760629684",
        "content": "",
        "created_utc": 1707351035.0,
        "subreddit_name": "apple",
        "comments": 467
    },
    {
        "title": "Don't try to sneak an Apple Vision Pro into Germany, the import cops will nab you",
        "score": 1379,
        "url": "https://appleinsider.com/articles/24/02/08/berlin-customs-officers-confiscate-apple-vision-pro?utm_medium=rss",
        "content": "",
        "created_utc": 1707416807.0,
        "subreddit_name": "apple",
        "comments": 473
    },
    {
        "title": "Apple moves away from iTunes on PC with new Windows apps | Apple Music, Apple TV, and Apple Devices are all designed to replace iTunes on Windows.",
        "score": 1252,
        "url": "https://www.theverge.com/2024/2/8/24065866/apple-windows-apps-music-tv-devices-itunes",
        "content": "",
        "created_utc": 1707399299.0,
        "subreddit_name": "apple",
        "comments": 255
    },
    {
        "title": "Fake LastPass password manager spotted on Apple’s App Store",
        "score": 973,
        "url": "https://www.bleepingcomputer.com/news/security/fake-lastpass-password-manager-spotted-on-apples-app-store/",
        "content": "",
        "created_utc": 1707419927.0,
        "subreddit_name": "apple",
        "comments": 244
    }
]