[
    {
        "title": "Musk now says it's 'pointless' to build a $25,000 Tesla for human drivers",
        "score": 754,
        "url": "https://www.reddit.com/r/stocks/comments/1gk7fz6/musk_now_says_its_pointless_to_build_a_25000/",
        "content": "So, will there be any new car model for Tesla in 2025???\n\n&#x200B;\n\n**Musk now says it's 'pointless' to build a $25,000 Tesla for human drivers**\r  \n[https://www.reuters.com/business/autos-transportation/musk-now-says-its-pointless-build-25000-tesla-human-drivers-2024-11-05](https://www.reuters.com/business/autos-transportation/musk-now-says-its-pointless-build-25000-tesla-human-drivers-2024-11-05)\n\n&#x200B;\n\n*When Reuters reported in April that Tesla had scrapped plans for a long-promised, next-generation $25,000 electric vehicle, the automaker’s stock plunged. Chief Executive Elon Musk rushed to respond on X, his social-media network.*\r  \n*“Reuters is lying,” he posted, without elaborating. Tesla’s stock recovered some of its losses.*\r  \n*Six months later, Musk appears to have backed into an admission that Tesla dropped its plans for a human-driven $25,000 car. He said in an Oct. 23 earnings call that building the affordable EV would be \"pointless” unless the car was fully autonomous.*\r  \n*His latest remarks came in response to an investor asking: “When can we expect Tesla to give us the $25,000 non-robotaxi regular car model?”*\r  \n*Musk responded: “We’re not making a non-robo…,” before he was interrupted by another Tesla executive. Musk later added: “Basically, I think having a regular $25K model is pointless. It would be silly.”*\r  \n*The April 5 Reuters article reported that Tesla had abandoned plans for an all-new, affordable mass-market EV but still planned a self-driving robotaxi. Since then, Musk has increasingly touted plans for robotaxis and autonomous vehicles.*\r  \n*Tesla and Musk did not respond to requests for comment for this story.*\r  \n*On the October earnings call, Musk said that Tesla does plan a “$25K car” – its “Cybercab,” a two-door, two-seat, fully autonomous vehicle. Musk unveiled a prototype at a Hollywood-style event on Oct. 10.*\r  \n*Musk says Tesla will start production of the Cybercab in 2026, after it deploys fully autonomous versions of its current Model 3 and Model Y vehicles in Texas and California next year. The automaker faces steep technological, regulatory and legal challenges in delivering on Musk’s latest promises of fully autonomous vehicles, which echo others dating back about a decade.*\r  \n*An all-new affordable Tesla for human drivers had until recently been a linchpin of Tesla’s strategy to become the world’s biggest automaker. For several years, Tesla had a goal of producing 20 million vehicles a year by 2030, more than tenfold what it sells now and nearly double that of Toyota, the current global sales leader. In May, Tesla dropped the 20-million goal from its latest “impact report” on progress toward sustainability goals.*\r  \n*As recently as January of this year, Musk confirmed the plan for an all-new affordable EV in an earnings call. He said the next-generation vehicle would arrive in 2025 and launch a second major \"growth wave,” following the first wave with the release of its Model 3 and Model Y vehicles in 2017 and 2020, respectively.*\r  \n*Investors and Tesla fans commonly called the anticipated cheap car a “Model 2,” slotting in below the Model 3, currently the least-expensive Tesla, starting at $42,490.*\r  \n*In January, Musk described the all-new model as requiring “new revolutionary manufacturing technology.” But in April, after Reuters reported Tesla had scrapped the Model 2, Musk outlined a plan for “more affordable” models that could be produced “on the same manufacturing lines” as current Teslas.*\r  \n*Seth Goldstein, a Morningstar Research Services analyst, said he believes these less-expensive vehicles will be built on current Tesla platforms and priced in the mid-$30,000s.*\r  \n*“It was my understanding that the original plan was to make the more-affordable vehicle on a new platform,” he told Reuters. “I think Tesla realized they were late to making an affordable vehicle versus their Chinese-EV peers … So, they changed their strategy rather than make a large investment to produce a new vehicle.”*\r  \n*After the April 5 Reuters report that Tesla had killed the Model 2, Musk posted that day on X saying Tesla planned a “robotaxi unveil” in August. The event, delayed until October and held on a movie set near Los Angeles, underwhelmed Wall Street and drove a 9% drop in Tesla shares the following day.*\r  \n*Some investors viewed Musk’s comments on the Cybercab – along with displays of an autonomous “Robovan” concept and humanoid robots – as short on concrete details about the products. Tesla hasn’t said whether the Cybercab will feature new self-driving technology beyond the company’s “Full Self-Driving” feature in its current vehicles. Its existing models can’t fully drive themselves and require a human driver paying strict attention.*\r  \n*The target market for the Cybercab isn’t clear. The Cybercab’s sports-car looks and two-door, two-seat configuration – a nearly extinct layout in the wider U.S. auto market – puzzled some analysts who expected a robotaxi with more room for passengers and luggage.*\r  \n*Musk, in the October earnings call, said the concept vehicle’s design was “optimized for autonomy” and would also deliver affordability.*\r  \n*“It will cost … roughly 25K, so it is a 25K car,” Musk said. “It just won't have a steering wheel and pedals.”*",
        "created_utc": 1730815541.0,
        "subreddit_name": "stocks",
        "comments": 382
    },
    {
        "title": "Which Earning Reports Have Impressed You?",
        "score": 137,
        "url": "https://www.reddit.com/r/stocks/comments/1gk38ce/which_earning_reports_have_impressed_you/",
        "content": "For quick example, Google crushed it, TSM crushed it, PLTR crushed it, META crushed it, RDDT crushed it.\n\nWhat are some favorites you're watching which have had great ER reports so far this season? What did you like? Maybe lesser known companies which beat and did well?",
        "created_utc": 1730800597.0,
        "subreddit_name": "stocks",
        "comments": 106
    },
    {
        "title": "Does anyone have an inverse Reddit portfolio?",
        "score": 116,
        "url": "https://www.reddit.com/r/stocks/comments/1gkbnqg/does_anyone_have_an_inverse_reddit_portfolio/",
        "content": "Ever since Reddit’s emotional hive mind thought META was going to $0, I’ve learned it’s usually good to bet against it. What stocks have given you the most success that Reddit hates for emotional reasons?",
        "created_utc": 1730826505.0,
        "subreddit_name": "stocks",
        "comments": 86
    },
    {
        "title": "Super Micro Computer- SMCI $26 - Avoid Till We Get Restated Financials",
        "score": 94,
        "url": "https://www.reddit.com/r/stocks/comments/1gkgqx3/super_micro_computer_smci_26_avoid_till_we_get/",
        "content": "**I think Super Micro Computer, (SMCI) should be avoided for the following reasons:**\n\n**Restatements could alter the financials significantly:** The odds are high that the company will end up restating past financials. The Auditor’s resignation, its CEO’s pay package, and its past settlement with the SEC in 2018 all suggest that SMCI will have to restate its financial statements.\n\n**No 10K:** SMCI has delayed its annual 10-K filing and without an audited 10K, we have precious little faith in the numbers. \n\n**SMCI has priors:** This was not their first time. In 2018, the company settled charges with the [SEC for improper accounting](https://www.sec.gov/newsroom/press-releases/2020-190). As stated in the article from the SEC website….\n\n>\n\n**Tainted:** To me the alleged malfeasance creates significant doubts for investors that will not go away for a while, and it's very likely that Wall Street will not touch it, fearing liability for not doing enough due diligence. Also, I can’t imagine SMCI getting a decent multiple in the future for the same reasons until faith is restored in management and its books.\n\n**Possible Loan Default:**  There is a significant risk of Super Micro defaulting on the company's Term Loan Agreement with Bank of America. \n\n**Compensation tied to aggressive revenue targets**: The CEO’s unusual compensation package, with virtually no base salary and bonuses tied to very aggressive revenue and share price targets, is a dangerous and potentially abusive practice.\n\n**Possible delisting from the Nasdaq, and getting thrown out of the S&P 500**: The chances of both are high as a new auditor needs to be found, and a substantial amount of restatement work needs to be done.\n\n**A great business:** Sure, SMCI has a great server liquid cooling business, which has tremendous potential and demand for server racks for AI GPUs, right now and for the foreseeable future. However, as we saw Nvidia has already started shifting this business.\n\n**Ignore the low valuation:** I’m going to ignore the current low valuation of 8x earnings and 0.5x sales, which are much lower than competitors such as Dell (DELL) and Oracle (ORCL), simply because I have no idea what the restated financials will look like, and the valuation could be a lot different\n\nThe only way I would invest is the possibility of a merger/acquisition/White Knight, that will keep the stock afloat. The CEO owns close to 10% of the company so I doubt if he would let this go without a fight.\n\nThe other problem I foresee is the difficulty of getting good and timely information. For the most part, we rely on analysts who expect a proper set of books. Instead of focusing on the fundamentals, we’ll be spending far too much time, and worse without success trying to figure out what is genuine or not, It would make better sense to invest in other GPU/semiconductor businesses. ",
        "created_utc": 1730839261.0,
        "subreddit_name": "stocks",
        "comments": 50
    },
    {
        "title": "Do I sell my stock and dump the money into ETFs like VOO and VIG?",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gk9vg0/do_i_sell_my_stock_and_dump_the_money_into_etfs/",
        "content": "My YTD return on my portfolio is currently 12.6% compared to VOO at 21.81% or VIG at 15.79%. I am a long-term investor and my thesis for each stock still holds strong, but I am certainly drawn to the higher returns and diversification in ETFs. Should I maintain my current holdings and continue to dump future money into ETFs or just sell now, and put all of the money into ETFs? Some of my stocks include NVIDIA, Delta, Disney, Amazon, American Express, Capital One, HCA, and others to list a few. ",
        "created_utc": 1730822017.0,
        "subreddit_name": "stocks",
        "comments": 33
    }
]