[
    {
        "title": "Blackberry: Bear Case",
        "score": 1495,
        "url": "https://www.reddit.com/r/stocks/comments/lmcvkk/blackberry_bear_case/",
        "content": "The more in look into Blackberry and Connected Cars and Unified Endpoint Management the ***more bullish I get on BB***, on top of that Reddit is filled with CONSTANT confirmation bias. To ground myself I wrote a bear case, please help me add to it, ***the stronger we can make the bear case, the more clear we will see the potential opportunity*****.** \n\n# Macro: \n\nIvy will not be released till 2023, developers are not expected to get access till 2022 **Far too early to expect Ivy to benefit BB’s bottom line.** Without it, stock price will not moon.\n\n**Collaboration/partnerships** with 3rd parties (AWS, Biadu, IBM, Hyundai via Motional, Microsoft (crisis management/Microsoft Teams)) to develop technologies, products and services  **may not result in ROI**\n\nSome OEMS and tier 1 customer have accelerated **internal development of embedded solutions** could result in fewer customer orders, loss of market share, pressure to reduce prices, etc\n\nCOVID-19 Impact, Chip storage hitting the automobile sector resulting in revenue decrease of 16% in Q3 FY21, **could continue into the future**\n\n**Market is highly competitive**:  IBM, Microsoft, VMware, Mobile Iron, CrowdStrike to name a few\n\nTechnology landscape: **evolving customer requirements, high frequency of product introductions by competitors** could leave BB behind\n\nMaintaining key personal: success is dependent on ability to develop/retain skilled employees (executive team, R&amp;D team, experience sales people with specialized knowledge). Competition is intense, has resulted in **solicitation** resulting in higher compensation costs not offset by higher prices\n\nChanges in endpoints, operating systems and applications, security threats and industry standards \n\nMust obtain/maintain certain product approvals and certifications from government bodies and regulated enterprise customers, although BB is already ISO26262 certified (auto industry)\n\nBBs software runs on \\*3rd party operating systems\\* (Apple, Google, Microsoft, OEM op systems). **Updates to these op system with limited notice can disrupt operations**, forcing company to divert resources from preexisting product roadmap to accommodate changes \n\nMeeting debenture covenants\n\n# Financials\n\nRevenues have stalled, **growth is challenged** based on current financials\n\n**BB** (4%) **trails the average revenue when compared to competitors** **in each space** in Enterprise Software (5%) , Licensing &amp; IP (10%), Cybersecurity (10%), Canadian Enterprise Software (9%) per TD Securities equity research\n\nNormalized operating expenses have fluctuated although below average for last 8 qtrs\n\n**Hasn’t reported a profitable qtr since Q4 FY19** (Feb 2019)\n\nLet me know if I missed anything.\n\nCurrently holding ~400 shares @ $12, I started buying last week, before WSB happened\n\n**Edit**\nNew points added from the discussion below and my observation..\n \n**Perception: Many retail investors still consider BB a smartphone maker**, John Chen and the BB marketing team need to rebrand to change this perception. Other than their PR releases and twitter, I don’t see much else..i could be wrong..  **Although BB deals with B2B not B2C**, specifically they are niche with OEMs, governments, banks and healthcare.  One could argue no marketing is needed as a result, the security industry is well aware of the best products.\n \nWSBs: I’ve been active in the BB community for 2 weeks now, and **ALOT of people are bag holding, ALOT, which is why I believe your seeing so many pumps**, granted BB has been killing it with their constant updates with partnerships..not sure what came first but someone had posted a chart showing the correlation between BB, GME, AMC, and they are moving in sync!\n \nBB Cylance (AI and machine learning-based cybersecurity solutions) **was trending down from 20% of revenue in FY20 Q1 to 10% by the end of the FY.  Since then, BB stopped breaking out revenue between IoT and Cylance and now present it as one (Software &amp; Service)**",
        "created_utc": 1613619839.0,
        "subreddit_name": "stocks",
        "comments": 220
    }
]