[
    {
        "title": "Introducing Apollo, a brand new Reddit experience for iOS. Gorgeous, iOS centric design, an incredible Media Viewer, fully customizable gestures, a full Markdown editor, and sculpted by thousands of Redditors.",
        "score": 18752,
        "url": "https://www.reddit.com/r/apple/comments/787rtu/introducing_apollo_a_brand_new_reddit_experience/",
        "content": "Hey!\n\nFor the last almost three years, I've been developing a brand new Reddit app for iOS called Apollo. I used to work at Apple, and since then I took what I learned and built Apollo from the ground up to look and feel like a gorgeous Reddit experience that is distinctly iOS, following the design guidelines Apple put forth, to almost envision what Reddit would look like if Apple themselves built a Reddit app, with all the power, speed and flexibility you could possibly want.\n\n**Download link:** https://itunes.apple.com/app/apollo-reddit-client/id979274575?mt=8\n\n**Trailer:** https://www.youtube.com/watch?v=MKbPZVDg-Z8\n\nI [posted](https://www.reddit.com/r/apple/comments/2u86mj/announcing_apollo_a_brand_new_gorgeous_reddit_app/) a few years back, and literally thousands of awesome Redditors joined the beta program to help sculpt the best Reddit experience possible and form Apollo into what it is today. So much of the feedback fundamentally transformed Apollo beyond what I could have done or foreseen myself.\n\nIt's available for download for free, and I'd love for you all to check it out if you have the chance (and send me feedback over in r/ApolloApp if you have any!). Fundamentally, I focused on giving it a gorgeous iOS design, with a really powerful Media Viewer, incredible comments experince, a full Markdown editor, fully customizable gestures, and so much more. It's insanely powerful, while also maintaining a really clean, simple design.\n\nAgain, your feedback would be monumental. This is just the beginning for Apollo, and really hope I can keep building onto it for a long time coming with even more incredible features.\n\n### Questions\n\n##### Why build it? There's already Reddit apps.\nWhile there are some nice ones, nothing exactly scratched my itch as to what a Reddit client could really achieve on iOS. Alien Blue came close, but still had a UI that especially once iOS 7 launched felt outdated and somewhat out of place on iOS. Android also has some really great clients, but I just think the experience on iOS has been lacking and is due for something to really show what Reddit on iOS can be. I built Apollo with the goal of not just being the best Reddit experience on iOS, but the best Reddit experience *period*.\n\n##### What's wrong with the official Reddit app?\nNothing, if you're happy, great! Reddit has a lot of really smart people on it. For me, however, I'm not a fan of how they're trying to get one central look across iOS and Android, I really think an iOS app should look and feel like an iOS app, and an Android app should respect Material Design. I think designing for the middle results in a clunky experience where the potential of both platforms is never realized to the fullest. Apollo is an iOS app period, built to take advantage of iOS features and feel like a beautiful, familiar iOS app. I also think they discontinued Alien Blue without incorporating the best parts of it that people loved the most, such as the minimal, uncluttered UI (Alien Blue was much more compact and concise), as well as powerful features like swipe to collapse comments, full screen, inline previews for links in comments, etc. Apollo has all that and more, because I think it's essential part of browsing on iOS.\n\n##### I'm still using Alien Blue, why use Apollo?\nI can say without question Alien Blue was an incredible app, I loved it. But it's very clearly not being taken care of anymore. If you plan to get an iPhone X, it won't even display properly and will have black bars at the top. For everyone else, it's simply not getting updates or being maintained properly, and it's obviously got worse and worse. Imgur links don't work that well anymore, Reddit's own content links certainly don't, more and more things are stopping loading. Lots of new features of Reddit are missing (and even some old goodies, like multireddits) too. I really built Apollo with the power of Alien Blue in mind, I think if you're a fan of Alien Blue you'll feel right at home in Apollo.\n\n##### It's free? How do you make money/expect it to survive?\nI more or less just copied how Alien Blue did it, where it's free to download and use forever (with no ads), and you can unlock a \"Pro\" version in the app for $2.99 that unlocks some extra features like submitting posts (same as Alien Blue did), automatic dark mode, customizing gestures, customizing the app icon, and a bunch more. I mean, I'd love to give out everything for free, but I can't afford to compete with a billion dollar company like Reddit. I'm just one guy in an apartment with an awesome girlfriend and [two cute cats](https://i.imgur.com/7dKJs2n.jpg), and obviously need some form of revenue in the app to sustain me being able to build the app at all and give it a healthy future. Choosing *which* features to include in Pro is obviously hard, but I thought Alien Blue [set a good standard](https://www.reddit.com/r/AlienBlue/comments/1i2fe4/im_trying_to_convince_a_friend_to_get_pro/) with its unlockable features, which allowed it to have a healthy, long-ish life. I hope that's understandable, I just really want to be able to keep building onto this app for a long time coming.\n\n##### Does it have ads?\nNo, no ads anywhere.\n\n##### iPad app?\nYep, it's a universal app! I have awesome plans to really bring it further and to the next level on iPads as well.\n\n##### Available everywhere?\nYes! International, baby!\n\n##### What are your plans for Apollo for the future?\nA lot. :) I have a ton of things I want to build for Apollo, from an even better, super-powered iPad app, to even more powerful content filtering, more moderator features, full comment search, etc. My plan is to have users vote on which features they want to see the most, and I'll work on those, so it'll become even more of a Reddit app for Redditors, by Redditors.\n\nIf you have any more I'm more than happy to answer them! I'll be at my keyboard all day until I've answered everything or my wrists fall off. EDIT: Oh boy, you all are hard to keep up with. I will answer every question though if it takes me weeks!\n\n**Download link**: https://itunes.apple.com/app/apollo-reddit-client/id979274575?mt=8 \n\n**Trailer:** https://www.youtube.com/watch?v=MKbPZVDg-Z8\n\n**More Info:** https://apolloapp.io\n\n— Christian",
        "created_utc": 1508765986.0,
        "subreddit_name": "apple",
        "comments": 4519
    }
]