[
    {
        "title": "AMC says it will accept bitcoin as payment for movie tickets by year-end",
        "score": 4413,
        "url": "https://www.reddit.com/r/stocks/comments/p1fylf/amc_says_it_will_accept_bitcoin_as_payment_for/",
        "content": "AMC Entertainment mentioned Monday it will begin accepting bitcoin as payment for movie tickets and concessions if bought on-line in any respect of its U.S. theaters. \n\nCEO Adam Aron mentioned throughout an earnings name Monday that the movie theater chain will have the IT methods in place to take the cryptocurrency as payment by the tip of 2021.\n\nThe transfer marks a wedding of two extremely speculative property — bitcoin, identified for its wild volatility, and AMC, which turned a meme inventory star favored by retail merchants on Reddit’s notorious WallStreetBets discussion board.\n\nThe value of bitcoin swung drastically in latest weeks, final buying and selling round $46,000 after falling under $30,000 final month. The latest rebound got here amid optimism {that a} cryptocurrency compromise will be included as a part of the bipartisan infrastructure bundle. The Senate finally didn’t advance the deal.\n\nTesla had introduced plans to allow bitcoin transactions, however it halted automotive purchases with the digital token in mid-Could as a consequence of considerations over how mining contributes to local weather change. CEO Elon Musk has since commented positively on bitcoin, saying he plans to carry the coin long run.\n\nShares of AMC climbed greater than 4% in prolonged buying and selling on Monday following a better-than-feared earnings report. The corporate posted a narrower-than-expected loss throughout the second quarter, together with income that topped analysts’ estimates.\n\nThe inventory has rallied practically 1,500% this 12 months as a band of retail merchants who coordinated trades on social media platforms managed to create a large brief squeeze within the shares. The struggling movie theater was a preferred brief goal amongst hedge funds and different gamers.",
        "created_utc": 1628561695.0,
        "subreddit_name": "stocks",
        "comments": 743
    },
    {
        "title": "Apple iCar!!",
        "score": 19,
        "url": "https://appleinsider.com/articles/21/08/09/apple-reportedly-in-talks-with-korea-ev-component-makers-for-apple-car",
        "content": "",
        "created_utc": 1628561881.0,
        "subreddit_name": "AAPL",
        "comments": 8
    },
    {
        "title": "Apple 'in talks' with Korean car component makers",
        "score": 12,
        "url": "https://www.macworld.co.uk/news/apple-korean-car-manufacturers-3807323/",
        "content": "",
        "created_utc": 1628606438.0,
        "subreddit_name": "AAPL",
        "comments": 1
    }
]