[
    {
        "title": "Sony cuts PlayStation 5 sales forecast to 21 million units after posting record revenue",
        "score": 466,
        "url": "https://www.reddit.com/r/stocks/comments/1aqlc02/sony_cuts_playstation_5_sales_forecast_to_21/",
        "content": "Sony cut its sales forecast for its flagship PlayStation 5 console on Wednesday, after warning of weaker transactions in its key gaming division.\n\nThe Japanese gaming giant said it now expects to sell 21 million units of the PS5 in the fiscal year ending March, down from a previous forecast of 25 million units.\n\nThe cut in outlook comes after Sony posted record quarterly revenue in the all-important December quarter which encompasses the holiday season. Sony sold 8.2 million units of its flagship PlayStation 5 console in its fiscal third quarter, which runs from October to December. Sony has sold 16.4 million PS5 units so far in its fiscal year.\n\nSony also trimmed its fiscal year sales forecast for the gaming division by 210 billion yen to 4.15 trillion yen, saying it expects a decrease in sales of hardware.\n\nThe company’s challenge now lies in trying to keep up momentum for the PS5, which was released more than three years ago. In October, Sony made available a refreshed version of the console with better specs.\n\nRival Nintendo has been grappling with a similar issue, managing to keep interest in its near seven-year old Switch console thanks to new game releases and movies associated with its famous characters, like Super Mario.\n\nSales at Sony’s gaming business rose 16% year-on-year to 1.4 trillion yen in the December quarter, the company said on Wednesday. However, operating profit fell 26% in the division, due to increase losses from hardware due to promotions in the period as well as a decline in sales of first-party games.\n\nSony also lowered its sales forecast for the entire company to 12.3 trillion yen from 12.4 trillion yen for the fiscal year.\n\nSony beat analyst expectations by a wide margin in its fiscal third quarter when it reported results on Wednesday.\n\nHere’s how Sony did in the December quarter versus LSEG consensus estimates:\n\nRevenue: 3.75 trillion Japanese yen ($24.9 billion) versus 3.58 trillion yen expected\n\nOperating profit: 463.3 billion yen versus 428.4 billion yen expected\n\nSony said that it will partially spin off its financial services business via a public listing. The company plans to distribute slightly more than 80% of its shares of Sony Financial Group through dividends in kind as a result of the spinoff, in a listing due to take place in October 2025.\n\nSony’s financial services unit saw revenue in the December quarter rise more than 1,100% to 311.7 billion yen. The company said this was thanks to a rise in sales at its insurance business.\n\nSony also reported a 21% jump in sales in its image sensor business, which it sells to companies like Apple for smartphones.\n\nMeanwhile, Sony in January scrapped a planned merger with Indian firm Zee Entertainment. The deal, which was negotiated for more than two years, was seen as a way for Sony to get a foot into the lucrative Indian entertainment market.\n\nHiroki Totoki, Sony’s chief financial officer, said on Wednesday that India has “great growth potential,” adding that the company will “seek various opportunities” in the country and will look into plans to “replace” the failed merger with Zee.\n\nSource: https://www.cnbc.com/2024/02/14/sony-posts-record-quarterly-revenue-on-playstation-sales-boost.html",
        "created_utc": 1707912335.0,
        "subreddit_name": "stocks",
        "comments": 129
    },
    {
        "title": "Apple fans are starting to return their Vision Pros",
        "score": 10429,
        "url": "https://www.theverge.com/2024/2/14/24072792/apple-vision-pro-early-adopters-returns",
        "content": "",
        "created_utc": 1707942363.0,
        "subreddit_name": "technology",
        "comments": 2322
    }
]