[
    {
        "title": "Dark day but the storm will pass soon and the future remains very bright for Apple",
        "score": 13,
        "url": "https://www.reddit.com/r/AAPL/comments/s815ya/dark_day_but_the_storm_will_pass_soon_and_the/",
        "content": "Welcome to correction territory, but the future remains bright for AAPL and its little sister SWKS which I also own. down to the bottom for both, it appears. However, this severe risk-off mentality based on general pessimism in the world (especially the rise of fascism in the GOP and the impending Russian invasion of Ukraine which looks likely, so a new USSR?) plus a lot of gouging making inflation worse, the democrats agenda all blocked by Manchin and Sinema, covid unpredictable as hell, anti vaxxer anti maskers rebelling and many still dying, well it is a bad day on the planet or a bad week or two.\n\nNegative psychology can hit the market in unexpected ways. But there is a big silver lining and once those storm clouds pass, we will see sharp upward movement at least with well-deserving stocks like AAPl and SWKS.  for one thing we have earnings in 8 days.  Earnings cut through the BS usually, According to what I can surmise, Apple has had a wonderful quarter with huge growth in China and many other countries which didn't used to be Apple strongholds.  can they keep up with demand?  Well maybe not quite, but I hear they have pretty much solved their supply chain problems of late.\n\nCovid was bad this last month, but remember what happened during the worst covid shutdowns?  Apple benefitted greatly.  despite the fact the anti masker anti vaxx GOP is demanding that schools re-open unprotected (fools) 100,000 students in Miami-Dade alone didn't show up for class because our anti vaxxer governor Desantis made it too dangerous.  So how are those kids learning? On iPads and iPHones and Macs.  Plus 5G just premiered and despite problems around airports (real or imagined) the 5G super cycle has just begun, and not only AAPl and SWKS will benefit but also T ad VZ which are very cheap stocks now.\n\nSo two steps back, three steps forward for AAPL?  And will bears take it down even more before earnings just because they can?   If you, a great buying op is presenting itself and the future remains just as bright as when AAPL was at 182. In fact, if this negativity lasts another week, then AAPL will announce earnings perhaps at the near term bottom and then we might see something like we saw years ago when apple beat and the stock went up 20%.  We shall see.",
        "created_utc": 1642627953.0,
        "subreddit_name": "AAPL",
        "comments": 26
    }
]