[
    {
        "title": "Remember the internet bubble? Here’s me selling 1000 shares of AMZN at $6.",
        "score": 37237,
        "url": "https://i.redd.it/q0bb58fm1xm71.jpg",
        "content": "",
        "created_utc": 1631384312.0,
        "subreddit_name": "wallstreetbets",
        "comments": 2009
    },
    {
        "title": "SPY Swing Trading",
        "score": 277,
        "url": "https://www.reddit.com/r/Daytrading/comments/plwt89/spy_swing_trading/",
        "content": "**Personal Info:** So, I've been trading spy for about almost a year right now. Super successful trading this. At first I was just buying the dip with long dated options (1 month or so). However, Now I have refined my strategy that has turned my account parabolic. \n\nThis little pull back we've seen the last couple of days is really really attractive. Swung some poooots today for a easy 2x on my account today. Sold out. (way too early could have X10) and now im looking for a bottoming pattern. \n\n&#x200B;\n\n# PART ONE: \"Swinging SPY\" and \"Buying the DIP\" \n\nRight now, I think we can see two levels act as **support.** \n\n# The 50 Day EMA\n\n* For the last year the 50 EMA (daily) has offered a decent amount of support and really hasn't fallen under that. \n\n[\\(the Straight line is community trend line\\) and the 50ema is the little green swiggly line.](https://preview.redd.it/wouqmxdxdrm71.png?width=1089&format=png&auto=webp&s=863635298a1c83c740c79cb1081babd170a7a041)\n\n# The RSI levels\n\n* I really hate RSI for selling levels. But I think if you see patterns for RSI its a great buy indicator. \n* We are in a good buy signal area.\n* Every time it reaches below 30 on the RSI (2Hour) we can see a big price action movement.\n\n[RSI is at 30 rn](https://preview.redd.it/uewmxoo8erm71.png?width=1103&format=png&auto=webp&s=b7c082e244470ab79fd041d78fc7e4424a2261bb)\n\n# My Personal Strategy for this pattern:\n\n* Scale into positions\n   * This is very important. Normally I split my entire account into about 3 sections. \n      * This is when I buy into a options for SPY. Typically I scale into a 1 week expiring call where my break even is roughly about 1.25% up from current levels.\n      * Next level is when I hit the 50Ema I buy calls where my break even is roughly 1% up expring 2 days out.\n      * If it keeps falling then I save the last 3rd of my account for longer dated calls when this bottoms and can see clear trend reversal (this hasn't happened yet)\n      * If it doesn't keep falling normally, if I see a bullish pattern breaking out above the 20EMA I'll yolo this into 1 week expiring calls pretty close to the money.\n* Weird Risk Management\n   * IF YOU DO NOT SECTION YOU ACCOUNT THEN YOU WILL LOSE EVERYTHING\n      * say you are wrong on the first support level and you yolo your account you lose everything.\n      * But, with sectioning out your account into 3 different trades. then it will normally \n* Big **kahunas** **and Patience**\n   * Gotta have big balls\n   * Have to be patient\n\nHonestly, I should be selling a freaking course for $200 on this stuff and stealing peoples moneys. Like honestly this strategy isn't for everyone. But, It is such an easy way to make phenomenal gains these last couple of months.   \n\n\n# Stipulations: \n\n* The market could just fall more than 10% and this pattern of bullish \"dip buying\" just gets stoppped. (This is why \"Section 3\" of my account is there)\n* Patterns don't always follow through\n* Sometimes the patterns are confusing and high stress. For example, this march was a weird time to be trading this. \n\nHere is the March (Daily) chart on SPY, this was my biggest spy profit so far. Like, made me wanna drop out of college moment.\n\nFirst we will start with RED: Here is where I yolo'd my section one of my account (1/3 of account). Took 75% of section one and sold it as a signicant amount of profit. Spy then proceeded to turn around and smack the 50 Ema Line. My entry was impectable right on the 50ema and yolo'd \"section\" one and \"section two\" of my account into 3DTE options. I gained signifcant profit. However, That highlighted section. That day my account took a -50%, But still overall profit from the first trade from the previous march one. I also entered pooooots at the highlighted section once it failed to break above 20EMA. (super easy trade). THennnnnnnnnnnnnnnnnnn The next highlighted section). Hollllly crap. I entered my 50Ema position (1/3 of my account) then I subsquently lost it all with that long wick to the downside the next day. However When I saw it bounce of that level very aggressively. I split my account into 1/3 into cash, 1/3 into 0DTE calls and then 2DTE calls. This by far is one of my most successful trades. \n\n[March $SPY](https://preview.redd.it/1hm9bcyejrm71.png?width=332&format=png&auto=webp&s=025e55aa65e84d2602daeb404ed2fa93328032d6)\n\nThis long winded toot of my own horn isnt to well toot my horn. It is to show that this stragey needs to be carefully monitored for me and it doesn't need to change that much. Also that scaling into positions, Risk REWARD is very very good for trading options. \n\n&#x200B;\n\n# PART TWO: Day Trading SPY (Opening Gap Fill)\n\nThis is by far my favorite pattern to trade. This is normally what I look for every day on SPY. Not all the days it holds up. But i'd say about 90% of the time SPY fills the gap it creates from the opening market.  \n\n\nFor this I normally trade about 25-50% of my account into 0DTE calls/puts or 1DTE calls/poots. I always sell at when the Gap gets filled. Always sell when I take a 50% \n\nHere is a bunch of charts from these last two weeks from SPY. The highlighted sections were the gaps created from market close and market open. (All charts are on the 5 minute). The blue line is my positions.\n\n&#x200B;\n\n[Todays POOT Swing](https://preview.redd.it/4jwq80e2mrm71.png?width=291&format=png&auto=webp&s=62f7423bb007c5030232421dbc1269e68e72d2d0)\n\n&#x200B;\n\n[Example 2](https://preview.redd.it/ik0x6668mrm71.png?width=352&format=png&auto=webp&s=bef81e070caf501a75f5fa1121938d7abe604176)\n\n&#x200B;\n\n[Example 3 \\(This one happened very very fast. and gave up all gains. However, You can see later in the day it also filled. ](https://preview.redd.it/nruxorjamrm71.png?width=546&format=png&auto=webp&s=2a6dfd30c2f594366460e344277c973c5a264f7d)\n\n&#x200B;\n\n[This one took much longer and lots of Theta Decay. However ended positive eventually](https://preview.redd.it/achafx1fmrm71.png?width=647&format=png&auto=webp&s=2cb1dff167c6b5bd69b840509bab513ddfa6cbec)\n\n&#x200B;\n\n[Example 4](https://preview.redd.it/cu79rszomrm71.png?width=627&format=png&auto=webp&s=0e68a7625f3981997e9e0468f25464740f839448)\n\n&#x200B;\n\n[Example 5](https://preview.redd.it/b9af6xcqmrm71.png?width=627&format=png&auto=webp&s=ed233a05a9b22b3b8c0d226d7ecfe2f70468bf8e)\n\nTypically smaller moves on 0DTE SPY options will net you about 20% gain. However, when the gap is larger .33%-.5% then you can look at doubling your account right there. \n\n&#x200B;\n\n# Conclusion: \n\nHere is everything I pretty much do on SPY. Spy is a perfect stock to trade. It often gets a really bad wrap for \"gambling\" and being \"unpredictable\". However, If you look for patterns and have proper risk management then it is really easy to be consistant. Normally. I look for gap fills every morning and these are pretty decent gains over time. However, The big money is in those OTM calls when you hit close to the 50EMA line.",
        "created_utc": 1631318984.0,
        "subreddit_name": "Daytrading",
        "comments": 135
    }
]