[
    {
        "title": "The FCC is expected to announce a vote to gut net neutrality rules the day before Thanksgiving. This could be the last chance for Internet users to make their voices heard.",
        "score": 76623,
        "url": "https://www.reddit.com/r/technology/comments/7779es/the_fcc_is_expected_to_announce_a_vote_to_gut_net/",
        "content": "Hey reddit, I wanted to give everyone a heads up that Ajit Pai, former Verizon lawyer and current chairman of the FCC, is expected to circulate the text of his rule and announce a vote to gut net neutrality protections on November 22, the day before Thanksgiving.\n\n**[That means these next few weeks could be our last chance to speak out to defend net neutrality. You can use this tool to call your lawmakers.](https://www.battleforthenet.com)**\n\nOnce the FCC announces a vote (which would likely be at its open meeting in December), it will become much, much harder to stop them from gutting the rules that prevent companies like Comcast, Verizon, and AT&T from charging us all extra fees to access sites like reddit, and controlling what we see and do online by throttling, blocking, and censoring websites, apps, games, and streaming services. \n\nThe good news is that we are hearing from people who are meeting with Congress that there are key lawmakers who are sympathetic to the cause, and considering stepping in to slow down the FCC. **But they need to be getting a lot more phone calls from constituents in order to act.**\n\nThe groups behind the big Net Neutrality [day of action](https://www.battleforthenet.com/july12) that happened back on July 12 are calling on all Internet users, websites, apps, subreddits, and online communities to do everything they can to drive as many phone calls to Congress as possible between now and November 22. \n\n**There's an easy click-to-call tool set up at https://www.battleforthenet.com**\n\n**We have ready-made banners, modals, and graphics of various sizes here: https://www.battleforthenet.com/#join**\n\nOur best shot at saving net neutrality is if we can get phones ringing off the hook in Washington, DC right NOW. It's a long shot, but it's our best shot. Please spread the word, and message me if you want to learn more or get involved. ",
        "created_utc": 1508340192.0,
        "subreddit_name": "technology",
        "comments": 3196
    },
    {
        "title": "iOS 11 is the buggiest i have ever seen any of my iphones",
        "score": 9302,
        "url": "https://www.reddit.com/r/apple/comments/775yok/ios_11_is_the_buggiest_i_have_ever_seen_any_of_my/",
        "content": "I’m curious as to how often you guys experience these bugs because they are honestly infuriating and remind me of having an android. \n\nFirst annoying bug which happens way too often, when i answer a phone call, i cannot head the other person and they can not hear me. When this bug starts happening, it doesn’t fix until i reset my phone. another part of this bug is whenever i try to make a phone call, it will not ring. and when i try to adjust the volume on the phone call the volume slider does not show up. very annoying especially since i can’t just try making the phone call again, i have to restart \n\nanother very annoying bug is, half the time, more often than not actually, the music won’t show up on the lock screen, preventing me from changing the volume anywhere outside of the actual app playing the media, wether it be the podcast app, soundcloud, spotify, etc. this one sometimes fixes without me resetting my phone but i usually have to reset for this to fix \n\nthe last most universal bug is my phone will freeze up like crazy so many times through out the day, for a couple minutes at a time and seemingly randomly. very annoying. \n\nhow common are all three of these issues for anyone else? the freezing one i guess i can kind of forgive but the other two drive me absolutely crazy, especially considering i have an iphone 7 plus \n\n",
        "created_utc": 1508326611.0,
        "subreddit_name": "apple",
        "comments": 1914
    }
]