[
    {
        "title": "Lost in translation (RR CEZ)",
        "score": 29,
        "url": "https://www.reddit.com/r/stocks/comments/1giwn7a/lost_in_translation_rr_cez/",
        "content": "Hello, I believe opportunity to beat the market is in finding market ineffectiveness. How much market ineffectiveness do you believe, there is in different information availability between languages?\n\nWhy I am asking.\n\nLast week ČEZ has bought 20% of Rolls Royce SMR. And it was massive event in Czech language. Largest net newspaper had article about it on the front page. (remainder google translate can translate web-pages if you want to read).\n\nLargest newspaper article: https://www.seznamzpravy.cz/clanek/ekonomika-firmy-cez-koupi-za-miliardy-podil-v-rolls-royce-smr-budou-vyrabet-reaktory-263383\n\nState television: https://ct24.ceskatelevize.cz/clanek/domaci/cez-a-rolls-royce-smr-budou-spolupracovat-na-vyvoji-modularnich-reaktoru-354812\n\nWeb about energy industry: https://oenergetice.cz/jaderne-elektrarny/cez-koupi-za-miliardy-podil-v-rolls-royce-smr-budou-spolupracovat-na-reaktorech\n\nWeb about investing: https://www.kurzy.cz/firmy/cez-rolls-royce/\n\neverybody was writing about it. So I thought: I want to see what English speakers think about it. And there was nothing. I bought shares and 1 call. Thinking once they translate the news, market will react. I am already waiting a week. And nothing. When I look at Yahoo finance nothing happened at all. When I look at seeking alpha or IBKR. One simple article, no analysis or discussion.\n\n20% of SMR company has been bought by corporation which has almost monopoly for energy in Czech republic (because it would be illegal to have perfect monopoly). ČEZ talks about need to build up to 10 SMR to replace coal heat/power plants in coming years. ČEZ has recently also bought Škoda JS (Škoda nuclear engineering). That company has produced nuclear reactors in the past. And still has all the tools and facilities to produce nuclear reactors. They have “unused” reactor hall which is currently producing storage units for spent nuclear fuel, because nobody orders reactors today. RR is producing SMR design to be build in factory. ČEZ owns a factory for nuclear reactors in middle of EU. And no one speaks about the synergy. \n\nReaction of the market, whole weak of nothing -1%. As if there were no news. So it got me thinking, how often this happens? Do you know any other example of events which has vastly different information availability or point of view based on language?\n\n*Disclosure: I have 500 shares of RR and 1 RR call, bought this week, and ČEZ shares long term unrelated to this.*",
        "created_utc": 1730666361.0,
        "subreddit_name": "stocks",
        "comments": 7
    },
    {
        "title": "3X / 5X / 10X ETPs - how do they work during sharp downturns?",
        "score": 28,
        "url": "https://www.reddit.com/r/stocks/comments/1gir2yn/3x_5x_10x_etps_how_do_they_work_during_sharp/",
        "content": "Could be a basic question, so forgive me for my ignorance. (I think), I understand futures & options quite well, but don't fully understand leveraged ETPs (exchange traded products), which claim to perform 3X / 5X / 10X of an index or any other underlying e.g. Apple.\n\nSo, let's say I buy such a product, 10X on Apple. If Apple crashes 12%, do I lose **more than** my capital? Here, I'm talking about 12% loss in a day, and not 6+6% over two days, which could lower my investments to near-zero but not zero or negative.\n\nIf I do end up owing money, how's this any different from buying a future?",
        "created_utc": 1730652097.0,
        "subreddit_name": "stocks",
        "comments": 9
    },
    {
        "title": "The Contradiction of Warren Buffet's Avoidance of $TSLA",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1ginwra/the_contradiction_of_warren_buffets_avoidance_of/",
        "content": "Hi investing friends, helping fellow like-minded people (where's the trading/day trading swing tradaing sub-reddit of r/investing by the way?) add their fundamentals. I'm 93/7 percent believe in Warren and Elon, meaning if they say 100 things, I will most like believe 93 or them 110%:\n\nAlthough Warren Buffett and we must always do our best to surpass our heroes like all Olympic records are meant to be broken (coz' in part technology, rule change and medicine advances) or NBA stars like MJ surpassing their heroes and Warren Buffett is still the genius compared to 93.% of investors and traders (the remaining 7% are the other stars like Peter Lynch), he's also made a few mistakes (Amazon is the best example coz' he always insists he doesn't understand technology which is honestly not that hard to understand but may be hard to see the road ahead when the internet was democratized including made affordable for the common working man with a decent salary ala Henry Ford's speech):\n\ngranted he loves CEOs and founders who have a laid back personality that are orthodox but orthodox in the big way, like Tim Cook, and granted TSLA is overbought by saying TSLA has the market cap of the auto industry combined vs. it's book value (math part of things, ruled by figures/number so it's more a part of technical analysis still), is he avoiding TSLA because:\n\na)  Elon Musk's personality is the biggest Think Big of all Think Bigs in the industrial history (way bigger than Henry Ford or Vanderbilt and the others who built industrial america which spilled to the world) and he's not comfortable with that\n\nb) or is it because it's personal coz' they had a little war on words in the interviews and on X/formerly Twitter?\n\nIf it's about a) then it contradicts with his being on the Left mindset (a democrat, I'm with team common sense by the way at the moment coz' it has clarity, consistency and specific solutions) coz' the Left is very unorthodoxed and sometimes even comically non-sensical, going way beyond common sense.\n\nIf it's b) that's even worse, coz' one's judgment must not be clouded as Graham and Warren have though themselves, big decisions must be logical not ruled by vibes and emotions.\n\nThank you.\n\nGod bless fundamental and technical analysis analyzers",
        "created_utc": 1730643644.0,
        "subreddit_name": "investing",
        "comments": 21
    }
]