[
    {
        "title": "Samsung’s profit plunged 95% to its lowest level since 2009 as chip demand slumps",
        "score": 1677,
        "url": "https://www.reddit.com/r/stocks/comments/130jaxp/samsungs_profit_plunged_95_to_its_lowest_level/",
        "content": ">South Korean electronics giant Samsung’s operating profit plunged in the first quarter as prices for its memory chips continued to fall and demand remained weak.  \n>  \n>Here are Samsung’s earnings at a glance in the first quarter:   \n>  \n>**Revenue:** 63.75 trillion Korean won (about $47.6 billion), down 18% year-on-year. That is on par with [Samsung’s own guidance of approximately 63 trillion Korean won](https://news.samsung.com/global/samsung-electronics-announces-earnings-guidance-for-first-quarter-2023) but below the 63.9 trillion won expected by analysts, according to Refinitiv consensus estimates.  \n>  \n>**Operating profit:** 640 billion Korean won (roughly $478.55 million), down from 14.12 trillion won a year earlier. The company [issued guidance earlier this month](https://news.samsung.com/global/samsung-electronics-announces-earnings-guidance-for-first-quarter-2023) saying Q1 profit would be 600 billion Korean won.  \n>  \n>This is the company’s lowest operating profit since the first quarter of 2009.  \n>  \n>  \n>  \n>**Samsung sees memory recovery ahead**  \n>  \n>Traditionally, Samsung’s biggest profit driver is its semiconductor division which consists of sales of memory chips that go into everything from personal computers to smartphones to servers in data centers.  \n>  \n>Samsung posted a 4.58 trillion Korean won loss at its semiconductor business versus a 8.45 trillion won profit in the same period last year.  \n>  \n>During the pandemic, smartphone and PC makers stockpiled chips as demand for consumer devices increased, but they are now grappling with excess inventories as consumers cut back on purchases of these goods due to rising inflation. This has led to a fall in prices for the memory chips that Samsung sells.  \n>  \n>The South Korean giant said this month [it would be making a “meaningful”](https://www.cnbc.com/2023/04/07/samsung-electronics-says-first-quarter-profit-likely-plunged-96percent-as-chip-glut-slashes-prices.html) cut in memory chip production, following the lead of smaller rivals such as SK Hynix and Micron.  \n>  \n>“Samsung Electronics announced the disappointing number for the first quarter, but at the same time, they announced a meaningful production cut amid the severe memory chip downturn. After that, the market reacted positively on the news,” SK Kim of Daiwa Securities Capital Markets told CNBC’s “Squawk Box Asia” on Thursday.  \n>  \n>Samsung did however forecast a recovery in the second-half of the year.  \n>  \n>“Demand is expected to gradually recover in 2H amid projections that customer inventory levels will have declined,” Samsung said.  \n>  \n>[Samsung said it expects limited demand recovery](https://news.samsung.com/global/samsung-electronics-announces-first-quarter-2023-results) as large-scale data centers invest more conservatively and customers continue to adjust inventories. Samsung also expects launches of new smartphones, PC promotions and expansion of new CPU adoption to boost memory chip demand.  \n>  \n>SK Hynix, a competitor to Samsung, [also guided for a recovery in memory chips](https://www.cnbc.com/2023/04/26/sk-hynix-reports-record-quarterly-operating-loss-forecasts-better-outlook.html) when it reported a record quarterly loss on Wednesday,  \n>  \n>“If we got a rebound, it’s mostly driven by the production cut and some restocking demand. So we see, despite the disappointing earnings number, some positive investor sentiment on the stock,” said Kim.  \n>  \n>Samsung’s stock was around 0.6% higher on Thursday.  \n>  \n>  \n>  \n>**S23 Ultra gives mobile a boost**  \n>  \n>During the first quarter, Samsung launched its latest lines of flagship [smartphones called the S23 series](https://www.cnbc.com/2023/02/01/samsung-galaxy-s23-smartphone-lineup-to-take-on-apples-iphone-14.html), which gave its mobile division a boost.  \n>  \n>Revenue at its mobile business grew 22% versus the previous quarter to 30.74 trillion won, but was down 2% versus the same period last year. Operating profit came in at 3.94 trillion won, up 3% year-on-year.  \n>  \n>Samsung was helped by sales of its highest priced smartphone — the $1,200 S23 Ultra.  \n>  \n>“The premium market grew in terms of both volume and value even amid weak smartphone demand caused by lingering macro uncertainties,” Samsung said in a statement. “Sales grew and profitability recovered to reach double-digits on the back of strong sales of new premium models, centering on S23 Ultra, and efforts to enhance operational efficiencies.”  \n>  \n>Overall, Samsung’s smartphone division appeared to remain resilient amid an overall tough quarter for the industry. Shipments of smartphones fell 13% year-on-year in the first quarter of the year, according to data released Thursday by market research firm Canalys. Samsung reclaimed the top spot globally in terms of smartphone market share, Canalys said.  \n>  \n>  \n>  \n>**Tech recovery underway?**  \n>  \n>Samsung is the latest tech company globally to report earnings after numbers from U.S. technology giants [Alphabet](https://www.cnbc.com/quotes/GOOGL/), [Microsoft](https://www.cnbc.com/quotes/MSFT/) and [Meta](https://www.cnbc.com/quotes/META/).  \n>  \n>Daniel Yoo, head of global asset allocation at Yuanta Securities Korea, pointed to strong results from these American tech firms.  \n>  \n>Meta saw [first-quarter sales boosted by advertising from Chinese companies](https://www.cnbc.com/2023/04/26/meta-q1-23-earnings-boosted-by-chinese-retailers-buying-ads.html) while Microsoft posted [third-quarter results](https://www.cnbc.com/2023/04/25/microsoft-msft-q3-earnings-report-2023.html) that beat analyst expectations on both the top and bottom lines.  \n>  \n>“I do think that the recovery story is coming. And the good factor is that despite such poor profit numbers coming through, we are seeing sharp prices stabilizing,” Yoo said on CNBC’s “Street Signs Asia” on Thursday.\n\nSource: [https://www.cnbc.com/2023/04/27/samsung-earnings-q1-2023.html](https://www.cnbc.com/2023/04/27/samsung-earnings-q1-2023.html)",
        "created_utc": 1682595709.0,
        "subreddit_name": "stocks",
        "comments": 225
    }
]