[
    {
        "title": "Tesla Is Now Worth $400 Billion",
        "score": 1490,
        "url": "https://www.reddit.com/r/stocks/comments/ihc9q7/tesla_is_now_worth_400_billion/",
        "content": "The world’s most valuable car company just hit another milestone.\n\nTesla ￼’s (ticker: TSLA) market capitalization on Wednesday topped $400 billion. About two months ago, it was celebrating $200 billion. It first hit $100 billion in January.\n\nTesla passed Johnson & Johnson ￼ (JNJ) along the way on Wednesday, in terms of market cap. There are only seven companies in the S&P 500 index worth more, including Visa ￼ (V) at $447 billon and Apple ￼ (AAPL) at $2.16 trillion.\n\nThere is a lot you could buy for $400 billion. Here are a few notable   comparisons to put that figure in context.\n\nIt’s more than the combined value of every team in the four major U.S. professional sports, according to Forbes estimates. It’s also more than the Forbes estimate for the combined net worth of Bill Gates, Mark Zuckerberg, and Tesla’s own CEO Elon Musk.\n\nIt’s nearly four times International Business Machines ￼’ (IBM) market cap.\n\nYou could buy 400 billion things at a dollar store—or just buy Dollar General ￼ (DG) and Dollar Tree ￼ (DLTR).\n\nIt’s also more than the individual gross domestic product of Israel, Ireland, and Hong Kong.\n\nWith $400 billion, you could also stockpile about 181 billion regular gallons of gas, based on AAA’s U.S. estimates. You could drive 5.79 trillion miles, if you averaged 32 miles per gallon. That would take you around the Earth 232.5 million times.\n\nIf you are into electric vehicles, $400 billion could get you 10.53 million of Tesla’s basic 2020 Model 3. Of course, such a sale would cause price targets to soar. And Tesla would need a few more factories to turn out that many vehicles. The company only delivered about 90,000 vehicles in the second quarter.\n\nSource: Barron's\n\nThanks for the awards.",
        "created_utc": 1598493253.0,
        "subreddit_name": "stocks",
        "comments": 497
    },
    {
        "title": "Facebook apologizes to users, businesses for Apple’s monstrous efforts to protect its customers' privacy",
        "score": 48050,
        "url": "https://www.theregister.com/2020/08/27/facebook_ios_ads/",
        "content": "",
        "created_utc": 1598538127.0,
        "subreddit_name": "technology",
        "comments": 2446
    },
    {
        "title": "Apple showing signs it may soon launch a search engine to compete against Google Search",
        "score": 11906,
        "url": "https://www.coywolf.news/seo/apple-search-engine/",
        "content": "",
        "created_utc": 1598507396.0,
        "subreddit_name": "apple",
        "comments": 1424
    }
]