[
    {
        "title": "Apple, Microsoft Dominate U.S. Markets After FAANG Trade Fizzles",
        "score": 4,
        "url": "https://www.reddit.com/r/AAPL/comments/11youxj/apple_microsoft_dominate_us_markets_after_faang/",
        "content": "The combined weighting of Apple and Microsoft in the S&P 500 has risen to the highest level on record\n\nThe FAANG era is apparently over. The U.S. market is dominated by just two stocks now. \n\nThe combined weighting of [Apple](https://archive.is/o/wFMXU/https://www.wsj.com/market-data/quotes/AAPL) Inc. and [Microsoft](https://archive.is/o/wFMXU/https://www.wsj.com/market-data/quotes/MSFT) Corp. in the S&P 500 has risen to 13.3%, the highest level on record, while the influence of other big technology stocks has waned of late. That is according to Strategas Securities data going back to 1990.\n\nNot since [International Business Machines](https://archive.is/o/wFMXU/https://www.wsj.com/market-data/quotes/IBM) Corp. and [AT&T](https://archive.is/o/wFMXU/https://www.wsj.com/market-data/quotes/T) in 1978 have two stocks made up a greater share of the benchmark, according to Howard Silverblatt, senior index analyst at S&P Dow Jones Indices.   \nFor much of the past decade, investors simultaneously bid up shares of Facebook parent [Meta Platforms](https://archive.is/o/wFMXU/https://www.wsj.com/market-data/quotes/META) Inc., [Amazon.com](https://archive.is/o/wFMXU/https://www.wsj.com/market-data/quotes/AMZN) Inc., Apple, [Netflix](https://archive.is/o/wFMXU/https://www.wsj.com/market-data/quotes/NFLX) Inc. and Google owner [Alphabet](https://archive.is/o/wFMXU/https://www.wsj.com/market-data/quotes/GOOG) Inc. The robust gains in the stocks year after year reinforced bets that they could only go up, helping the trade become so [popular that it earned the FAANG nickname](https://archive.is/o/wFMXU/https://www.wsj.com/articles/the-year-big-tech-stocks-fell-from-glory-11672543952?mod=article_inline).  \nAs their share prices surged, so did their concentration in the S&P 500. At the peak in August 2020, the group swelled to make up about one-quarter of the index. Although that share has since edged down to 21%, some investors still worry the index is top-heavy and a significant pullback in a few stocks could [leave broader markets susceptible to a fall](https://archive.is/o/wFMXU/https://www.wsj.com/articles/stock-market-is-top-heavy-but-carnage-is-widespread-11652935180?mod=article_inline).\n\nThe big tech stocks began to diverge once worries about inflation began bubbling and the Federal Reserve started raising interest rates, dimming the allure of some growth stocks. \n\nOf course, they faced company-specific issues as well. Meta, for example, [has seen challenges stemming from competition](https://archive.is/o/wFMXU/https://www.wsj.com/articles/facebook-parent-meta-begins-new-round-of-job-cuts-e34b81cc?mod=article_inline) and privacy restrictions, while [Netflix has battled subscriber losses](https://archive.is/o/wFMXU/https://www.wsj.com/articles/netflix-shares-rise-as-content-drives-strong-subscriber-growth-11674234501?mod=article_inline) and struggled to control content costs.\n\nTodd Sohn, ETF strategist at Strategas, said Apple and Microsoft have [emerged as havens in the stock market turmoil](https://archive.is/o/wFMXU/https://www.wsj.com/articles/regional-bank-chaos-clouds-outlook-for-markets-ed1b315?mod=article_inline), bringing their weightings in the S&P 500 to 7.11% and 6.14%, respectively. The stocks have gained 23% and 14% in 2023 after suffering steep losses last year.\n\n“It’s just been monumental,” Mr. Sohn said. “There’s just more comfort with the way Apple and Microsoft are viewed as opposed to going out and buying any tech name out there.”More broadly, investors have piled into tech stocks to [hide out from the banking crisis](https://archive.is/o/wFMXU/https://www.wsj.com/articles/regional-bank-chaos-clouds-outlook-for-markets-ed1b315?mod=article_inline) amid hopes that the[ Fed is nearing the end of its campaign raising interest rates](https://archive.is/o/wFMXU/https://www.wsj.com/articles/federal-reserve-faces-tough-decision-on-rate-increase-681d6abc?mod=article_inline). The tech-focused Nasdaq Composite has rallied 3.5% this month, extending its 13% gain for the year, while the S&P 500 is up 0.8% in March and has given up almost all of its early year advance.\n\nLori Van Dusen, founder and chief executive of LVW Advisors in Rochester, N.Y., cautions investors to actively pick stocks instead of just buying funds tied to an index, noting that the hefty weighting of tech companies during the dot-com bubble led to big market declines. “The index is more concentrated than it’s been. You’re just making a bet that these are going to be the places to be going forward and that’s usually a bad bet,” she said. “That is not the way to make money in the coming years.”",
        "created_utc": 1679503732.0,
        "subreddit_name": "AAPL",
        "comments": 2
    }
]