[
    {
        "title": "JPMorgan raises TSLA price target to $295 (lmao)",
        "score": 2300,
        "url": "https://www.reddit.com/r/investing/comments/hm7keh/jpmorgan_raises_tsla_price_target_to_295_lmao/",
        "content": "[The US bank JPMorgan has raised its price target for Tesla from USD 275 to USD 295 following deliveries in the second quarter, but has left the rating at “Underweight”. These were better than expected, analyst Ryan Brinkman wrote in a study available on Monday. In addition, media reports suggested that the manufacturer of electric vehicles may have been profitable in the second quarter as well. However, Brinkman maintained that the valuation of the share was clearly too high.](https://gryffintrading.com/2020/07/06/tesla-stock-defies-pessimistic-analysts-and-rises-to-ever-new-heights/)\n\nMeanwhile TSLA is trading at 1,2k. I dont even know how this is possible, either the analysts valuations are entirely unrealistic or this is an insane bubble. In reality, the analysts are probably dumb and TSLA is also overvalued.",
        "created_utc": 1594041820.0,
        "subreddit_name": "investing",
        "comments": 984
    },
    {
        "title": "Volatility Stock Screener for Individual Equities (TOS) and How I Pick my Own Stocks and Stopped Relying on Others",
        "score": 347,
        "url": "https://www.reddit.com/r/Daytrading/comments/hmcpmf/volatility_stock_screener_for_individual_equities/",
        "content": "**Volatility Stock Screener for Individual Equities**\n\n=========================================\n\nInstruction is for anyone, indicators are for Thinkorswim\n\n**Scan**\n\n[https://tos.mx/xZCD91B](https://tos.mx/xZCD91B)\n\n**Watchlist Columns**  [https://i.ibb.co/HTj4mBs/image.png](https://i.ibb.co/HTj4mBs/image.png)\n\nATRP: [http://tos.mx/hO0MgJh](http://tos.mx/hO0MgJh)\n\nColored Average Daily Volume: [http://tos.mx/3jMy41L](http://tos.mx/3jMy41L)\n\n&#x200B;\n\nThis is \"base scan\" that you would then apply a strategy to. These could be long or short, they are simply stocks are likely to have very good setups. I broaden this a little more and use it as my \"Scan in\" for **Thinkorswim** so I can apply a pre-filtered list of Volatile Stocks to any other setup scan that I run.\n\n\\--------------------------------------------------------------------------------------------------------\n\n**If you want to know why I pick what works for me**\n\nProbably the hardest thing for any trader to get good at is learning how to find their own stocks. It took me years and is what I spend more time on anything. It is the single thing that separates professional traders (people who make a living trading their own money) and people who don't.\n\n**Why do you care?**\n\nEven if you trust the person you get tips from, they will be gone one day.\n\nYou will make less money starting out. You will make more money longer for the rest of your life with proper risk management picking your own stocks.\n\n&#x200B;\n\n**========== Beginner ==========**\n\nWe want a price range. A volume range. And stocks that have the potential to move. (volitility)\n\n&#x200B;\n\n**Price**\n\n**Low**: A simple cut off is $10 minimum. You can absolutely trade less but you will start getting into more stocks that are more heavily manipulated.\n\n**High**: $50 is good if you have a $5k account. You will get much better gains from smaller cap stocks. the risk is also higher, but you are not risking much with an account that small.\n\nOnce you get to $25k, $200-$250 is a nice cap. You can absolutely trade TSLA and others over a thousand but you seldom make as much.\n\n**Price > 5 and < 200**\n\n&#x200B;\n\n**Volume**\n\n**Two kinds of volume** \\- volume for the day and the average volume over a time period (I use a 20 for daytrading or 30 for swingtrading, daily SMA of the Volume).\n\nYou want stocks that are above the **daily average** of volume, showing that investors have interest in it and it will move. TOS has a built in scan called Unusual Volume. Any scanner code would be something like\n\n**Volume is greater than SMA(Volume, Length=20, Aggregate=Day)**\n\n&#x200B;\n\n&#x200B;\n\n**Volitility**\n\nVolume is a good filter, but we want stocks that can really move a big portion of their price percentage inside of a day for daytrading.\n\nI use the **ATR Percentage**, which is simply percentage of the ATR in relation to the stocks price. It is one of my favorite filters to pick higher R / R stocks.\n\n**(ATR(\"length\" = 30) / Close) \\* 100 > 5**\n\nThis is a **5**% range filter. Changing it to a **3**% will give you more results, but they will have less potential for movement.\n\nAs always, **google everything**, like **ATRP** and see if you even agree with it Maybe you prefer the \"volume sizzle\" filter in TOS. **Find your own best setup.**\n\n***Google*** *Volatility Stocks,  Daily average volume, Moving Average of volume, Average True Range Percentage*\n\n&#x200B;\n\n**========== Intermediate ==========**\n\n(I use Finviz and Market Smith for these)\n\n**Share Float Groups** Float is the shares a company has available to investors. The float percentage or ratio would show you what shares are held by insiders or other non-public shares.\n\nUnder 1M\n\nBetween 1 and 3M\n\nBetween 3 and 10M\n\nGreater than 10M\n\n&#x200B;\n\n**Market cap** is the value of a company's shares. A lower market cap usually has a higher risk reward (it moves more) than a high market cap. I do not apply market cap filters unless I am doing a Micro/nano play but they could help if you are having trouble.\n\nMega Cap: Market cap of $200 billion and greater\n\nBig Cap: $10 billion and greater\n\nMid Cap: $2 billion to $10 billion\n\nSmall Cap: $300 million to $2 billion\n\nMicro Cap: $50 million to $300 million\n\nNano Cap: Under $50 million\n\n(likely not 100% accurate)\n\nI group market caps in **1-10M, 10M-100 million**, **100M-1bllion** and > **1B**\n\nThe 100M-1B group is my recommendation for most traders (you could up the high end) and what I trade the most. If i trade a nano or micro I use an very different set of criteria than I do for anything else. 100M-1B are at less risk for turning violently against you but have very good profit potential.\n\nFor **microcap** and **nanocap filters**\n\n**1-20 price, Cap 200M, Float 0-10M with a Turnover of 1-5% (volume / shares)**\n\n&#x200B;\n\nThe **short float** is what shares are available to short. These are held by brokers usually or you can call and request your broker find you shares so you can short a stock.\n\nThe **short interest** is the shares that have been shorted but not yet closed. A very high short interest can setup very big short squeezes that yield the highest profit potential in the shortest amount of time. (there is of course a Long Squeeze no one talks about)\n\n***Google*** *Nanocap, Microcap, Pennystocks, Low Float, Short Float/Interest/Ratio*\n\n**Microcap 5x Daily Volume Scan (TOS):** [**http://tos.mx/jp5f8hu**](http://tos.mx/jp5f8hu) (not for new traders)\n\n&#x200B;\n\n**========== Advanced ==========**\n\n**What I studied next to build on this**\n\n**Sector Rotations**\n\n[https://stockcharts.com/freecharts/rrg/?s=xlb,xlc,xle,xlf,xli,xlk,xlp,xlre,xlu,xlv,xly&b=spy](https://stockcharts.com/freecharts/rrg/?s=xlb,xlc,xle,xlf,xli,xlk,xlp,xlre,xlu,xlv,xly&b=spy)\n\n***Google*** *Sector Rotations, ETF Relative Strength, Relative Rotation Graph (RRG)*\n\nEven in daytrading it is helpful to know what sectors are about to boom (did software just finish a run and now semi's are up?) (gold and silver respond very differently if the vxx is up or down) and what ones are going to correct. These are very repeatable and knowable things that happen over and over and can really help you start to get a feel for the market. It has cycles, rotations and a flow that you can use to help \"go with that flow\" to maximize your profits and minimize your losses. I use Seeking Alpha, ETFDB and [Stockcharts.com](https://Stockcharts.com) for sector research.\n\nFind good people who do a brief **weekly analysis video** of the market on the weekend to go over the previous week and prepare you for the next week. Right now I like Brian Shannon and Trendspider.\n\nRead a **weekend publication** that gives you the same thing. Do not do daily's - way too much information and it promotes FOMO. I read a lot - this year I have found useful information from IDB.\n\nDon't discount the value of the past. The best traders I know anticipated this market crash and made a ton of money on the recovery because they studied past market crashes. History repeats itself more than you would know.\n\n**No Results?**\n\nIn pre-market, TOS is picky about about average volume and price depending on your instrument. I use \"mark\" \"last\" and \"close\" for different things with different success.  Similarly with volume, you may have issues doing comparative scans against average daily volume. Wait for market open or tweak your scans.\n\n&#x200B;\n\n**Good luck. Be safe.**\n\n&#x200B;\n\n&#x200B;",
        "created_utc": 1594058661.0,
        "subreddit_name": "Daytrading",
        "comments": 48
    }
]