[
    {
        "title": "Meme-Stock Influencers Charged in $114 Million Fraud Scheme",
        "score": 1359,
        "url": "https://www.reddit.com/r/investing/comments/zm2pyw/memestock_influencers_charged_in_114_million/",
        "content": " [https://www.bloomberg.com/news/articles/2022-12-14/stock-trading-influencers-charged-with-114-million-fraud-scheme](https://www.bloomberg.com/news/articles/2022-12-14/stock-trading-influencers-charged-with-114-million-fraud-scheme)\n\nEight men who used social media platforms to promote stocks they owned were charged by federal prosecutors with engaging in a $144 million “pump and dump” scheme.\n\nEdward Constantinescu, known on Twitter as “@MrZackMorris,” and Perry Matlock, whose Twitter handle is “@PJ\\_Matlock,” were among the defendants charged in an indictment unsealed Tuesday in federal court in Houston.\n\nConstantinescu and Matlock are co-founders of Atlas Trading, a stock-trading forum on the Discord social media platform. Constantinescu has more than 550,000 Twitter followers, according to the US Securities and Exchange Commission, which sued the eight men yesterday. Matlock has 340,000.\n\nThe shares they hyped were in little-known companies including [GTT Communications Inc.](https://archive.vn/o/rhUG5/https://www.bloomberg.com/quote/GTTNQ:US), [Surface Oncology Inc.](https://archive.vn/o/rhUG5/https://www.bloomberg.com/quote/SURF:US) and [Universe Pharmaceuticals Inc.](https://archive.vn/o/rhUG5/https://www.bloomberg.com/quote/UPC:US), according to the indictment.\n\nAlso charged were Thomas Cooperman (“Tommy Coops”) Gary Deel (“Mystic Mac”), Mitchell Hennessey (“Hugh Henne”) Stefan Hrvatin (“LadeBackk”), Daniel Knight (“Deity of Dips”) and John Rybarczyk (“Ultra Calls, “The Stock Sniper”).\n\nThe case is US v. Constantinescu, 22-cr-00612, US District Court, Southern District of Texas (Houston).",
        "created_utc": 1671053211.0,
        "subreddit_name": "investing",
        "comments": 157
    },
    {
        "title": "Tesla Investors Voice Concern Over Elon Musk’s Focus on Twitter",
        "score": 1654,
        "url": "https://www.reddit.com/r/stocks/comments/zlf435/tesla_investors_voice_concern_over_elon_musks/",
        "content": "The chorus of Tesla Inc. individual investors expressing misgivings that Chief Executive Elon Musk‘s involvement with Twitter Inc. may be to the detriment of the electric-vehicle maker is getting louder, with the car company’s stock on track for its worst full-year performance.  \n\n“There is no TSLA CEO today,” Gary Black, managing partner of the Future Fund LLC, which owns roughly $50 million worth of Tesla, tweeted Monday. \n\nMr. Black voiced frustration after another sharp selloff in Tesla’s stock Monday. Shares in the world’s largest car company by market value fell more than 6% in Monday trading after a tumultuous weekend for Mr. Musk on Twitter, including the billionaire taking aim at the company’s former head of trust and safety; calling for the prosecution of top U.S. government medical adviser Anthony Fauci; and criticizing people who offer their pronouns without being asked.\n\nMr. Black said, “The market voted today that the $TSLA brand has been negatively impacted by the Twitter drama. Where before EV buyers were proud to drive their Teslas to their friends or show off Teslas in their driveways, now the Twitter controversy is hurting Tesla’s brand equity.”\n\nRoss Gerber, a longtime backer of Tesla, on Monday tweeted a question directed at Tesla’s board of directors. “Who is running tesla day to day during this critical time for the company,” Mr. Gerber said. \n\nHe separately tweeted, “There is nothing wrong at tesla at all. Other than the CEO working at another company, certainly tesla deserves a focused ceo. It would be helpful to know what Elon’s plans are.”\n\nMr. Musk, at a trial about his Tesla compensation package last month, said he had been spending most of his time of late focusing on Twitter, which he acquired for $44 billion. “I expect to reduce my time at Twitter and find somebody else to run Twitter over time,” he testified. \n\nTesla shares are down 54.31% this year through Tuesday’s close, putting it on pace for their worst year on record. The only other year where the shares fell was in 2016, when Tesla’s stock ended down 10.97%. The Nasdaq, which advanced Tuesday, has fallen around 28% this year.\n\nTesla shares closed down 4.09% Tuesday, the day Mr. Musk ceded the unofficial title to European mogul Bernard Arnault for the world’s wealthiest individual, according to Bloomberg, which publishes a ranking of the richest people.\n\nMr. Musk’s takeover of Twitter has raised anxiety among Tesla backers for months. Several urged the Tesla CEO to abandon the deal and focus on the car maker, when shares were already down around 30%. The stock has declined further in ensuing months amid growing recession concerns and cost pressure from high inflation. Tesla also has scaled back vehicle delivery plans. Tesla’s stock has fallen about 28% since the Twitter deal closed in late October through Tuesday, when it ended trading at its lowest level in more than two years.\n\nThe Tesla boss on Tuesday tweeted: “Tesla will be great long-term, but doesn’t control macroeconomic tides.” He later added “I will make sure Tesla shareholders benefit from Twitter long-term,” but didn’t offer details.\n\nTesla didn’t respond to a request for comment. Mr. Musk last week said he continues to work on Tesla as well as SpaceX, formally known as Space Exploration Technologies Corp. “I continue to oversee both Tesla & SpaceX, but the teams there are so good that often little is needed from me,” he tweeted Saturday.\n\nBill Nelson, the National Aeronautics and Space Administration’s administrator, said Sunday that he had asked SpaceX President Gwynne Shotwell if Mr. Musk’s purchase of the social-media platform would divert from the rocket company’s mission. Mr. Nelson said he was given assurance that wouldn’t be the case.\n\nLeo KoGuan, a self-proclaimed Tesla investor, last week tweeted: “Tesla board is missing in action” and called on the company to initiate a share buyback. Mr. Black also has been urging the company to pursue a $10 billion share repurchase. \n\nMr. Musk in October said Tesla could pursue a $5 billion to $10 billion share buyback and said some meaningful buyback was likely. The company had discussed such a share repurchase at the board level, but at the time hadn’t signed off on it. Mr. Musk has sold more than $19 billion in Tesla stock this year, including almost $4 billion in November to help finance Twitter. \n\nTesla’s brand image has taken a hit in recent months, according to market surveys. Self-identifying Democrats in particular have soured on the car maker since Mr. Musk bought Twitter, according to data from research firm Morning Consult. \n\nhttps://www.wsj.com/articles/tesla-investors-voice-concern-over-elon-musks-focus-on-twitter-11670948786?mod=hp_lead_pos7",
        "created_utc": 1670985601.0,
        "subreddit_name": "stocks",
        "comments": 487
    }
]