[
    {
        "title": "EU launches probe into Meta, Apple and Alphabet under sweeping new tech law",
        "score": 441,
        "url": "https://www.reddit.com/r/stocks/comments/1bnaa9e/eu_launches_probe_into_meta_apple_and_alphabet/",
        "content": "The European Union on Monday opened an investigation into Apple, Alphabet and Meta, in its first probe under the sweeping new Digital Markets Act tech legislation.\n\n“Today, the Commission has opened non-compliance investigations under the Digital Markets Act (DMA) into Alphabet’s rules on steering in Google Play and self-preferencing on Google Search, Apple’s rules on steering in the App Store and the choice screen for Safari and Meta’s ‘pay or consent model’,” the Commission said in a statement.\n\nThe first two probes focus on Alphabet and Apple and relate to so-called “anti-steering rules.” Under the DMA, tech firms are not allowed to block businesses from telling their users about cheaper options for their products or about subscriptions outside of an app store.\n\n“The way that Apple and Alphabet’s implemented the DMA rules on anti-steering seems to be at odds with the letter of the law. Apple and Alphabet will still charge various recurring fees, and still limit steering,” EU competition chief Margrethe Vestager said during a press conference on Monday.\n\nApple has already fallen foul of the EU’s rules on this. This month, the company was fined 1.8 billion euros ($1.95 billion) after the European Commission said it found that Apple had applied restrictions on app developers that prevented them from informing iOS users about alternative and cheaper music subscription services available outside of the app.\n\nThe third probe focuses on Alphabet. The European Commission said it is looking into whether Alphabet’s display of Google search results “may lead to self-preferencing in relation to Google’s” other services such as Google Shopping over similar rival services.\n\nThe fourth probe focuses on Apple. The  Commission said it is investigating whether the company has complied with obligations under the DMA to ensure that users can easily uninstall app on iOS and can easily change default settings on iOS. The probe also focuses on whether Apple is actively prompting users with choices to allow them to change default services on iOS, such as for the web browser or search engine.\n\nThe Commission said that it is “concerned that Apple’s measures, including the design of the web browser choice screen, may be preventing users from truly exercising their choice of services within the Apple ecosystem.”\n\nThe fifth and final investigation focuses on Meta and its so-called “pay and consent” model. Last year, Meta introduced an ad-free subscription model for Facebook and Instagram in Europe. The Commission is looking into whether offering the subscription model without ads or making users consent to terms and conditions for the free service, is in violation of the DMA.\n\n“The Commission is concerned that the binary choice imposed by Meta’s ‘pay or consent’ model may not provide a real alternative in case users do not consent, thereby not achieving the objective of preventing the accumulation of personal data by gatekeepers.”\n\nThierry Breton, the EU’s internal market commissioner, said during a press conference that there should be “free alternative options” offered by Meta for its services that are “less personalized.”\n\nGatekeepers is the term used to label large tech firms that are required to comply with the DMA in the EU.\n\n “We will continue to use all available tools, should any gatekeeper try to circumvent or undermine the obligations of the DMA,” Vestager said.\n\nSource: https://www.cnbc.com/2024/03/25/eu-launches-probe-into-meta-apple-and-alphabet-under-sweeping-new-tech-law.html",
        "created_utc": 1711362402.0,
        "subreddit_name": "stocks",
        "comments": 156
    }
]