[
    {
        "title": "Trump to block U.S. downloads of TikTok, WeChat on Sunday",
        "score": 4229,
        "url": "https://www.reddit.com/r/stocks/comments/iv56al/trump_to_block_us_downloads_of_tiktok_wechat_on/",
        "content": "The Commerce Department announced Friday morning that it would ban U.S. business transactions with Chinese-owned social apps WeChat and TikTok on Sunday.\n\nThe announcement comes ahead of an expected statement Friday by President Donald Trump on whether or not the government will approve a deal for Oracle to take a minority stake in TikTok and become a “trusted technology partner” for the company in the U.S.\n\nIt’s unclear if the Commerce Department’s announcement means there’s no possibility of a deal going through before the Sunday deadline, and it could be an aggressive move from the Trump Administration to push for its original intention for TikTok to be fully owned by a U.S. company.\n\n“At the President’s direction, we have taken significant action to combat China’s malicious collection of American citizens’ personal data, while promoting our national values, democratic rules-based norms, and aggressive enforcement of U.S. laws and regulations.” Commerce Secretary Wilbur Ross said in a statement Friday.\n\nFriday’s announcement from the Commerce Department is an enforcement of Trump’s original executive order from August 6 that gave TikTok 45 days to sell its U.S. business to a U.S. company or face a ban in the U.S. WeChat, which is one of the most popular social messaging apps in the world, is owned by the Chinese company Tencent. TikTok’s parent company is the Chinese company ByteDance. Trump’s executive order cited national security concerns over the Chinese government’s access to user data in those apps to justify the potential ban.\n\nThe Commerce Department’s statement on Friday said that starting Sept. 20, U.S. companies would be banned from distributing WeChat and TikTok, meaning the two major mobile app stores run by Apple and Google would have to remove the apps from their libraries. The statement also blocks U.S. companies from providing services through WeChat “for the purpose of transferring funds or processing payments within the U.S.”\n\nWeChat is a popular marketing and sales tool for U.S. companies primarily in China, but around the world as well. With U.S. social apps like Facebook and Instagram banned in China, WeChat is the primary app people use for social networking and e-commerce. It’s also a popular app used by people in the U.S. to communicate with people in China, since U.S. apps are banned in China.\n\nThe Commerce Department’s announcement also lays out a separate time frame specific to TikTok, which take affect on Nov. 12. The rules that start Nov. 12 include provisions that block U.S. companies from providing internet hosting and services for TikTok. This could be directed at the deal being negotiated between TikTok and Oracle, which would provide cloud services for TikTok if Trump approves, and could give TikTok and Oracle more time to hammer out a deal that Trump will approve.\n\nRepresentatives for Tencent, TikTok, WeChat, Apple and Google were not immediately available to comment.\n\nhttps://www.cnbc.com/2020/09/18/trump-to-block-us-downloads-of-tiktok-wechat-on-sunday-officials-tell-reuters.html",
        "created_utc": 1600432308.0,
        "subreddit_name": "stocks",
        "comments": 989
    }
]