[
    {
        "title": "Did I buy the cheapest share of Pfizer in the last decade?",
        "score": 505,
        "url": "https://www.reddit.com/r/stocks/comments/1ba8ehi/did_i_buy_the_cheapest_share_of_pfizer_in_the/",
        "content": "On Monday morning, I lazily checked my phone during the morning Zoom meeting at work and noticed a Yahoo finance alert that a stock on my watchlist was down a few percent. I thought about it for a few seconds and decided to pull the trigger. I nonchalantly opened my brokerage app and logged in while still pretending to pay attention to the meeting, then entered a hasty limit buy order. I don't even remember the limit price I used. It filled, 50 shares of PFE at 9:46am for an average price of $25.689.\n\nThe low for the day was $25.61 and it looks like it may have been in the same 9:46am candle. $25.61 also happens to be the lowest price the stock has been since 2012. Is it possible that I got at least 1 share in my odd lot of 50 for the price of $26.61? Or is that incredibly unlikely based on my fill price being $0.079 higher?",
        "created_utc": 1709956536.0,
        "subreddit_name": "stocks",
        "comments": 122
    },
    {
        "title": "My 401K has a YTD of -98.87%",
        "score": 298,
        "url": "https://www.reddit.com/r/investing/comments/1baa2sk/my_401k_has_a_ytd_of_9887/",
        "content": "I do the lowest risk one that my advisor suggested thru Lincoln financial. I logged in today and it says -98.87% YTD RETURN, I’m a little nervous cause I started it last year and I am almost to 8k I am only 25 and wanted to think about my future. My company matches. And I’m doing 8% of my check. Is this normal?\n\n\nSECOND EDIT: whoever said it was just a glitch was right! My account looks way better today! Still going to get better investment strategies \n\n$7,039.61 Account balance\n5.07% YTD rate of return\n(01/01/2024 - 03/08/2024)\nN/A Annual rate of return\n8% Current contribution\n$233.86 My last contribution (03/06/2024)\n$1,121.32My YTD contributions\n$560.66My YTD employer contributions\n\n\n\nEDIT: thank you all for your advice, and teachings, comments.. I have learned more today than I have in a 1 hour phone call with a financial advisor!! You all are so helpful and friendly. Thank you. I’ll be calling Lincoln Monday and trying to get into a tad more aggressive investing fund so that I can see that money grow!",
        "created_utc": 1709961991.0,
        "subreddit_name": "investing",
        "comments": 128
    },
    {
        "title": "Base Model M3 MacBook Air Has Faster SSD Speeds After Controversy With Previous Model",
        "score": 1237,
        "url": "https://www.macrumors.com/2024/03/09/base-model-m3-macbook-air-faster-ssd/",
        "content": "",
        "created_utc": 1709999455.0,
        "subreddit_name": "apple",
        "comments": 307
    },
    {
        "title": "Biden predicts Federal Reserve will lower interest rates",
        "score": 505,
        "url": "https://www.reddit.com/r/stocks/comments/1bail4r/biden_predicts_federal_reserve_will_lower/",
        "content": "In a speech on Friday, Biden “bet” that the Fed would be cutting interest rates soon.\n\nIt is extremely rare for a President not named Trump to comment on Federal Reserve policy. This comes after a climax run in NVDA stock and a volatile week that had the market on the cusp of a much needed pause or pullback.\n\nYet now, if market participants take this comment seriously and believe Biden has inside information about Powell’s plan, the market could surge higher, trapping newly minted shorts, and avert the healthy price action it needs to sustain this bull run for the longer term.\n\nAnyone think Biden’s comments will ignite the market next week? Or will they just ignore this crazy old man?",
        "created_utc": 1709993445.0,
        "subreddit_name": "stocks",
        "comments": 343
    }
]