[
    {
        "title": "Department of Energy will buy an Nvidia-AMD powered supercomputer because Intel is months late on delivery",
        "score": 1828,
        "url": "https://www.reddit.com/r/investing/comments/pbmbzk/department_of_energy_will_buy_an_nvidiaamd/",
        "content": "[Source](https://finance.yahoo.com/news/u-near-deal-nvidia-supercomputer-190754396.html?.tsrc=rss):\n\n>The U.S. Department of Energy is nearing a deal to purchase a supercomputer made with chips from Nvidia Corp and Advanced Micro Devices Inc as a key lab waits for a larger supercomputer from Intel Corp that has been delayed for months, two people familiar with the matter told Reuters.\n\n>The Nvidia and AMD machine, to be called Polaris, will not be a replacement for the Intel-based Aurora machine slated for the Argonne National Lab near Chicago, which was poised to be the nation's fastest computer when announced in 2019.\n\n>Instead, Polaris, which will come online this year, will be a test machine for Argonne to start readying its software for the Intel machine, the people familiar with the matter said.\n\nA more technical breakdown can be found from the [DOE's lab's website](https://www.anl.gov/article/us-department-of-energys-argonne-national-laboratory-and-hewlett-packard-enterprise-prepare-for).\n\nTo be clear, the Intel deal is merely delayed, but not canceled. How does this change the narrative of Nvda/AMD versus Intel in the high-end server and super computer space? Are these kind of delays very common? I.E It's not a big deal.\n\nOr did Intel just messed up a very visible and prestigious deal that will accelerate nvda/amd's surge to capture Intel market share?\n\n*edited to add* [Tom's Hardware](https://www.tomshardware.com/news/nvidia-amd-polaris-supercomputer-department-of-energy) also interpreted the DOE's purchase of the Nvidia-AMD machine as being caused by Intel's delay.",
        "created_utc": 1629931315.0,
        "subreddit_name": "investing",
        "comments": 203
    }
]