[
    {
        "title": "Bought my first PC today.",
        "score": 5788,
        "url": "https://www.reddit.com/r/apple/comments/p0i9vb/bought_my_first_pc_today/",
        "content": "I know this will get downvoted to hell, because it’s the Apple sub, but I need to vent how disappointed I am in Apple. \n\nI got my first Mac Book Pro in 2005 and have been a huge Apple fan ever since. \n\nI have been waiting for the next 16” to be released to get my next Mac (really hoping for that mag safe to return). Same with the iPhone 13 Pro. I’ve spent close to $30k on Apple products in my lifetime.\n\nToday I’m spending $4k+ on a custom built PC and it’s going to be a huge pain to transition to PC, learn windows or Linux, etc. but I feel that I must.\n\nApple tricked us into believing that their platform is safe, private, and secure. Privacy is a huge issue for me; as a victim of CP, I believe very strongly in fighting CP — but this is just not the way. \n\nI’ve worked in software and there will be so many false positives. There always are. \n\nSo I’m done. I’m not paying a premium price for iCloud & Apple devices just to be spied on. \n\nI don’t care how it works, every system is eventually flawed and encryption only works until it’s decrypted. \n\nBest of luck to you, Apple. I hope you change your mind. This is invasive. This isn’t ok.\n\nEdit: You all are welcome to hate on me, call me reactive, tell me it’s a poorly thought out decision. You’re welcome to call me stupid or a moron, but please leave me alone when it comes to calling me a liar because I said I’m a CP victim. I’ve had a lot of therapy for c-ptsd, but being told that I’m making it up hurts me in a way that I can’t even convey. Please just… leave it alone.\n\nEdit 2: I just want to thank all of you for your constructive suggestions and for helping me pick out which Linux to use and what not! I have learned so much from this thread — especially how much misinformation is out there on this topic. I still don’t want my images “fingerprinted”. The hashes could easily be used for copyright claims for making a stupid meme or other nefarious purposes. Regardless, Apple will know the origin of images and I’m just not ok with that sort of privacy violation. I’m not on any Facebook products and I try to avoid Google as much as humanly possible. \n\nThank you for all the awards, as well. I thought this post would die with like… 7 upvotes. I’ve had a lot of fun learning from you all. Take care of yourselves and please fight for your privacy. It’s a worthy cause.",
        "created_utc": 1628441706.0,
        "subreddit_name": "apple",
        "comments": 1260
    }
]