[
    {
        "title": "Apple Intelligence to Miss Initial Launch of Upcoming iOS 18 Overhaul",
        "score": 1468,
        "url": "https://www.bloomberg.com/news/articles/2024-07-28/apple-intelligence-to-miss-initial-release-of-upcoming-ios-18-ipados-overhauls",
        "content": "",
        "created_utc": 1722192382.0,
        "subreddit_name": "apple",
        "comments": 402
    },
    {
        "title": "26k gain from 400. 60 bagger",
        "score": 5840,
        "url": "https://i.redd.it/16gv5beghafd1.jpeg",
        "content": "I just can't lose. 90 percent of my trades are spy 0dte betting with the trend.\nMy rules:\n1, no trading in the first 2 hours\n2, zero chasing a loss, I sell if I hit -20 percent\n3, never stay in a trade longer than 2 hours\n4, if I hit 30 percent gain I set a trailing stop loss to lock in gains.\n5. I'm super lucky\n",
        "created_utc": 1722185421.0,
        "subreddit_name": "wallstreetbets",
        "comments": 949
    },
    {
        "title": "I made $110k with Apex Trader Funding. This is my strategy.",
        "score": 954,
        "url": "https://www.reddit.com/r/Daytrading/comments/1ee4lru/i_made_110k_with_apex_trader_funding_this_is_my/",
        "content": "Apex Trader Funding asked me to submit videos explaining my strategy, indicators used, and examples of me trading with market analysis and commentary. They want proof that I'm actually trading, and not taking lucky gambles or copy trading.\n\nSeeing as I have to share my trading strategy and trades with Apex, I thought I'd share them here as well. I see a lot of traders asking for a profitable strategy.  I hope this will be helpful.\n\nI've taught friends and family to trade, so I was able to cut the strategy explanation from a training video I already had: https://youtu.be/brpMLi3qrB4.  I'm not a professional trainer so excuse the quality of the presentation.\n\nHere are 4 examples of me trading the strategy:\n\n1. Market analysis followed by a 3 tick counter-trend scalp to demonstrate the basic setup. The actual scalp happens at 15m48s [https://youtu.be/6tbnelh9S-Q](https://youtu.be/6tbnelh9S-Q)\n2. Counter-trend move into resistance, attempting to take out stops above resistance. [https://youtu.be/iOYZCpi2v\\_Q](https://youtu.be/iOYZCpi2v_Q)\n3. With-trend move into support, taking out stops below support. [https://youtu.be/sSwHhFvMhhM](https://youtu.be/sSwHhFvMhhM)\n4. Making over $12k before breakfast.  I've just woken up and I'm trading from my laptop in bed.  This is a longer video; this was a very technical session so contains lots of examples of the strategies listed in the first video. [https://youtu.be/VtaCt-dI4nE?si=ZtRW3KhHt5I0nufw&t=1201](https://youtu.be/VtaCt-dI4nE?si=ZtRW3KhHt5I0nufw&t=1201)\n\nHappy to answer any questions here.  If this gets a favourable response I will upload more videos of my strategies and how I trade.\n\nI'll update here when Apex approve my videos.\n\n** Update - Apex denied these videos as \"not suitable\". They changed the rules _after_ I submitted the videos. The updated rules require me to show my hands, keyboard, mouse and screen. Picture in picture is not allowed.  My videos were compliant with the first request but were rejected. **\n\n**Update 08Aug24** - *Apex approved the second videos I submitted and I have been paid out.*",
        "created_utc": 1722163307.0,
        "subreddit_name": "DayTrading",
        "comments": 303
    },
    {
        "title": "$72k lost in options over 2 years",
        "score": 569,
        "url": "https://i.redd.it/lqy2gxh6l8fd1.jpeg",
        "content": "Never thought I’d be in this position but here I am. Totally distraught. Started trading regularly in March 2023 and had a loss of around $13k at the time from 2021 when I tried my very 1st options trade. Had a profitable March, where I covered my $13k loss. But then kept losing each month. Was down $40k last week and lost $30k on Wednesday (7/24) when QQQ dropped $17. Had 0dte call options. A combination of fear, lack of risk management, experience and discipline has led me to this. I don’t have much left now. I don’t know if I’ll ever be able to have any sort of financial stability now. Had never grew up with money. Worked hard and saved up for years to only lose it all in an instance. Don’t have any equity, no assets, no 401k. 34 years old. Hard times are back and how!! Been feeling suicidal.",
        "created_utc": 1722162460.0,
        "subreddit_name": "DayTrading",
        "comments": 278
    }
]