[
    {
        "title": "Elon Musk says Tesla deliveries will rise 30% to 40% in 2020, touts new battery tech",
        "score": 1936,
        "url": "https://www.reddit.com/r/stocks/comments/ixyrff/elon_musk_says_tesla_deliveries_will_rise_30_to/",
        "content": "Tesla CEO Elon Musk said on Tuesday he expects vehicle deliveries to increase by 30 to 40 percent over last year, when the company reported deliveries of 367,500 vehicles. The new guidance from Musk implies deliveries of between 477,750 and 514,500 cars, a range that encompasses the company’s previously stated goal to deliver half a million cars in 2020.\n\nMusk offered the updated numbers during the company’s 2020 shareholder’s meeting on Tuesday afternoon, which was accompanied by a presentation about Tesla’s battery advances. After thanking Tesla owners for their word-of-mouth marketing, he noted: \n\n\n“In 2019, we had 50% growth. And I think we’ll do really pretty well in 2020, probably somewhere between 30 to 40 percent growth, despite a lot of very difficult circumstances.”\n\nThe company’s shares dropped more than 6% during the presentation, which took place after normal trading hours.\n\nDuring the “battery day” portion of the presentation, Tesla confirmed that it is making its own battery cells at a facility in Fremont.\n\nJoining Musk on stage, Tesla’s senior vice president of powertrain and energy engineering, Drew Baglino, described the new cells as a “large tabless cell,” with a “shingled spiral” design. The cells are larger than the ones Tesla purchases from Panasonic and other suppliers, and offer “thermal benefits” which make them appropriate for use in electric vehicles. \n\nBaglino said battery, manufacturing and design changes underway at Tesla would eventually “unlock” a 54% improvement in the range of the company’s vehicles.\n\nMusk, who is famous for being overly optimistic on such matters, said with all the battery and manufacturing advances Tesla is working on: “About 3 years from now, we’re confident we can make a very compelling $25,000 electric vehicle that’s also fully autonomous.” \n\nNear-term, Tesla says it aims to produce 10 gigawatt hours worth of its new battery cells at its pilot plant within a year. Musk noted that whatever cells it produces in Fremont would be supplemental to 100 gigawatt hours worth of cells it buys from suppliers. The company also said it had secured rights to a lithium clay deposit in Nevada to mine for its batteries.\n\nOn Monday, Musk warned that the advances announced at battery day won’t find their way into mass production until 2021, sending the company’s stock down about 6% ahead of the event on Tuesday.\n\nDue partly to Covid-19 health orders that limit the size of in-person gatherings, Tesla postponed its annual meeting from July this year to Sept. 22, 2020. The company previously held its shareholder meetings at the Computer History Museum in Mountain View, California but moved the event to Fremont, where its U.S. vehicle assembly plant is based. Shareholders parked and sat in their cars at the meeting, which Musk characterized as a “drive-in.” They honked in lieu of applause.\n\nAl Prescott, Tesla's VP of legal, at the company's socially distanced 2020 shareholders meeting, as attendees listen in their cars.\nAl Prescott, Tesla’s VP of legal, at the company’s socially distanced 2020 shareholders meeting, as attendees listen in their cars.\nThose who wanted to attend had to obtain a winning lottery-style ticket (or other special access) to the meeting. Otherwise, shareholders could log into a website to ask questions to be answered during the live-streamed event.\n\nSince its last shareholder meeting in June 2019, Tesla’s long-time CTO JB Straubel resigned from the company. He worked there from the start, even before Musk took the CEO reins in 2008.\n\nTesla also appointed a new board member, Hiromichi Mizuno, formerly the Chief Investment Officer of the Japan Government Pension Investment Fund, and a famous critic of shortsellers. Long-time Elon Musk collaborator and proponent, venture capitalist Steve Jurvetson, is leaving the Tesla board as well, though he still sits on the board of Musk’s aerospace venture, SpaceX.\n\nRemaining board members at Tesla authorized a five-for-one stock split, which the company implemented in August this year. The split followed four consecutive quarters of reported profitability for Tesla, and a season where Musk clashed with health authorities in California over Covid-19 restrictions that temporarily shut down their vehicle assembly plant in Fremont.\n\nThe stock split also followed a huge payout to Musk, part of his unprecedented compensation package. \n\nExpecting Tesla to talk about where its metals for batteries are sourced, and to promote battery tech suitable for Semi and Cybertruck vehicles, Cannacord Genuity analyst Jed Dorsheimer wrote in a note to investors before the meeting:\n\n“The big question will be on follow through. It’s one thing to announce all these breakthroughs, which might be great for momentum algorithms, but like most things TSLA, the devil will be in the details, which sadly will take some time to play out.”\n\nCannacord maintains a “Hold” rating and a price target of $442 on shares of Tesla currently.\n\nShares of the electric car maker are up more than 400% year-to-date.\n\nhttps://www.cnbc.com/2020/09/22/elon-musk-at-battery-day-tesla-deliveries-to-rise-30percent-to-40percent-in-2020.html",
        "created_utc": 1600817049.0,
        "subreddit_name": "stocks",
        "comments": 461
    }
]