[
    {
        "title": "Netflix third-quarter subscribers barely beat estimates as ad-tier members jump 35%",
        "score": 341,
        "url": "https://www.reddit.com/r/stocks/comments/1g609hk/netflix_thirdquarter_subscribers_barely_beat/",
        "content": "Netflix posted third-quarter earnings that beat on the top and bottom line Thursday after the bell.\n\nThe company’s advertising business continued to grow in the third-quarter, with ad-tier memberships jumping 35% quarter-over-quarter. It’s on track to launch this service in Canada in the coming quarter and more broadly in 2025.\n\nHere are the results:\n\nEarnings per share: $5.40 compared with the $5.12 expected by LSEG.\n\nRevenue: $9.83 billion compared with the $9.77 billion expected by LSEG.\n\nPaid memberships: 282.7 million compared to 282.15 million expected, according to StreetAccount\n\nSource: https://www.cnbc.com/2024/10/17/netflix-nflx-earnings-q3-2024.html",
        "created_utc": 1729196097.0,
        "subreddit_name": "stocks",
        "comments": 146
    },
    {
        "title": "Google CEO names new search and ads boss, slides predecessor to chief technologist",
        "score": 216,
        "url": "https://www.reddit.com/r/stocks/comments/1g5yk19/google_ceo_names_new_search_and_ads_boss_slides/",
        "content": "Google is replacing Prabhakar Raghavan, the company’s search and ads boss, with longtime Google executive Nick Fox.\n\nThe move was announced by Alphabet CEO Sundar Pichai, who said in a blog post on Thursday that Raghavan will be moving into the role of chief technologist after 12 years of leading teams across the search company. Raghavan will continue to report to Pichai in the new role, the company told CNBC in a statement.\n\n“Prabhakar has decided it’s time to make a big leap in his own career,” Pichai wrote in the post. “In this role, he’ll partner closely with me and Google leads to provide technical direction and leadership and grow our culture of tech excellence.”\n\nThe move comes as Google continues to restructure its teams to move more quickly in the artificial intelligence arms race, where it faces increased competition. The company is also dealing with several antitrust lawsuits related to its search and ads business.\n\nFox has long been a member of Raghavan’s leadership team. He will be leading Google’s Knowledge and Information division, which includes the company’s search, ads and commerce products, Pichai said.\n\nA Google employee since 2003, Fox has been vice president for product and design for the company’s Assistant product in recent years. He previously worked within the company’s ads business unit.\n\n“Over the past few years, Nick has been instrumental in shaping Google’s AI product roadmap and collaborating closely with Prabhakar,” Pichai wrote.\n\nRaghavan led the knowledge and information unit since 2018. Earlier this year, he told employees to prepare for a different market reality because “things are not like they were 15-20 years ago,” CNBC reported.\n\nAdditionally, Pichai announced that the team working on Google’s Gemini app, which includes Google’s AI direct-to-consumer products, will join Google DeepMind under AI head Demis Hassabis.\n\n“Bringing the teams closer together will improve feedback loops, enable fast deployment of our new models in the Gemini app,” Pichai wrote.\n\nThe move also means the Assistant teams focused on devices and home experiences will move to the Platforms and Devices unit “so they can sit closer to the product surfaces they’re building for,” Pichai wrote.\n\nSource: https://www.cnbc.com/2024/10/17/google-replaces-its-search-and-ads-boss.html",
        "created_utc": 1729191685.0,
        "subreddit_name": "stocks",
        "comments": 47
    },
    {
        "title": "ASML’s issues should have been a positive for TSMC and Intel",
        "score": 79,
        "url": "https://www.reddit.com/r/stocks/comments/1g5kjql/asmls_issues_should_have_been_a_positive_for_tsmc/",
        "content": "If the China export restrictions are the primary cause for ASML’s weakness, then that must mean that TSMC and Intel will have an easier time acquiring ASML machines. \n\nOne of the biggest costs for chip fabs is the machines. It’s the reason TSMC has not invested heavily into high NA EUV machines because they are simply too expensive to make sense economically right now. \n\nWith nearly half of ASML’s market wiped out over night, TSMC and Intel should have a much easier time securing these machines faster and at a lower price due to less competition. \n\nTherefore, the analysts were wrong. They should have saw this and bought up TSMC and Intel instead of selling all semiconductor stocks after ASML’s report. ",
        "created_utc": 1729146444.0,
        "subreddit_name": "stocks",
        "comments": 40
    },
    {
        "title": "YoY: 56%, YTD: 35.6% - Living at home changed my life",
        "score": 634,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1g5z896/yoy_56_ytd_356_living_at_home_changed_my_life/",
        "content": "\nTL;DR - Dad got cancer - so I went ham on investing \n\nI've been a long time lurker of this sub (and I never really post on reddit in general), but I didn't know where else to post this. I don't do options so maybe this is the wrong place lmao.\n\nI moved back home to my parents place when my dad was diagnosed with terminal brain cancer. Truthfully this has been the worst year of my life (and his obviously) in a lot of ways, but I've been investing since I was 16 (I'm 25 now). My dad worked in equities, so when he lost his ability to communicate effectively with me (and since I had significantly more income because I'm not paying rent) - I truthfully went ballistic on investing.\n\nPretty much said fuck it, I'm living at home I don't need a 6 month emergency fund till I move out and went all-in. Granted 40% of my portfolio not listed here is in a 401k account entirely in the S&P 500 (set & forget just in case my equities went to hell as with the rest of my life lol).\n\nI believe in the margin of safety when investing. I like to invest in high-quality companies that generate lots of cash as the backbone of my portfolio. Since 2021 (before my dad got this cancer shit), I spoke with him and he basically said just look at the fundamentals of a company and invest in growth companies that you think will be around in 5-10 years. I look for value within growth stocks (i know paradoxical). Some of my icons in investing are David Tepper & Michael Burry. Again below is all my own experience and reflects **only** my own views and are not a recommendation of my company (corporate. disclaimer).\n\n* My portfolio is heavily weighted (85%) between several stocks: AAPL, META, MSFT, GOOGL (So fucking cheap r u kidding me sorry), NVDA, AMZN, AMD, CRM, COST, RIVN (RIP), AVGO, VOO (ik not a stock) <-- I know semi(s) are very cyclical but i believe in holding all of these companies for 5-10 years, so I don't have to worry about temp. earnings beats/misses etc. Much easier to pick a stock and hold it for a while then it is to get the timing right. Roughly at 175% return in the past 3 years. (hammered META at $100's, NVDA at $200 both in 2022)\n* Roughly 15% of my bets are moonshots (note the word bet hehe) with promise but objectively could be overvalued/bad investments: CCL/RCL (both are crushing it and between them own 75% of the cruise line market), LCID/RIVN (going to 0 bc they can't scale profitably or will make u a very happy person 3 years down the line bc R2/Atlas at 45k/50k should capture a significant portion of model y demand), TTD, DKNG/FLUT - gambling hasn't even been legalized in Cali/Texas (the biggest markets in the U.S. come on), RBLX (feels like betting against youtube in the early innings w/o realizing how much rev. they're actually recognizing), PYPL (value - cheap af (bought at $60) should turn around in a couple years)\n\nI joke I allocate like google's budget where it's 90% bread&butter and the rest are moonshots.\n\nWas very depressed (still reasonably depressed) because I'm not sure how much time my dad has. I hope in a way I can pass some of these stocks to my kid in a better place than I found it. I don't know I'm crying as I write this. Fuck my life. It is what it is. Gonna smoke a joint and drink a gin and tonic.\n\nCheers\n\nhttps://preview.redd.it/j8ym4lkamdvd1.png?width=1198&format=png&auto=webp&s=70c707919d6301944c8ff8cbbcb33ed03c9e6837",
        "created_utc": 1729193419.0,
        "subreddit_name": "wallstreetbets",
        "comments": 133
    },
    {
        "title": "Apple Preparing to Add ChatGPT Integration to Siri",
        "score": 1268,
        "url": "https://www.macrumors.com/2024/10/17/apple-siri-chatgpt-integration/",
        "content": "",
        "created_utc": 1729208656.0,
        "subreddit_name": "apple",
        "comments": 198
    },
    {
        "title": "Apple Secretly Worked With China’s BYD on Long-Range EV Battery",
        "score": 752,
        "url": "https://www.bloomberg.com/news/articles/2024-10-16/apple-secretly-worked-with-china-s-byd-on-long-range-ev-battery",
        "content": "",
        "created_utc": 1729161108.0,
        "subreddit_name": "apple",
        "comments": 98
    },
    {
        "title": "Apple Music Now Lets Artists Create Playlists Based on Concert Set Lists",
        "score": 692,
        "url": "https://www.macrumors.com/2024/10/17/apple-music-concert-set-list-playlists/",
        "content": "",
        "created_utc": 1729195139.0,
        "subreddit_name": "apple",
        "comments": 45
    }
]