[
    {
        "title": "Apple today is a good example why the markets are so hard.",
        "score": 1850,
        "url": "https://www.reddit.com/r/stocks/comments/yfwujj/apple_today_is_a_good_example_why_the_markets_are/",
        "content": "Whenever there's a large upside or downside move in the markets, everyone's thoughts are, \"Why did the markets go up/down today?\"\n\nAnd there are a myriad of reasons why. But at the end of the day, the simplest and truest answer is, \"Because there were more buyers than sellers\" (or vice versa).\n\nApple's earnings yesterday was definitely a sigh of relief for investors, cinching a much needed win in this week of big-tech earnings misses.\n\nHowever, does it deserve a ~8% upside move in a single day? I don't know, but that's a $200 billion move in market cap, larger than any company outside of the top 50 largest companies globally. Don't quote me on this, but I think this is probably the biggest percentage day gain for $AAPL in more than 10 years. Interesting.\n\nSome folks think the move was exacerbated by today being EOY for mutual funds, so maybe there's a large one-sided buying skew from big fund positioning. Other folks think that it's just another day of a gamma-squeeze with 0 DTE calls being hammered all day long. Maybe the earnings was really THAT good in the grand scheme of big tech earnings misses this quarter. At the end of the day, trying to find rhyme or reason for moves on a single day basis will drive you mad. Trying to find rhyme or reason for moves on a weekly basis will also drive you mad.\n\nWith all that being said, what's peculiar about this situation is that $AAPL now is the most expensive it's ever been relative to the NASDAQ 100. While trying to find reasons for moves in markets is impossible, what is understandable is the ebb and flow of markets during a bear market. Similarly to the dot-com bubble, you had the trashiest stocks implode many months before the rest of the market tanked. Before full capitulation happened, there was a flight to safety in big-cap tech stocks as well. In bear markets like these, it's human nature to preserve what you have and \"fly\" to safety. Apple is the safety net everyone is flocking to, and I believe it will be painful.\n\nFull disclaimer, I've been bearish all year, but bullish over the past couple weeks. Earlier this week I actually thought THE bottom might be in for markets, and the worst had probably come. But today's move in $AAPL has changed my view and I now believe there is still one last shoe to drop soon in the markets.\n\nThere is currently a bubble in \"safe\" value large-cap stocks, and I believe this cohort will drive the overall market lower over the next few months. Apple is the ring-leader, but there are several others that at interesting valuations. (I personally think buying beaten-down growth tech is much more attractive than these). Altria ($MO) 47 P/E, Clorox ($CLX) 38 P/E, Kraft Heinz ($KHC) 38 P/E, Colgate-Palmolive ($CL) 32 P/E, Hershey ($HSY) 30 P/E, PepsiCo ($PEP) 26 P/E. These are brands we all know, and they are trading at eye-watering levels, driven by a \"flight to safety\" by big funds who have no choice during this year's turmoil.\n\nI think the moves in these \"value\" stocks can be attributed to a single philosophy that I've heard from folks who were fund managers in a different generation. \"You won't be fired for buying IBM\". Underperforming the benchmark because you invested in risky stocks like $CVNA and $W? Fired. Underperforming the benchmark because you invested in quality stocks like $CLX and $PEP? You'll still have your job.",
        "created_utc": 1666981859.0,
        "subreddit_name": "stocks",
        "comments": 400
    },
    {
        "title": "Apple Music pulls Kanye West ‘Essentials’ playlists, first streaming service to take action",
        "score": 11276,
        "url": "https://9to5mac.com/2022/10/28/apple-music-kanye-west/",
        "content": "",
        "created_utc": 1666970212.0,
        "subreddit_name": "apple",
        "comments": 949
    }
]