[
    {
        "title": "Apple today is a good example why the markets are so hard.",
        "score": 1850,
        "url": "https://www.reddit.com/r/stocks/comments/yfwujj/apple_today_is_a_good_example_why_the_markets_are/",
        "content": "Whenever there's a large upside or downside move in the markets, everyone's thoughts are, \"Why did the markets go up/down today?\"\n\nAnd there are a myriad of reasons why. But at the end of the day, the simplest and truest answer is, \"Because there were more buyers than sellers\" (or vice versa).\n\nApple's earnings yesterday was definitely a sigh of relief for investors, cinching a much needed win in this week of big-tech earnings misses.\n\nHowever, does it deserve a ~8% upside move in a single day? I don't know, but that's a $200 billion move in market cap, larger than any company outside of the top 50 largest companies globally. Don't quote me on this, but I think this is probably the biggest percentage day gain for $AAPL in more than 10 years. Interesting.\n\nSome folks think the move was exacerbated by today being EOY for mutual funds, so maybe there's a large one-sided buying skew from big fund positioning. Other folks think that it's just another day of a gamma-squeeze with 0 DTE calls being hammered all day long. Maybe the earnings was really THAT good in the grand scheme of big tech earnings misses this quarter. At the end of the day, trying to find rhyme or reason for moves on a single day basis will drive you mad. Trying to find rhyme or reason for moves on a weekly basis will also drive you mad.\n\nWith all that being said, what's peculiar about this situation is that $AAPL now is the most expensive it's ever been relative to the NASDAQ 100. While trying to find reasons for moves in markets is impossible, what is understandable is the ebb and flow of markets during a bear market. Similarly to the dot-com bubble, you had the trashiest stocks implode many months before the rest of the market tanked. Before full capitulation happened, there was a flight to safety in big-cap tech stocks as well. In bear markets like these, it's human nature to preserve what you have and \"fly\" to safety. Apple is the safety net everyone is flocking to, and I believe it will be painful.\n\nFull disclaimer, I've been bearish all year, but bullish over the past couple weeks. Earlier this week I actually thought THE bottom might be in for markets, and the worst had probably come. But today's move in $AAPL has changed my view and I now believe there is still one last shoe to drop soon in the markets.\n\nThere is currently a bubble in \"safe\" value large-cap stocks, and I believe this cohort will drive the overall market lower over the next few months. Apple is the ring-leader, but there are several others that at interesting valuations. (I personally think buying beaten-down growth tech is much more attractive than these). Altria ($MO) 47 P/E, Clorox ($CLX) 38 P/E, Kraft Heinz ($KHC) 38 P/E, Colgate-Palmolive ($CL) 32 P/E, Hershey ($HSY) 30 P/E, PepsiCo ($PEP) 26 P/E. These are brands we all know, and they are trading at eye-watering levels, driven by a \"flight to safety\" by big funds who have no choice during this year's turmoil.\n\nI think the moves in these \"value\" stocks can be attributed to a single philosophy that I've heard from folks who were fund managers in a different generation. \"You won't be fired for buying IBM\". Underperforming the benchmark because you invested in risky stocks like $CVNA and $W? Fired. Underperforming the benchmark because you invested in quality stocks like $CLX and $PEP? You'll still have your job.",
        "created_utc": 1666981859.0,
        "subreddit_name": "stocks",
        "comments": 400
    },
    {
        "title": "Apple Music pulls Kanye West ‘Essentials’ playlists, first streaming service to take action",
        "score": 11276,
        "url": "https://9to5mac.com/2022/10/28/apple-music-kanye-west/",
        "content": "",
        "created_utc": 1666970212.0,
        "subreddit_name": "apple",
        "comments": 949
    },
    {
        "title": "How I went from 6 out of 8 weeks being red to now 8 very profitable green weeks in a row",
        "score": 277,
        "url": "https://www.reddit.com/r/Daytrading/comments/yg3n8p/how_i_went_from_6_out_of_8_weeks_being_red_to_now/",
        "content": "I have gotten a lot of questions of “how did you go from 6 out of 8 weeks being red to 8 green weeks in a row? “How is it even possible to go from losing that much to winning like this now?” \n\n&#x200B;\n\nhttps://preview.redd.it/xx3rrnlqqmw91.png?width=975&format=png&auto=webp&s=7dd95988498a8faf35807aaaf7e4ebb8c6d779ee\n\n**Stop losses/ Risk management**\n\nThe answer sadly was right in front of me the whole time… risk management. I am someone that preaches and preaches risk management and small gains till im blue in my server. However, I failed to practice what I preached. \n\nLets take a look at the win % of July and August 71.76% vs. my current 84.16% win rate currently. Yes a 84.16% win rates impressive in my opinion but with my strategy I can and should be profitable with a 71.76% win rate? So why was I note profitable? Lets take a look at a few weeks of trades and its pretty easy to see why. \n\nNote- for those of you who question why I use excel to show my losses/ wins this is why cause I can analyze things in a way that TOS does not let me. \n\nNow what do you see? In terms of stop losses there were no stop losses. I thought I was smarter then the chart. I thought that I just got a bad bounce and it would come back to me. What I ended up doing was putting myself in such a whole that I couldn’t recover. \n\nFor the week on the left had I closed stuff out at -20% I would have finished the week at +$1974 and on the right I would have closed the week at $1890. Same win rate… but completely different result… So not even changing the loss from a win BUT changing where I close out my loss (and more importantly accepting my loss at -20%) would immediately have turned two of those 6 week green (and actually would have turned every one of those 6 weeks green and even looking back from January to June I believe 90% of my weeks had I closed out at -20% on my losses… and not increased my win rate or anything else… I would have been profitable on every single week.). \n\nSo when people ask me “what did you change?” “its impossible for someone to have 8 green weeks!” “its impossible for someone to recover like that!”\n\nI say no its not… I say and I say this to 90% of people who blow their accounts up or have a green week go red… “where was your stop loss?”   \n \n\nRisk management and mitigating our losses is about 100x more important then taking proifts. There are actually numerous strategies out there that can have 40-60% win rates BUT with proper stop losses can have extremely profitable results. \n\nThere is a rule called the 10/20 rules… the goal should be 10% profits and we should use a HARD -20% stop loss. We can not think about it and we can not try to out smart it. This is another reason I stopped playing 0dte lottos as they would result in -90% losses I could recover. \n\nHonestly I could stop right here but there is a few other minor things that have helped me.\n\n**Position sizing**\n\nI have talked about this since forever but I always say that your options account should be 10% of your total investment portfolio. That means if you have $10,000 to invest (for simple numbers) you should really only have about $1000 in your options account. And of that 10% you should only be trading with at MOST 10% of the 10%. That means each position size should only be about $100. \n\nWhy? Why so small? We have to assume the worst. If we use $100/ trade on a cash only account (which if you haven’t switched to a cash only account SWITCH NOW!) then we can make about 10 trades per day. That means with the 10/20 rule and about a 70%-80% win rate we can remain profitable every day. Its about quality quantity not one quality trade. This is a mistake I made in July and August also. \n\nI was so focused on making one good trade that I would end up making a bad trade or wait so long to enter that I would get stopped out immediately. \n\nSomething I did and HIGHLY recommend people do is to size heavily down in times of bad trading… when I recognized in June and July that I was struggling I sized down by 1/5th per trade. And then I sized down another ½ in the really bad times. From there focusing on the % gains not the $ gained I was able to gather myself and now I have gone from $500/ trade to $1000/ trade to $1500/ trade and now im pretty content at about $2000-$2500 per trade and I don’t think I will size up again for a while. Maybe another month or so of consistency and I will size back up. \n\nThe number one goal should always be capital preservation. Remember the light at the end of the tunnel is the end of this bear market and a return to the “easy” times of a bull market. \n\n**Win rate doesn’t= profit** \n\nThis is something I wish I would have taken to heart even earlier then I did. I had a really respected trader tell me this all the time when I was so proud of my 80% win rate. But he reminded me (and so did my weekly log) that win rate doesn’t equal profitable. There are actually a lot of strats out there where you can be holding a 40-60% win rate and still make money. This plays into the first and most important point of all of this… STOP LOSSES ARE KING. \n\n**Trusting myself**\n\nThis is the last point I want to make. In this market we have to trust ourselves and have confidence in our trades. Something that I experienced in this bear market for the first time was lack of confidence in myself. There was so many times where I would enter a trade (back before my hard set stop loss days) and I would get a rogue $3 green candle (like we saw this week) that would wreck my position beyond belief. I would finally take my loss and then we would see some wild bounce $6 the other way back in my favor. Where had I just held I would end up green. \n\nThis is where this 2022 market is absolutely brutal and I have seen some pretty decent traders wash themselves out of this market. When we lose confidence in ourselves we lose confidence in the plays we make. I struggled with this (and honestly some of it was pressure on myself to be perfect and to never lose cause of the server and I have a lot of eyes on me). But I know im not perfect and I know no matter how perfect a setup works in the end we will never win everytime. Sure it was fun when I had like a 35 green trades in a row win streak but honestly it was just luck. \n\nWhat I have learned is when we recognize a trend we do not fight momentum nor do we fight the trend. BUT it is okay to say I don’t like this setup, I don’t like this day, or this isn’t my ideal setup and to sit cash gang. There are so many people who fail to understand the importance of the fact that cash IS a position. You cant lose money sitting cash. WAIT for YOUR setup to come to you. \n\nAnother thing I struggled with for a while was traders paralysis. I had so many things I was waiting to be “perfect” before I entered a trade that by time the crystals would align I would have missed the move already. This plays into my last and final point. \n\n**Aggressive without being wreckless**\n\nSpeaking of trader paralysis what I found is that in waiting for everything to be perfect by time I got into the trade that initial little pop that gets you that 10% in 30 seconds had already pasted and I was left with the bread crumbs of bread crumbs waiting for the 10% pop that never came. \n\nI found that through those red weeks and endless days and weekends backtesting and backtesting and backtesting I found what works for me. What is the post HIGH PROBABILITY risk to reward plays. In my server often times you’’ll hear me play these “bounce or die” or “die or bounce” plays. \n\nThat is what I mean about high probability plays. Often times these are when the indicators are favoring lets say a call and SPY 15min chart has retraced to a key support and is sitting on it. Everything points to a bounce back up but its not perfect yet. \n\nI would rather take a play that has a high probability of success then wait so long for confirmation that I end up never seeing profits. I trade a fine line between aggressive and wreckless. With the 10/20 rule a 0dte gives you enough wiggle room to be slightly off on timing with being aggressive BUT if you are too aggressive (aka wreckless) then you end up just stopping out and then it plays out how you expected. \n\nI hope this helps you guys if you have any questions let me know!",
        "created_utc": 1666999138.0,
        "subreddit_name": "Daytrading",
        "comments": 58
    },
    {
        "title": "Why is AAPL poppin' today?",
        "score": 9,
        "url": "https://www.reddit.com/r/AAPL/comments/yfr0nf/why_is_aapl_poppin_today/",
        "content": "",
        "created_utc": 1666970463.0,
        "subreddit_name": "AAPL",
        "comments": 16
    }
]