[
    {
        "title": "Amazon beats, Earnings: $12.37 vs $7.41 expected, Revenue: $96.15b vs $92.7b expected",
        "score": 1589,
        "url": "https://www.reddit.com/r/investing/comments/jkhs1v/amazon_beats_earnings_1237_vs_741_expected/",
        "content": "(CNBC) Amazon reported better-than-expected third-quarter results after the bell on Thursday, including soaring profits and 37% revenue growth.\n\nThe stock bounced around in extended trading after Amazon provided a wide guidance range for the fourth quarter.\n\n* **Earnings:** $12.37 vs $7.41 per share expected, according to analysts surveyed by Refinitiv\n* **Revenue:** $96.15 billion vs $92.7 billion expected, according to analysts surveyed by Refinitiv\n\nAmazon  said sales in the fourth quarter will be between $112 billion and $121  billion, which comes out to growth of 28% to 38% from a year earlier.  Analysts were expecting revenue of $112.3 billion. \n\nThe company  forecast operating income of $1 billion to $4.5 billion, assuming about  $4.0 billion of costs tied to COVID-19. That's a step up from the second quarter,  when Amazon said it would spend more than $2 billion on  coronavirus-related measures, including procuring personal protective  equipment, enhanced cleaning of its facilities and wage increases. \n\nAmazon  continues to be one of the biggest beneficiaries of the pandemic, as  consumers flocked to the site for essential goods, groceries and  household items. Amazon is expected to face even greater demand heading  into the holiday season, with shoppers likely to do the bulk of their  gift buying online instead of making trips to the store.\n\n\"We're  seeing more customers than ever shopping early for their holiday gifts,  which is just one of the signs that this is going to be an unprecedented  holiday season,\" Amazon CEO Jeff Bezos said in a statement.\n\nBezos  also touted Amazon's recent job creation and treatment of warehouse  workers, which has been a subject of scrutiny in recent months. The  Amazon CEO pointed to Amazon's $15 minimum wage and challenged other  large employers to \"make the jump to $15.\"\n\nAmazon is one of few companies that has continued to grow its headcount  amid a broader economic downturn due to the coronavirus crisis. The  company now counts more than 1.12 million full-time employees across the  globe, an increase of 50% year over year. That figure doesn't include  Amazon's network of contractors and temporary workers. \n\nAmazon's cloud-computing unit, Amazon Web Services, generated  sales of $11.6 billion for the quarter, up 29% year over year and in  line with analysts' estimates, according to FactSet. Operating income in  the segment of $3.54 billion topped estimates of $3.45 billion. The  segment was helped by millions of people working from home.  \n\nThe  company's \"other\" category, which is primarily comprised of its  advertising business, saw revenue of $5.4 billion, up 51% year over  year. Subscription services, which includes revenue from Prime  memberships, climbed 33% year over year to $6.58 billion.\n\nOnce  again, third-party sales grew more than Amazon's first-party business.  Third-party sales increased 55% year-over-year, while first-party sales  grew 38% year-over-year. Sales fell 10% in Amazon's physical store unit,  which includes Whole Foods Market.\n\nAmazon shares are up 74% this year, the best performance among the five most valuable U.S. tech companies. \n\nThree of those companies — Apple, Alphabet and Facebook — also reported quarterly results after the bell on Thursday and all exceeded analysts' estimates.\n\nAmazon will hold a call with investors to discuss its third-quarter results starting at 5:30 p.m. ET. \n\n[https://www.cnbc.com/2020/10/29/amazon-amzn-earnings-q3-2020.html](https://www.cnbc.com/2020/10/29/amazon-amzn-earnings-q3-2020.html)\n\n&#x200B;",
        "created_utc": 1604002604.0,
        "subreddit_name": "investing",
        "comments": 275
    },
    {
        "title": "Apple CEO Tim Cook 'More Exciting Things' in Store For This Year",
        "score": 5498,
        "url": "https://www.macrumors.com/2020/10/29/tim-cook-more-in-store-this-year/",
        "content": "",
        "created_utc": 1604006540.0,
        "subreddit_name": "apple",
        "comments": 713
    }
]