[
    {
        "title": "Tesla down 33% ytd, just closed 162, market cap 517bil. Well's Fargo downgraded to 125.",
        "score": 2577,
        "url": "https://www.reddit.com/r/stocks/comments/1beuyyd/tesla_down_33_ytd_just_closed_162_market_cap/",
        "content": "***On Fortune****:* \n\n\"*Wall Street’s stance on Tesla Inc. worsened further on Wednesday as yet another analyst warned about risks to sales, and said its strategy of cutting prices to boost demand was losing its effectiveness.*  \n*The electric vehicle maker’s growth in its core markets has moderated, Wells Fargo analyst Colin Langan wrote in a note to clients Wednesday, as he downgraded the stock to the equivalent of a sell rating. Langan expects Tesla’s sales volumes to be flat this year and to fall in 2025.* \n\n*Elon Musk’s company is a “growth company with no growth,” Langan wrote. He highlighted that sales volumes rose only 3% in the second half of 2023 from the first half, while prices fell 5%.*\r  \n\r  \n*Tesla analysts are getting increasingly wary, and the share of bullish ratings on the stock has dropped to the lowest since April 2021. Sentiment deteriorated after the company in January said its growth will be “notably lower” this year, while other automakers, EV suppliers and even rental-car companies have sounded similarly cautious comments about the near-term demand for EVs.*\r  \n\r  \n*As a pure-play EV company with an eye-wateringly high valuation, Tesla shares have taken a serious hit. The stock has already fallen 29% this year through Tuesday’s close, placing it among the worst performers on the S&P 500 Index. The Austin-based company fell as much as 2.8% by 9:32 a.m. in New York.*\r  \n\r  \n*This year’s selloff has wiped more than $224 billion from the company’s market value through its last close, and pushed it off the list of the 10 biggest companies on the S&P 500.* \r  \n\r  \n*Even after the decline, the stock still trades at 55 times its forward earnings, compared to the average of about 31 for the Bloomberg Magnificent 7 Price Return Index.* \r  \n\r  \n*“While an EV and battery technology leader, Tesla screens poorly relative to Mag 7 peers,” Wells Fargo’s Langan said, noting the valuation discrepancy. The analyst lowered his 2024 profit estimate for the company to $2 a share from $2.40. That compares to analysts’ average expectation of $3.03 a share for the year, according to data compiled by Bloomberg.*\r  \n\r  \n*Still, some analysts see a bright future for the company, and the drop in shares reflect an overly bearish outlook.*\r  \n\r\n\n*“The demand story for EVs globally has clearly moderated, however we believe Tesla is on the broader trajectory to see growth and margin improvement return to the story over the coming quarters,” Wedbush analyst Dan Ives wrote in a note Wednesday. “Now is not the time to throw in the towel on Tesla*.” \n\n***Ross Gerber on Yahoo finance***: \"*The original story that I think most investors bought into with Tesla didn't really include Elon and Twitter. And... for a long time, we all hoped that it really wouldn't affect Tesla and the demand for its products,\" Gerber says. \"We all know that that has now happened. The demand for Tesla products is obviously lower. They've had to discount and do many things that hurt margins and returns and, ultimately, profits for Tesla*.\"\n\n***....End of Article...***\n\n***Source****:* [*https://fortune.com/2024/03/13/elon-musk-tesla-growth-company-no-growth-wells-fargo-downgrade/*](https://fortune.com/2024/03/13/elon-musk-tesla-growth-company-no-growth-wells-fargo-downgrade/)\n\n*https://finance.yahoo.com/video/tesla-ceo-elon-musk-hurting-165507347.html*",
        "created_utc": 1710447673.0,
        "subreddit_name": "stocks",
        "comments": 700
    },
    {
        "title": "Apple Said iPhone Driver's Licenses Would Expand to These 8 U.S. States… Two Years Ago",
        "score": 1787,
        "url": "https://www.macrumors.com/2024/03/14/apple-wallet-app-ids-slow-adoption/",
        "content": "",
        "created_utc": 1710429851.0,
        "subreddit_name": "apple",
        "comments": 305
    },
    {
        "title": "Spotify says its iPhone app updates in the EU are getting held up by Apple",
        "score": 817,
        "url": "https://www.theverge.com/2024/3/14/24100944/spotify-ios-app-update-eu-apple-dma",
        "content": "",
        "created_utc": 1710452755.0,
        "subreddit_name": "apple",
        "comments": 191
    }
]