[
    {
        "title": "Google Loses DOJ Antitrust Suit Over Search",
        "score": 684,
        "url": "https://www.reddit.com/r/stocks/comments/1ekw0c7/google_loses_doj_antitrust_suit_over_search/",
        "content": "Google’s payments to make its search engine the default on smartphone web browsers violates US antitrust law, a federal judge ruled Monday, handing a key victory to the Justice Department.\n\nJudge Amit Mehta in Washington said that the Alphabet Inc. unit’s $26 billion in payments effectively blocked any other competitor from succeeding in the market.\n\nAntitrust enforcers alleged that Google has illegally maintained a monopoly over online search and related advertising. The government said that Google has paid Apple Inc., Samsung Electronics Co. and others billions over decades for prime placement on smartphones and web browsers. This default position has allowed Google to build up the most-used search engine in the world, and fueled more than $300 billion in annual revenue largely generated by search ads.\n\nThe case is the first antitrust trial pitting the federal government against a US technology company in more than two decades. \n\nhttps://www.bloomberg.com/news/articles/2024-08-05/google-loses-doj-antitrust-suit-over-search\n\nGoogle will face another antitrust trial September 9th, this time over ad tech. The company will face off in federal court against the US Department of Justice in Virginia, after the DOJ claimed in January 2023 that Google violated US antitrust law by illegally monopolizing the digital ads market, allegedly boosting its profits while raising costs for advertisers. Google has said the DOJ’s reasoning “would slow innovation, raise advertising fees and make it harder for thousands of small businesses and publishers to grow.”\n\nhttps://www.theverge.com/2024/2/5/24062497/google-will-face-another-antitrust-trial-september-9th-this-time-over-ad-tech",
        "created_utc": 1722884407.0,
        "subreddit_name": "stocks",
        "comments": 208
    },
    {
        "title": "Reminder: Timing the Market Is Impossible",
        "score": 303,
        "url": "https://www.reddit.com/r/stocks/comments/1ekpsml/reminder_timing_the_market_is_impossible/",
        "content": "For those of you panic selling (or thinking about selling) on a day like today, please carefully READ and ABSORB the below (quote & informative chart):\n\n>78% of the stock market’s best days occur during a bear market or during the first two months of a bull market. **If you missed the market’s 10 best days over the past 30 years, your returns would have been cut in half. And missing the best 30 days would have reduced your returns by an astonishing 83%.**\n\n[In chart form](https://www.hartfordfunds.com/practice-management/client-conversations/managing-volatility/timing-the-market-is-impossible/_jcr_content/root/readmore/readmoreresponsivegrid/mainfullgrid_1115893_1862387216/mainFull_container/highlighter/highlighter_container/column_control/content1/highlighter_copy/highlighter_container/image.coreimg.80.650.png/1708032823738/ccwp073-3.png)\n\nPrint this out and put it beside your computer or take a screenshot and save it on your cell phone as a regular reminder.  Of note though - this advise primarily applies to investing in broad market indicies (i.e. S&P/Nasdaq, not an individual stock or crypto)\n\n[Source](https://www.hartfordfunds.com/practice-management/client-conversations/managing-volatility/timing-the-market-is-impossible.html)\n\nFYI:  Some other interesting reading for a day like today (to learn)\n\n>When Stocks Are Hitting All-Time Highs, Is It Too Late to Jump In?\n\n[Source](https://www.hartfordfunds.com/practice-management/client-conversations/investing-for-growth/when-stocks-are-hitting-all-time-highs-is-it-too-late-to-jump-in.html?ite=8672&ito=3289&itq=9cadb492-f274-48c9-b045-4561dbcc3909&itx%5Bidio%5D=20704278)\n\n>The Risk of Playing It Too Safe With Your Investments\n\n[Source](https://www.hartfordfunds.com/practice-management/client-conversations/investing-for-growth/the-risk-of-playing-it-too-safe-with-your-investments.html?ite=8769&ito=3289&itq=9cadb492-f274-48c9-b045-4561dbcc3909&itx%5Bidio%5D=20704278)\n\n>10 Things You Should Know About Recessions. \"Although down markets sometimes coincide with recessions, stocks actually produced positive returns during seven of the 13 recessions since 1945. In fact, the S&P 500 Index gained 3.68% on average during recessions\"\n\n[Source](https://www.hartfordfunds.com/practice-management/client-conversations/managing-volatility/10-things-you-should-know-about-recessions.html?ite=7353&ito=3289&itq=f8f38cc7-5776-4010-8c99-a36bfc83a830&itx%5Bidio%5D=20704278)",
        "created_utc": 1722869566.0,
        "subreddit_name": "stocks",
        "comments": 112
    },
    {
        "title": "Joining this sub was the worst decision i’ve ever made",
        "score": 8780,
        "url": "https://i.redd.it/pywjadrtyugd1.jpeg",
        "content": "Bought SPY and AAPL puts at open. Did not end well",
        "created_utc": 1722869250.0,
        "subreddit_name": "wallstreetbets",
        "comments": 1338
    },
    {
        "title": "iPhone Driver's License Support Coming Soon to California",
        "score": 2292,
        "url": "https://www.macrumors.com/2024/08/05/iphone-drivers-license-support-coming-california/",
        "content": "",
        "created_utc": 1722869673.0,
        "subreddit_name": "apple",
        "comments": 381
    },
    {
        "title": "Apple's SuperDrive for reading disks seemingly discontinued",
        "score": 630,
        "url": "https://9to5mac.com/2024/08/05/apple-superdrive-discontinued/",
        "content": "",
        "created_utc": 1722897481.0,
        "subreddit_name": "apple",
        "comments": 173
    },
    {
        "title": "What to buy at this huge discount?",
        "score": 577,
        "url": "https://www.reddit.com/r/stocks/comments/1ekhi87/what_to_buy_at_this_huge_discount/",
        "content": "Seeing the potential large correction coming within the coming month(s), where should I be throwing my cash reserves?\n\nI’m seeing NVDA potentially trail back down to 75-78 within this correction and SPY move to 460’s. But what should I put my money in to get maximum value out of this huge buying opportunity? Should I just play it safe and DCA SPY or potentially double my savings quickly by nabbing NVDA at crazy cheap?\n\n",
        "created_utc": 1722841680.0,
        "subreddit_name": "stocks",
        "comments": 428
    },
    {
        "title": "Suicide prevention hotline - Dial 998",
        "score": 4988,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1ekfuy9/suicide_prevention_hotline_dial_998/",
        "content": "The correct number is 988. calls on glasses\n\npls post losses when mkt opens. Thank you   \ncurrently down by one chromosome and ~~$800~~ ~~1200~~ picked up 100 intel for my favorite grandson   \n  \nedit: i forgot i have two other portfolios, we fucked   \n  \nedit2: UVXY hit 55. congrats to that regard with 55c  \n  \nedit3: Spy to 500 or nah?\n\nedit4: correct US number is 988\n\nedit5: ~~let's go barbie, let's go party~~ see edit6\n\nedit6: can't login to my adult brokerages; they're down.... Robinhood running strong\n\nedit7: seeing some gltiches on RH \n\nedit8: this fire sale sucks, and i called off from work for this.. going to sleep. ",
        "created_utc": 1722835167.0,
        "subreddit_name": "wallstreetbets",
        "comments": 363
    },
    {
        "title": "New trade: a falling sword or buying the ultimate dip.",
        "score": 1,
        "url": "https://i.redd.it/ph7kedmr1vgd1.jpeg",
        "content": "AAPL $215 calls Aug 09 ",
        "created_utc": 1722870238.0,
        "subreddit_name": "AAPL",
        "comments": 0
    }
]