[
    {
        "title": "Berkshire unloads another chunk of Bank of America as CEO lauds Buffett ",
        "score": 284,
        "url": "https://www.reddit.com/r/stocks/comments/1fecz50/berkshire_unloads_another_chunk_of_bank_of/",
        "content": "Warren Buffett’s Berkshire Hathaway offloaded another chunk of Bank of America shares, bringing its total sales to more than $7 billion since mid-July and reducing its stake to 11%.\n\nThe Omaha-based conglomerate shed a total of 5.8 million BofA shares in separate sales on Friday, Monday and Tuesday for almost $228.7 million at an average selling price of $39.45 per share, according to a new regulatory filing.\n\nThe latest action extended Berkshire’s selling streak to 12 consecutive sessions, matching the 12 consecutive sessions from July 17 to Aug. 1.\n\nBerkshire has sold more than 174.7 million shares of the Charlotte-based bank for $7.2 billion, with 858.2 million shares remaining, or 11.1% of shares outstanding. BofA has fallen to the No.3 spot on Berkshire’s list of top holdings, trailing behind Apple and American Express. Before the selling spree, BofA had long been Berkshire’s second biggest holding.\n\nMoynihan on Buffett\n\nBuffett famously bought $5 billion worth of BofA’s preferred stock and warrants in 2011 in the aftermath of the financial crisis. He converted those warrants in 2017, making Berkshire the largest shareholder in BofA. The “Oracle of Omaha” then added 300 million more shares to his bet around 2018 and 2019.\n\nBofA CEO Brian Moynihan made a rare comment about Berkshire’s sales Tuesday, saying he has no knowledge of Buffett’s motivation for selling.\n\n“I don’t know what exactly he’s doing, because frankly, we can’t ask him. We wouldn’t ask,” he said during Barclays Global Financial Services Conference, according to a transcript on FactSet. “But on the other hand, the market’s absorbing the stock .... we’re buying a portion of the stock, and so life will go on.”\n\nShares of BofA have dipped just about 1% since the start of July, and the stock is up 16.7% this year, slightly outperforming the S&P 500.\n\nMoynihan, who has been leading the bank since 2010, praised the 94-year-old’s shrewd investment in his bank in 2011, which helped shore up confidence in the embattled lender struggling with losses tied to subprime mortgages.\n\n“He’s been a great investor for our company, and stabilized our company when we needed at the time,” he said.\n\nTo illustrate how lucrative Buffett’s investment has been, Moynihan said if investors were to buy his bank stock the same day Buffett did, they would have been able to capture the low price of $5.50 per share. The stock last traded just under $40 apiece.\n\n“He just had the guts to do it in a big way. And he did it. And it’s been a fabulous return for him. We’re happy that he gets it,” Moynihan said.\n\nSource: https://www.cnbc.com/2024/09/11/berkshire-unloads-another-chunk-of-bank-of-america-as-ceo-moynihan-lauds-buffett-as-great-shareholder.html",
        "created_utc": 1726068537.0,
        "subreddit_name": "stocks",
        "comments": 33
    },
    {
        "title": "Apple's Polishing Cloth now supports new iPhone 16 models and Apple Watch Series 10",
        "score": 9701,
        "url": "https://www.apple.com/shop/product/MW693AM/A/polishing-cloth",
        "content": "",
        "created_utc": 1726097734.0,
        "subreddit_name": "apple",
        "comments": 589
    },
    {
        "title": "Apple Makes iPhone 16 Batteries Easier to Replace to Comply With EU Law",
        "score": 1244,
        "url": "https://www.macrumors.com/2024/09/11/apple-makes-iphone-16-batteries-easier-to-replace/",
        "content": "",
        "created_utc": 1726089424.0,
        "subreddit_name": "apple",
        "comments": 138
    },
    {
        "title": "What's New With the iPhone 16 Displays",
        "score": 783,
        "url": "https://www.macrumors.com/2024/09/10/iphone-16-display-improvements/",
        "content": "",
        "created_utc": 1726061603.0,
        "subreddit_name": "apple",
        "comments": 235
    },
    {
        "title": "My winning 3% a day strategy. Makes me happy",
        "score": 521,
        "url": "https://i.redd.it/er5ohnqqv7od1.jpeg",
        "content": "Disclaimer: I have been trading this strategy pretty disciplined for only 3 days but I used a similar strategy in the past. I have plenty to learn still. I will update this post if I become unprofitable.\n\nStarted with 20k on monday, at 21,800 today. So about 3% a day if you want an average but I made $1080 today.\n\n\nTHE STRATEGY\n\nI only trade spy options on 1min. Only trade between 10am and around 12:30pm, u could push it to 1pm if needed.\n\nI dont do any of the 1:2, 1:3 shit. I just trade.\n\nI only trade reversals and trend continuations/breakouts confirmed by chart astrology and or macD.\n\nIndicators:\nMacD\nAdaptive200ema - not a normal 200ema\nYes only 2 dont overcomplicate things.\n\nStarting Words:\nPatience is the most important attribute to have in trading. Always be patient and do not let your thoughts get clouded. Also, keep trading simple.\n\nChart Astrology:\nGo back a week on the 1min, 15min, 1hr, and 4hr and put infinite lines at every support and resistance. Ur chart should look filled up but a good rule of thumb is ur lines should be more than 40cents apart (spy) unless they are really strong sup/res levels. Simply use these levels as a, will it continue through or get stopped here? This is something you really have to feel out as you trade. You only have to do this process once until whatever u r trading makes new sup/res.\n\nUnderstanding the macD:\nI used to trade using the macD and rsi but that is hell. Dont do that. The rsi overcomplicates things. Simple is always better. The macD is a god of an indicator. U can always take a trade at the top, middle, and bottom of the macD. However, be careful of the middle as sometimes it bounces off of it like a resistance. If you are trading up on the middle, make sure either spy dropped a shit ton or both macD lines cross on a completed candle. I do not trade bounces off of the middle line as they are quite unpredictable. We will get to the AEMA later but I also do not trade off of bounces on that.\n\nTrend Break:\nAs you trade wait for the perfect trade and draw trend lines. If you can make a strong trendline then trade on the trend break plus macD cross confirmed by a completed candle. Always wait for the candle confirmation. If it crosses but the candle closes without a cross u would be screwed. This is a part of risk management.\n\nIf you cant make a strong trendline follow this-\nThe Adaptive200EMA:\nAn AdaptiveEMA (AEMA) adapts to the current market conditions, including volitility. From my experience you can always trade off of a passing through this line. Again, candle close confirmation. You can use this strategy with the macD to further confirm a reversal. If the conditions are just right, you can have chart astrology, the macD, and this ema work together to give you the perfect entry to a reversal.\n\nIf the candles ever fall flat for an extended period of time, be patient as it will pick a side. Refer back to \"Trend Break.\"\n\nRisk management:\nI use around 8% per trade but risk about 1%. Doing this opens up for higher returns. I buy contracts in quantities of 20-30 depending on their price since I want to be trading with around 8%. Only 1 trade at a time. I sell if it isnt going my way and wait to buy in again. If you are patient, it will go your way. Important Thing to Note!!!! - Never buy in early trying to get in at a cheaper price, always wait for confirmation. This is better risk management than a stop loss. If it is going to go up, it will go up and vice versa.\n\nTrading spy, on a violitile day like today, buy the  options around 60-75 cents per contract. Normal days, its more like 85-100 cents per contract.\n\nThe main goal of this strategy is to be patient and wait for an AEMA cross or a strong trendline reversal. Today I traded both of these.\n\nRefer to the image for reference:\nThis mornings downfall was violent so obviously it would have to turn around at some point in the day, so I waited about an hour for the candles to break out of the trend lines. They did and fell flat for around 10min. I bought calls ($3 otm due to todays volitility) once they breached through the first resistance. Next, the macD crossed the middle. Boom, $870. (I need to learn to hold longer I sold quite quickly)\n\nMy second trade was off of the 200AEMA (light blue line). I waited for candle confirmation and didnt get it the first time. So, I waited; honestly, I went and took a shit and watched it on my phone. I saw it going back up for a retest, wiped, and got back to my computer. On first candle confirmation I bought in and again, sold too earlier but made an easy $300. Im done for the day.\n\nFor example, if I were to continue trading today I would wait for these scenerios:\nA trend line forms and I wait for the break.\nor\nThe 200AEMA creeps up to the candles as they fall flat or the candles creep down to the AEMA and wait for break.\n\nThanks for reading :)",
        "created_utc": 1726076540.0,
        "subreddit_name": "DayTrading",
        "comments": 238
    }
]