[
    {
        "title": "Berkshire unloads another chunk of Bank of America as CEO lauds Buffett ",
        "score": 284,
        "url": "https://www.reddit.com/r/stocks/comments/1fecz50/berkshire_unloads_another_chunk_of_bank_of/",
        "content": "Warren Buffett’s Berkshire Hathaway offloaded another chunk of Bank of America shares, bringing its total sales to more than $7 billion since mid-July and reducing its stake to 11%.\n\nThe Omaha-based conglomerate shed a total of 5.8 million BofA shares in separate sales on Friday, Monday and Tuesday for almost $228.7 million at an average selling price of $39.45 per share, according to a new regulatory filing.\n\nThe latest action extended Berkshire’s selling streak to 12 consecutive sessions, matching the 12 consecutive sessions from July 17 to Aug. 1.\n\nBerkshire has sold more than 174.7 million shares of the Charlotte-based bank for $7.2 billion, with 858.2 million shares remaining, or 11.1% of shares outstanding. BofA has fallen to the No.3 spot on Berkshire’s list of top holdings, trailing behind Apple and American Express. Before the selling spree, BofA had long been Berkshire’s second biggest holding.\n\nMoynihan on Buffett\n\nBuffett famously bought $5 billion worth of BofA’s preferred stock and warrants in 2011 in the aftermath of the financial crisis. He converted those warrants in 2017, making Berkshire the largest shareholder in BofA. The “Oracle of Omaha” then added 300 million more shares to his bet around 2018 and 2019.\n\nBofA CEO Brian Moynihan made a rare comment about Berkshire’s sales Tuesday, saying he has no knowledge of Buffett’s motivation for selling.\n\n“I don’t know what exactly he’s doing, because frankly, we can’t ask him. We wouldn’t ask,” he said during Barclays Global Financial Services Conference, according to a transcript on FactSet. “But on the other hand, the market’s absorbing the stock .... we’re buying a portion of the stock, and so life will go on.”\n\nShares of BofA have dipped just about 1% since the start of July, and the stock is up 16.7% this year, slightly outperforming the S&P 500.\n\nMoynihan, who has been leading the bank since 2010, praised the 94-year-old’s shrewd investment in his bank in 2011, which helped shore up confidence in the embattled lender struggling with losses tied to subprime mortgages.\n\n“He’s been a great investor for our company, and stabilized our company when we needed at the time,” he said.\n\nTo illustrate how lucrative Buffett’s investment has been, Moynihan said if investors were to buy his bank stock the same day Buffett did, they would have been able to capture the low price of $5.50 per share. The stock last traded just under $40 apiece.\n\n“He just had the guts to do it in a big way. And he did it. And it’s been a fabulous return for him. We’re happy that he gets it,” Moynihan said.\n\nSource: https://www.cnbc.com/2024/09/11/berkshire-unloads-another-chunk-of-bank-of-america-as-ceo-moynihan-lauds-buffett-as-great-shareholder.html",
        "created_utc": 1726068537.0,
        "subreddit_name": "stocks",
        "comments": 33
    },
    {
        "title": "Apple's Polishing Cloth now supports new iPhone 16 models and Apple Watch Series 10",
        "score": 9701,
        "url": "https://www.apple.com/shop/product/MW693AM/A/polishing-cloth",
        "content": "",
        "created_utc": 1726097734.0,
        "subreddit_name": "apple",
        "comments": 589
    }
]