[
    {
        "title": "AirPods Pro impressions from NYC: subway noise, coins pocket test, comfort and more",
        "score": 5358,
        "url": "https://www.reddit.com/r/apple/comments/dp91i9/airpods_pro_impressions_from_nyc_subway_noise/",
        "content": "I'm in NYC and just picked up my AirPods Pro. I've seen a couple other posts of impressions so I'll try to cover stuff that hasn't already been done to death. Feel free to ask questions.\n\n* **Apple Store:** Hot tip: If you buy them in-store, set them up next to the line of display iPhones. Absolutely hilarious to watch a full line of iPhones pop up the setup box in sync. When you press connect on yours, all the other ones will switch to \"Not your AirPods Pro.\" If that's not a \"pro\" experience, I don't know what is lol.\n* **General Comfort:** I liked the original AirPods because they felt invisible and was a little worried about these, especially because earbuds like my Jabra Elite Active 65t buds take a little finagling to get them in right and get a seal, and when you do, there's pressure. AirPods Pro really surprised me. The tips feel excellent, *almost* invisible once they're in, and I didn't have to adjust at all to get a good seal. The Ear Tip Test is cool, very quick, and to my surprise confirmed I did get a good seal. That vent makes a massive difference in comfort, holy shit. Also, small note, but they look much nicer in ear than regular AirPods. Stem is way less noticeable.\n* **Sound Quality:** If you like the way AirPods sound, you'll like these more because of the seal and reduced outside noise. Bass hits a little harder, you notice a little more detail in songs, etc. If you don't like how AirPods sound, you'll like these a little more but they won't blow you away. It's what you'd expect, nothing crazy. *EDIT: Had more time to test the sound quality. It's actually a bigger step up than I thought previously (I was mostly paying attention to ANC quality). The seal makes a big difference but honestly the drivers are just better.*\n* **Subway and Street Noise:** This is the noisiest city I've ever been in. Near the Apple Store there's a lot of construction going on near the subway—jackhammers, construction workers, huge trucks, just really annoying chaos. I walked to the Apple Store wearing my regular AirPods and it was not fun but it's what I'm used to with them. Walking back to the subway with AirPods Pro cut a *ton* of the noise. I could still hear some of it obviously but suddenly I wasn't annoyed. When I got to the subway, I walked down the steps and saw that the opposite direction train was already there, just started to turn around to see when my train would arrive, and then WHOOSH, it flew by me, arriving. I literally didn't hear it *at all*. That's crazy. All I could hear was Kanye. On the subway itself, I couldn't really hear anybody around me and could barely hear the train. I switched to a podcast and it was like having the people and train at 20% volume. With normal AirPods on the subway I'd listen to podcast at like 80-90% volume; with the Pro I literally turned it *down* to about 50-60%. Amazing. Then on the walk home, I couldn't hear anybody on the street despite seeing people chatting or talking on their phone (on speakerphone of course). It was great.\n* **Jeans Coin Pocket Test:** Saw some people worried about this as well. I can confirm that these *do* fit in my jeans coin pocket *better* than the old AirPods. The case for the old ones was more squarish, so I always had to kinda *push* it in a little bit. The Pro case on the other hand is long and narrow so you just turn it to the side and it slips in super easily. [I took a quick video here.](https://imgur.com/CeJwTUm)\n* **Negatives:** They're white so the case still picked up lint from my jeans which is annoying but oh well, the controls definitely take a hot minute to get used to, and again, the sound quality isn't gonna blow you away if you didn't already like the way AirPods sound. So far those are my only negatives.\n\nObviously it hasn't been that long but I was literally grinning while walking home because suddenly NYC wasn't as loud and annoying anymore and I could actually hear my music and hear myself think. I'm super happy with these so far.",
        "created_utc": 1572452542.0,
        "subreddit_name": "apple",
        "comments": 780
    }
]