[
    {
        "title": "With MSFT, AAPL AMZN, GOOGL and FB making up more than 1/5 of the S&P500, what are practical ways to de-risk your portfolio from this imbalance?",
        "score": 1763,
        "url": "https://www.reddit.com/r/investing/comments/ii8wsu/with_msft_aapl_amzn_googl_and_fb_making_up_more/",
        "content": "For those who subscribe to having the majority or the entirety of their equity holdings to consist of ETF/funds from the S&P 500, the impact to their portfolio as a function of any one company has increased substantially.\n\nEven with total market funds like Vanguard's VTI, these five stocks make up an outsized portion of the fund because of market cap weight.  \n\nMuch like investors using \"ex-US\" funds to increase exposure to international holdings, are there funds that are \"ex-FAANG\" so individuals can lessen the impact?  If not, would another practical strategy be to buy more non-tech sector funds as opposed to say buy more of the 400+ other S&P 500 stocks as counterweight.\n\nThoughts?\n\n------------------------------------------------------------------------\n\n**EDIT1:**  /u/exaggerate_a_point summed up my ask better than my own attempt so I'll add it here instead of responding to similar comments:\n\n> OP specifically said he/she wants to de-risk, aka diversify. It's not about not holding good companies, it's about hedging the risk if one has a bad series of news or events. It's inherently risky if your portfolio is heavily weighted in a handful of companies.\n\nAnother good summary of the ask for this discussion from /u/FerociousGiraffe :\n\n>Trying to move your portfolio away from FAANG isn’t to say those are great, successful, hugely profitable companies. You’d keep a position in them. It’s about protecting against news that will only hurt FAANG while not hurting the broader market.\n\n**EDIT2:**  For comments related to balancing with international equities, this discussion is contained for U.S. equities.  Assume whatever percentage of bonds, precious metals, digital currency, international equities or whatever you think is appropriate in a portfolio has been addressed.\n\n**EDIT3:**  Outside of suggestions like \"Why do you hate winning?\", some of the top solutions to dilute these stocks from your S&P 500 / U.S. equities part of a portfolio:\n\n* Many suggest a variation of my original post of simply adding more sector funds outside of tech.  Though this strategy will unfortunately remove many non-giant tech companies in this sector.\n\n* Many of you like /u/desquibnt suggests equal weighted ETFs like RSP.  However, RSP has a high net expense ratio of 0.20%.  \n\n* /u/TriathlonNerd suggests a reverse cap weighted ETF like RVRS.  This too has a high net expense ratio of 0.29%.\n\n* /u/BubbyginkESO and others suggests going broader than just 500 companies with low cost total market funds like Vanguard's VTI or Fidelity's FZROX.  While these 5 stocks still make up the top holdings, the effect of a larger basket of stocks also dilutes these companies.  So far, I like this simple and practical one the best.",
        "created_utc": 1598627851.0,
        "subreddit_name": "investing",
        "comments": 724
    },
    {
        "title": "How I applied Buffet's strategies to my own portfolio, +70% networth, beat SP500 by 40%",
        "score": 2196,
        "url": "https://www.reddit.com/r/stocks/comments/ihyea8/how_i_applied_buffets_strategies_to_my_own/",
        "content": "I believe I did pretty well in the market this year. My networth increased ~65% since its lowest point in March, [~350k to 620k](https://imgur.com/a/3Vu6u2f). 20k from the car I bought in March. I rolled over a 401k and it messed up Mint's reporting, hence the spike from Jul -> Aug. \n\nI beat the [SP500 by 40%](https://imgur.com/a/adeDokD) in my YOLO account, my FAANG account went from [180->300](https://imgur.com/a/kBmBp1O)\n\nI did this by following some basic investing principles, buying and holding for the most part, being patient, and only investing in areas which I have expertise in. \n\nI did not buy into the TSLA hype, nor do I play options, nor do I play crypto. \n\n#High level advice:\n=========================================\n\nI picked the 7 I agree with.\n\n1. Invest in what you know…and nothing more.\n2. Never compromise on business quality\n3. When you buy a stock, plan to hold it forever\n4. Diversification can be dangerous\n5. Most news is noise, not news (don't read articles about investing)\n8. The best moves are usually boring (buy and hold)\n10. Only listen to those you know and trust \n\nI firmly believe that anyone who follows those concepts, they will find success in investing.  \n\n#General mindset:\n================\n- Keep emotions out of the market\n- Don't bother timing the market. Don't get ruled by FOMO.\n- Understand that for some stocks, you can't really average cost down. You will have to stomach buying the stock at a higher entry point. My refusal to average up early on caused me to miss out on a lot of gains. \n- Understand the difference between trading, investing, and gambling. \n- Have an exit strategy (stop losses would have helped me a lot in March, I now learned from my expensive mistake)\n- Be greedy-- not TOO greedy. If a stock pops 10%, I will sell half to lock in profits. It's super common to see a lot of companies pop and the next day dip a bit due to sell off. Perfect time to grab more on the dip. This is obviously impossible to time, which is why I only sell half. \n\n#Application:\n==================================================================\nI was very specific in the types of companies I would choose to invest in within tech. I decided to follow my strengths. As a data engineer, I'm very intimate with cloud technologies, and I think I generally have pretty sharp business acumen and good strategic direction. \n\nAs a result, my day to day work had me using a ton of technologies in the cloud space. I've used Splunk, NewRelic, Twilio, AWS, GCP, Hortonworks/Cloudera, Oracle, Tableau, Datadog, Sendgrid (bought by Twilio), Dropbox/box, Slack, Salesforce, Marketo, Databricks, Snowflake, HP Vertica, just to name a few. I was familiar with CDN services like Fastly and Cloudflare because sometimes, I worked with the DevOps and IT guys. \n\nBased on industry hearsay, day to day work, eventually, I got a good \"feel\" of what technologies were widely adopted, easy to use, and had a good reputation in the industry. Similarly, I also got a feel for what tech were being considered 'dated' or not widely used (HP, Oracle, Cloudera, Dropbox, Box). \n\nI tend to shy away from companies that I don't understand. In the past, most times I've done that-- I got burned.  My biggest losers this year was betting on $NAT and $JMNA (10k total loss). After learning from those mistakes, I decided to only focus on investing in companies that either I or my peers have intimate first hand experience with using. Because of this rationale, the majority of stocks in my portfolio are products which I believe in, I thoroughly enjoy using, and I would recommend to my friends, family, and colleagues. \n\nPost COVID, due to the shift to remote work and increase in online shopping I decided to double down on tech. I already knew that eCommerce was the next big thing. I made very early investments into SHOP and Amazon in 2017 for that reason.\n\nMy hypothesis was that post-COVID, the shift on increased online activity, remote work, and eCommerce would mean that companies which build tools to support increased online activity should also increase. I decided to choose three sectors within tech to narrow down-- these were three sectors that I had a good understanding of, due to the nature of my work and personal habits. \n\n1. eCommerce + AdTech \n2. IT/DevOps (increased online activity means higher need for infra)\n3. FinTech (increased shopping activity means more transactions)\n\nThese are the points I consider before I consider jumping into a stock:\n\n1. Do I feel good about using the company? Do I believe in the company's vision?\n2. Where do I see this company in 5 years? 10 years? Do I see my potential children being around to use these companies?\n3. What does YoY, QoQ growth look like for this company? \n4. Is/Will this product be a core part of how businesses or people operate?\n5. Who are their customers and target demographic?\n6. (SaaS) Customer testimonials, white papers, case studies. If it's for a technology, I'm going to want to read a paper or use case.\n\nIn March, I took what I believe to be an \"educated gamble\". When the market crashed, I liquefied most of my non tech assets and reinvested them into tech. Some of the holdings I already had, some holdings were newly purchased.\n\n*EDIT* ^^^ this isn't called timing the market you /r/wsb imbeciles. Timing the market would be trying to figure out when to PULL OUT during ATH and then buying the dip. I SOLD at the lowest point, and I with the cash I sold AT A LOSS, I reinvested that cash and doubled down into tech. If I sold in Feb, and bought back in March, that would be calling timing the market. What I am doing is called REINVESTING/REBALANCING... not timing the market. \n\nI have 50% of my networth in AMZN, MSFT, AAPL, GOOG, FB, NFLX, and the rest in individual securities/mutual funds. I have 3 shares of TSLA that I got in @1.5.\n\nHere are the non FAANGs I chose.\n\n1. $SQ. I had already been invested in SQ since 2016. I made several bad trades, holding when it first blew past 90 until I sold it at 70... bought in again last year at 60s, after noticing that more and more B&M stores were getting rid of their clunky POS systems and replacing it with Square's physical readers. After COVID, I noticed a lot of pop up vendors, restaurants doing take out. A Square reader made transactions very easy to make post-COVID. \n\n2. $ATVI. Call of Duty and Candy Crush print money for them. I've been a Blizzard fanboy since I was a kid, so I have to keep this just out of principle.\n\n3. $SHOP. They turned a profit this year, and I think there is still a lot more room to grow. It's become somewhat of a household name. I've met quite a few people who mentioned that they have a Shopify site set up to do their side hustle. I've tried the product myself, and can definitely attest that it's pretty easy to get an online shop up and running within a day. I 5.5xed my return here. \n\n4. $BIGC. I bought into this shortly after IPO. I'm very excited to see an American Shopify. BigC focuses on enterprise customers right now, and Shopify independent merchants, so I don't see them directly competing. I'm self aware this is essentially a gamble. I got in at 90, sold at 140, and added more in 120s. I def got lucky here... it's not common for IPOs to pop so suddenly. I honestly wasn't expecting it to pop so soon.\n\n5. $OKTA. Best in class SSO tool. Amazing tool that keeps tracks of all of my sign-ons at work. \n\n6. $DDOG. Great monitoring tool. Widely adopted and good recommendations throughout the industry. Always had a nice looking booth at GoogleNext.\n\n7. $ZM. Zoom was the only video conf tool at work which I had a good time using. Adoption had blown up pre-COVID already in the tech world, and post-COVID, they somehow became a noun. \"Zoom parties\" and \"Zoom dates\" somehow became a thing interwoven into peoples' day to day lives.\n\n8. $TWLO. Twilio sells APIs which allow applications to send messages like text, voice, and video chat. For example, when DoorDash sends you a text at 1 AM reminding you that your bad decision has arrived, that text is powered by Twilio. In March, New York announced that they were going to use Twilio to send SMS notifs for COVID contact tracing. \n\n10. $NET/$FSTY. These two two seem like the ones best poised for growth in the CDN space. This is based off of industry exposure and chatting with people who work in DevOps.\n\n11. $DOCU. people aren't going to office to sign stuff, super easy to use, I like their product. \n\n12. $WMT. eComm, streaming, and a very substantial engineering investment makes me think they have room to grow. Also I really need to diversify. \n\n13. $COST. When is the last time you heard someone say \"Man I hate going to Costco and paying $1.50 for a hotdog and soda?\" Diversification. Also cheap hotdogs.\n\n14. $NVDA/AMD. GPUs are the present and the future. Not only are they used for video games, but Machine Learning now uses GPU instead of CPU to do compute (Tensorflow for example). Crypto is still a thing as well, and there will always been a constant need for GPUs.\n\nMutual funds/ETFs\n1. $FSCSX. MF which focuses on FinTech. \n\n2. $VTSAX Pretty much moves with the SP500. \n\n3. $WCLD. Holdings include Salesforce, Workday, Zuora, Atlassian, Okta, New Relic, Fastly... \n\nTitanvest:\nI was an early access user, and I was able to secure 0% fees for my accout. 36% gains so far. I like them, because their portfolio happens to include shares of tech giants that I either don't have individual stocks for or my stake is low (CRM, PPYL). It nicely complements my existing portfolio.\n\n#Some things I do that that are against the grain:\n\n- Not really diversified. 80% is in tech. They are in very different sectors of tech, but the truth is, when tech falls, all of these companies fall. I'm obviously long tech and I do not believe that tech will fall anytime soon. What about the dot com bubble? There wasn't a single dot com company that was integral in our lives. The internet was in its infancy then. Techonology is now such an interwoven part of our lives and I see companies like Apple, Amazon, Google to be sticking around for several generations.\n\n- I don't read investing articles. I think people who write articles about a stock all have ulterior motives-- to pump or to dump. Case in point-- Citron Research spent years writing articles telling people how SHOP was overvalued. Why did they do that? Because they were shorters at the time. I turned 5k into 27k, because I held on to most of my SHOP shares.\n\n- I don't take much value from balance sheets, other than net loss, income, YoY growth. Instead, I use my business acumen to try to pick up on info that isn't super apparent from Google. For example, one thing I always do is that I look at the career page to see how the business is growing. Increase on marketing/sales/implementation engineers is typically a solid sign that a company is preparing headcount to take new deals in the upcoming quarters. I look at the product road map, supported integrations, and customer base. \n\nOne example was how I applied the above principle was to WalMart. In 2018 I noticed that I was getting targeted by a lot of Data engineering job listing for WalMartLabs-- WarMart's tech division. The role was to build out a big data pipeline to support their eCommerce platform. WalMart's online store released in Q3 of 2019. Post COVID, I used their online store and it was a seamless experience. They even offer a 5% cash back card like Amazon. They reported strong Q4 sales last year, and they did very well post COVID. Why did I choose to invest in $WMT? Because I believe that Wal-Mart has room to grow for their online platform. \n\nLastly... remember that wealth isn't accrued over time. It takes years to build. The quickest way to increase your wealth is by investing in yourself-- your career and earning potential. The sooner my income increased, the quicker I had more capital to buy into stocks. \n\nAlso, if you've gotten this far, the point of my post isn't to say that you should invest into tech. The message I'm trying to get across is-- when picking companies, pick companies in fields or verticals you have good knowledge in. Heed Buffet's advice to only pick companies you believe in and understand. Play to your strengths, don't mindless toss money based on one person's posts on Reddit-- always do your own due diligence. Use DD as a guide and use personal research and experience to drive your decision.",
        "created_utc": 1598579888.0,
        "subreddit_name": "stocks",
        "comments": 534
    },
    {
        "title": "Apple has now terminated Epic's App Store account following legal dispute between the two companies",
        "score": 26574,
        "url": "https://9to5mac.com/2020/08/28/apple-has-now-terminated-epic-games-app-store-account/",
        "content": "",
        "created_utc": 1598644559.0,
        "subreddit_name": "apple",
        "comments": 3464
    },
    {
        "title": "YouTube starts testing native picture-in-picture feature in its iOS app",
        "score": 4538,
        "url": "https://9to5mac.com/2020/08/27/youtube-starts-testing-native-picture-in-picture-feature-in-its-ios-app/",
        "content": "",
        "created_utc": 1598584901.0,
        "subreddit_name": "apple",
        "comments": 547
    }
]