[
    {
        "title": "JPMorgan advises clients to expose 1% of their portfolio to Bitcoin",
        "score": 4757,
        "url": "https://www.reddit.com/r/investing/comments/lt7oop/jpmorgan_advises_clients_to_expose_1_of_their/",
        "content": "In a recent note to clients, strategists from JPMorgan (NYSE:JPM) suggested a one percent portfolio allocation to Bitcoin and other cryptocurrencies.\n\nAs reported by Bloomberg, JPM strategists Joyce Chang and Amy Ho opined that Bitcoin could serve as a hedge against fluctuations from traditional assets like bonds, stocks, and commodities. However, they advised clients to allocate a small percentage due to the risk of major downturns in Bitcoin’s value.\n\nAfter setting a new all-time high above $58,000, the value of the digital asset slumped to less than $45,000 and has been struggling to recover ever since.\n\nChang and Ho told investors:\n\n>*In a multi-asset portfolio, investors can likely add up to 1% of their allocation to cryptocurrencies in order to achieve any efficiency gain in the overall risk-adjusted returns of the portfolio.*\n\nBitcoin has welcomed major investments from the likes of Paul Tudor Jones, Tesla (NASDAQ:TSLA), and MicroStrategy. The endorsement from JPM comes at a time when institutional players are rushing to accumulate the digital asset. As per Bloomberg’s report, America’s oldest bank BNY Mellon (NYSE:BK) has also announced plans to enable Bitcoin transactions for its clients.\n\nThe strategists were quick to add that cryptocurrencies should be viewed as an investment vehicle and opposed to being funding currencies like the USD or EUR. This appears to be contrary to earlier statements from other JPM analysts that called cryptocurrencies the “poorest hedge for major drawdowns in equities.”\n\n[https://www.investing.com/news/cryptocurrency-news/jpmorgan-advises-clients-to-expose-1-of-their-portfolio-to-bitcoin-2431724](https://www.investing.com/news/cryptocurrency-news/jpmorgan-advises-clients-to-expose-1-of-their-portfolio-to-bitcoin-2431724)",
        "created_utc": 1614373174.0,
        "subreddit_name": "investing",
        "comments": 1753
    },
    {
        "title": "What caused stocks to dump yesterday: the unwinding of $50B worth of bonds",
        "score": 5620,
        "url": "https://www.reddit.com/r/stocks/comments/lsyfcs/what_caused_stocks_to_dump_yesterday_the/",
        "content": "Last week and earlier this week, I've been posting warnings about watching out for increased volatility leading into March, and particularly toward the end of March, which is the end of Q1. We're going to see unwinding of massive positions in the pandemic and tech stocks that were successful in 2020 as institutions and professionals will be forced to change their portfolios to more value oriented stocks that will perform better in high interest rate conditions: commodities, energy, high free cash flow businesses, industrials and financials. I refer to this as \"rotation\" where portfolios evolve from being focused on one sector or asset class to another over time. This Spring, these rotations may not occur in a slow, calm and orderly way. \n\nMonday, as I said in an earlier post this week, I liquidated most of my positions in the hot stocks of 2020, including EVs, and began focusing on interest-rate proof businesses. These are businesses with lower long term debt, good free cash flow, actual positive profit margins, and good balance sheets. I'm just holding long positions in outright cash purchases of stock, so I don't have complicated positions to \"unwind\" (I just sell a stock to get out of a position). However, institutional and professional investors, and hedge funds, have more complicated and leveraged portfolios. \n\nWe can't expect the unwinding of positions of so-called \"whales\" (big players) in the market to always be orderly or calm as the end of Q1 approaches. \n\nYesterday's market dump appears to have been triggered by one or more whales forcefully selling $50B of bonds into a reluctant buyer's market. The below is a good article from Bloomberg but it's premium content so I'll summarize it below because it answers the question, *Why are bond yields spiking despite the Federal Reserve setting its interest rates to banks so low and WTF is going on in the bond market?*\n\n[Chaotic Treasury Selloff Fueled by $50 Billion of Unwinding](https://www.bloomberg.com/news/articles/2021-02-26/chaotic-treasury-selloff-fueled-by-50-billion-position-unwind)(Paywall)\n\n* **A massive dump of $50B in bonds suggest one (or a few) positions were unwound by one or more whales**  \n\n> “It wasn’t an orderly selloff and certainly didn’t appear to be driven by any obvious fundamental continuation or extension of the reflation thesis,” wrote NatWest Markets strategist Blake Gwinn in a note to clients. \n\n* **\"Fundamental decoupling\" between low interest rates and a heating economy**\n\nBond and lending pros are rejecting the Federal Reserve's low-interest view, which is at odds with 6-7% growth projected due to stimulus plans and rebound from the pandemic and Powell's talk of \"maximum employment\" plans\n\n> The bond market’s divergence from a fundamental backdrop was most evident at the shorter-end of the curve. Eurodollar contracts -- which are priced off Libor -- collapsed in record volumes as traders repriced their expectations for the path of Fed rates with few obvious catalysts.\n\n* **What exactly happened?  5-year Treasury notes jumped 22 points, and spreads associated with those notes jumped 24 points**\n\n> The main protagonist in the bond market was the five-year Treasury note, a maturity often associated with long-term Fed rate expectations, where yields closed 22 basis point higher on the day. The so-called butterfly-spread index -- a measure of how the note is performing against its two- and 10-year peers -- jumped 24 basis points, the worst daily performance for the sector since 2002.\n\n> Markets now see a Fed hike by March 2023 compared to mid-2023 previously, and have priced in rates over 50 basis points higher by 2024.\n\n> But in remarks this week, Fed Chairman Jerome Powell offered reassurance that policy would continue to be supportive and look beyond a temporary pick-up in inflation, especially from a low base. While Fed Vice Chair Richard Clarida expressed cautious optimism on the outlook, he said it would “take some time” to restore the economy to pre-pandemic levels.\n\n* **Bond buyers who disagree with the Fed were \"on strike\" yesterday and created a \"liquidity drought\"** \n\n> A number of more “technical-style” factors were in the mix, against a backdrop of a good-old-fashioned buyers strike...\n\n> A lack of bond market liquidity, just when traders needed it most [i.e. during a big dump of $50B in bonds]\n\n* **Also high frequency trading exists in the bond market too, apparently, and they suddenly disappeared yesterday in a market that was used to their presence, at the same time buyers thinned out**\n\n> “We think that a steep decline in market depth contributed to the outsized moves in yields today,” wrote JPMorgan Chase & Co. strategist Jay Barry in a note to clients. Barry showed how the share of high-frequency traders in the Treasury market -- which has been on an increasing trend -- tends to retreat rapidly as volatility spikes.\n\nI expect to see more volatility as positions from 2020 unwind and people create whole new portfolios for post-pandemic 2021. This is a good time to look at which stocks are the ones doing well each day and why. \n\nDisclaimer: Not a financial professional\n\nEdit: I plan to reenter tech stocks hardcore once these whales are done with whatever BS they do at the end of every quarter whenever there are big changes.\n\n__________________________\n\nEdit 2: Here's an addition of more material offered by /u/TomatoeHaven from other references (I have not checked them)\n\n**What impact, if any, does the Fed have on Treasury Yield?**\n\nNote: Treasury yield briefly topped the 1.6% level on Thursday and traded at its highest level in more than a year, raising concern for investors across asset classes.\n\n“To be sure, if bond yields continue to rise and there is a smooth rotation out of growth and defensive stocks into value and cyclical stocks, the Fed will remain sanguine,” strategist Albert Edwards of Societe Generale said in a note. “But the risk is growing that with so many bubbles blown by the Fed something will burst soon.”\n\nhttps://www.cnbc.com/2021/02/25/us-bonds-treasury-yields-rise-ahead-of-fourth-quarter-gdp-update.html",
        "created_utc": 1614348619.0,
        "subreddit_name": "stocks",
        "comments": 992
    },
    {
        "title": "Morning Update for Friday, 02/26/21",
        "score": 253,
        "url": "https://www.reddit.com/r/Daytrading/comments/lsy6rs/morning_update_for_friday_022621/",
        "content": "Good morning everyone!\n\nI want to make a quick clarification and say that this post and list is geared towards day trading, and I am not advocating to blindly buy and hold these at all, in fact I advise strongly against that.\n\n*With the small cap stocks especially, I am typically in and out very quickly, only occasionally longer than 5-10 minutes, usually faster scalps.* I am also constantly watching the candlestick charts and observing price action and volume, and you should be doing the same if you want to trade these stocks. Always have a plan when you enter a trade (for profit taking and for taking a loss), and use proper risk management.\n\n**Stocks over $10**\n\n* Gapping UP: GME, RKT, CCIV, ETSY, BYND, EH\n* Gapping DOWN: SPCE, NCTY, VST, WKHS, DASH, RIOT, MARA, CAN, MVIS, SBE, XPEV, NIO, TS, SCKT\n\n**Stocks under $10**\n\n1. LIXT: Leading gapper, but I couldn't find a catalyst. Has been seeing strong volume and price action in the premarket, momentum could fade, just don't chase. Premarket high around 7.70-7.73.\n2. AFI: Gapping up on sale of property. Seeing good volume and decent price action in premarket. Premarket support right around 4.97-5.00.\n3. METX: Gapping up on good news. Seeing high volume at the moment, and good price action. I'll be watching how this one behaves closer to market open. \n4. JG: Gapping up on news of partnership. Seeing good volume with decent price action in premarket. Premarket resistance at 6.20.\n5. SCO: Corresponds to 2 times the inverse (-2X) of the Bloomberg commodity crude oil index. Oil has been roaring recently, so this could be worth a look today. \n6. SRTS: Gapping up after reporting earnings yesterday. Currently showing some weakness in premarket, but I'll be watching to see if it can get back over at least the 4.75-4.80 level. \n\nLooks like a bit of a mixed open for stocks this morning. SPY is currently sitting just below 384, and like QQQ, they are sitting right above support. If they can hold over support, we could see some upwards movement today. But if they break down through support, we could see another red day. Bitcoin is currently down a bit on the day, sitting at around 46,500. Bitcoin-related plays are hurting a bit in premarket, and I'll be keeping an eye on them. Marijuana stocks looking to open mostly flat, I'll be TLRY and APHA pretty closely. Oil is finally calming down, at least for the moment. The Senate parliamentarian ruled yesterday that they would not be raising the federal minimum wage to $15. I'll be watching UVXY once again to take advantage of any volatility in the market. \n\nRemember to use proper risk management, make sure you size appropriately for your account, and have a plan for every trade you enter. Happy trading everyone :)\n\nEdit: I was getting a lot of PMs about screener settings and all that, so I’m just going to copy and paste what I sent in PMs in a comment.",
        "created_utc": 1614347883.0,
        "subreddit_name": "Daytrading",
        "comments": 94
    },
    {
        "title": "Ri$e up retail players 💎 🙌 $120",
        "score": 18,
        "url": "https://www.reddit.com/r/AAPL/comments/lsxsbc/rie_up_retail_players_120/",
        "content": "IMO:\n\nBuy level: $127-$137\n\nAnything under $126 is a gift 🎁 from aapl.\n\n$120 💎 🙌\n\nUp vote this and let 'em know what's up!",
        "created_utc": 1614346480.0,
        "subreddit_name": "AAPL",
        "comments": 10
    },
    {
        "title": "Should’ve posted this here too. Absolutely amazing! AAPL is the most oversold it’s been in over 2 years on a daily chart. WILD🦧🍿📈",
        "score": 16,
        "url": "https://i.redd.it/nra73deybrj61.jpg",
        "content": "",
        "created_utc": 1614317072.0,
        "subreddit_name": "AAPL",
        "comments": 21
    },
    {
        "title": "Looks like ARK Invest firm sold GOOG, AMZN, AAPL etc and bought TSLA, JD, TWTR, BIDU etc on 2/23rd and today...",
        "score": 2,
        "url": "https://www.reddit.com/r/AAPL/comments/lsmvrv/looks_like_ark_invest_firm_sold_goog_amzn_aapl/",
        "content": "Solve 128,307 aapl share 2/23rd.Solve 116,653 aapl share today.\n\nGiven the situations and we're only off 3.48% instead of 6%-10% today can be seen as a good thing!Someone is buying up ARK Invest firm shares.",
        "created_utc": 1614304325.0,
        "subreddit_name": "AAPL",
        "comments": 3
    }
]