[
    {
        "title": "WOO $TSLA ",
        "score": 2,
        "url": "https://i.redd.it/typa7unghd0e1.gif",
        "content": "$TSLA carrying $SPY.",
        "created_utc": 1731374553.0,
        "subreddit_name": "wallstreetbets",
        "comments": 3
    },
    {
        "title": "What Should We Really Learn From Market Crashes?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gp9u28/what_should_we_really_learn_from_market_crashes/",
        "content": "There's this video on YouTube explaining every major financial crash (I'll link the video). It goes through in brief detail every crash that happened in history.  \n  \nVideo link: [Every Major Financial Crash Explained in 5 Minutes](https://www.youtube.com/watch?v=ulzeBijeLSY) \n\nI'm curious to know everyone's thoughts about the lessons we should learn from marketing crashes. What are the typical downfalls mainly seen when there are bad market cycles?\n\nIs it that we should avoid the heard mentality and \"be fearful when others are greedy\" as Warren Buffett puts it?",
        "created_utc": 1731376917.0,
        "subreddit_name": "investing",
        "comments": 0
    },
    {
        "title": "If Berkshire Hathaway suddenly spent all cash on hand on equities, how much do you think the market would move?",
        "score": 135,
        "url": "https://www.reddit.com/r/stocks/comments/1gp7be7/if_berkshire_hathaway_suddenly_spent_all_cash_on/",
        "content": "Berkshire Hathaway has the largest pile of cash on hand of any company (or if I'm mistaken is at least in the top 10). If they suddenly bought as much stock as they could, in this environment, how much movement do you think we would see? Would this drive a bullish sentiment in stocks enough across the board to see significant changes? If so, couldn't Buffet essentially start his own stock market surge at any moment by choosing to do this? Not to say this is true of any mega cap company, but specifically for buffett since he is both one of the wealthiest in the world, and is possibly the most sought after voice in the investing world",
        "created_utc": 1731369693.0,
        "subreddit_name": "stocks",
        "comments": 110
    }
]