[
    {
        "title": "My friends and I recreated every default Apple wallpaper (MacOS Mojave, High Sierra, Yosemite, etc.) during a one week road trip through California",
        "score": 5757,
        "url": "https://www.reddit.com/r/apple/comments/d2wnhk/my_friends_and_i_recreated_every_default_apple/",
        "content": "A month ago me and two other friends went on a week road trip to visit each spot from Apple's \"California location\" themed wallpapers. Remember how Mac operating systems changed from big cats to nature photos? We visited all the locations of where the nature themed wallpapers were taken, and tried to recreate the iconic photos for ourselves (MacOS Mojave, High Sierra, Sierra, El Capitan, Yosemite, and Mavericks). \n\n[Here](https://imgur.com/a/aceKqmG) is an image of 3 of the wallpapers, side by side with Apple's version.\n\nIf you want to see the rest of the photos or how the entire journey went, there is a link to a video we made [here](https://youtu.be/5yZuaAQKnkY). You can also check out the route we took, or download our wallpapers for yourself in the video's description. \n\nOur trip started in Death Valley, where we hiked sand dunes in 120+ degree heat to try and capture the [MacOS Mojave](https://512pixels.net/downloads/macos-wallpapers/10-14-Day.jpg) photo at sunset. Oh boy, was this rough! We ended up having to hike the sand dunes 3 times, since we couldn't find the right place to take the photo before the sun went down. I didn't know until months after the trip that we were in the hottest place on Earth! The only perk of going in the summer is all the sand dunes were beautifully untouched (you can see for yourself in the video).\n\nOur next stop was Alabama Hills, a short drive from Death Valley. We arrived at 2AM, and got 3 hours of sleep before having to wake up before sunrise to take a photo of the mountain range in [MacOS Sierra](https://media.idownloadblog.com/wp-content/uploads/2016/06/macOS-Sierra-Wallpaper-Macbook-Wallpaper.jpg). We ended up getting really lucky finding the exact spot where the Apple wallpaper was taken. If you look, there is a rock formation in the foreground of the image that we just happened to see while we were racing against time to set up before the morning light was cast across the mountains. \n\nThe same day we drove to the High Sierras for [this wallpaper](https://512pixels.net/downloads/macos-wallpapers/10-13.jpg). This was the easiest photo to get and is also my favorite of the trip. A quick Google search gave us the location, and all we had to do was hop out of the car and take the photo. I think our photo is beautiful in its own way, since it contrasts Apple's fall colors with lush greens. Also jumping in a cold lake was a great change from scorching hot sand dunes.\n\nNext stop was in Yosemite National Park for [MacOS El Capitan](http://512pixels.net/downloads/macos-wallpapers/10-11.jpg). This photo was taken from Tunnel View, a popular spot for people to see the valley. We definitely came during the wrong season for this photo. If you take a look at our version, it's missing the clouds and snow in the background. Also, the light from the sun setting is much better in the winter.\n\nFinding the photo of Half Dome for [MacOS Yosemite](http://512pixels.net/downloads/macos-wallpapers/10-10.jpg) was difficult. We read online that the photo could have possibly been taken in a field, but when we visited it we were nowhere close. It ended up taking us two days of hiking through unmarked trails to find the spot where the photo was taken!\n\nIn the end it was an incredible journey where we saw things we would never have seen had it not been for Apple. While our photos weren't a perfect match, that wasn't what the trip was about. The trip was about the chase -- kind of like a big scavenger hunt! It was about going outside and seeing these places for ourselves, instead of cooped up in an office looking at a screen. Because as amazing as Apple's wallpapers are, snapped at the right time under the perfect conditions, they still will never compare to seeing them in person.\n\nNext stop, MacOS Catalina!",
        "created_utc": 1568234545.0,
        "subreddit_name": "apple",
        "comments": 116
    }
]