[
    {
        "title": "Lost in translation (RR CEZ)",
        "score": 29,
        "url": "https://www.reddit.com/r/stocks/comments/1giwn7a/lost_in_translation_rr_cez/",
        "content": "Hello, I believe opportunity to beat the market is in finding market ineffectiveness. How much market ineffectiveness do you believe, there is in different information availability between languages?\n\nWhy I am asking.\n\nLast week ČEZ has bought 20% of Rolls Royce SMR. And it was massive event in Czech language. Largest net newspaper had article about it on the front page. (remainder google translate can translate web-pages if you want to read).\n\nLargest newspaper article: https://www.seznamzpravy.cz/clanek/ekonomika-firmy-cez-koupi-za-miliardy-podil-v-rolls-royce-smr-budou-vyrabet-reaktory-263383\n\nState television: https://ct24.ceskatelevize.cz/clanek/domaci/cez-a-rolls-royce-smr-budou-spolupracovat-na-vyvoji-modularnich-reaktoru-354812\n\nWeb about energy industry: https://oenergetice.cz/jaderne-elektrarny/cez-koupi-za-miliardy-podil-v-rolls-royce-smr-budou-spolupracovat-na-reaktorech\n\nWeb about investing: https://www.kurzy.cz/firmy/cez-rolls-royce/\n\neverybody was writing about it. So I thought: I want to see what English speakers think about it. And there was nothing. I bought shares and 1 call. Thinking once they translate the news, market will react. I am already waiting a week. And nothing. When I look at Yahoo finance nothing happened at all. When I look at seeking alpha or IBKR. One simple article, no analysis or discussion.\n\n20% of SMR company has been bought by corporation which has almost monopoly for energy in Czech republic (because it would be illegal to have perfect monopoly). ČEZ talks about need to build up to 10 SMR to replace coal heat/power plants in coming years. ČEZ has recently also bought Škoda JS (Škoda nuclear engineering). That company has produced nuclear reactors in the past. And still has all the tools and facilities to produce nuclear reactors. They have “unused” reactor hall which is currently producing storage units for spent nuclear fuel, because nobody orders reactors today. RR is producing SMR design to be build in factory. ČEZ owns a factory for nuclear reactors in middle of EU. And no one speaks about the synergy. \n\nReaction of the market, whole weak of nothing -1%. As if there were no news. So it got me thinking, how often this happens? Do you know any other example of events which has vastly different information availability or point of view based on language?\n\n*Disclosure: I have 500 shares of RR and 1 RR call, bought this week, and ČEZ shares long term unrelated to this.*",
        "created_utc": 1730666361.0,
        "subreddit_name": "stocks",
        "comments": 7
    },
    {
        "title": "3X / 5X / 10X ETPs - how do they work during sharp downturns?",
        "score": 28,
        "url": "https://www.reddit.com/r/stocks/comments/1gir2yn/3x_5x_10x_etps_how_do_they_work_during_sharp/",
        "content": "Could be a basic question, so forgive me for my ignorance. (I think), I understand futures & options quite well, but don't fully understand leveraged ETPs (exchange traded products), which claim to perform 3X / 5X / 10X of an index or any other underlying e.g. Apple.\n\nSo, let's say I buy such a product, 10X on Apple. If Apple crashes 12%, do I lose **more than** my capital? Here, I'm talking about 12% loss in a day, and not 6+6% over two days, which could lower my investments to near-zero but not zero or negative.\n\nIf I do end up owing money, how's this any different from buying a future?",
        "created_utc": 1730652097.0,
        "subreddit_name": "stocks",
        "comments": 9
    },
    {
        "title": "Time In Market v Decrease Cost Averaging ",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gifbp9/time_in_market_v_decrease_cost_averaging/",
        "content": "Bit of a thought experiment that I can't quite comprehend myself. \n\nBasic strategy as I understand it for those of us who don't have hundreds of thousands to invest is to pick large ETFs or market funds such as VTI or VOO or QQQ and long hold. I have a mixed portfolio with a less aggressive 401k and a market based IRA, and also a personal investment portfolio comprised of some blue chips, some companies I like that I'm not dependent on for growth, and some ETFs. \n\nFor my personal portfolio I have a few thousand investable held in SPAXX with fidelity. Now that the stage is set here's the thought: is it better to make a lump sum investment to have more overall time in the market for the money I have liquid or is it better to invest that money systematically over the span of 6 to 12 months in the event the market turns during the US election so as to DCA my investments over said time? ",
        "created_utc": 1730609079.0,
        "subreddit_name": "investing",
        "comments": 9
    }
]