[
    {
        "title": "My 100x companies 🤜📈",
        "score": 938,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gcyo9q/my_100x_companies/",
        "content": "First off, for a company to potentially 100x, it has to be truly revolutionary to the point where no one believes in it. And that is what I love. I have mentioned a few of these in previous posts (my largest being IONQ) and got shit on for it. Since that post, it has doubled (177 days). Whether you agree or not, this post is mostly a way for me to combine my research and give others opportunities. Remember you can only lose 100% but make infinite. I don’t expect anyone to believe in these stocks now, but check back in 5 years. \n\n\n\nSo with that, \n\n\n\nCompany number 1: **IONQ**. (I have made this post before but my confidence is so strong in IONQ that others need to hear it again)\n\n\n\nIONQ is a company in the quantum computing industry and the reason I’m bullish on it is due to its positioning in the quantum industry. Unlike other companies such as IBM, MSFT, NVDA, AMZN and others, IONQ is able to create incredibly accurate qubits. \n\n\n\nWhat is quantum computing and qubits?\n\n\n\nQuantum computing utilizes qubits rather than the conventional bits in computing to solve the most complex problems. A bit is the binary value of 1 or 0 that stores data. Qubits by themselves are not interesting but that data it holds can be held in a state of superposition. This allows the qubit to be in a way, in every possible form. Once groups of these are in superposition, that data is in multidimensional space. That may sound complicated but imagine a normal computer has its bits in 2d space whereas quantum computing pushes that to the 3rd or 4th dimension allowing the data to be in every configuration. That’s just a basic quantum computer. Now to actually use these computers and qubits to solve complex problems, you must fire microwaves photons at them. The photons essentially tell it what position to be in. To change shape and read the info from that new position. \n\n\n\nWhat does IONQ do that’s special?\n\n\n\nWell IONQ has made incredibly accurate and stable qubits. Nature has created natural quantum systems in atoms that IONQ has been able to ionize and isolate. Because of that IONQ uses the naturally occurring quantum systems to create their qubits. \n\n\n\nOther companies such as IBM have revolutionized other areas of computing. IBM has used their chips to improve error correction of output data. GOOG is maximizing the number of qubits. AMZN also focused on error correction and the overall accuracy of its computing. MSFT focuses on quantum algorithms. Basically no other company has been able to produce and scale accurate qubits. (This is different than IBM because IBM needs the tech to limit errors whereas IONQ’s qubits practically have no errors to begin with)\n\n\n\nWhy quantum computing could be the future.\n\n\n\n1: Quantum computing has the potential to simply solve exponentially more challenging problems at a much faster rate. This will be used in our everyday life from shipping routes to electric vehicle batteries development. Any problem can be solved quicker and more accurately.  \n\n2: Quantum computing currently sits at an industry value of around 600 million with expectation for 9 billion in 2030. That’s the compounded annual growth so a breakthrough could yield a much higher potential industry value\n\n3: IONQ has investors including Kia, Google, Fidelity, Hyundai, and a couple firms. As well as being partnered with Amazon. Its investors stemming from automobiles to banking shows the belief in the possibilities of quantum computing. \n\n4: Quantum computers are just cool. They sound cool, they look cool, and who doesn’t love cool. If you haven’t seen one I highly recommend looking it up. \n\n\n\n\n\n\n\nCompany number 2: **NuScale Power Corp (SMR)** \n\n\n\nWe are just beginning to understand and even implement the extensive uses of nuclear energy. We are reaching undeniably dangerous levels of climate change due to constant greenhouse emissions due to growing populations, economies, and countries. Now these emissions come from producing out necessities which first stem from energy. Energy is everything. Everyone knows fossil fuels are simply bad for the environment but to what extent? Well to the extent that if we want humankind to live over 50 more years, we NEED to limit these emissions. And that is where nuclear energy comes in. Nuclear energy releases nearly zero emissions yet is roughly 8000 times more efficient than fossil fuels. So that begs the question, why don’t we solely use nuclear energy? It was unstable and unfeasible to main stream it. Until now.\n\n\n\nSMR is in the works of finalizing and streamlining its small modular reactors. Previously power plants required large plots of land, large mantience crews, and came with high risks of meltdown and the effects that come with that. However, SMR has cut down every single one of those factors. \n\n\n\nNow why would you invest in futuristic nuclear fission without understanding it. Well here is is simply put if you have taken a high school chemistry course. A neutron is released into a stable collection of uranium atoms which when collide and produce extreme amounts of energy taking the form of heat. Once one uranium atom splits, it releases more neutrons creating a chain reaction. This heat is then pressurized into steam which is used to create power. Now SMR submerges their reactors in water to provide consistent coolant during the reaction further within a room lined with seismic category 1 aircraft impact resistant structures. Now they also employ many more safety protocols to minimize the chance of a nuclear meltdown and the reaction of that to nearly zero.\n\n\n\nSo, why is nuclear energy and SMR simply creating the future?\n\n\n\n1: We will NEED nuclear energy if we want to continue to grow as a species without killing the climate and ourself\n\n2: SMR has innovated a way to scale nuclear power plants to make them economically viable for everyone and for our main supplier of power. \n\n3: SMR has large investors including Google, Amazon, potentially Microsoft, and I’m sure many more (no other investors were public information). \n\n\n\nAlso, a similar stock to SMR that I’m also investing in is OKLO. They are similar to SMR just appear to be in the earlier stages of entering the nuclear energy market (which I love). \n\n\n\n\n\n\n\nCompany number 3: **AST SpaceMobile (ASTS)**\n\n\n\nIm sure you have heard of ASTS through this subreddit, and probably think you already missed your chance ton invest. But that couldn’t be further from the truth. \n\n\n\nASTS is a company building the first ever global cellular network in space that allows 4G/5G connection from anywhere in the world, with any cellular phone. How awesome does that sound. 5G coverage while at sea, in a plane, in the middle of the andes. Anywhere you could think, boom connection. Now their stock is up a ton recently for only having launched 5 satellites. \n\n\n\nOnce again cellular coverage can be a complicated concept for some, so here it is simply put. As of now, with whoever your cellar provider is, (AT&T, Verizon, TMobile) Im sure you lose coverage while driving in the middle of nowhere, on flights, and sometimes in populated areas you would never expect. And it’s only when you need connection that you realize you have no connection. So ASTS would fully eliminate this problem for anyone in the WORLD that owns a cellular phone and is connected with ASTS. The cellular market value sits at around 450 billion dollars. That’s 450,000,000,000. Nearly completely devastated if ASTS can do what it says. \n\n\n\nThat being said, them being able to provide coverage anywhere in the world is a long shot. But that’s why I love it. They have already received FCC permission to complete the launch of 5 satellite which turned out successful. With their hefty goal in mind that would take over an entire sector, they have a bright road ahead of them all mapped out, just waiting for asphalt. \n\n\n\nSo, why is ASTS the future?\n\n\n\n1: They can provide cellular coverage ANYWHERE in the world from ANY cellular phone. And we already know how reliant our world is on electronics\n\n2: They have successfully launched 5 satellites and in the works of creating their arsenal in space\n\n3: If they are successful, they would take over a nearly 450 billion dollar sector and own a monopoly on cellular coverage. \n\n4: they have strong investors including they major partner AT&T, Google, Vodafone, and more\n\n\n\n\n\n\n\nSo anyways, that’s just my two sense of stocks I see making people fortunes. But I’m just a teenager with no degree in quantum computing, nuclear fusion, or cellular communications so take it with a grain of salt. \n\n\n\nPositions: Nearly 16k spread throughout these 3 companies and constantly increasing.\n\n\n\nTl;dr: buy stocks, hold, make money",
        "created_utc": 1729987865.0,
        "subreddit_name": "wallstreetbets",
        "comments": 348
    },
    {
        "title": "My advisor yearly fees are around 1.6%.",
        "score": 164,
        "url": "https://www.reddit.com/r/investing/comments/1gdesvf/my_advisor_yearly_fees_are_around_16/",
        "content": "Mid 30s here. Advisor yearly fees are around 1.6%. They're strictly just overseeing this account and nothing else, taking out their quarterly fees.\n\nStarted with around 250k in 2022. Account is held in Schwab, value is about now $276k. (Dividends have been taken out quarterly (total taken out around $25k since 2022, will stop these and just re invest them).\n\nThe advisor has invested the majority of my portfolio into multiple equities (NVDA, AVGO, SMCI, QCOM, COHR, IRM, PANW, AAPL, GOOGL, CAT, ZS, etc...) Only 1% of my holdings is in USBSX.\n\nWould I be better off just putting everything in a 3 fund type of portfolio and meeting with a fee based advisor a few times a year?",
        "created_utc": 1730046323.0,
        "subreddit_name": "investing",
        "comments": 155
    }
]