[
    {
        "title": "Apple is now banned from selling its latest Apple Watches in the US",
        "score": 17076,
        "url": "https://www.theverge.com/2023/12/26/24012382/apple-import-ban-watch-series-9-ultra-2",
        "content": "",
        "created_utc": 1703598616.0,
        "subreddit_name": "technology",
        "comments": 1674
    },
    {
        "title": "Apple Watch import ban takes effect after Biden administration passes on veto",
        "score": 2832,
        "url": "https://www.reuters.com/technology/biden-administration-allows-us-trade-tribunals-ban-apple-watch-imports-2023-12-26/",
        "content": "",
        "created_utc": 1703596307.0,
        "subreddit_name": "apple",
        "comments": 527
    },
    {
        "title": "Apple’s iPhone Design Chief Enlisted by Jony Ive, Sam Altman to Work on AI Devices",
        "score": 885,
        "url": "https://www.bloomberg.com/news/articles/2023-12-26/apple-iphone-design-head-tang-tan-to-work-with-jony-ive-sam-altman-on-ai-tech",
        "content": "",
        "created_utc": 1703634783.0,
        "subreddit_name": "apple",
        "comments": 157
    },
    {
        "title": "Apple reportedly wants to use the news to help train its AI models",
        "score": 634,
        "url": "https://www.theverge.com/2023/12/22/24012730/apple-ai-models-news-publishers",
        "content": "",
        "created_utc": 1703555897.0,
        "subreddit_name": "apple",
        "comments": 59
    },
    {
        "title": "I'm probably selling my Airbnb stock. Your experience?",
        "score": 531,
        "url": "https://www.reddit.com/r/stocks/comments/18r4umj/im_probably_selling_my_airbnb_stock_your/",
        "content": "I used Airbnb extensively before covid and was a fan of using it over hotels.\n\nHowever, I recently tried to book a few trips to Hong Kong, Taipei, and Tokyo. All 3 cities have made Airbnb irrelevant. All 3 cities are heavily regulated so there are barely any listings and the listings are worse than hotels. They used to have plenty of listings with excellent quality and price.\n\nThat got me thinking about the future viability of the business model. \n\nI understand why cities ban it. I live in a fairly luxurious building and Airbnb is unregulated. On my floor, 11/17 apartments are Airbnbs. People rent it to throw parties. It's a nightmare for the residents. \n\nBesides that, Airbnb seems to have problems for everyone. City renters hate that it's causing rent to go up. Residents hate that their neighbors are random strangers. Apartment owners are fearful of parties and bad guests. Where I live, many landlords don't even know that their tenants are using their apartments for Airbnb. Guests are fearful of no standards, cleanliness, spy cameras. And we all know powerful hotel lobbyists. \n\nAs a traveler, it seems like the golden age of Airbnbs is gone. I don't think I will use it much anymore. 3/3 places I wanted to travel to recently have all but banned it. Therefore, I'm thinking of selling the stock.\n\nI want to know what your experience is and if mine is overly too negative.",
        "created_utc": 1703584720.0,
        "subreddit_name": "stocks",
        "comments": 220
    },
    {
        "title": "I'm a professional money manager and this is what I'm watching/ expecting for the week ahead.",
        "score": 176,
        "url": "https://www.reddit.com/r/Daytrading/comments/18qvuj3/im_a_professional_money_manager_and_this_is_what/",
        "content": "  \n**Some Expectations:**\n\n* Low volume during the week due to Holiday season. \n* Nothing really on economic calendar this week at all + low volume = expectation of relatively flat movement.\n* No major headwinds so unlikely to see big correction this week, from a fundamental perspective. \n* Next real significant economic development will be the FOMC minutes on 3rd of Jan, and even that will probably send the dollar lower, pushing markets higher.  So not expecting sustained correction in the very near term.\n* Likelihood is that any dips will be bought and market will remain around current levels for now.   \n\n\n**A look at some of the Options data to reinforce these expectations:**  \n\n\n* EURUSD Skew at highest level of the year. Traders continue to bet that EURUSD will breakout. I personally had 1.10 as a price target on EURUSD but the active 1.11 strike tells us traders want 1.11.   \n[https://imgur.com/a/xRK9bWq](https://imgur.com/a/xRK9bWq)    \nThe lack of data this week and risk reversal on DXY falling, pointing to continued drop in dollar means I won’t be surprised if 1.11 hits.   \n\n* SPX skew is relatively flat. This tells us traders are not expecting a big move in either direction. Simply due to the fact of so little being on the economic calendar.   \nSkew has lowered a bit, due to spike in VIX, but weak dollar means that volatility is not lasting in markets.  \nTells us dips are likely to be bought.  \n   \n[https://imgur.com/a/LHI1Srn](https://imgur.com/a/LHI1Srn)    \n\n* Slight weakness in DOW Skews vs SPX skews. More hedging activity there. So if there is likely to be any weakness, Dow will probably underperform other indexes.   \n\n* Tesla EXPECTATIONS FROM Skews (just because I know the retail audience Loves Tesla):  \nBullish imbalance tells us sentiment is positive around Tesla. But the bullish skews lowered, so probably see some chop this week. May move higher after Year End.  \n[https://imgur.com/a/2DkrGYP](https://imgur.com/a/2DkrGYP)    \n\n* NVDA EXPECTATIONS FROM SKEWS:  \n500 Gamma wall seems a strong resistance, unlikely to break in short term.   \n\n* ***Fun fact, is the first time since 1997 that not a single company will report earnings during the last week of the year.***   \n\n\n  \n**——— CALENDAR/ CATALYSTS ——**   \n**MONDAY:**  \n\n\n* The only thing I was watching today was my Yorkshire puddings, to make sure my brother in law didn’t steal them.   \n\n* Ueda was talking earlier, with key highlights being that he said the prospect of achieving sufficient inflation rate isn’t enough yet and stressed the uncertainty involved. Said cannot predetermine when to raise policy.   \nMost of this is already known to the market, so no real movement in USDJPY   \n\n\n**TUESDAY: (Boxing Day, so bank holiday for many countries. Expected to see low volume):**  \n\n\n* US House Price index - Will probably show a MOM change of around 0.8% imo. \n* US 2 year auction - Will probably send 2 year yields lower, with better than expected demand.   \n\n\n**WEDNESDAY:**  \n\n\n* JAPAN - BOJ will release their version of the fed minutes, from the meeting where they dovishly held rates stable, against expectations of a hike. My expectation is that this will probably send JPY lower as they reinforce their commitment to ultra easy. USDJPY to prop up  \n\n* US - 5 year auction. Similar expectation to the 2 year auction the day before.   \n\n\n**THURSDAY**:  \n\n\n* JAPAN - Retail sales.   \n\n* US - Jobless claims - Expectation for it to come out slightly under forecast, due to Holiday seasonality.   \n\n\n**FRIDAY:**  \n\n\n* SPAIN - inflation Rate preliminary reading for December. Significant as Spain CPI tends to be a leading indicator of Eurozone CPI.   \n",
        "created_utc": 1703552724.0,
        "subreddit_name": "DayTrading",
        "comments": 25
    }
]