[
    {
        "title": "Hey, developer of Apollo for Reddit here. I'm doing a completely free iPhone 14 Pro giveaway to commemorate Apollo's big iOS 16 update and new iPhone 14 Pro features. Just leave a comment to enter! 🎉📱",
        "score": 20566,
        "url": "https://www.reddit.com/r/apple/comments/xtsjm6/hey_developer_of_apollo_for_reddit_here_im_doing/",
        "content": "# UPDATE: Winner has been announced! https://www.reddit.com/r/apolloapp/comments/xwjpof/apollos_iphone_14_pro_giveaway_winner_has_been/\n\n**This thread has hit the 100K Reddit comment limit, comment on this new thread now:  https://www.reddit.com/r/apolloapp/comments/xu8zct/part_2_hey_developer_of_apollo_for_reddit_here_im/**\n\nHey all,\n\nYears back I worked at Apple, and now I took what I learned there and build an app for Reddit called Apollo. It's a free alternative to the official app, built specifically for iOS (almost like if Apple created their own Reddit app), with lots of customizability, and being built in the open with community feedback. \n\nDownload link: https://apps.apple.com/app/id979274575\n\nI worked my butt off this summer so you'd have a Reddit app with all the best iOS 16 features on day 1:\n\n- A ton of awesome Lock Screen Widgets for Reddit, so you can keep tabs on your favorite subreddits, or how your posts are doing, total distance scrolled, etc. right from your lock screen\n- Live Text analysis, similar so the Photos app you can now directly select, share, and translate text just by selecting text in pics and videos in Apollo\n- Subreddit weather for hundreds of subreddits, so when you go to one you can see the weather there, as well as the local time!\n- Scroll Distance Tracker, so as you use Apollo you get live stats on how many miles you've scrolled in total, synced between all your devices, with comparisons to common distances like the height of Mount Everest, or 48 Shaquille O'Neals, and you can even set distance goals like a true athlete!\n- Pixel Pals, so if you have an iPhone 14 Pro, you can have [a little Tamagotchi-style buddy above the Dynamic Island](https://twitter.com/ChristianSelig/status/1570863225234923520) while you browse Reddit, and even if you don't have the newest iPhone, you can pin them to your Lock Screen as a widget!\n- More fun Dynamic Island stuff to come!\n\nReally proud of this update, so to celebrate it I wanted to do like I've done in the past, and have an iPhone 14 Pro giveaway! Just leave a comment (no spam pls) and you're entered, and I'll draw the winner in 24 hours.\n\nPic: https://i.imgur.com/dXBe07S.jpg",
        "created_utc": 1664726941.0,
        "subreddit_name": "apple",
        "comments": 86470
    }
]