[
    {
        "title": "Tesla is 'profoundly overvalued,' and its exclusion from the S&P 500 was a 'brave' decision by the index committee, DataTrek says",
        "score": 3874,
        "url": "https://www.reddit.com/r/stocks/comments/iqebna/tesla_is_profoundly_overvalued_and_its_exclusion/",
        "content": "Tesla's exclusion from the S&P 500 index on Friday was a surprise to many, given that the mega-cap electric-vehicle manufacturer ticked off all the eligibility requirements.\n\nTesla on Tuesday fell 21% from Friday's close as investors digested the S&P 500 exclusion amid a tech-heavy market sell-off.\n\nBut the S&P Dow Jones Indices index committee's decision to exclude Tesla despite its eligibility for inclusion was a \"brave\" one, DataTrek cofounder Nicholas Colas said in a note on Wednesday.\n\nThe decision by the committee could \"only have come from a collective and committed view that Tesla is profoundly overvalued,\" Colas said.\n\nTesla traded at a trailing 12-month price-earnings multiple of 913x on Wednesday, according to data from YCharts.com. The S&P 500 traded at a trailing 12-month price-earnings multiple of 21.7x, according to JPMorgan.\n\nIn addition to a steep valuation, the committee likely thinks Tesla \"sits on shakier fundamentals\" than its August 31 market capitalization of $465.2 billion may indicate, DataTrek said.\n\nThat might refer to the fact that much of the profit Tesla has recorded over the past few quarters derives from the sale of green EV regulatory credits to other carmakers that don't meet the mandated annual EV production quota, and not from Tesla's main business of building and selling cars and solar panels.\n\nTesla will remain eligible for inclusion in the S&P 500 index if it continues to stay profitable in future quarters.\n\nInstead of Tesla, the committee added Etsy, Teradyne, and Catalent to the S&P 500 index.\n\nhttps://www.businessinsider.com/tesla-stock-sp500-exclusion-index-overvalued-profoundly-datatrek-committee-why-2020-9",
        "created_utc": 1599778400.0,
        "subreddit_name": "stocks",
        "comments": 581
    },
    {
        "title": "Short seller Hindenburg alleges that electric truck maker Nikola is an 'intricate fraud' in new report",
        "score": 2548,
        "url": "https://www.reddit.com/r/investing/comments/iq2sye/short_seller_hindenburg_alleges_that_electric/",
        "content": "Source: https://hindenburgresearch.com/nikola/\n\n\"Today, we reveal why we believe Nikola is an intricate fraud built on dozens of lies over the course of its Founder and Executive Chairman Trevor Milton’s career.\n\n\nWe have gathered extensive evidence—including recorded phone calls, text messages, private emails and behind-the-scenes photographs—detailing dozens of false statements by Nikola Founder Trevor Milton. We have never seen this level of deception at a public company, especially of this size.\n\nTrevor has managed to parlay these false statements made over the course of a decade into a ~$20 billion public company. He has inked partnerships with some of the top auto companies in the world, all desperate to catch up to Tesla and to harness the EV wave.\n\n\nWe examine how Nikola got its early start and show how Trevor misled partners into signing agreements by falsely claiming to have extensive proprietary technology.\"",
        "created_utc": 1599742764.0,
        "subreddit_name": "investing",
        "comments": 480
    },
    {
        "title": "Apple refining Siri to cut down on mistaken activations, and to draw less power",
        "score": 5339,
        "url": "https://appleinsider.com/articles/20/09/10/apple-refining-siri-to-cut-down-on-mistaken-activations-and-to-draw-less-power",
        "content": "",
        "created_utc": 1599739665.0,
        "subreddit_name": "apple",
        "comments": 386
    }
]