[
    {
        "title": "Tesla has just issued a $5bn capital raise",
        "score": 1214,
        "url": "https://www.reddit.com/r/investing/comments/ikj1nf/tesla_has_just_issued_a_5bn_capital_raise/",
        "content": "https://sec.report/Document/0001193125-20-236699/\n\n>We have entered into an equity distribution agreement, or the equity distribution agreement, with Goldman Sachs & Co. LLC, BofA Securities, Inc., Barclays Capital Inc., Citigroup Global Markets Inc., Deutsche Bank Securities Inc., Morgan Stanley & Co. LLC, Credit Suisse Securities (USA) LLC, SG Americas Securities, LLC, Wells Fargo Securities, LLC and BNP Paribas Securities Corp., as our sales agents, under which we may offer and sell from time to time our common stock having an aggregate offering price of up to $5,000,000,000. The sales agents may act as agents on our behalf or purchase shares of our common stock as principal.\n\n>Our common stock is traded on the Nasdaq Global Select Market under the symbol “TSLA.” The last reported sale price of our common stock on August 31, 2020, as reported on the Nasdaq Global Select Market, was $498.32 per share.\n\n>Sales, if any, of common stock under the equity distribution agreement may be made in ordinary brokers’ transactions, to or through a market maker, on or through the Nasdaq Global Select Market or any other market venue where the securities may be traded, in the over-the-counter market, in privately negotiated transactions, in block trades, in transactions that are deemed to be “at the market offerings” as defined in Rule 415 under the Securities Act or through a combination of any such methods of sale. The sales agents may also sell our common stock by any other method permitted by law.\nWe will designate the maximum amount of common stock to be sold through the sales agents on a daily basis or otherwise as we and the sales agents agree and the minimum price per share at which such common stock may be sold. Subject to the terms and conditions of the equity distribution agreement, the sales agents will use their reasonable efforts consistent with their normal sales and trading practices to sell on our behalf all of the designated shares of common stock. We may instruct the sales agents not to sell any common stock if the sales cannot be effected at or above the price designated by us in any such instruction. We or any sales agent, with respect to itself only, may suspend the offering of our common stock by notifying the other party.\n\n>We will pay each sales agent a commission of up to 0.5% of the gross sales price per share of common stock sold through such agent under the equity distribution agreement. We have also agreed to reimburse the sales agents for certain of their expenses. In connection with the sale of the shares of common stock on our behalf, each of the sales agents may be deemed to be an “underwriter” within the meaning of the Securities Act of 1933, as amended, or the Securities Act, and the compensation paid to each of the sales agents may be deemed to be underwriting commissions or discounts. See “Plan of Distribution.”\n\n>Settlement of any sales of common stock will occur on the second business day following the date on which such sales were made (or such earlier day as is industry practice for regular-way\ntrading). \n\n>There is no arrangement for funds to be received in an escrow, trust or similar arrangement. Sales of our common stock as contemplated in this prospectus supplement will be settled through the facilities of The Depository Trust Company or by such other means as we and the sales agents may agree.",
        "created_utc": 1598962045.0,
        "subreddit_name": "investing",
        "comments": 743
    }
]