[
    {
        "title": "Does anyone use other chat rooms?",
        "score": 7,
        "url": "https://www.reddit.com/r/AAPL/comments/136ro7c/does_anyone_use_other_chat_rooms/",
        "content": "Does anyone have recommendations for other chat rooms about AAPL?  This one doesn't seem so lively at the moment?\n\nAlso any other stocks for that matter.  I'm looking for chats that like to talk about the good and bad points of a stock.  Too many of these groups seem to be focused on pumping the stock rather than allow people to determine whether or not they should invest.",
        "created_utc": 1683130200.0,
        "subreddit_name": "AAPL",
        "comments": 3
    },
    {
        "title": "AAPL squaring out in price and time",
        "score": 0,
        "url": "https://www.reddit.com/r/AAPL/comments/136nsi3/aapl_squaring_out_in_price_and_time/",
        "content": " ***AAPL will release its Q1 results on May 4th, 2023, with a delay of more than a month. As read in “Barron’s on April 6th, 2023, is there a reason for a longer-than-usual-delay?”***\n\nWe may speculate about it or look at the cycles to see if shorter and longer-term cycles are due in time.\n\nAAPL is also close to 360 degrees in price from low January 2023 on May 5th, 2023, right on the Lunar eclipse. A lunar cycle is due a few days later, on May 9th, 2023.\n\n&#x200B;\n\nhttps://preview.redd.it/69o0odxromxa1.jpg?width=1620&format=pjpg&auto=webp&s=c24ea00ecad4c0faecad59c9230db787bf4c59b6\n\n*There is perfect geometry if AAPL will change the trend again after an advance of $49. (like the $49 decline from the August 2022 High) from the lows of January 2023, reaching $173.17 by early to mid-of-May 2023.*\n\nThe number “49” is the square of “7,” and this is often a point of resistance (or support) in time and price.\n\nAs W.D. Gann mentioned in his stock market and commodity courses:\n\n>*“The number “7” is a fatal number referred to many times in the Bible, which brings about contraction, depression, and panics.”*\n\nRead more on Substack: [https://fiorente2.substack.com/p/apple-inc-update-may-1st-2023](https://fiorente2.substack.com/p/apple-inc-update-may-1st-2023)\n\n*This analysis is intended for general informational & educational purposes only. Hypothetical or simulated performance based on past cycles has many limitations. Cycles can contract, extend, and invert. Anomalies can occur. Hence, past performance is no guarantee for the future. No advice. Please* [*take a look at our full disclaimer*](https://fiorente2.substack.com/about)*.*",
        "created_utc": 1683124884.0,
        "subreddit_name": "AAPL",
        "comments": 5
    }
]