[
    {
        "title": "The wisdom (or stupidity) of the investment crowd: A reality check",
        "score": 635,
        "url": "https://www.reddit.com/r/stocks/comments/1e6zb4f/the_wisdom_or_stupidity_of_the_investment_crowd_a/",
        "content": "Exactly 3 years ago, there was a thread shared on X (back then Twitter) - **“Top 20 stocks that have 50x potential\".**\n\nThis list was based on 700+ responses from other Twitter users, and I thought it was a solid representation of what the average investor was excited about, back then. So, I bookmarked the thread, and here we are, three years later, ready to have a look at the wisdom **(or stupidity)** of the investment crowd.\n\nBut before I start, do not forget, that the sentiment at that time was very positive. The S&P500 was up over 90% in a bit over a year, since the pandemic low back in March 2020.\n\n\n\n|Company name|How it was described|Ticker|% change|\n|:-|:-|:-|:-|\n|Alteryx|Big Data Analytics|AYX|-39%|\n|Boston Omaha|Berkshire Hathaway 2.0|BOMN|6%|\n|Beyond meat|Plant-based meat|BYND|-95%|\n|Desktop Metals|3D Printing|DM|-95%|\n|ContextLogic|Discount e-commerce|WISH|-98%|\n|Fiverr|Online freelance marketplace|FVRR|-90%|\n|Global-E|Software for internatiocal e-commerce|GLBE|-38%|\n|Jumia|E-commerce in Africa|JMIA|-47%|\n|Lemonade|Next-gen insurance|LMND|-74%|\n|Upstart|Credit scores 2.0|UPST|-76%|\n|Latch|Hardware/software for property management|LTCH|-97%|\n|Nano-X Imaging|Bring medical imaging to the world|NNOX|-71%|\n|Origin Materials|Carbon negative plastic|ORGN|-85%|\n|Open Door|Real estate iBuying|OPEN|-82%|\n|Sofi Technologies|Digital financial services|SOFI|-50%|\n|Redfin|Real Estate 2.0 & iBuying|RDFN|-86%|\n|Ozon|e-Commerce in Russia|Ozon|Delisted|\n|Virgin Galactic|Space tourism|SPCE|-99%|\n|Twist Biosciences|DNA on demand|TWST|-56%|\n|YETI|High-quality outdoor gear|YETI|-57%|\n|||**Average**|**-70%**|\n|||**S&P500**|**28%**|\n\n\n\nThe table shows the performance of these “top 20 stocks that have 50x potential” and as you can see, the average decline was a **staggering 70%,** compared to the **S&P500’s gain of 28%** over the same period. Not only that, but **all of the 20 stocks underperformed the index.**\n\nThe reality is, that it is easy to look like a genius in a bull market. Positive sentiment drives stock prices up, and it hides the underlying weaknesses. The fear of missing out adds more fuel to the fire. But also, there was fuel in the form of stimulus checks.\n\nHowever, this doesn’t last forever and market conditions change. When that happens, risky investments and poor strategies are exposed, and those following the crowd without doing their homework, eventually learn a harsh lesson, as we’ll see in this perfect example.\n\nThe dramatic decline in these stocks serves as a cautionary tale about the dangers of following the crowd in investing. Despite the initial optimism and promising potential, the reality has been a harsh lesson in the importance of thorough research. As Warren Buffett said, only when the tide goes out do you discover who has been swimming naked.",
        "created_utc": 1721380083.0,
        "subreddit_name": "stocks",
        "comments": 143
    },
    {
        "title": "Any way to estimate the full financial impact of this CrowdStrike incident?",
        "score": 54,
        "url": "https://www.reddit.com/r/investing/comments/1e7bce1/any_way_to_estimate_the_full_financial_impact_of/",
        "content": "* Was having trouble getting some banking statements to download yesterday...\n* Tried to use my work laptop last night around 10pm noticed it had Blue Screen of Death\n* Started trying to debug it, realized it was my company's nanny anti-virus of choice... Crowdstrike\n* Google Crowdstrike Marketshare: ~23% of anti virus solutions... Oh fuck.\n* Told my wife, before going to bed: \"Prepare, tomorrow is going to be a historic event\"\n\nThis morning, holy shit. Airports, Banks, Hospitals, all getting screwed.\n\nMarket pulled back, but I don't think the bean-counters have fully understood the extent of this damage. Repairing the issue is not something you can do remotely, it literally requires a physical person to access the machine, reboot it in safe-mode and delete some files one machine at a time. If your machine uses Bitlocker encryption, you need to make sure you have the Bitlocker backup key to every single one of those machines. \n\nSo you have an update that auto-deployed on a bunch of Windows machines that requires manual 1-at-a-time intervention to fix. Have we ever had an incident on this scale? I expect markets to dip for a while from the fallout of this.\n\nAnyone know any ways to model this? VTI barely pulled back from this, but I expect there to be significantly more fallout as time passes.\n\nEDIT: What is going on with this thread? If you sort by Controversial, it's the top right now. Why is this controversial? \n\nEDIT: Some interesting testimonials from [Bay Area redditors about direct impact of this.](https://www.reddit.com/r/bayarea/comments/1e77pxt/question_how_is_the_crowdstrike_debacle_impacting/)\n\nEDIT: This is not a fear-mongering post. I am more curious about systematic discussion of impacts like this on investments across the board. Once in a lifetime events are interesting because their novelty makes it difficulty to model. In times like this getting a variety of sincere, thought out opinions is interesting to me.  \n\nIf all you want to do is come into this post and type \"HODL\" or some other crypto-like one liner, or even VTI and chill, please save us both the trouble and don't.",
        "created_utc": 1721415158.0,
        "subreddit_name": "investing",
        "comments": 55
    },
    {
        "title": "Trump shooter used Android phone from Samsung; cracked by Cellebrite in 40 minutes",
        "score": 24508,
        "url": "https://9to5mac.com/2024/07/18/trump-shooter-android-phone-cellebrite/",
        "content": "",
        "created_utc": 1721348950.0,
        "subreddit_name": "technology",
        "comments": 3297
    },
    {
        "title": "Apple patent hints at new system to rank Wi-Fi networks in iOS",
        "score": 890,
        "url": "https://9to5mac.com/2024/07/16/apple-patent-rank-wi-fi-networks-ios/",
        "content": "",
        "created_utc": 1721359317.0,
        "subreddit_name": "apple",
        "comments": 119
    },
    {
        "title": "iPhone SE 4 Rumored to Use Same Rear Chassis as iPhone 16",
        "score": 723,
        "url": "https://www.macrumors.com/2024/07/19/iphone-se-4-likely-to-use-iphone-16-chassis/",
        "content": "",
        "created_utc": 1721406619.0,
        "subreddit_name": "apple",
        "comments": 199
    },
    {
        "title": "Apple next 10 years ",
        "score": 23,
        "url": "https://www.reddit.com/r/AAPL/comments/1e74i5p/apple_next_10_years/",
        "content": "\n\nJust curious about everyone’s opinion here:  what would it take for Apple stock to replicate its past 10 year growth in the next 10 years(eps, revenue, products, services, margins, acquisitions, partnerships, AI etc)?  Is that a shot to the moon or even remotely possible?  Is the only way if the Vision Pro or AR glasses become a household item like the iPhone? Is that why people are saying it’s not likely?",
        "created_utc": 1721397759.0,
        "subreddit_name": "AAPL",
        "comments": 38
    },
    {
        "title": "Is The Crowdstrike/ Microsoft Meltdown Good For Apple?",
        "score": 8,
        "url": "https://www.reddit.com/r/AAPL/comments/1e73a8u/is_the_crowdstrike_microsoft_meltdown_good_for/",
        "content": "Being a Mac user I never even really think about anti-virus/ security software these days.  Excuse my possible ignorance, but does the Apple 'gated community' offer a higher degree of protection/ security over Microsoft/ Google based systems?  ",
        "created_utc": 1721394356.0,
        "subreddit_name": "AAPL",
        "comments": 15
    },
    {
        "title": "What are (in your opinion) the best buying opportunities arising from this dip? ",
        "score": 262,
        "url": "https://www.reddit.com/r/stocks/comments/1e7bk6j/what_are_in_your_opinion_the_best_buying/",
        "content": "I’m going to argue personally that nvidia is not one of them. They’re down less than 5% since Tuesday. Of course this metric alone means almost nothing, but I’d like to discuss companies which are great buying opportunities solely because of this dip. \n\nAs others have stated, AMD seems to be a great buying opportunity. It’s down about 15% since Tuesday, from what I believe was already an appealing price. I’d say the same for Qualcomm. \n\nThe broadest and likely “safest” are going to be TSM and QQQ. Personally I’m in a position where I’m deep in TSM and TQQQ, hedged with INTC. \n\nI’d like to add that I believe these tickers will all run downward a bit longer. I’ve lost bit of $$ due to impatience and buying too early. I do have funds in reserve for when I see evidence of a proper reversal. ",
        "created_utc": 1721415704.0,
        "subreddit_name": "stocks",
        "comments": 405
    }
]