[
    {
        "title": "Tesla hit $500 and 90B Market cap. If it grows 10% more Elon will get hist first portion of his compensation which is 1% of Tesla's current total outstanding shares.",
        "score": 2761,
        "url": "https://www.reddit.com/r/investing/comments/eo5ie9/tesla_hit_500_and_90b_market_cap_if_it_grows_10/",
        "content": "**CEO Performance Award Details**\n\nThe performance award consists of a 10-year grant of stock options  that vests in 12 tranches. Each of the 12 tranches vests only if a pair  of milestones are both met.\n\n* Market Cap Milestones: To meet the first market cap milestone, Tesla's current market cap must increase to $100 billion. For each of the remaining 11 milestones, Tesla's market cap must continue to increase in additional $50 billion increments. Thus, for Elon to fully vest in the award, Tesla's market cap must increase to $650 billion.\n* Operational Milestones: To meet the operational milestones, Tesla  must meet a set of escalating Revenue and Adjusted EBITDA targets (the  only adjustment to EBITDA is for stock-based compensation). These  milestones are even more directly aligned with shareholder value  creation than those used in Elon's 2012 performance award. They are  designed to ensure that as Tesla's market cap grows, the company is also  executing well on both a top-line and bottom-line basis.\n\nFor each of the 12 tranches that is achieved, Elon will vest in  stock options that correspond to 1% of Tesla's current total outstanding  shares (1% of that amount is approximately 1.69 million shares). If  none of the 12 tranches is achieved, Elon will not receive any  compensation.\n\n&#x200B;\n\n[https://ir.tesla.com/news-releases/news-release-details/tesla-announces-new-long-term-performance-award-elon-musk?ReleaseID=1054948](https://ir.tesla.com/news-releases/news-release-details/tesla-announces-new-long-term-performance-award-elon-musk?ReleaseID=1054948)\n\n&#x200B;\n\nEdit:  [ **Mark B. Spiegel**‏ @**markbspiegel**](https://twitter.com/markbspiegel)\n\nAs I noted last week, right now [~~$~~**TSLA**](https://twitter.com/search?q=%24TSLA&src=ctag) = Bitcoin (except at least Bitcoin frauds get prosecuted!). As I said I’d do last week, I stopped it down to 5-6% of the fund when it took out last week’s high today, and will stay there until it reconnects with reality.",
        "created_utc": 1578929094.0,
        "subreddit_name": "investing",
        "comments": 722
    },
    {
        "title": "Call to introduce common charger for all mobile phones | 13-01-2020 | News | European Parliament",
        "score": 6239,
        "url": "https://www.europarl.europa.eu/news/en/agenda/briefing/2020-01-13/13/call-to-introduce-common-charger-for-all-mobile-phones",
        "content": "",
        "created_utc": 1578915475.0,
        "subreddit_name": "apple",
        "comments": 868
    }
]