[
    {
        "title": "Americans Are Canceling More of Their Streaming Services",
        "score": 1137,
        "url": "https://www.reddit.com/r/stocks/comments/18x9f1g/americans_are_canceling_more_of_their_streaming/",
        "content": ">Hulu, Netflix and other streamers are turning to bundles, discounts and ad-supported plans as customer defections rise\n\nhttps://www.wsj.com/business/media/americans-are-canceling-more-of-their-streaming-services-fb9284c8\n\n* About one-quarter of U.S. subscribers to major streaming services—a group that includes Apple TV+, Discovery+, Disney+, Hulu, Max, Netflix, Paramount+, Peacock and Starz—have canceled at least three of them over the past two years, according to November data from subscription-analytics provider Antenna. Two years ago, that number stood at 15%, a sign that streaming users are becoming increasingly fickle.\n\n* Among the U.S. customers who joined Disney+ for the first time in November or converted from a trial, nearly 60% opted for the ad-supported tier. That figure was bolstered by Black Friday promotion and is up from 25% in December 2022, when the ad tier was launched. \n\n* More than one-third of new U.S. Netflix customers in November opted for the ad tier, compared with 11% a year earlier, when the ad-supported version was introduced. Streamers say ad-supported plans are a win-win for them and price-sensitive customers, bringing in revenue from monthly subscriptions as well as ad sales.\n\n\nIt’s getting a lot harder for streaming services to hold on to their customers.\n\nCrystal Revis, a mother of six in Lynn Haven, Fla., recently canceled her subscriptions to Disney\n+ and Paramount+, among others, because of their swelling price tags and the rising cost of living. She is also considering canceling Netflix, home to shows such as “The Crown” and films including “Leave the World Behind.”\n\nRevis is among the consumers nationwide paring their streaming bills and getting more strategic about when they turn services on and off. Customer defections across premium streaming services rose to 6.3% in November, from 5.1% a year earlier. \n\n\n\n[Switched Off - Customer cancellation chart](https://i.imgur.com/XSIM5tw.png)\n\n“With the streaming services increasing their rates like they are, it’s, like, ‘OK, do I pay for the cable?’” Revis, who is in her 40s, said of deciding what home entertainment to select.\n\nUnder pressure to improve profitability and avoid having to reacquire users, streamers are trying a range of tactics to retain customers, from launching lower-cost ad-supported tiers of service, to teaming up with rivals on bundled deals and providing discounts or free months of service.\n\nRevis planned to cancel Hulu, home to shows such as “Faraway Downs” and “Only Murders in the Building,” but decided to keep it because the service offered her six months of its ad-supported service for $2.99 a month, less than half of its typical $7.99-a-month price.\n\nBeni Goldenberg, 48 years old, has downgraded some services to control costs. In 2023, he switched from a $22.99-a-month premium Netflix plan to its $15.49-a-month standard plan, limiting the number of devices that can watch the service at the same time and lowering the viewing resolution. Netflix has long had the lowest rate of customer defections among major streamers.\n\n[Watch, Cancel, Go - Percentage of streaming services canceled](https://i.imgur.com/hV4Np2q.png)\n\nGoldenberg also cancels sports add-ons to his YouTube TV subscription when events are over. \n\n“I’m focusing on the ones that me and my family watch the most,” said the father of two in North Texas, who typically watches movies and TV shows on Disney+ with his family on Friday nights.\n\nSome customers who turn off a service return to it later, according to Antenna. \n\nOne in four people who cancel a premium streaming service typically resubscribes to that service within four months, and one in three does so within seven months. Half do so within two years.\n\n“Retention doesn’t just mean holding on to a new subscriber the first time they get them. It’s about managing a relationship over a true customer lifetime,” said Jonathan Carson, co-founder and chief executive of Antenna. Antenna compiles data from third-party services that collect information from consumers, with their consent, such as online purchases, bills and banking records.\n\nStreamers will have to become more sophisticated about when they try to win back customers, he said. For example, they might target ads and marketing efforts at people who tend to watch at a certain time of year.\n\nAd-supported plans offer streaming services a way to attract new customers and win back those who have canceled their subscriptions and want to pay less. \n\nAmong the U.S. customers who joined Disney+ for the first time in November or converted from a trial, nearly 60% opted for the ad-supported tier. That figure was bolstered by Black Friday promotion and is up from 25% in December 2022, when the ad tier was launched. \n\n[Returning to the Stream](https://i.imgur.com/Fa2Jwwd.png)\n\n\nMore than one-third of new U.S. Netflix customers in November opted for the ad tier, compared with 11% a year earlier, when the ad-supported version was introduced. Streamers say ad-supported plans are a win-win for them and price-sensitive customers, bringing in revenue from monthly subscriptions as well as ad sales.\n\nSome rivals have begun bundling their ad-supported tiers of service, offering a discounted rate in the hopes that customers see value in the offering and stick around longer. Verizon in early December began offering some of its customers a bundle that includes the ad-supported tiers of Netflix and Max for about $10 a month, instead of about $17.\n\nWarner Bros. Discovery CEO David Zaslav has said bundling is an important part of the business’s future and can provide a good customer experience. Disney has said customers are less likely to cancel its streaming service when they pay for its bundle of Disney+, ESPN+ and Hulu. \n\nBrendan Byrne, a 40-year-old father of four in the Boston area, pays for streaming services including Netflix, the Disney bundle, Amazon Prime Video and Paramount+, in addition to cable, but is starting to question the value of some of those subscriptions. \n\nAfter the 2023 Hollywood writers and actors strikes, “the lack of content is evident across all of these streaming things right now,” he said. \n\n“We’ll cut back on a few of them,” Byrne said. “We’re just not using them.”",
        "created_utc": 1704253168.0,
        "subreddit_name": "stocks",
        "comments": 344
    }
]