[
    {
        "title": "Man sues feds after being detained for refusing to unlock his phone at airport",
        "score": 44382,
        "url": "https://arstechnica.com/?post_type=post&p=1429891",
        "content": "",
        "created_utc": 1545160073.0,
        "subreddit_name": "technology",
        "comments": 2891
    },
    {
        "title": "Can we PLEASE stop defending Apple for poor design decisions?",
        "score": 14730,
        "url": "https://www.reddit.com/r/apple/comments/a7ebn3/can_we_please_stop_defending_apple_for_poor/",
        "content": "I recently had to get my iPhone X's screen replaced for the display touch issue and the \"Genius\" that set up the replacement gave me some sassy shit for my phone's rear glass looking like I took some sand paper to it and the fact my Stainless Steel black coating is coming off. She instantly said \"Well you should have had a case.\" That's the same kinda crap that people here and other places say any time there is any kind of crap design choice Apple makes. It's down right infuriating to hear. The front glass of the iPhone X hasn't scratched at all from going in and out of my pocket. So they clearly CAN put glass on the back that would protect from that. The Apple Watch uses a higher grade coating on it's stainless steel which is why it won't begin to shed, or possibly never will. Me not using a case isn't an excuse when Apple already uses stronger methods on other products and sometimes on the same product. For a $1000 phone. \n\nI saw the same thing about BendGate and some people STILL refuse to admit that the phone's were structurally compromised. My 6 bend from just being in my front pocket. I replaced the rear case and that one ALSO bent. People gave shit to JerryRigEverything for showing how easily the new iPad Pro bent. I will agree that the iPad Pro is a bit more of an edge case but how easily some people are to just blame those that have issues for not using a case is just insane. These are $1000+ devices. They clearly know how to protect from these issues. Defending them like this every time something goes wrong won't convince them to fix it going forward.",
        "created_utc": 1545161422.0,
        "subreddit_name": "apple",
        "comments": 1381
    }
]