[
    {
        "title": "Warren Buffet said if you have just $10K or $15K to invest, he recommends investing in just one or two companies, which goes against the conventional wisdom of diversification in most investment subs, what do you think? (Link inside)",
        "score": 1188,
        "url": "https://www.reddit.com/r/investing/comments/kql973/warren_buffet_said_if_you_have_just_10k_or_15k_to/",
        "content": "https://www.youtube.com/watch?v=rgyYFQmdRyY\n\nThis is of course assuming you know what you are doing, and still follow the value-based investment approach, but this is in contrary to most investment advice I've seen on reddit, which generally encourages buying index funds to reduce risk. What do you think?\n\nEDIT: Oops, just realized I misspelled his name, maybe I'm getting hungry.",
        "created_utc": 1609803899.0,
        "subreddit_name": "investing",
        "comments": 393
    },
    {
        "title": "Why are so many people suddenly panicking when there is a ONE red day? Haven’t we discussed the entire last month that we shouldn’t really care corrections, rather stick to the original strategy that you’ve been doing.",
        "score": 2391,
        "url": "https://www.reddit.com/r/stocks/comments/kqewuq/why_are_so_many_people_suddenly_panicking_when/",
        "content": "The Dow is about 1,6% on the red side and the S&P about the same. I see too many people suddenly panicking and selling their stocks, especially in tech. And not just any tech stocks, the gold boys of the subreddit: Microsoft and Apple! We’ve talked a lot in this subreddit how these companies are great long term plays with good upside, yet I see a surprising amount of people starting to wonder if they should sell their tech stocks.\n\nFor those who are thinking of selling today, I want you to go back to that date when you bought the stock, whatever stock it was. Ask yourself: ”Why did I buy this stock?” \n\nThen ask yourself: ”Has the situation changed?” Do you still see the same qualities that made you invest in the company? \n\nIf you see the same qualities that you saw at the start, continue what you are doing. There’s no reason to sell the stock, right? If anything, buy more!\n\nStick to your original strategy. I’d just keep doing that DCA and buy the dips. Today is a great day to do that. Don’t worry.\n\nEdit: Thanks for the upvotes and awards!",
        "created_utc": 1609785876.0,
        "subreddit_name": "stocks",
        "comments": 608
    }
]