[
    {
        "title": "How I bought $300 of RBLX to teach my son a lesson on investing",
        "score": 4113,
        "url": "https://www.reddit.com/r/stocks/comments/m2hbcq/how_i_bought_300_of_rblx_to_teach_my_son_a_lesson/",
        "content": "A few months ago, due to what I still can’t explain, the parental controls on purchases on the android device stopped asking for a password. My 8 year old son discovered this while playing Roblox and went on a Robux buying spree to the tune of $427. We only caught it because of the confirmation emails a few days later. We were only able to reclaim $115 from Google.  He lost the device, and his favorite game, for a long time. \n\nFast forward to today. I have been giving my son $5 a week for chores into a custodian trading account.  I luckily I picked a few good stocks and he has a nice little ~$300 Disney Trip fund for toys, swag, etc. I told him I was going to spend his savings on buying RBLX. I explained to him about market cap, shares outstanding, float and he understood 0 of these things... But I also explained that putting $300 into a game vs $300 into a game company were different things and (inner monologue: while probably over priced at the moment) it may grow his Disney Trip fund while he supports the company that has brought him so much pandemic joy. He was totally jazzed about this prospect and investing in general. Also... payback... sort of.\n\n\nEDIT: A few more details for the surprising amount of negative posters below, especially for a light-hearted story about both of us learning money lessons.\n\n* I am not shilling Roblox stock we collectively own 4 shares.\n* Of course any major losses would be covered.  No children's dreams were ruined in the making of any financial lessons... yet.\n* He did have to earn back his mistake through increased help around the house.\n* I own a lot of DIS in my own accounts. \n* I match his own bday, card, etc contributions 1-1 to his account as an additional incentive to invest.",
        "created_utc": 1615435310.0,
        "subreddit_name": "stocks",
        "comments": 649
    },
    {
        "title": "Amazon Quietly Began Building a Grocery Chain During Pandemic",
        "score": 3978,
        "url": "https://www.reddit.com/r/stocks/comments/m2ss0t/amazon_quietly_began_building_a_grocery_chain/",
        "content": "https://www.bloomberg.com/news/articles/2021-03-11/amazon-quietly-began-building-a-grocery-chain-during-pandemic\n\nGrocery analysts say Amazon Fresh stores are likely cheap to launch and even cheaper to run—the perfect weapon to stake a long-term claim in a famously low-margin  industry.\n\nAnalysts have long expected Amazon to bring its cashierless technology to larger stores. The company currently operates two Go Grocery locations, the largest of which is about 13,000 square feet—or roughly six times the size of the original convenience stores. Fresh stores are substantially larger, ranging from from 25,000 square feet to 45,000 square feet.\n\nAmazon is always looking for a way to defend from walmart and target, amazon fresh store is the perfect answer. Amazon keep improving the logistic warehouses and expanding the delivery network, the fresh store will be easily managed and capturing the low margin market share. Amazon is providing an unlimited growth opportunity for shareholders, for investor who bought amazon under $3k for the latest pullback, congratulation.\n\nThanks for the awards.",
        "created_utc": 1615476540.0,
        "subreddit_name": "stocks",
        "comments": 460
    },
    {
        "title": "Full Diligence Post on Nokia (NOK) Ahead of Capital Markets Day next Thursday (3/18)",
        "score": 1401,
        "url": "https://www.reddit.com/r/investing/comments/m33vsq/full_diligence_post_on_nokia_nok_ahead_of_capital/",
        "content": " I know there have been a lot of posts about NOK recently across several different subreddits, but I recently did some due diligence on the the stock and wanted to share my findings.\n\nI originally had a lot of links in this, but it led to the post getting auto-removed. Let me know if you would like any sources.\n\n# History of Nokia\n\nIf you've seen any of the recent Nokia posts over the last few months, a common comment you will see is: \"Nokia?!? That stock has been trading sideways for years!\"\n\nWhile yes that is true, it is important to understand why. Let's take a look.\n\n**2000-2013**\n\nNokia dominated the mobile phone market during this time due to a quality handset. NOK traded in the $50s during the Dotcom bubble and in $30s before the housing crash. However, they never recovered after 2008 due to struggling to keep up in software as the mobile phone market started to shift to smart phones.\n\n**2013-2019**\n\nWhen Nokia realized that trying to stay in the phone space was a losing battle they sold their phone division to Microsoft in 2013. For the next 3 years, Nokia was a large company in disarray.\n\nThis did not get much better in 2016 when they acquired Alcatel-Lucent and decided to focus on networks. The merger did not go as smoothly as planned and over the next 5 years Nokia started \"trading sideways\" due to a bearish sentiment.\n\nSome investors stuck around through all of this due to a dividend being paid out, but that was suspended in 2019 so Nokia could focus on developing its 5G mobile networks. This dropped the share price down to $3.50.\n\n**2020-Present**\n\nIn March 2020, sentiment started to change somewhat bullish as they announced Pekka Lundmark would be taking over as CEO. Pekka worked for Nokia for a decade in the 90s and most notably served as Fortum's, a Finnish state-owned energy company, CEO from 2015 to 2020.\n\nThe bullish sentiment was shorted lived due to the pandemic crash dropping the share price to $2.42. It started to pick back up over the summer when it was announced that Pekka would take over a month earlier than planned.\n\nThis was followed by rumors that there was a chance Nokia could win Verizon's $6 billion 5G deal. Hype around this brought Nokia's price above $5 for the first time since they suspended their dividend in October 2019. But in September, it was announced that Samsung won the Verizon deal and NOK fell down to $3.78. It fell even further to $3.37 in October when the rest of the market saw a down swing.\n\nThen it climbed back up to the low $4s, had a crazy January hitting $9.79 for about 10 seconds during to the meme stock frenzy, and has since returned to the high $3s low $4s after the Q4 earnings call.\n\n**Q4 Earnings Call**\n\nSo what exactly did happen during that earnings call on 2/4/21? Why did it hurt NOK's price?\n\nA lot of people blame Pekka messing up the call with some pessimistic word choices, most notably the word \"challenging.\" Why would he say this?\n\nIt may just be his straight forward personality. It might have been an intentional sandbag so he can control future expectations. It may because Nokia prides itself on being on ethical company. I think it was probably due to a little bit of all of the above. Pekka using this language was not surprising. He said the exact same thing during the 2020 Q3 earnings call.\n\nSo the rumors that Nokia may blow it out of the water during their Q4 earnings were unwarranted. Nokia did beat their expected earnings, but because of a decrease in year over year revenue, people overreacted (just like they did when Samsung won the Verizon deal) and sold their Nokia positions.\n\n**Pekka's Tenure**\n\nPekka has been in charge for 7 months during a global pandemic, but he has been able to make some progress it appears. Much of this information can be found in the Nokia 2020 Annual Report.\n\n* He trimmed their employee size by 11,000.\n* He improved their free cash flow to $2.6 billion.\n* Even with the decrease in revenue he nearly doubled their operating profit (page 82).\n* He drastically reduced their net deferred tax balance (page 175).\n* He created four distinct business groups with plans for these groups to be shared in more detail during during Capital Markets Day on 3/18.\n* He replaced Nokia's CFO, CTO, and CMO (CFO happened before he took over)\n* It appears he issued new shares to leadership.\n* Pekka has a stake in the company (page 67 of annual report) with a long term goal to \"Focus on increase in share price and restoration of the dividend\".\n   * \" In addition, Mr. Lundmark received an award of EUR 1.3 million of restricted shares on joining to buy out the awards he forfeited on leaving his previous employer. Mr. Lundmark was invited to join the co-investment based long-term incentive arrangement (eLTI) targeted to engage senior leaders with the long-term nature of our business and share price, and purchased EUR 2.6 million of Nokia shares against which he was given a matching award of EUR 5.2 million of Nokia 2020 performance shares. This investment by Mr. Lundmark aligns him with shareholders from the start and is a sign of his commitment and engagement with the company. Delivery of actual Nokia shares would take place in 2023 subject to performance conditions\"\n\n# Bullish\n\nHere is a list of 28 deals and partnerships Nokia has established since December 2020. Some of these deals are not massive, but they span across 6 continents.\n\n**Largescale Network**\n\n* 5 year Multi Billion Dollar T Mobile Deal\n* 7 year Belgium deal\n* Deutsche Telekom in Germany\n* France's Mainland 5G Network\n* 5G Network in Austria\n* Telecom Italia\n* Cibicom ISP in Denmark\n* Polkomtel Phone Provider in Poland\n* Telenor Group in Thailand\n* Ooredoo in Algeria\n* 5G Network in Philippines\n* Tele2 in Sweden, Latvia, Lithuania, and Estonia\n* Ecuador\n* Vodafone in Australia\n* Saudi Arabia\n* Singapore\n\n**Private 5G Deals**\n\n* San Diego Gas &amp;amp; Electric Private Network\n* Port of Seattle\n* Japanese Companies Conexio, Hitachi Kokusai, Nippon Steel, Omron and Sharp\n* WEG Motor Manufacturer in Brazil\n* Elisa in Finland\n* Optus Stadium in Australia\n\n**Partnerships**\n\n* Google Cloud\n* EU's Hexa-X 6G Project\n* Brazil's Telecommunications R&amp;amp;D Center\n* AT&amp;amp;T tests to deploy virtualized and open RAN\n* Patents deal with Samsung\n* LG Uplus trial in South Korea\n\n**5G is the Future**\n\nThe confusing nature of 5G could be holding back the market's valuation of Nokia. \n\n* Nokia is currently trading at a market cap of $22-23 billion even with a 2020 revenue of $24 billion.\n* A letter that Pekka recently published gives a decent explanation of what 5G is.\n   * In it, he admits \"\\[5G\\] is exciting, but it can seem a bit abstract.\" But then goes on to describe some real world examples that really helps explain it.\n   * \"Our partners saw unanticipated breakdowns and production line defects drop by 30% after installing smart video sensors in our manufacturing deployments. In the logistics sector, deploying augmented reality devices cut machine monitoring costs by half. In ports, remote-controlled cranes doubled productivity and eliminated staff injuries: an incredible 100% drop.\"\n* This seems to suggest that there may be more uses for 5G worldwide than cellular networks.\n* Nokia released a study stating that 5G could have an $8 trillion impact on global GDP by 2030.\n* Nokia and Ericcson may have a duopoly on 5G with Huawei and ZTE being banned in many countries. This trend may continue.\n* Some analysts have predicted massive (&amp;gt;1,000%) growth in the 5G market over the next 5 years.\n\n**Upcoming Events/Rumors**\n\n* **Capital Markets Day (3/18/21)**\n   * This is when we will get some true guidance on the future of the company. Not only will they lay out the strategic business plans for their 4 business segments as I mentioned above, but it should be when they make announcements toward potential a Dividend Reinstatement, Share Buyback, and future R&amp;amp;D decisions.\n* **Annual General Meeting (4/8/21)**\n   * Not sure what they plan to cover during this, but I would assume it will act as a follow up to Capital Markets Day\n* **Dividend Reinstatement**\n   * Most signs point to Nokia investing in R&amp;amp;D for a while, but based on Pekka's compensation package it should be back by 2023 at the latest.\n* **Share Buyback**\n   * Nokia did buy back 1.25 billion shares in 2015-16 and 1 billion shares in 2016-17. So the rumors they plan to do this again could be true. They can purchase up to a total of 550 million shares both this year and next year. 550 million because it correlates to 10% of the companies total outstanding shares.\n\n# Bearish (Risks/Cons)\n\n* The meme stock frenzy has a long-lasting impact on the opinion of this stock.\n* The dividend is not reinstated for another 3+ years.\n* Pekka does not have what it takes. Nokia is a sinking ship and cannot be turned around.\n* FCF is used solely for R&amp;amp;D and no shares are bought back over the next three years. The float does turn out to be too big to move significantly.\n* Nokia may not be undervalued and their revenue streams may continue to decline due to network share loses and pricing erosion.\n* Pekka has been very serious over the last two earning calls and things are going to get much worse/challenging before they get better.\n* With a new US administration in place, the trend of banning Huawei and ZTE that they started is lifted. These two competitors then undercut Nokia pricing.\n* 5G is no where near as big of an industry as the experts predict. Covid continues to slow the rollout of 5G well past 2030.\n* 5G is too confusing and never gets the buy in from today's investors.",
        "created_utc": 1615505619.0,
        "subreddit_name": "investing",
        "comments": 298
    },
    {
        "title": "Adobe officially releases Photoshop for Apple M1, says it’s 50% faster",
        "score": 6825,
        "url": "https://thenextweb.com/plugged/2021/03/11/adobe-officially-releases-photoshop-for-apple-m1-says-its-50-faster/",
        "content": "",
        "created_utc": 1615471922.0,
        "subreddit_name": "apple",
        "comments": 684
    },
    {
        "title": "Morning Update for Thursday, 03/11/21",
        "score": 640,
        "url": "https://www.reddit.com/r/Daytrading/comments/m2q478/morning_update_for_thursday_031121/",
        "content": "Good morning everyone! Happy Thursday.\n\n*This list is geared towards day trading. With the small cap stocks especially, I am typically in and out very quickly, only occasionally longer than 5 minutes, usually faster scalps.* I am also constantly watching the candlestick charts and observing price action and volume, and you should be doing the same if you want to trade these stocks. Always have a plan when you enter a trade (for profit taking and for taking a loss), and use proper risk management.\n\n**Stocks Over $10**\n\n* Gapping UP: MARA, RIOT, NIO, TSLA, GRWG, PTON, SPCE, FCEL, RBLX, AMC, VIR, AVEO, RSI, BMBL, SUNW, FUTU\n* Gapping DOWN: GME, AMTX, KOSS, EYES, ORCL, HESM, YSG\n\n**Stocks Under $10**\n\n1. NVFY: Gapping up but couldn't find a catalyst. Seeing strong volume and price action in the premarket, just be cautious as it could get over-extended. Low float, so this could see some volatile swings this morning. \n2. SIEB: Gapping up after reporting earnings. Seeing good volume and decent price action in premarket. Also pretty low float, so could see some volatility early this morning. \n3. SPPI: Gapping up on lung cancer catalyst. Seeing decent volume and price action in the premarket. \n4. PHUN: Gapping up on news of a partnership. Seeing strong volume and price action at the moment, I'll want to see if that holds up. \n5. SLGG: Gapping up on news of acquiring Mobcrush. Seeing some weakness in price action at the moment, but I'll be keeping an eye on it to see if there's a revival before market open.\n6. OGI: Gapping up on news of strategic deal. Decent volume in premarket, but could see some better price action. \n7. KERN: Gapping up on news of an acquisition. Seeing strong price action at the moment, I'll be watching to see if that is sustainable.\n\nThe market should open nice and green all around, with lots of stocks gapping up this morning. SPY is trading at a little above 392 at the moment, and we should see some strength today, maybe even a push to ATH. If SPY takes a step back and makes it back down below the 390 level, we could see some choppiness. Bitcoin is trading at around 56,800. Bitcoin-related stocks are up in premarket and I could see them having a strong day for intraday trading. Marijuana stocks are following the market trend and are trading higher in premarket. Gold and silver are also up at the moment, and oil continues its climb again. GME is down in premarket, but I'll be keeping an eye on it today. Stay patient and disciplined in your trading, and let's have a good day.\n\nRemember to use proper risk management, make sure you size appropriately for your account, and have a plan for every trade you enter. Happy trading everyone :)",
        "created_utc": 1615469507.0,
        "subreddit_name": "Daytrading",
        "comments": 158
    },
    {
        "title": "Go AAPL",
        "score": 18,
        "url": "https://finance.yahoo.com/news/global-5g-services-market-size-114000701.html",
        "content": "",
        "created_utc": 1615468822.0,
        "subreddit_name": "AAPL",
        "comments": 3
    }
]