[
    {
        "title": "Will NYCB Go Under And Will There Be Contagion?",
        "score": 103,
        "url": "https://www.reddit.com/r/investing/comments/1b86j8r/will_nycb_go_under_and_will_there_be_contagion/",
        "content": "A weak bank in needs of cash…\n\nNew York Community Bancorp tumbles 40% and is halted as troubled bank reportedly seeking cash infusion https://www.cnbc.com/2024/03/06/new-york-community-bancorp-tumbles-40percent-and-is-halted-as-troubled-bank-reportedly-seeking-cash-infusion.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
        "created_utc": 1709748243.0,
        "subreddit_name": "investing",
        "comments": 64
    },
    {
        "title": "Apple terminated Epic's developer account",
        "score": 3600,
        "url": "https://www.epicgames.com/site/en-US/news/apple-terminated-epic-s-developer-account",
        "content": "",
        "created_utc": 1709744528.0,
        "subreddit_name": "apple",
        "comments": 1426
    },
    {
        "title": "Epic says its iOS game store plans are stalled because Apple banned its developer account",
        "score": 1438,
        "url": "https://www.theverge.com/2024/3/6/24092158/epic-apple-developer-account-terminated-digital-markets-act-alternative-ios-app-store",
        "content": "",
        "created_utc": 1709744958.0,
        "subreddit_name": "apple",
        "comments": 551
    },
    {
        "title": "The best candidates to replace Tim Cook as Apple CEO",
        "score": 732,
        "url": "https://appleinsider.com/articles/24/03/06/the-next-apple-ceo-who-could-succeed-tim-cook",
        "content": "",
        "created_utc": 1709742929.0,
        "subreddit_name": "apple",
        "comments": 341
    },
    {
        "title": "Alternative iOS App Stores Only Work for 'Grace Period' When Traveling Outside of EU",
        "score": 706,
        "url": "https://www.macrumors.com/2024/03/06/alternative-ios-app-stores-eu-grace-period/",
        "content": "",
        "created_utc": 1709728846.0,
        "subreddit_name": "apple",
        "comments": 532
    },
    {
        "title": "How Apple Sank About $1 Billion a Year Into a Car It Never Built",
        "score": 670,
        "url": "https://www.bloomberg.com/news/features/2024-03-06/apple-car-s-crash-design-details-tim-cook-s-indecision-failed-tesla-deal",
        "content": "",
        "created_utc": 1709765221.0,
        "subreddit_name": "apple",
        "comments": 237
    },
    {
        "title": "I'm a full time trader and this is everything I'm watching and analysing from premarket after market sold off yesterday",
        "score": 143,
        "url": "https://www.reddit.com/r/Daytrading/comments/1b7ypdq/im_a_full_time_trader_and_this_is_everything_im/",
        "content": "**ANALYSIS:**\n\n* We do have a few volatile events today. Firstly the ADP jobs numbers, which are expected to come in hotter than last month, whilst Powell talks in his testimony infant of Congress. \n* I think Powell’s talk will be important, but probably not the impact some may fear, as if you look historically at when Powell testifies, not as much movement as other speeches by Powell. Only thing I worry about is the fact that inflation ticked higher last month and could tick higher again this month if you look at Euro inflation reports for Feb as a guide. This could make Powel more hawkish than before. Still, Powell is generally v candid with his words so I’m not sure he will say anything which kills the market, but let’s see. \n* Regardless, if we look at risk reversal on DXY, we see it widen as traders continue to expect dollar to fall in medium term.\n* Traders are mostly long GBPUSD, and very short USDJPY. LEt’s see. \n* EURUSD they are long as well, but less so. Let’s see. Moving towards 1.09 which is trader target but may see rejection there. \n* Regarding price movement yesterday, we saw a squeeze as traders very short volatility, which was triggered by bad news around TESla and AAPl. \n* This moved VIX much higher to 15, which led to QQQ sell off.\n* Was. Bigger sell off than I anticipated, but signs of a major pullback still not there.\n* Traders still very short vol, and we saw them sell it off towards end of the day, and today, VIX is lwoer at 14. \n* Yesterday was likely a buying opportunity rather than a major negative event. \n* We can get volatility from JOLTS today, they tend to be volatile for the market, but still no major signs of pullback. \n* Institutional money flow on SPY not pulling back one bit. THeyre still long. \n* On oil we can expect a bit more sideways movement below 80, as volatility skew quite flat, but I think fundamentals support move back to 80 on WTI as producers look to extend cuts to supply.\n\nDATA LEDE:\n\n* South Korea Inflation rate comes hot, at 3.1% vs 2.9% expected. Above previous reading of 2.8%\n* MOM was hot 0.5% vs 0.4% expected\n* Aus GDP (Q4) - Comes stronger than expected, at 1.5% YOY growth rate, vs 1.4% expected. Previous reading was 2.1%\n* So it slowed vs last month, but beat expectations. \n* GERMAN exports and imports both beat expectation\n* Exports MOM came 6.3% Up, vs expectations of 1.5% increase\n* Imports were 3.6% up, vs expectations of 1.8% increase\n* This points to improving domestic demand and international demand, although is one data point. \n* Eurozone Retail Sales (Jan)\n* Retail sales were down 1% YOY, better than expectations of a -1.3% decline.\n* MOM retail sales were more or less in line.\n* So still declining YOY. This has been the case for more than a year. Not great, but in line with expectations. \n* ADP Employment Chnge (Feb) - Expected to have grown to 150k jobs placed according to official consensus. \n* POWELL TESTIMONY\n* JOLTS (Jan) - has been a volatile one for market reaction for intraday trading, so look out for this one. \n\n———— \n\nMARKETS:\n\n* SPX: pushing up towards 5100 again in premarket, low yday of 5058, after falling from 5110\n* NASDAQ: back Abvoe 18k again, this will be the key level for it to maintain. \n* Hong Kong MARKET pumps on PBOC pointing to more room to cut interest rates. Was up 2%, faded the gain a little bit though later in session. \n* China downs slightly, couldn’t maintain the break above 12k. That remains the key level. \n* GEr40: Slightly higher today although not by much, as markets await ECB decision tomorrow\n* FTSE100 - higher by 0.51%. Traders look more bullish with the positive catalyst of hopefully a supportive budget, but we have to see. \n* OIL - slightly higher, on tight supply, as many oil producing companies signal that they will be reducing supply. Also dollar lower. \n* GOLD - higher again, conintues to march up as USD pulls back. \n\nFX:\n\n* AUD higher on Australia growth numbers coming in better than expected, and also on the fact that China signal more rate cuts possible ahead. \n* Dollar down slightly ahead of ADP and Powell testimony, testimony will be key for dollar direction today\n* JPY higher as report that BOJ is apparently more confident now though about stronger wage growth. \n* GBP slightly higher, awaiting UK budget. \n* AUDUSD: was trading around 0.65, but has sustained a move higher today on PBOC news\n* GBPUSD at 1.272, above 1.27 ahead of Budget\n* EURUSD pushes towards 1.09. \n* USDJPY back below 150.\n\n**EARNINGS:**\n\n**CRWD**\n\n* CURRENT QUARTER: \n* Revenue of 945M beat by 12%\n* Operating income of 213M beat by 13%\n* Operating margin was 22.5% beat vs 22.4% expectation\n* EPS of 0.95 beat by 15%\n* FCF was strong, beat by 4.8%\n* ARR beat by 1.3%. ARR was up 35% YOY\n* Billings was a big beat by 18%. Billings points to future revenue expectations so thats important\n* GUIDANCE - next quarter:\n* Revenue of 904M was more or less in line \n* Operating income was in line \n* EPS of 0.90 beat by 8%\n* GUIDANCE Full Year:\n* Revenue was in line \n* Operating margin in line \n* EPS beat by 3%\n* Raised FCF margin guidance \n* Stock baed compensation $176M vs 165M expected, beat by 6.6%. This is a key reason why it is up. \n* Interesting comments from the commentary:\n* Flow Security acquisition, to enhance cloud data runtime security\n* PANW CEO on their earnings call said:\n* \"We are seeing some rogue pricing and competitive pricing pressures.\"\n* Meanwhile, CRWD CEO says:\n* \"We expect to continue seeing a favorable pricing environment.\"\n\n**JD EARNINGS:**\n\n* EPS of 0.75 beat by 0.12. beat by 20%\n* Revenue of 43B wa sup 4% YOY, and beat by around 4%\n* Margins increased to 3.2%, vs 3% last year. \n* Operating cash flow up 4% YOY\n* Said they finished the year strong with upticks in revenue and profitability\n* Their actions to focus on user experience and price competitiveness have paid dividends. \n* Heavy discounts are boosting demand basically. \n* Approves a $3B share repurchase program\n\nMAG 7:\n\n* AAPL - coming off back of its most significant 2 day drop in the stock. \n* META - Yesterday news - Facebook outages were being monitored, that occurred on Facebook and Instagram\n* META - today news, META is thinking about setting up first data center in India. \n* NVDA - yesterday, CFRA raises price target to 1000 from 840. \n* TSLA - say that their production outage will cost more than 100M euros. Said they expect power to be down for a few days. \n*  **TSLA - will give you 10k free supercharging miles when you buy a new Tesla vehicle by March 31**   \n \n* **Despite sell off in Tesla, MS maintained its price target on Tesla at 320, maintained at overweight.** \n* AAPL - Yesterday, Wedbush remained bullish on Apple, saying that brighter days will be ahead. Said sentiment is currently dismal right now, \n\nCOMPANY SPECIFIC:\n\n* Top 10 Most active in premarket by volume: \n* MARA, LCID, SOFI, AAPL, PLTR, TSLA, NVDA, GRAB, COIN, INTC\n* Other cybersecurity stocks are up on CRWD earnings. PANW up the least, due to rhetoric in crowd commentary which showed storng pricing. That makes it strange then that PANW said the pricing scenario is more competitive. \n* Crypto miners higher as BTC up 3%. \n* Chinese stocks generally higher as Hong Kong MARKET up 2% on PBOC signalling more rate cuts ahead. \n* PLTR - Will likely win $178m TITAN contract with the US Army, says William Blair. \n* INTC - L&T Tech and Intel will partner to develop AI solutions for traffic management\n* CRWD up on earnings\n* GTLB price correction after big earnings related sell off. \n* NIO - CLSA downgrades to peer perform from outperform, price target 6 vs previous 9.8\n* Morgan Stanley - lays off 9% of its staff at china asset management unit. Cuts staff amid shrinking assets and operating losses\n* COIN - says they are investigating errors users may be having when transacting. \n* BYD - expanding Chinese EV in Australia, amid rising eV demand there. \n* Also BYD another price cut for their cheapest car. \n* DIS - CEO expresses high confidence ins streaming profitability by fiscal Q4. \n* Citi CEO says he expects Q1 results to be slightly better than expected\n* DXCM - announces that their first ever over the counter CGM Stelo is cleared by the FDA. \n* CDNS - will buy BETA CAE Systems for 1.24\n* THOR down after earnings \n* ALB - prices a $2B equity offering. This comes after they did a $1.75B public offering of depositary shares\n* FSLR - CEO says tariff exemptions threaten US solar manufacturing\n* MGA announces $400m senior notes offering\n* LNG - prices $1.5B senior notes due 2034.\n* GTLB - raised to outperform by Wolfe Research, price target 75\n* TSM raises prices 8.7%\n* MRVL up with semis ahead of earnings tomorrow\n* SMCI - Argus initiates at buy, price target 1350\n\nOTHER NEWS:\n\n* BTC hit all time high then tumbled 10% on algo selling, Today is up 4% again. \n* UK pre election budget announcements- expectation is for a cut to national insurance, and more tax cut measures. Conservatives are struggling for popularity in pre election polls, so there will be high hopes on it. \n* ECB meeting tomorrow, expected to hold rates steady but we will get inflation nd growth estimates. Inflation estimates could be key as currently the market is forecasting lwoer inflation estimates than the ECB. \n* CHINA Congress Meeting Continues - They are increasing expectations of monetary and fiscal easing. Pointed to further room to cut rates more. \n* PBOC sees room for RRR and financing costs to decline. Officials say bond sales and tax cuts will help growth. \n* They said they will step up macro economic policy adjustments. \n* As such, offshore Chinese Yuan jumped today. \n* JPM calls Asia’s Tech sector as a bright spot amid global uncertainty\n* Ex BOJ official says bank of. Japan needs around 9 years to normalise balance sheet. \n* Apparently, BOJ officials have differing views on the timing of rate hikes \n* BOJ is apparently more confident now though about stronger wage growth. \n* Fitch affirms Korea at AA-, outlook stable\n* Iraq’s Oil minister says that Iraq are committed to oil output cuts. \n* Binance US has laid off 2/3 of its staff in wake of SEC lawsuit, with revenue plunging 75%. \n* Presidents comments yesterday:\n* Prices are still too high and some companies are still not passing on savings to customers. \n* Will launch task force to crack down on unfair pricing. \n* Former New York Fed economist, Steve Friedman, says that 3 rate cuts as base case still looks reasonable. But more risk now of less cuts and later cuts. \n* Hale.y is exiting the presidential race. \n* Etihad Airlines signals that they may do a possible IPO. This comes after their 2023 revenues rebound. \n\n&#x200B;",
        "created_utc": 1709728837.0,
        "subreddit_name": "DayTrading",
        "comments": 25
    },
    {
        "title": "Ex employee - hold out or sell",
        "score": 2,
        "url": "https://www.reddit.com/r/AAPL/comments/1b7kz8z/ex_employee_hold_out_or_sell/",
        "content": "So I previously worked at Apple and left back in 2012. I was stupid and didn’t start buying into the Apple stock program until 2011. I have held this whole time and been around for 2 different stock splits. Tbh the only reason why I never sold was bc I really don’t know much about the stock market. I kinda just let it do its own thing. I’ve seen a few people here say that they would sell if Buffett decided to and just wondering why people say that. Also, what amount of money made in from this stock would cause to sell? More just curious what people would do personally. Not a right or wrong question",
        "created_utc": 1709683328.0,
        "subreddit_name": "AAPL",
        "comments": 19
    }
]