[
    {
        "title": "Why is Intel losing to AMD & people just realized it now?",
        "score": 1419,
        "url": "https://www.reddit.com/r/investing/comments/hy3mgo/why_is_intel_losing_to_amd_people_just_realized/",
        "content": "Simple answer: [Dr. Lisa Su (how she turns around AMD)](https://www.youtube.com/watch?v=lHT5MRky9SA)\n\nWhen you invest in a company, it's not just the product that's important for the company, but its people and leadership as well. Because ultimately, a corporation is just an organization run by bunch of people, which Elon Musk emphasized this point. A company's leader who has a clear vision for the company will bring its people together and its competitive products to market for the future. You look at the leaders between Intel's and AMD's. One got a Ph.D in electrical engineering and has a firm grasp of where the industry is heading toward, whereas the other person who was previously a CFO just looks at spreadsheets and uses any means to appease the shareholders. How likely would a business major know anything what the semiconductor industry will look like in five years?\n\nIntel has been dominating 90% of the PC market for many years. The company becomes complacent and so do its shareholders' base as the stockholders enjoy their annual dividend payouts. You do that in a highly competitive semiconductor industry, your company will lose value and eventually get abandoned. You have to be constantly innovating to stay ahead, especially in the technology sector because that's just the nature of the industry. This isn't like consumer staples where the market remains static for a long time. A technology company's moat is easily broken if the company doesn't plan out its roll map & product lines for the next five years. A lot investors could tell this became quite apparent at the last Intel's earning report.\n\nThis also separates the difference between value investing & growth investing. Value investors look at financial statements of a company to judge how it appears now, whereas growth investors look at a company and make financial projections where the company can potentially go toward for the next several years. Growth stocks will never appear cheap at any current time, because if they do, then by definition they already stop growing. If you're a value investor by heart, I advise stay away from investing into tech stocks if you don't have a firm grasp about their respective, ever-changing industries, because most of them will never make sense to you.\n\nThere will be a time to revisit Intel. In my opinion, Intel needs a better leader who has an expertise in the field. Hitherto, AMD will continue to take market shares away from Intel to grow its revenues & earnings, because its leader already planned this out from the last few years. She knew her competitor would have a tougher time catching up in manufacturing the technology. AMD stock is going much higher for the next 2-5 years.\n\nDisclosure: AMD shareholders since $8.00",
        "created_utc": 1595753370.0,
        "subreddit_name": "investing",
        "comments": 522
    },
    {
        "title": "Kristy Viers: “I thought I would share how I, as someone who is visually impaired use my iPhone.☺️”",
        "score": 5907,
        "url": "https://twitter.com/Kristy_Viers/status/1287189581926981634",
        "content": "",
        "created_utc": 1595803825.0,
        "subreddit_name": "apple",
        "comments": 240
    }
]