[
    {
        "title": "The omicron panic is overdone. Buy the dips in these stocks, says JPMorgan",
        "score": 2445,
        "url": "https://www.reddit.com/r/stocks/comments/r78jjn/the_omicron_panic_is_overdone_buy_the_dips_in/",
        "content": "“Over the last several days markets have been in turmoil over the new COVID variant omicron. However, data on omicron is sparse, information contradictory, and some media has been exaggerating risks and highlighting worst case scenarios,” chief global strategist Marko Kolanovic and quant strategist Bram Kaplan wrote in a note to clients. They pointed fingers at a “media blitz” on Thanksgiving evening, one of the lowest market liquidity points in a year, that sent growth-sensitive assets crashing. They took issue with a selloff sparked by Moderna’s CEO, who dashed hopes that current vaccines will work against omicron. They argued his comments have been “invalidated by reports from Pfizer, Oxford, the WHO and the Israeli Health Ministry.”\n\nKolanovic and Kaplan said their clients are less worried about the variant and more about flight restrictions, which have included barring South African flights, but not European ones, where cases have also been spotted. They described assessments of omicron’s potential transmissibility as confusing at best. “In simple terms, when older variants are spreading via breakthrough infections, new variants will always appear to be significantly more transmissible than older ones.” They backed this up with a tweet by biomathemetician Gabriela Gomes.\n\nEarly reports suggest it may be less deadly, and if confirmed in coming weeks, that could turn omicron into a positive for markets, said the pair. Kolanovic and Kaplan raised the possibility that a less severe and more contagious variant may crowd out more severe variants, potentially speeding up the end of the pandemic and turning it into more of a seasonal flu. That’s amid vaccines and a growing list of treatments to tackle COVID, said the strategists. “If the market were to anticipate that scenario — omicron could be a catalyst for steepening (not flattening) the yield curve, rotation from growth to value, selloff in COVID and lockdown beneficiaries and rally in reopening themes,” said the team.\n\n“Also, if that scenario were to happen, instead of skipping two letters and naming it omicron, the WHO could have skipped all the way to omega. As such, we view the recent selloff in these segments as an opportunity to buy the dip in cyclicals, commodities and reopening themes, and to position for higher bond yields and steepening,” said the bank’s strategists. Here’s hoping they’re right.\n\n **The buzz** \n\nApple AAPL, -0.32% has reportedly warned suppliers that demand may be softer into 2022. Wedbush analysts lifted shares to $200 from $185, on optimism headed into 2022. They also see the “tech stalwart” as a “safety blanket” in a near-term COVID market storm. \n\nGlaxoSmithKline GSK, 0.03% GSK, +0.61% says its COVID-19 Sotrovimab antibody treatment is effective against the omicron variant, but based on lab test tubes. The U.S. has unveiled its plan for stricter COVID-19 testing on international travelers.\n\nWeWork shares WE, -2.65% are down after the co-working space group said it will restate financials and admitted a material weakness.\n\nMeanwhile, infections in South Africa, which raised the alarm over the variant last week, were at 8,561 on Wednesday, doubling in 24 hours. A top scientist in South Africa has warned that “more severe complications may not present themselves for a few weeks.”\n\n[https://www.marketwatch.com/story/the-omicron-panic-is-overdone-buy-the-dips-in-these-stocks-says-jpmorgan-11638447971?mod=home-page](https://www.marketwatch.com/story/the-omicron-panic-is-overdone-buy-the-dips-in-these-stocks-says-jpmorgan-11638447971?mod=home-page)",
        "created_utc": 1638454982.0,
        "subreddit_name": "stocks",
        "comments": 434
    },
    {
        "title": "Head Fake - Don't Be Fooled",
        "score": 1,
        "url": "https://www.reddit.com/r/AAPL/comments/r7ihvj/head_fake_dont_be_fooled/",
        "content": "HEADLINE was that suppliers say AAPL told them orders would be lower. Let's assess--Fact: at the same time backlogs and wait times for iphone13s go down, when just a month ago AAPL said on earnings call that they couldn't get enough parts to supply demand. Hmmm--do those things go together? Could it be the headline is correct--demand is down and that's why wait times are down. Don't be fooled by the head fake. Dow up today (and AAPL up 5 from low with it), but it was still down a buck. Dow and AAPL are headed down again.",
        "created_utc": 1638482461.0,
        "subreddit_name": "AAPL",
        "comments": 10
    },
    {
        "title": "What are your guys’ thoughts on the recent Bloomberg report that stated that the demand for iPhone 13 is “waning”? The pullback has been pretty sharp; $159 at the time of writing.",
        "score": 1,
        "url": "https://www.reddit.com/r/AAPL/comments/r79x5d/what_are_your_guys_thoughts_on_the_recent/",
        "content": "",
        "created_utc": 1638458961.0,
        "subreddit_name": "AAPL",
        "comments": 27
    }
]