[
    {
        "title": "One Year of Leaving a MacBook Pro Connected to Power",
        "score": 5042,
        "url": "https://www.reddit.com/r/apple/comments/paqapf/one_year_of_leaving_a_macbook_pro_connected_to/",
        "content": "Hello r/Apple\n\nOne year ago, I purchased the top model Intel MacBook Pro (“2.0GHz Intel Core i5 Quad-Core Processor with Intel Iris Plus Graphics, 1TB Storage”). However, I had a pressing question. Given that the pandemic was still ongoing, and I was doing Zoom University, **was it okay to just leave my laptop plugged into the charger all the time?** After all, I rarely left home, it was treated more like a desktop than a laptop.\n\nApple has a wealth of [support documents](https://www.apple.com/batteries/maximizing-performance/) on battery life and longevity. They go to great lengths to explain charge cycles and whatnot. However, nowhere on the website does Apple address the issue of leaving a laptop plugged in v. cycling the battery over a long period of time. I mean it’s a niche situation to begin with, but I still wanted answers.\n\nI next tried a simple Google search, but there is so much contradictory information online. Some say it’s perfectly okay, others say it degrades the battery because batteries don’t like being kept at a full charge. Some say it’s okay, but that you should cycle the battery once a month, while others remark that batteries don’t have a “memory” and so that practice is unnecessary. Some say keeping it on the charger is best for batteries because that will result in fewer cycles—plus, the battery “trickle charges” anyway. Still, others counter that leaving Macs plugged in all the time degrades the battery because of heat.\n\nThoroughly confused, I reached out to Apple support via chat. Support said that whether or not to keep a laptop plugged in was a “personal preference.” I asked if it even mattered because when a Mac is plugged into power it runs off AC power, and she confirmed this but clarified that the battery still drains anyway?\n\nWith no clear answer, I sent an email to Tim Cook with hopes that the executive office could direct me to someone with the right answer. T2 support or a battery engineer or something. I know what you’re thinking, “who cares?” I mean I wasn’t expecting my battery to be and behave like it was factory new a year or two later. I just wanted confirmation, *from Apple*, that such a practice was safe, and that it wouldn’t totally destroy my battery so I could rely on it when I could eventually start taking my new Mac out and about again. Anyway, no one responded to that email.\n\nNow it’s been a year. With a few exceptions such as travel, my MacBook Pro has been plugged into power daily, 24/7, whether I’m actively using it or not. I also seldom shut it down, just put it to sleep, though I do most of my work on an iPad. With a year of this behavior, how do the battery stats look?\n\nCharge Information:\n\n  Charge Remaining (mAh): 4405\n\n  Fully Charged:\tYes\n\n  Charging: No\n\n  Full Charge Capacity (mAh): 4502\n\nHealth Information:\n\n  Cycle Count: 43\n\n  Condition: Normal\n\n  Battery Installed: Yes\n\n  Amperage (mA): 0\n\n  Voltage (mV): 12558\n\nLess than 100 mAh down and only 43 cycles in one year. Like I said, I wasn’t expecting a brand new battery. My only concern was whether performance would be severely degrading by basically never cycling the battery. A year later we have our answer: No.\n\n**TL;DR:** Leaving your Mac laptop connected to power all the time is perfectly safe, and won’t negatively degrade battery life.",
        "created_utc": 1629821093.0,
        "subreddit_name": "apple",
        "comments": 488
    }
]