[
    {
        "title": "My Apple Watch just saved my Life",
        "score": 6859,
        "url": "https://www.reddit.com/r/apple/comments/ba02r7/my_apple_watch_just_saved_my_life/",
        "content": "I was laying in bed, enjoying some TV and homemade brisket, when my Apple Watch told me that my heart rate was weird af, and then, told me my heart rate was stupid fast (thank you heart rate alerts)\n\nCalled ER, when they arrived, they found me in serious trouble. Body went into shock, got rushed to the hospital in a stretcher, and got taken into trauma.\n\nI felt totally fine before everything happened, and then notifications, and then BAM, everything goes nuts.\n\n100% thank you apple for making an amazing accessory and tool that helps people stay not dead.\n\nUpdate 1: doctor just swung by, said that when I was picked up by the paramedics, I was suffering tachycardia, they gave me an IV and put me on oxygen, and applied EAD pads to my torso. Fortunately they never needed to be used, but I passed out in the ambulance on the way to the hospital. Woke up in a hospital bed, and at this point the docs are just awaiting some results and such. Apparently I should be clear to leave, but have an appointment scheduled with a cardiologist tomorrow.\n\nUpdate 2: me and my IV thingy after being moved to a waiting room - https://imgur.com/a/YuVgVCQ\n\nUpdate 3: Doc swung by with my ECG and noted that while all the chambers of the heart were beating like they should, they were doing so at an abnormally fast rate. Got schedule me to see a Cardiologist tomorrow.\n\nUpdate 4: Doctor says it was SVT, and scheduled me for an ECHO (I think?) and took some more blood after I’d recovered and been at rest for a few hours to check for any issues with my thyroid. Been discharged from the hospital but am to return tomorrow afternoon.\n\nFinal Update: was fitted with one of those 24-hour heart monitors after an echocardiogram, doctors concluded that the issue was due to nerves(?) not doing their job and delivering weak signals, received the option for a pacemaker or mandatory (supervised) cardio exercise to strengthen the heart.",
        "created_utc": 1554519818.0,
        "subreddit_name": "apple",
        "comments": 553
    },
    {
        "title": "Rumor: Apple to Launch iPhone XE with 4.8-inch Edge-To-Edge OLED Display with Face ID in Q3 2019",
        "score": 4359,
        "url": "https://www.cultofmac.com/616998/sketchy-report-claims-cheaper-iphone-xe-is-coming-this-fall/",
        "content": "",
        "created_utc": 1554573214.0,
        "subreddit_name": "apple",
        "comments": 609
    }
]