[
    {
        "title": "Hindenburg: We View Nikola’s Response As a Tacit Admission of Securities Fraud",
        "score": 1943,
        "url": "https://www.reddit.com/r/investing/comments/it7zdv/hindenburg_we_view_nikolas_response_as_a_tacit/",
        "content": "Nikola Failed to Address 43 of our 53 Questions. Of Those It Touched On, It Largely Confirmed Our Findings or Raised New Questions.\n\nNikola Admitted That Its Deceptive “Nikola One in Motion” Video Was, In Fact, Video of The Semi-Truck Simply Rolling Down A Hill.\n\nThe Company Says It Never Claimed the Truck Was Powering Itself, Despite Deceptive Editing and Claims That it Had “1,000 HP” With “Sports Performance”\n\n&#x200B;\n\nIn our report, we explained how the company released a [video](https://www.youtube.com/watch?v=IAToxJ9CGb8&feature=youtu.be) called “Nikola One in Motion”, which made it seem that its Nikola One semi-truck was traveling under its own power at a high rate of speed. Angles in the video were edited to make it appear as though the semi was moving on a roadway that was flat, or even uphill.\n\nIn Monday’s response, the company acknowledged that its vehicle was not functioning under its own power, and instead, was apparently simply showcasing the power of gravity. It claimed that using the term “in motion” dispelled the deceptive nature of the video.\n\nWe disagree. Beyond common sense, the company referred to the Nikola One as “**the 1,000 HP**, zero-emission Nikola One semi-truck” in the description of its video. Obviously, the truck can’t have 1,000 horsepower or even 1 horsepower if it doesn’t power itself.\n\n&#x200B;\n\nThe whole response:\n\n[https://hindenburgresearch.com/nikola-response/](https://hindenburgresearch.com/nikola-response/)",
        "created_utc": 1600173721.0,
        "subreddit_name": "investing",
        "comments": 355
    },
    {
        "title": "$AAPL Reveals 5nm Chip with A14 Processor",
        "score": 1799,
        "url": "https://www.reddit.com/r/stocks/comments/ite63k/aapl_reveals_5nm_chip_with_a14_processor/",
        "content": "AMD is gaining against Intel on their 7 nm chip.  \nIntel is still struggling with their 10 nm.  \nApple announces 5 nm.  \nThis looks like a significant tech advancement  \nThey also announced a blood oxygen sensor for the Apple Watch on top of performance improvements\n\nSurprised to see the stock price retracting\n\nUpdate:  \nScooped up some cheap $120 calls expiring this week while it touched red after the event  \n",
        "created_utc": 1600193344.0,
        "subreddit_name": "stocks",
        "comments": 286
    },
    {
        "title": "Apple will release iOS 14 and iPadOS 14 on September 16th",
        "score": 12547,
        "url": "https://www.theverge.com/2020/9/15/21436979/apple-ios-ipados-14-release-date-september-16?utm_campaign=theverge&utm_content=chorus&utm_medium=social&utm_source=twitter",
        "content": "",
        "created_utc": 1600192945.0,
        "subreddit_name": "apple",
        "comments": 1239
    },
    {
        "title": "Apple announces new iPad Air that looks more like an iPad Pro",
        "score": 6766,
        "url": "https://www.theverge.com/2020/9/15/21436500/apple-ipad-air-new-design-features-release-date-price?utm_campaign=theverge&utm_content=chorus&utm_medium=social&utm_source=twitter",
        "content": "",
        "created_utc": 1600192171.0,
        "subreddit_name": "apple",
        "comments": 1364
    }
]