[
    {
        "title": "Lost in translation (RR CEZ)",
        "score": 29,
        "url": "https://www.reddit.com/r/stocks/comments/1giwn7a/lost_in_translation_rr_cez/",
        "content": "Hello, I believe opportunity to beat the market is in finding market ineffectiveness. How much market ineffectiveness do you believe, there is in different information availability between languages?\n\nWhy I am asking.\n\nLast week ČEZ has bought 20% of Rolls Royce SMR. And it was massive event in Czech language. Largest net newspaper had article about it on the front page. (remainder google translate can translate web-pages if you want to read).\n\nLargest newspaper article: https://www.seznamzpravy.cz/clanek/ekonomika-firmy-cez-koupi-za-miliardy-podil-v-rolls-royce-smr-budou-vyrabet-reaktory-263383\n\nState television: https://ct24.ceskatelevize.cz/clanek/domaci/cez-a-rolls-royce-smr-budou-spolupracovat-na-vyvoji-modularnich-reaktoru-354812\n\nWeb about energy industry: https://oenergetice.cz/jaderne-elektrarny/cez-koupi-za-miliardy-podil-v-rolls-royce-smr-budou-spolupracovat-na-reaktorech\n\nWeb about investing: https://www.kurzy.cz/firmy/cez-rolls-royce/\n\neverybody was writing about it. So I thought: I want to see what English speakers think about it. And there was nothing. I bought shares and 1 call. Thinking once they translate the news, market will react. I am already waiting a week. And nothing. When I look at Yahoo finance nothing happened at all. When I look at seeking alpha or IBKR. One simple article, no analysis or discussion.\n\n20% of SMR company has been bought by corporation which has almost monopoly for energy in Czech republic (because it would be illegal to have perfect monopoly). ČEZ talks about need to build up to 10 SMR to replace coal heat/power plants in coming years. ČEZ has recently also bought Škoda JS (Škoda nuclear engineering). That company has produced nuclear reactors in the past. And still has all the tools and facilities to produce nuclear reactors. They have “unused” reactor hall which is currently producing storage units for spent nuclear fuel, because nobody orders reactors today. RR is producing SMR design to be build in factory. ČEZ owns a factory for nuclear reactors in middle of EU. And no one speaks about the synergy. \n\nReaction of the market, whole weak of nothing -1%. As if there were no news. So it got me thinking, how often this happens? Do you know any other example of events which has vastly different information availability or point of view based on language?\n\n*Disclosure: I have 500 shares of RR and 1 RR call, bought this week, and ČEZ shares long term unrelated to this.*",
        "created_utc": 1730666361.0,
        "subreddit_name": "stocks",
        "comments": 7
    },
    {
        "title": "3X / 5X / 10X ETPs - how do they work during sharp downturns?",
        "score": 28,
        "url": "https://www.reddit.com/r/stocks/comments/1gir2yn/3x_5x_10x_etps_how_do_they_work_during_sharp/",
        "content": "Could be a basic question, so forgive me for my ignorance. (I think), I understand futures & options quite well, but don't fully understand leveraged ETPs (exchange traded products), which claim to perform 3X / 5X / 10X of an index or any other underlying e.g. Apple.\n\nSo, let's say I buy such a product, 10X on Apple. If Apple crashes 12%, do I lose **more than** my capital? Here, I'm talking about 12% loss in a day, and not 6+6% over two days, which could lower my investments to near-zero but not zero or negative.\n\nIf I do end up owing money, how's this any different from buying a future?",
        "created_utc": 1730652097.0,
        "subreddit_name": "stocks",
        "comments": 9
    },
    {
        "title": "What’s the best app to use",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gidac7/whats_the_best_app_to_use/",
        "content": "I’m currently using investing.com on iOS but I am also looking for a potentially better app if it is one. I heard Robinhood was a decent app to use but their fees are also kinda high I was told. Im new to the marketing world and will finally have a chance to actually invest my money. As I have just worked pretty much week in and week out. Now having a chance to invest when I’m making decent money seems like the right and smart thing to do. \nSo any tips on Stocks to look into would be helpful. But definitely starting off with a safe and reliant app to dive into would also be beneficial if you guys don’t mind. ",
        "created_utc": 1730601937.0,
        "subreddit_name": "investing",
        "comments": 4
    },
    {
        "title": "Buybacks or IPOs? Which is better as a retail investor?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gijauq/buybacks_or_ipos_which_is_better_as_a_retail/",
        "content": "My take:\n\n**Advantages of Buybacks**\n\n**1. Boosting Share Value**: Buybacks reduce the number of shares outstanding, which can increase earnings per share (EPS) and can lead to a higher stock price.\n\nEg: Apple has a series of buybacks for billions of dollars that has benefitted a lot of shareholders.\n\n**2. Boosting Investor Confidence**: Buybacks can boost investor sentiment. Investors interpret it as a sign that the company expects to perform well in the future.  \n\n**Advantages of IPOs**\n\n**1. Growth Potential:** IPOs provide an opportunity to invest in a company at an early stage, potentially reaping substantial rewards as the company grows.\n\n**2. Market Sentiment:** IPOs often attract considerable market attention and investor interest, which can lead to initial price surges.\n\nExample: Paras Defence was listed at a premium of 171% leading to instant gains for buyers in a short time. It does not end here. The share price surged by another 143% within 3 weeks giving more gains to the shareholders.\n\nWhile buybacks are good for existing shareholders as they can sell their shares above the market price, IPOs provide decent prices for retail investors to accumulate shares in case they are able to get allocation for the applied IPO.\n\nWhat do you think about IPOs and buybacks, especially for retail investors? Share your views in the comments",
        "created_utc": 1730626937.0,
        "subreddit_name": "investing",
        "comments": 5
    },
    {
        "title": "Chinese Hackers Stole Phone Audio From Both Harris and Trump Campaigns",
        "score": 3750,
        "url": "https://www.wsj.com/livecoverage/harris-trump-election-11-01-24/card/chinese-hackers-stole-phone-audio-from-both-harris-and-trump-campaigns-Sfa6s0vIBEmEWOjeaZ8e",
        "content": "",
        "created_utc": 1730597824.0,
        "subreddit_name": "news",
        "comments": 135
    },
    {
        "title": "Apple reportedly releasing ‘total redesign’ for MacBook Pro in 2026",
        "score": 2975,
        "url": "https://9to5mac.com/2024/11/03/apple-macbook-pro-redesign-2026/",
        "content": "",
        "created_utc": 1730640892.0,
        "subreddit_name": "apple",
        "comments": 887
    },
    {
        "title": "Gurman: iOS 18.2 releasing slightly earlier than usual",
        "score": 698,
        "url": "https://9to5mac.com/2024/11/03/gurman-ios-18-2-with-releasing-slightly-earlier-than-usual/",
        "content": "",
        "created_utc": 1730640813.0,
        "subreddit_name": "apple",
        "comments": 192
    },
    {
        "title": "Kuo: Cheaper ‘Apple Vision’ headset delayed beyond 2027",
        "score": 522,
        "url": "https://9to5mac.com/2024/11/03/cheaper-apple-vision-delayed/",
        "content": "",
        "created_utc": 1730639583.0,
        "subreddit_name": "apple",
        "comments": 157
    },
    {
        "title": "What to Expect From Apple's M4 Ultra Chip Next Year",
        "score": 461,
        "url": "https://www.macrumors.com/2024/11/03/what-to-expect-from-m4-ultra-chip/",
        "content": "",
        "created_utc": 1730664306.0,
        "subreddit_name": "apple",
        "comments": 140
    },
    {
        "title": "I created a personal finance app that lets you track your savings, debts, and expenses privately with iCloud",
        "score": 239,
        "url": "https://www.reddit.com/r/apple/comments/1gimkml/i_created_a_personal_finance_app_that_lets_you/",
        "content": "[Image](https://imgur.com/a/jlsaeX7?s=sms)\n\n**Screenshots & UI:** [View Gallery](https://www.reddit.com/r/iOSProgramming/s/JfJjruelgR)\n\n**App Store Link:** [DownPay for iOS](https://apps.apple.com/app/apple-store/id6474574024?pt=126403444&ct=rapplepost&mt=8)\n\nHi r/apple!\n\nMy first app is a debt and savings tracker that lets you log your debts and savings goals. The UI becomes a dashboard to monitor those debts and savings, with many charts, projections, and calculators integrated into the debts. \n\nAll entered data is saved *only* on the device and in iCloud and is *100% private*. It doesn’t have logins or synchronization with bank accounts, it works offline and doesn’t have a signup to use. \n\n*Current Features:*\n\n**Debt Manager:**\n\n   - Log 14 types of debt in one place, including credit cards, student loans, auto loans, mortgages, and more.\n   - Easily add and log debt activity, view detailed progress reports, and plan repayment with a user-friendly interface.\n   - See detailed Amortization, Debt Payoff dates, and interest estimations for most debts\n   - Asset metadata for Debts: log mortgages to Houses, Cars to loans, student loans to degrees, etc\n\n**Savings Manager:**\n\n   - Log savings goals for downpayments, emergency funds, weddings, home renovations, cars, and much more.\n   - Each savings can have multiple sources of funds to log across more than one place (such as savings account, gifts from family or brokerage + savings + physical cash, etc) \n   - Some savings types allow “downpayment” logic. For example, when you save for a car/house, you can save 10,20,50,100% of the total purchase price. \n\n**No Data Tracking:**\n\n   - DownPay collects no data whatsoever from users, no 3rd party ads, no analytics, etc\n\n**No Subscription:**\n\n   - Free, or One-time Lifetime unlock for unlimited\n\n*Free Version:*\n\n- Log 3 Debts\n- Log 2 Savings Goals\n\nIn-App Purchases: DownPay Pro\n\n- One-time $15\n- Monthly $0.99\n\n\n**New features built recently:**\n\n- [Detailed Amortization tables & charts](https://www.reddit.com/r/iosapps/s/u58Mvf0LTc)\n- [Paycheck Allocator for debts & expenses](https://www.reddit.com/r/SwiftUI/s/1SoSvCPdmP)\n- [Vehicle Search - USA & International](https://www.reddit.com/r/DownPayApp/s/xUlcbtjcej)\n- Hide balances & [*over 20+ currencies*](https://www.reddit.com/r/SwiftUI/s/8JcJBSPpJE)\n- In-app requests for new features, currencies, icons, and more\n\n**What I'm building now:**\n\n- Detailed timeline charts\n- Enhanced breakdowns\n- Expenses & Budgeting\n- and more, [view my Roadmap](https://lifeutilityapps.com/downpay/roadmap?isNativeEmbed=true)\n\nIf you have any feedback, suggestions, or questions, please comment below 😃 I love implementing suggestions from other Redditors, you all give great feedback! If you enjoy my app please drop an App Store rating, it helps a lot ❤️\n\nThanks so much!\n\nGet for free on the App Store: [https://apps.apple.com/app/apple-store/id6474574024](https://apps.apple.com/app/apple-store/id6474574024?pt=126403444&ct=rapplepost&mt=8)",
        "created_utc": 1730639677.0,
        "subreddit_name": "apple",
        "comments": 106
    },
    {
        "title": "Apple will soon be selling a top head strap for Apple Vision Pro's Solo Knit band",
        "score": 238,
        "url": "https://9to5mac.com/2024/11/02/apple-vision-pro-top-head-strap/",
        "content": "",
        "created_utc": 1730603326.0,
        "subreddit_name": "apple",
        "comments": 16
    },
    {
        "title": "LogIT – The Fishing Journal  \nThe iOS app for anglers, by anglers. Get the Lifetime Pro version for free in the next 72 hours, no subscription required!\n",
        "score": 38,
        "url": "https://www.reddit.com/r/apple/comments/1gisfr4/logit_the_fishing_journal_the_ios_app_for_anglers/",
        "content": "Hello r/apple!\n\nToday, we, Maik and Daniel, would like to introduce our self-developed app [LogIT](https://apps.apple.com/de/app/logit-the-fishing-journal/id6667102943?l=en-GB). Like many anglers, we also record our fishing days and catches to look back later and learn from them. A handwritten catch diary has always been a hassle, and the existing apps didn't really convince us. So, we decided to develop our own solution in our free time. After about 7 months of hard work, the first version of LogIT is finally available for iPhones and iPads.\n\n\n\nWhat makes LogIT special?\n\n \\- 📒 Organized diary view instead of chaotic catch lists  \n\n\\- 📊 Visual statistics – Insightful analysis of your catches  \n\n\\- 🖱️ Easy to use and intuitive design  \n\n\\- 🌦️ Automatic logging of weather data  \n\n\\- ☁️ Data backup – iCloud backup and synchronization  \n\n\\- 🚫 No registration required – Start right away, without tedious sign-up processes \n\n\\- ❌ No mandatory subscription  \n\n\\- 🛑 Ad-free – No annoying banners or pop-ups  \n\n\\- 🎨 Customizable color scheme  \n\n\\- 🌙 Dark mode – For comfortable use even at night  \n\n\\- 🐟 Quick recording of bycatches in seconds  \n\n\\- 🔒 No unnecessary data collection – We respect our users' privacy  \n\n\n\n The best part: The lifetime Pro version of LogIT is completely free for 72 hours! We hope the app will become a helpful companion for many anglers. If you are not into fishing but you may know someone who would benefit from a free logbook feel free to share. Numerous updates and new features are already in the pipeline, and we're excited to hear your feedback!\n\n Try out LogIT and let us know what you think. A positive review in the App Store would be a huge motivation boost and the cherry on top! Feel free to share the app with your friends. Thanks in advance.\n\n Tight lines and best wishes, Maik and Daniel 🎣  \n\n P.S. There’s a small bug: On iOS 17, the “Dive in” button doesn’t work sometimes when the app is first launched. However, closing and reopening the app should fix this. There are no issues on iOS 18. A new update is already published and will soon be online.\n\nApp Store link: [https://apps.apple.com/de/app/logit-the-fishing-journal/id6667102943?l=en-GB](https://apps.apple.com/de/app/logit-the-fishing-journal/id6667102943?l=en-GB)",
        "created_utc": 1730655554.0,
        "subreddit_name": "apple",
        "comments": 9
    },
    {
        "title": "Daily Advice Thread - November 03, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/apple/comments/1gikcs3/daily_advice_thread_november_03_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1730631629.0,
        "subreddit_name": "apple",
        "comments": 32
    },
    {
        "title": "MacBook Mini and MacBook Pro M4 - Why upgrading might save you money /w Joswiak and Ternus",
        "score": 0,
        "url": "https://youtu.be/TfXP8b0tuZk",
        "content": "",
        "created_utc": 1730616087.0,
        "subreddit_name": "apple",
        "comments": 11
    },
    {
        "title": "Apple Finally Finds Its Gaming Console With the New Mac Mini",
        "score": 0,
        "url": "https://www.bloomberg.com/news/newsletters/2024-11-03/apple-finally-finds-its-game-console-rival-with-the-new-m4-and-m4-pro-mac-minis-m31na57p",
        "content": "",
        "created_utc": 1730641592.0,
        "subreddit_name": "apple",
        "comments": 82
    },
    {
        "title": "I Created an App to Help Effortlessly Extend Your MacBook's Battery Life by 10-15%",
        "score": 0,
        "url": "https://www.reddit.com/r/apple/comments/1ginx2u/i_created_an_app_to_help_effortlessly_extend_your/",
        "content": "Hello!\n\nI'd like to introduce my first Mac app - **Dreamless**.\n\nThe concept is simple: it automatically turns off Wi-Fi/Bluetooth when your Mac goes to sleep and turns them back on when it wakes up.\n\nYou may wonder why such an app is needed. The answer is simple: it saves your MacBook's battery life, helping keep it in good condition for as long as possible. It also prevents unwanted connections/processes from running without your knowledge when your Mac is asleep.\n\n**Features:**\n\n\\- Ability to toggle Wi-Fi and Bluetooth separately.\n\n\\- All controls are in the menu bar - just two buttons!\n\n\\- Uses minimal resources on your Mac. Overall, the use of system resources is close to zero.\n\n\\- Option to add to auto-start.\n\nWorks on Apple Silicon and Intel. Requires macOS 13+.\n\n**Downsides:**\n\n\\- Despite my efforts to streamline this, due to macOS security, you’ll need to enter your admin password a few times during installation. This isn't to grant access to critical system services but simply to create folders, copy a few essential files, and run the program in the background for proper functionality.\n\n\\- Disabling Wi-Fi may affect the Find My feature.\n\nI use Dreamless daily, both with an external monitor and without any peripherals. With an external monitor, if I wake up my Mac by any means (I use a USB mouse), Bluetooth devices like the keyboard and trackpad connect in a few seconds. Without peripherals, it runs flawlessly.\n\nIn the end, I’ve created a handy utility I've been using for over a year.\n\nFor your safety, the app is signed and notarized, meaning it’s been verified by Apple for malware.\n\nTo celebrate the launch, I’m offering a **75% discount** with the promo code **APPLE**, bringing the price down to just $1. The promo code will be valid for a month, until December 3rd. All future updates will be free.\n\nCheck out the app here: [https://dreamless.app](https://dreamless.app). \n\nI’d love to hear your feedback.\n\nThanks for your attention, and have a great day.",
        "created_utc": 1730643669.0,
        "subreddit_name": "apple",
        "comments": 15
    },
    {
        "title": "Intel says integrating RAM into Lunar Lake SoC was a mistake, might abandon desktop GPUs again | Panther Lake and Nova Lake laptops will return to traditional RAM sticks",
        "score": 430,
        "url": "https://www.techspot.com/news/105407-intel-not-repeat-lunar-lake-integrated-memory-design.html",
        "content": "",
        "created_utc": 1730630664.0,
        "subreddit_name": "technology",
        "comments": 67
    },
    {
        "title": "Lime green iBook G3",
        "score": 319,
        "url": "https://www.reddit.com/gallery/1gijnq0",
        "content": "Hey mac fans!\nI have a clamshell iBook G3 laying around for a while, but I want to pass it onto someone hopefully.\nIt is working, on a swedish MacOS 9.1. It looks okay from the outside, only a few minor cracks on the handle and the missing piece of the Apple logo. It won’t hold a charge, but on the charger it is working.\nWhat do you people think it is worth today?",
        "created_utc": 1730628562.0,
        "subreddit_name": "mac",
        "comments": 14
    },
    {
        "title": "Why does that feel like cheating? 🥲 ",
        "score": 281,
        "url": "https://i.redd.it/mazoc6cg7ryd1.jpeg",
        "content": "So pumped for the M4 Pro, but... I've been enjoying the M1 Pro Macbook so much. It has been such a great work companion. If it had more than 16GB RAM I'd keep it for a few more years. \n\nWhat a strange bag of conflicting feelings, anyone feels the same?",
        "created_utc": 1730668988.0,
        "subreddit_name": "mac",
        "comments": 136
    },
    {
        "title": "Macbook screen turns black if opened more than half way",
        "score": 103,
        "url": "https://www.reddit.com/gallery/1gikzd7",
        "content": "as the title says, Macbook Pro 2019 if i open it more than  half way it goes black with this blue line. should i take it to a repairshop? I can’t afford the £400 quotes ive seen online. Any help appreciated ",
        "created_utc": 1730634165.0,
        "subreddit_name": "mac",
        "comments": 43
    },
    {
        "title": "Bob Woodwards 2018 Desktop icon size....",
        "score": 22,
        "url": "https://www.reddit.com/r/mac/comments/1giv8aa/bob_woodwards_2018_desktop_icon_size/",
        "content": "https://preview.redd.it/vjayjgxkoqyd1.jpg?width=1600&format=pjpg&auto=webp&s=5f44bfb3297f34507304a443fe7eb6a27525636c\n\n",
        "created_utc": 1730662738.0,
        "subreddit_name": "mac",
        "comments": 14
    },
    {
        "title": "My wife was scared by something her MacBook Pro did tonight. Can you explain?",
        "score": 11,
        "url": "https://www.reddit.com/r/mac/comments/1gifjq6/my_wife_was_scared_by_something_her_macbook_pro/",
        "content": "Hi all,\n\nSo tonight my wife's computer acted up in a really unusual way. She's the type who can't handle horror movies and she's pretty freaked out. In fairness to her, it was very odd. I'm hoping I can describe it well enough that one of you can provide an explanation?\n\nShe had her MacBook Pro open and plugged into power in her office, but asleep. She hadn't touched it since clocking out of her WFH job on Friday. All of a sudden, it started making a noise very very rapidly, not quite a beep, more like a low chime, the kind you get for those little Mac notifications that pop up in the top right corner of your screen. This noise was happening about three or four times per second. In conjunction with that, the screen was lighting up and going dark at about that same rate. I witnessed it and it honestly did look like something out of a horror movie lol.\n\nShe unlocked the laptop with her fingerprint and just started frantically closing things. There was a notification in the corner that disappeared and she closed out her main set of tabs and it all stopped. It all happened too fast to really process what any notification or words on the screen said.\n\nCan anyone give an explanation for what happened there, so my wife can sleep? ",
        "created_utc": 1730609952.0,
        "subreddit_name": "mac",
        "comments": 49
    },
    {
        "title": "MacBook light flashing",
        "score": 8,
        "url": "https://i.redd.it/qnmvvin09ryd1.jpeg",
        "content": "I dont, know what model MacBook this is, so I apologize. But does anyone know why this light flashes and the MacBook doesn't turn on? I don't know if it's dead or just not working but any help would be appreciated!",
        "created_utc": 1730669538.0,
        "subreddit_name": "mac",
        "comments": 7
    },
    {
        "title": "Is this imac worthless?",
        "score": 8,
        "url": "https://www.reddit.com/gallery/1giman5",
        "content": "recently bought this old mac from facebook market place for really cheap knowing something was definitely up with it but my curiosity took over\n\nwhen i plug it in and power on it takes a significant amount of time to start up and show an apple logo, followed by an error screen that keeps looping after the screen goes black, i’ve showed it to some friends and they have no idea and i basically i think it’s screwed but just wanted to know what some people thought could anyone let me know\n\nalso if you need more pictures or a video of the start up please DM ",
        "created_utc": 1730638812.0,
        "subreddit_name": "mac",
        "comments": 7
    },
    {
        "title": "Good plan for migrating to Apple silicon on a Mac mini?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1giwkfp/good_plan_for_migrating_to_apple_silicon_on_a_mac/",
        "content": "4 months ago, I migrated from Windows 10 to a used Mac Mini 2018 for \\~$180. I understood that my time on this Intel chip was limited since newest chips are Apple silicon but I’ve already experienced features I want that are only available on Apple silicon. I‘ve looked at used Mac Mini M1, M2, M3 as well as a new M4. Apple is offering a trade-in $115 credit for my current Mac Mini and I have a second credit of $85 from a recycle of my wife’s iPhone ($200 total). The lower end M4 is more than sufficient for my needs and it feels like the right move to pre-order one from Apple ($599 list price - $200 credit = $399). Used M1s (eBay) are going for around $300 so this seems like a no-brainer. Am I overlooking anything here or does that sound like the right plan to get onto Apple silicon?",
        "created_utc": 1730666157.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "MacBook Pro 13’ inch black screen ",
        "score": 3,
        "url": "https://i.redd.it/acf54cs7pqyd1.jpeg",
        "content": "Hey everyone,\n\nRecently, my girlfriend's MacBook Pro started having some strange issues:\n\n- First off, the MacBook was just sitting on a table for about a week. It didn’t fall or get damaged in any obvious way.\n- Then, when she opened it, she noticed the screen would go black when she power the Mac.\n\nI suggested connecting it to an external display, and that worked... for about three days. Then, it stopped working on the external monitor as well.\n\nHere’s what I know about the MacBook:\n- It’s a 13-inch MacBook Pro with two USB ports and a headphone jack.(2019 I guess)\n- I’ve tried resetting the SMC and NVRAM, but that didn’t help.\n- The screen stays black, but there’s a faint backlight, so I know it’s getting power.\n- The keyboard seems to be working—I can activate VoiceOver and hear it, and the caps lock key also lights up.\n\nHas anyone encountered something similar or have any ideas on what might be causing this? Repair it would cost her the same amount of a new Mac so it’s not a possibility \n\nBelow is a picture of  the black screen that is happening now \n\n\nThanks in advance!",
        "created_utc": 1730662858.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Question on Thermals: 16\" MacBook Pro vs. M4 Pro Mac Mini",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gibt97/question_on_thermals_16_macbook_pro_vs_m4_pro_mac/",
        "content": "Hey everyone,\n\nI’m considering a new setup and trying to decide between the 16\" MacBook M4 Pro and the M4 Pro Mac Mini. My primary concern is thermal performance and how well each will handle sustained workloads without throttling.\n\nI’ll be configuring both with 14-core CPU / 20-core GPU and 48GB of unified memory. Given that these are the same specs for each device, I’m curious which one you think will handle heat better over long sessions.",
        "created_utc": 1730597146.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Mac for book editing",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gibgyc/mac_for_book_editing/",
        "content": "I edit books, and often deal with large MS Word manuscripts containing many tracked changes and comments, which is a surprising resource hog. Right now I'm using a 2019 i9 MacBook Pro and it's painfully slow, sometimes taking 5-10 minutes to fully load in 1000 page manuscripts, and often lagging and freezing when editing it. Even smaller 60-100 page documents with many tracked changes are laggy. I am trying to upgrade so that I can have a seamless experience with Word, as far as possible. What should I look for, and what would help speed up the program – CPU or RAM? I hook up to two external monitors, though I sometimes move around with the laptop for other work and calls.",
        "created_utc": 1730596061.0,
        "subreddit_name": "mac",
        "comments": 10
    },
    {
        "title": "Finder won't relaunch",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1giaxtk/finder_wont_relaunch/",
        "content": "I'm using macOS Catalina 10.15.7 and finder literally won't restart, even after multiple days of waiting.",
        "created_utc": 1730594409.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "What can I use my old Macbook for?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1giz6f4/what_can_i_use_my_old_macbook_for/",
        "content": "I was one of the unlucky ones who purchased the last macbook before M1, I have a 16 Inch Macbook Pro (2019, Core i9) That I spent almost 3k on and retired 2 years later when I got a Mac Studio. I planned for the macbook to last me for longer but I got so tired of just how awful the performance was for me (to be fair, im a video editor who works with SERIOUSLY demanding files) \n\nI dropped it last year, and everything was fine with it except that it seems one of the fans isnt quite working right, I tried using it for field work, but it kept crashing and overheating, so its ended up sitting on a shelf for the last few years. \n\nHonestly, I feel I havent gotten my moneys worth yet, so I want to find a use for it, im wondering if anyone has any suggestions or Ideas for how I can get this thing to work, Its powerful enough for me to feel like im wasting its potential, but not powerful enough for me to use it for my day to day work... so, any thoughts?",
        "created_utc": 1730673028.0,
        "subreddit_name": "mac",
        "comments": 7
    },
    {
        "title": "mac mini hub for the m4 mini",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1givwkg/mac_mini_hub_for_the_m4_mini/",
        "content": "I have one of those USB hubs with SSD enclosure that sit directly under the mac mini with the same footprint. I wonder who will make them for the new mac mini. \n\n\nI’m surprised it hasn’t been advertised already like how iPhone cases have been sold even before the phone arrives. Maybe I’m just too excited for my mac mini to arrive as well and looking for accessories to add on to it",
        "created_utc": 1730664448.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "Mac mini to a windows laptop",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1giks49/mac_mini_to_a_windows_laptop/",
        "content": "I am in the creative field and I wanna get a mac mini in the future and was wondering if i could get the mac mini and use my lenovo ideapad as a monitor/keyboard-mouse unit.\nSo i could have a really fast, macOS computer and have access to my windows laptop in the same device. Is it possible? Is it worth it?",
        "created_utc": 1730633403.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Upgrading from base M1 to M4 Pro?",
        "score": 1,
        "url": "https://www.reddit.com/r/mac/comments/1gif80o/upgrading_from_base_m1_to_m4_pro/",
        "content": "I bought a base **8GB M1 MacBook Pro** when it first came out (512GB). Im **considering upgrading** to a new **M4 Pro MBP** but I'm not sure if it will be a worthwhile upgrade. My main use will be for finishing a **Comp Sci** degree, but I also do a lot of creative projects in **After Effects** and other adobe apps (might explore more with blender in the future too). I don't want to spend too much over $2000. Would it be best to get the 12-core CPU/16-core GPU option and maybe upgrade ram to 48GB, or would the 14-core CPU/20-core GPU be better?\n\nI really dislike the markup they place on storage and RAM.",
        "created_utc": 1730608692.0,
        "subreddit_name": "mac",
        "comments": 10
    },
    {
        "title": "Where is that dictaphone file",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1giaudr/where_is_that_dictaphone_file/",
        "content": "If i downloaded a dictaphone file from my phone in itunes , where is it on the computer?\n\nMany thanks for your help",
        "created_utc": 1730594121.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "iPod fans evade Apple’s DRM to preserve 54 lost clickwheel-era games | Dozens of previously hard-to-access games can now be synced via Virtual Machine.",
        "score": 3009,
        "url": "https://arstechnica.com/gaming/2024/11/ipod-fans-evade-apples-drm-to-preserve-54-lost-clickwheel-era-games/#gsc.tab=0",
        "content": "",
        "created_utc": 1730630088.0,
        "subreddit_name": "gadgets",
        "comments": 60
    },
    {
        "title": "trust me. i know",
        "score": 740,
        "url": "https://www.reddit.com/gallery/1gj0o6y",
        "content": "i already know. got too reckless. got too greedy. don’t full port. i fucking know. i started off with 10k got to 28k lost half of it then lost it all and direct deposited 25k in hopes for a reversal then lost half of that. i since then went down to 4/5k. my last paycheck came in last week for the month and i’m now at 7.9k.  this is my last chance. i just graduated college and am working full time. i had almost 60k in both accounts (stock and bank) combined now i’m at less than 10k. my life has went downhill. i know i need to walk away but i can’t just stomach losing my life earnings and everthing i’ve saved. i am hoping to start back up slowly. 20% limit sells. 20% stop losses. 2.5-5% gain everyday off of 2dte SPY right now. build up slowly.. if anyone can help or has advice please let me know i am at the lowest i have ever been in my life ",
        "created_utc": 1730677074.0,
        "subreddit_name": "wallstreetbets",
        "comments": 259
    },
    {
        "title": "Time In Market v Decrease Cost Averaging ",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gifbp9/time_in_market_v_decrease_cost_averaging/",
        "content": "Bit of a thought experiment that I can't quite comprehend myself. \n\nBasic strategy as I understand it for those of us who don't have hundreds of thousands to invest is to pick large ETFs or market funds such as VTI or VOO or QQQ and long hold. I have a mixed portfolio with a less aggressive 401k and a market based IRA, and also a personal investment portfolio comprised of some blue chips, some companies I like that I'm not dependent on for growth, and some ETFs. \n\nFor my personal portfolio I have a few thousand investable held in SPAXX with fidelity. Now that the stage is set here's the thought: is it better to make a lump sum investment to have more overall time in the market for the money I have liquid or is it better to invest that money systematically over the span of 6 to 12 months in the event the market turns during the US election so as to DCA my investments over said time? ",
        "created_utc": 1730609079.0,
        "subreddit_name": "investing",
        "comments": 9
    }
]