[
    {
        "title": "Lost in translation (RR CEZ)",
        "score": 29,
        "url": "https://www.reddit.com/r/stocks/comments/1giwn7a/lost_in_translation_rr_cez/",
        "content": "Hello, I believe opportunity to beat the market is in finding market ineffectiveness. How much market ineffectiveness do you believe, there is in different information availability between languages?\n\nWhy I am asking.\n\nLast week ČEZ has bought 20% of Rolls Royce SMR. And it was massive event in Czech language. Largest net newspaper had article about it on the front page. (remainder google translate can translate web-pages if you want to read).\n\nLargest newspaper article: https://www.seznamzpravy.cz/clanek/ekonomika-firmy-cez-koupi-za-miliardy-podil-v-rolls-royce-smr-budou-vyrabet-reaktory-263383\n\nState television: https://ct24.ceskatelevize.cz/clanek/domaci/cez-a-rolls-royce-smr-budou-spolupracovat-na-vyvoji-modularnich-reaktoru-354812\n\nWeb about energy industry: https://oenergetice.cz/jaderne-elektrarny/cez-koupi-za-miliardy-podil-v-rolls-royce-smr-budou-spolupracovat-na-reaktorech\n\nWeb about investing: https://www.kurzy.cz/firmy/cez-rolls-royce/\n\neverybody was writing about it. So I thought: I want to see what English speakers think about it. And there was nothing. I bought shares and 1 call. Thinking once they translate the news, market will react. I am already waiting a week. And nothing. When I look at Yahoo finance nothing happened at all. When I look at seeking alpha or IBKR. One simple article, no analysis or discussion.\n\n20% of SMR company has been bought by corporation which has almost monopoly for energy in Czech republic (because it would be illegal to have perfect monopoly). ČEZ talks about need to build up to 10 SMR to replace coal heat/power plants in coming years. ČEZ has recently also bought Škoda JS (Škoda nuclear engineering). That company has produced nuclear reactors in the past. And still has all the tools and facilities to produce nuclear reactors. They have “unused” reactor hall which is currently producing storage units for spent nuclear fuel, because nobody orders reactors today. RR is producing SMR design to be build in factory. ČEZ owns a factory for nuclear reactors in middle of EU. And no one speaks about the synergy. \n\nReaction of the market, whole weak of nothing -1%. As if there were no news. So it got me thinking, how often this happens? Do you know any other example of events which has vastly different information availability or point of view based on language?\n\n*Disclosure: I have 500 shares of RR and 1 RR call, bought this week, and ČEZ shares long term unrelated to this.*",
        "created_utc": 1730666361.0,
        "subreddit_name": "stocks",
        "comments": 7
    },
    {
        "title": "3X / 5X / 10X ETPs - how do they work during sharp downturns?",
        "score": 28,
        "url": "https://www.reddit.com/r/stocks/comments/1gir2yn/3x_5x_10x_etps_how_do_they_work_during_sharp/",
        "content": "Could be a basic question, so forgive me for my ignorance. (I think), I understand futures & options quite well, but don't fully understand leveraged ETPs (exchange traded products), which claim to perform 3X / 5X / 10X of an index or any other underlying e.g. Apple.\n\nSo, let's say I buy such a product, 10X on Apple. If Apple crashes 12%, do I lose **more than** my capital? Here, I'm talking about 12% loss in a day, and not 6+6% over two days, which could lower my investments to near-zero but not zero or negative.\n\nIf I do end up owing money, how's this any different from buying a future?",
        "created_utc": 1730652097.0,
        "subreddit_name": "stocks",
        "comments": 9
    },
    {
        "title": "What’s the best app to use",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gidac7/whats_the_best_app_to_use/",
        "content": "I’m currently using investing.com on iOS but I am also looking for a potentially better app if it is one. I heard Robinhood was a decent app to use but their fees are also kinda high I was told. Im new to the marketing world and will finally have a chance to actually invest my money. As I have just worked pretty much week in and week out. Now having a chance to invest when I’m making decent money seems like the right and smart thing to do. \nSo any tips on Stocks to look into would be helpful. But definitely starting off with a safe and reliant app to dive into would also be beneficial if you guys don’t mind. ",
        "created_utc": 1730601937.0,
        "subreddit_name": "investing",
        "comments": 4
    },
    {
        "title": "Buybacks or IPOs? Which is better as a retail investor?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gijauq/buybacks_or_ipos_which_is_better_as_a_retail/",
        "content": "My take:\n\n**Advantages of Buybacks**\n\n**1. Boosting Share Value**: Buybacks reduce the number of shares outstanding, which can increase earnings per share (EPS) and can lead to a higher stock price.\n\nEg: Apple has a series of buybacks for billions of dollars that has benefitted a lot of shareholders.\n\n**2. Boosting Investor Confidence**: Buybacks can boost investor sentiment. Investors interpret it as a sign that the company expects to perform well in the future.  \n\n**Advantages of IPOs**\n\n**1. Growth Potential:** IPOs provide an opportunity to invest in a company at an early stage, potentially reaping substantial rewards as the company grows.\n\n**2. Market Sentiment:** IPOs often attract considerable market attention and investor interest, which can lead to initial price surges.\n\nExample: Paras Defence was listed at a premium of 171% leading to instant gains for buyers in a short time. It does not end here. The share price surged by another 143% within 3 weeks giving more gains to the shareholders.\n\nWhile buybacks are good for existing shareholders as they can sell their shares above the market price, IPOs provide decent prices for retail investors to accumulate shares in case they are able to get allocation for the applied IPO.\n\nWhat do you think about IPOs and buybacks, especially for retail investors? Share your views in the comments",
        "created_utc": 1730626937.0,
        "subreddit_name": "investing",
        "comments": 5
    },
    {
        "title": "Chinese Hackers Stole Phone Audio From Both Harris and Trump Campaigns",
        "score": 3750,
        "url": "https://www.wsj.com/livecoverage/harris-trump-election-11-01-24/card/chinese-hackers-stole-phone-audio-from-both-harris-and-trump-campaigns-Sfa6s0vIBEmEWOjeaZ8e",
        "content": "",
        "created_utc": 1730597824.0,
        "subreddit_name": "news",
        "comments": 135
    }
]