[
    {
        "title": "Oil stocks - the time is now",
        "score": 2180,
        "url": "https://www.reddit.com/r/stocks/comments/iexyez/oil_stocks_the_time_is_now/",
        "content": "Hello there\n\nI posted about [6 weeks ago](https://www.reddit.com/r/stocks/comments/hn9ydm/defense_stocks_what_the_heck_is_going_on/) about defense being undervalued and they’ve climbed 15-20% since then (besides HII which completely whiffed earnings). Hope you hopped on. Now I am now starting to see value in the oil sector(s). The June high and subsequent re-crash for oil industry coincided directly with the new covid case rate picking up. With covid cases declining and oil stocks generally trading in ranges for over a month now, I present my case for a break in those ranges\n\nThere are a couple of tailwinds that are happening right now for WTI:\n\n* New covid cases in the US have dropped substantially from their peak and are on a downtrend [according to JHU’s data](https://i.imgur.com/EShb2sU.jpg). Globally, it seems to be seesawing in a confined range\n* [China is buying a large amount of US crude by September](https://www.reuters.com/article/us-usa-trade-china-oil-exclusive/exclusive-china-ramps-up-u-s-oil-purchases-ahead-of-trade-deal-review-sources-idUSKCN25A2F4), potentially 37 million barrels [according to this](https://oilprice.com/Latest-Energy-News/World-News/China-Charters-Tankers-For-37-Million-Barrels-Of-US-Oil.html)\n* After flooding the US market with [Saudi oil](https://www.npr.org/2020/05/04/850026351/saudi-arabias-oil-tanker-flotilla-is-reaching-the-u-s-despite-some-objections#:~:text=Live%20Sessions-,Saudi%20Arabia's%20Oil%20Tanker%20Flotilla%20Is%20Reaching%20The%20U.S.%2C%20Despite,are%20headed%20to%20the%20U.S.), they have now cut exports to a [record low ](https://oilprice.com/Latest-Energy-News/World-News/Saudi-Arabias-Crude-Oil-Exports-Dip-To-Record-Low-In-June.html)\n* The dual storms in the Gulf have caused a lot of [shut-ins](https://www.reuters.com/article/us-usa-storms-energy/oil-firms-evacuate-staff-curb-offshore-production-ahead-of-twin-storms-idUSKBN25I0J3)\n* After stalling in July, air traffic is starting to [pick back up](https://www.tsa.gov/coronavirus/passenger-throughput) and routes are being added again, although still way way down\n\nWhich all support WTI prices in the coming weeks. Should be noted that rig counts have continued to lows, however last week was the first week in a long time that a few rigs came back online, which will add to the inventory. How much, I am not sure. You can see from [Baker Hughes’ rig count]( https://rigcount.bakerhughes.com/rig-count-overview) that we added 10 rigs, but are still down a net of 662 rigs from last year. Next we can take a look at the [EIA data](https://www.eia.gov/petroleum/supply/weekly/) for some more insight into what current inventories are like:\n\n* 512M barrels of crude, 15% above average. Peak was 540M barrels on June 19th\n* 244M barrels of gasoline, 7% above average. Peak was before covid due to build over the winter\n* 178M barrels of distillates, 24% above average. Peak was 180M barrels on July 31st\n* Refinery inputs at 14.5M barrels, low was 12.4M barrels on May 13th \n* Refinery rates at 81%. At the low on April 22nd it was at 67%, normally around 95%.\n* WTI is trading in the $42-43 range, with the low being negative due to the contract rollover situation back in the Spring\n\nThe last several EIA reports have been good in general – drawing down of products, with two weeks in a row of fantastic gasoline draw down. \n\nWhat’s my point here? The takeaway should be this: the worst is over and it seems we're about halfway recovered. Now is the best chance for a while to get beaten up value stocks at a discount, as the industry recovers and conditions for the crash are resolving\n\nRight now cyclicals have been beaten down to Earth’s core as tech goes up and up. Cyclicals and value generally outperform in a market recovery and I expect a rotation at some point, strengthened by a combination of inventory drops making headlines, covid cases going down, and a general resumption of normal. Any stimulus would be big news for these beaten down stocks as well\n\nWorried about a Democratic administration? Unlike the defense stocks I had previously looked at, I think it’s a real issue for this industry. The Democratic platform calls out removing tax breaks for oil and gas companies while adding environmental regulations. It’s weird that big tech has been climbing – companies like Amazon, Apple, Facebook etc. that are known tax avoiders and privacy usurpers seem like prime candidates to have a ‘tax bill fear’ from the Dem’s closing of tax avoidance legislation and future lawsuits. I haven’t seen any hints of this in the market, so I am going to assume this is not considered a big deal by investors. Environmental regulations should be, however\n\nHowever, I still believe these low valuations are still too low, even with headwinds. Some of the majors have already been adjusting (Shell in particular) and refineries like Valero already have strong renewable fuels segments; Phillips 66 recently announced plans to build the [biggest renewable diesel refinery in the world](https://investor.phillips66.com/financial-information/news-releases/news-release-details/2020/Phillips-66-Plans-to-Transform-San-Francisco-Refinery-into-Worlds-Largest-Renewable-Fuels-Plant/default.aspx)\n\nWhat am I looking at in particular?\n\nRight now, refineries have the best value to me. PSX is **criminally** undervalued with a safe dividend. VLO is another that is set for strong performance. MPC has a strong position after its Speedway asset sale, but I would rank PSX>VLO>MPC at this point for value.\n\n* PSX target price: ~$82, sitting currently at ~$61\n* VLO target price: ~$71-72, sitting currently at ~$52.50\n\nFrom a producer standpoint, CVX and COP are both fundamentally solid (I prefer COP at this point). RDS is the closest its been to it’s covid low and is one of the leading majors in transitioning off oil. It’s been beaten down since losing its dividend but I can only assume it will be back. I’m not a fan of XOM going forward, but right now it’s at the low of the range it’s been confined in and wouldn’t be a bad temporary pickup. FANG / EOG / PXD aren’t bad pickups either\n\nPS – stay away from OXY. It’s very clear they’re going to continue to issue shares until they’re through their debt and the pummeling is well deserved. It was popular for a while, not sure how it’s still viewed, just stay away\n\nTLDR; buy refineries and the producers worth buying that aren't drowning in debt or have terrible assets\n\nDisclosure: I have a large position in PSX calls",
        "created_utc": 1598161412.0,
        "subreddit_name": "stocks",
        "comments": 486
    }
]