[
    {
        "title": "\nTesla shares drop 6% in premarket after Cybercab robotaxi reveal fails to impress",
        "score": 1697,
        "url": "https://www.reddit.com/r/stocks/comments/1g18fon/tesla_shares_drop_6_in_premarket_after_cybercab/",
        "content": "Shares of electric vehicle maker Tesla tumbled Friday after the company’s long-awaited robotaxi event — where CEO Elon Musk unveiled the firm’s Cybercab self-driving concept car — failed to impress investors.\n\nTesla stock was down 5.8% as of 6:33 a.m. ET in premarket trading on Friday.\n\nMusk revealed Tesla’s Cybercab concept vehicle — a low, silver two-seater, has no steering wheels or pedals — on Thursday night. The plan is for the car to be capable of driving itself autonomously when it launches.\n\nThe Tesla boss said the company hopes to be producing the Cybercab before 2027, but offered no details on where the cars will be manufactured. He said consumers would be able to buy a Tesla Cybercab for a price tag under $30,000.\n\nHe also said he expects Tesla to have “unsupervised FSD” up and running in Texas and California next year in the company’s Model 3 and Model Y electric vehicles. FSD, which stands for Full Self-Driving, is Tesla’s premium driver assistance system, available today in a “supervised” version for Tesla electric vehicles.\n\nThe technology still requires a human driver at the wheel, ready to steer or brake at any time.\n\nIn reaction to the Thursday event, analysts at Barclays said that the revelations had failed to highlight any near-term opportunities for Tesla, instead prioritizing Musk’s vision for a fully autonomous driving future.\n\n“As expected, like prior Tesla product unveils, the event was light on the details, and instead emphasized the vision underpinning Tesla’s growth endeavors in AI/AV \\[autonomous vehicles\\],” Barclays’ U.S. autos & mobility team wrote in the note early on Friday.\n\n“Yet there were no updates indicating near-term opportunities. Tesla didn’t show its low-cost model planned for 1H′25 production,” they added. “We also didn’t get any near-term updates on FSD progress, or data reflecting improvement in the system.”\n\nPiper Sandler analysts said in a separate Friday note that “most trading-oriented firms will be underwhelmed by the robo-taxi unveiling.”\n\n“We wouldn’t be surprised if the stock sells off in the coming weeks, as pre-event momentum fizzles,” the investment bank’s analysts said in the note.\n\nMorgan Stanley, meanwhile, suggested that Musk failed to make the case that Tesla is an AI company during the event. The bank’s analysts noted that Musk didn’t mention any details on improvements to Tesla’s FSD system, nor did the billionaire go into detail regarding rumored plans of a tie-up between Tesla and xAI, Musk’s AI company. Musk has previously denied such reports.\n\nThe event “overall disappointed expectations on a number of areas: a lack of data regarding rate-of-change on FSD/tech, ride-share economics and go-to-market strategy,” Morgan Stanley’s analysts wrote in a note Friday.\n\n“We were overall disappointed with the substance and detail of the presentation. As such, we anticipate TSLA to be under pressure following the event,” they added.\n\nIt is expected to take some years still before self-driving cars become a mainstream reality on public roads, with regulators concerned over the safety features embedded into such vehicles.\n\nAmong the few companies that have successfully launched self-driving cars on public roads is Google’s Waymo, which has offered its robotaxi service to the general public since June.",
        "created_utc": 1728649167.0,
        "subreddit_name": "stocks",
        "comments": 566
    }
]