[
    {
        "title": "I tracked down my stolen car with an Apple AirTag and it was one of the most ridiculous days of my life.",
        "score": 8779,
        "url": "https://www.reddit.com/r/apple/comments/q82ezx/i_tracked_down_my_stolen_car_with_an_apple_airtag/",
        "content": "*(TLDR: Sorry this is so long. It's long for my own sake because I need to tell the story. There are pictures and videos of the events, but if you don't want to follow along, the gist is that I had my car stolen. The police weren't really optimistic about getting it back. But I'd put an AirTag in it in case it was stolen, and I was able to track that and, getting extremely lucky, find my car even though the AirTag had been found and ditched.)*\n\nI am a night owl. I went out to get in my car around 3am earlier this week to find my car gone. I have a young family member who lives with me. He's also a night owl, so I thought he'd taken the car to McDonald's or something. I texted him to see if that was the case, and he told me that no, he had not.\n\nMy car (a 2010 Subaru Forester) had been stolen.\n\nI did all the normal stuff one should do when your car's stolen. I called the police and filed a report. They reported the car stolen but didn't seem optimistic much could be done. Which makes sense, I live in the Chicago suburbs, where there are millions of cars and the police are busy. I start an insurance claim and, very annoyed, just kind of sit down to wallow in pity and frustration with myself and whoever stole my dang car.\n\nI remembered then, after the dust settled, that I had put a spare AirTag in the sunglasses holder of my car. I'd bought a 4 pack and figured there might be an off chance it could potentially help me find the car. There's millions of iPhones in Chicagoland too, so I figured the chances of it getting pinged were decently high.\n\nSo I marked the AirTag lost. It’s last showed its location as my house at 10:17pm the night before, so I knew my car had been stolen in the previous 5 hours.\n\nLess than 10 minutes later, I got a [notification that my car had been found](https://imgur.com/a/qpoAUYm) in Northlake, a Chicago suburb about a half hour from me. It was sitting in a [Walmart parking lot.](https://imgur.com/RSQWzCD) \n\nObviously I immediately called 911 again and explained the situation. Police went to check the parking lot but couldn't find the car. \n\nI kept getting pings from the tracker in this Walmart parking lot, however. I figured that the thief had found and tossed the tracker. I was amped up and around 5:00am decided to head over and check the lot for myself. I expected maybe to find the tracker dumped in the lot and, possibly, use it to convince the police to take a look at the Walmart cameras, which they hadn't wanted to do before. \n\nAs I drove to the Walmart, tense and still amped, I got several more pings from the tracker. I knew where it was, exactly. \n\nWhen I arrived at the parking lot, I drove around with my phone out the window until my bluetooth connected to the tracker. I parked and walked around until I found the tracker by ringing it. It was under a parked car, and I could hear it, but it was rainy and gross out and I didn't want to lay down in the puddle under the car to get it. So I sat and waited, hoping the car belonged to a customer who would leave. \n\nAfter a half hour or so I got bored of waiting and just decided to go home, defeated, and hope insurance would go smoothly. I thought I'd still call the investigating officer and tell him I knew the car had been in the parking lot and see if he'd pull Walmart's security footage. Maybe it would show someone known to them. Who knew.\n\nI sat at the light to leave the Walmart parking lot.\n\nThen I see MY STOLEN CAR TURN RIGHT PAST ME INTO THE PARKING LOT. This can be seen on [dash cam footage](https://youtu.be/4Tkj_o88plY) from my second car, where you can also see me over-excitedly calling the cops. \n\nIf I'd have left 30 seconds earlier, I wouldn't have my car back. It was that close. \n\nI couldn't't believe it. I didn't see the plate, but my car is this unusual ugly orange color and I was 90% sure it's mine. I waited for the car to disappear around a corner in my rear view mirror and flipped around. I watched this guy in my car drive slowly around and find an inconspicuous place to park. He backed in so the plate was hidden. Why he came back, I don’t know. But I’m glad he did.\n\nAt this point I'm determined not to lose my car, having found it semi-miraculously. I'm tempted to drive right up and block him into his spot. I was tense, just hoping that the guy would stay put and I wouldn’t have to confront him. But I don't want to get shot, and I don't want to damage my cars if he tries to ram his way out. So, kind of freaking out, I call the police again. This is the fourth time I've called 911 in the previous 3 hours, and the Northlake policewoman I'm transferred to knows the situation. \n\nLuckily, in very short order 2 police cars arrive. I wave and point frantically out my window at my car until they see it, and [they pull up on it.](https://imgur.com/a/YoiQngi)\n\nThey pull a skinny pale kid from the car, so thin and dejected I genuinely slightly felt sorry for him. I felt even worse after learning he's homeless and, judging from the hard drug paraphernalia in my car, and addict. \n\n*(As a personal aside, I’ve had an advantaged life, and from what the officers told me, this kid has not. Still, he’s wanted on several warrants and I have the choice between pressing felony and misdemeanor charges. I am opposed to our way of criminal justice system, so I decided press the lesser charges. I don’t know if it will do any good, but at the hearing I intend to request some sort of drug treatment diversion program and hopefully have an opportunity to assure the kid I forgive him and wish him well. It probably won’t do much in the grand scheme of things, but I think having one more person telling him how awful he is will probably do worse.)*\n\nMy car was trashed. It smelled like cigarettes and weed, and there were cigarette butts put out in my floorboard. In less than 7 hours my car now looked like a hoarder's car, I'm not exaggerating. The police had me go though all this stuff piece by piece myself to find what was mine and what wasn't. There were several bags of stolen phones, tablets, watches, and just a metric ton of junk. \n\nI got it detailed later that day. It just felt too gross to be in it before that.\n\nThere are more and more developments to that story. Finding a key fob to what turns out to be another stolen car that's parked near my house later on, having been ditched by the thief before he stole my car. And having a detective interview me and a crime scene tech take my DNA to rule me out (I moved the car out of the way of a neighbors garage so he could go to work). Finding a bunch of neighbors' stuff in my car and learning that many other cars in our alley where we park were broken into. \n\nIn fact, this guy, in the middle of robbing this whole line of cars, sat down in my second car (after stealing some stuff from it) and smoked 2 whole cigarettes in it, putting one out on my passenger seat.\n\nAnd more. \n\nIt was just a crazy experience.\n\nBut about the AirTags.\n\nThey work to track down your car. I wouldn't have found mine without it. But I would have potentially found it faster if I'd hidden it better. So my advice: hide it well, but somewhere it will not be blocked from transmitting a Bluetooth signal. \n\nAll in all, I just want to vouch for the fact that these things work decently for the price and purpose. I wouldn’t count on them 100% but I’d also still recommend using them for this purpose if you don’t feel like paying for a GPS module.\n\nOH, and for God's sake people. Don't be an idiot like me. Lock your damn car. I'd gotten complacent living somewhere off the beaten path in a [safe suburb](https://patch.com/illinois/wheaton/wheaton-among-smallest-safe-cities-u-s-security-company) and parking my car off the street in a private slot. I fully admit to being stupid on that point, roast me all you want.",
        "created_utc": 1634226468.0,
        "subreddit_name": "apple",
        "comments": 790
    }
]