[
    {
        "title": "How I bought $300 of RBLX to teach my son a lesson on investing",
        "score": 4113,
        "url": "https://www.reddit.com/r/stocks/comments/m2hbcq/how_i_bought_300_of_rblx_to_teach_my_son_a_lesson/",
        "content": "A few months ago, due to what I still can’t explain, the parental controls on purchases on the android device stopped asking for a password. My 8 year old son discovered this while playing Roblox and went on a Robux buying spree to the tune of $427. We only caught it because of the confirmation emails a few days later. We were only able to reclaim $115 from Google.  He lost the device, and his favorite game, for a long time. \n\nFast forward to today. I have been giving my son $5 a week for chores into a custodian trading account.  I luckily I picked a few good stocks and he has a nice little ~$300 Disney Trip fund for toys, swag, etc. I told him I was going to spend his savings on buying RBLX. I explained to him about market cap, shares outstanding, float and he understood 0 of these things... But I also explained that putting $300 into a game vs $300 into a game company were different things and (inner monologue: while probably over priced at the moment) it may grow his Disney Trip fund while he supports the company that has brought him so much pandemic joy. He was totally jazzed about this prospect and investing in general. Also... payback... sort of.\n\n\nEDIT: A few more details for the surprising amount of negative posters below, especially for a light-hearted story about both of us learning money lessons.\n\n* I am not shilling Roblox stock we collectively own 4 shares.\n* Of course any major losses would be covered.  No children's dreams were ruined in the making of any financial lessons... yet.\n* He did have to earn back his mistake through increased help around the house.\n* I own a lot of DIS in my own accounts. \n* I match his own bday, card, etc contributions 1-1 to his account as an additional incentive to invest.",
        "created_utc": 1615435310.0,
        "subreddit_name": "stocks",
        "comments": 649
    }
]