[
    {
        "title": "Adidas to End Kanye West Partnership After Controversies; Adidas: was “one of the most successful collaborations in our industry's history\"",
        "score": 3183,
        "url": "https://www.reddit.com/r/stocks/comments/yd0eo8/adidas_to_end_kanye_west_partnership_after/",
        "content": "* **German company may announce it is severing ties on Tuesday**\n* **Adidas has been under pressure after antisemitic remarks by Ye** \n* **Adidas would join Gap Inc. and Kering SA’s Balenciaga fashion label in cutting ties with West, who now goes by Ye**\n* **Adidas shares, already weighed down by the controversy, fell as much as 3.2% in Frankfurt trading, reaching the lowest since April 2016.**\n* **Yeezy line accounted for as much as 8% of Adidas's total sales** \n* **For Adidas, was “one of the most successful collaborations in our industry’s history.”**  \n\nAdidas AG plans to end its partnership with Kanye West following a rash of offensive behavior from the rapper and designer that turned a once-thriving shoe brand into a lightning rod for criticism.\n\nThe German sports company may announce the move as early as Tuesday, according to people familiar with the matter, who asked not to be identified because discussions are private. A representative for Adidas didn’t immediately respond to requests for comment. \n\n**Adidas would join Gap Inc. and Kering SA’s Balenciaga fashion label in cutting ties with West, who now goes by Ye**. The rapper has made controversial statements, including antisemitic social media posts in recent weeks, and has moved to cut ties with his corporate partners. Ye couldn’t immediately be reached for comment.\n\n**Adidas shares, already weighed down by the controversy, fell as much as 3.2% in Frankfurt trading, reaching the lowest since April 2016.**\n\n**The Adidas decision follows weeks of deliberations inside the company, which over the past decade has built the Yeezy line -- together with Ye -- into a brand that’s accounted for as much as 8% of Adidas’s total sales**, according to several estimates from Wall Street analysts. \n\nThe German company is of the view that it owns the intellectual property rights to the products from the collaboration and could continue producing the models, one of the people said.\n\n**Adidas earlier this month called the partnership “one of the most successful collaborations in our industry’s history”** and said it will continue co-managing Yeezy products during its review.\n\nThat success, however, has come with plenty of acrimony between the partners. Ye has accused Adidas of copying his ideas and mismanaging the brand, and taunted outgoing Chief Executive Officer Kasper Rorsted on social media. Meanwhile, Adidas has said it’s repeatedly tried and failed to resolve issues with Ye privately.\n\nRead more: Kanye West Renounces Corporate Deals After JPMorgan, Gap Clashes\n\nThe rapper said in September he wants to negotiate with Adidas to get a 20% royalty on all the shoes he’s designed with the company in perpetuity.\n\nYe caused more controversy after that by wearing a shirt at the Paris fashion week that said “White Lives Matter.” He later got locked out of his Twitter and Instagram accounts after making repeated anti-Semitic remarks -- remarks that have created a growing backlash of consumers and celebrities, with some calling for people to boycott Adidas products until the partnership is canceled.\n\nThe Ye situation is one of many headaches for Adidas, which is searching for a new CEO to take over in 2023. The company has lowered its earnings forecast several times this year amid falling demand for its shoes and apparel in China and growing signs of economic trouble in Europe and North America.\n\nSource:  [https://www.bloomberg.com/news/articles/2022-10-25/adidas-is-said-to-end-kanye-west-partnership-after-controversies](https://www.bloomberg.com/news/articles/2022-10-25/adidas-is-said-to-end-kanye-west-partnership-after-controversies)",
        "created_utc": 1666690015.0,
        "subreddit_name": "stocks",
        "comments": 362
    },
    {
        "title": "Apple Rejected Spotify's App Update Adding Audiobook Support",
        "score": 5622,
        "url": "https://www.macrumors.com/2022/10/25/spotify-audio-book-app-update-rejected-apple/",
        "content": "",
        "created_utc": 1666729997.0,
        "subreddit_name": "apple",
        "comments": 1345
    }
]