[
    {
        "title": "Tesla stock has best day in over a decade on Musk's 2025 growth projection",
        "score": 556,
        "url": "https://www.reddit.com/r/stocks/comments/1gbcgse/tesla_stock_has_best_day_in_over_a_decade_on/",
        "content": "Tesla shares soared 22% to close at $260.48 on Thursday, the stock’s best day since 2013, following the company’s better-than-expected earnings report.\n\nThe company late Wednesday reported revenue of $25.18 billion, which came in just under analysts’ expectations of $25.37 billion, but was up 8% compared with a year earlier. Tesla reported earnings per share of 72 cents adjusted, topping the average analyst estimate of 58 cents.\n\n“We expect this surprising earnings beat to power a strong positive reaction in Tesla shares Thursday, given the degree to which investors have become conditioned to earnings misses from the company,” analysts at JPMorgan wrote in a note.\n\nTesla’s profit margins in the third quarter were boosted by $739 million in revenue for environmental regulatory credits, which the JPMorgan analysts noted were a “potentially unsustainable driver” of earnings and cash flow.\n\nAutomakers are required to obtain a certain amount of regulatory credits every year, and if they can’t meet the target, they can buy credits from other companies. Tesla has excess credits because it only makes electric vehicles.\n\nTesla earnings also got a boost from FSD, the company’s Full Self-Driving Supervised system. CFO Vaibhav Taneja said on the earnings call that FSD contributed $326 million in revenue in the quarter after Tesla made it available for use in the Cybertruck and added a feature called “Actually Smart Summon.”\n\nCEO Elon Musk said on the call that his “best guess” is that “vehicle growth” will reach 20% to 30% next year, citing “lower cost vehicles” and the “advent of autonomy.” Analysts surveyed by FactSet were expecting delivery growth of about 15% for 2025.\n\nEven bullish Deutsche Bank analysts doubted Musk’s forecast and wrote, in a note following the earnings report, “Our view remains more reserved at 10-15% (~2.03m),” and assumes Tesla can roll out a cheaper version of its Model Y at a price under $30,000 after subsidies, and other variants of the small SUV.\n\nAnalysts at Morgan Stanley who also recommend buying the stock, called Musk’s 2025 vehicle delivery growth prediction a “maybe.” They set their estimate at 14%.\n\nIt “clearly depends on the company’s ability to improve affordability through cheaper model (next gen) introduction, financing offers and improved features,” the Morgan Stanley analysts wrote in a note Thursday.\n\nA grain of salt\n\nMusk said on the Wednesday call that Tesla plans to start production of its recently unveiled Cybercab, a robotaxi with butterfly doors and no steering wheel or pedals, by the end of 2026. He also said Tesla would conduct driverless ridehailing in California and Texas next year in its existing cars, which are not currently safe to use without a human driver ready to steer or brake at any time.\n\nBernstein analysts, who have a bearish price target of $120 on shares of Tesla, wrote in a note out Thursday: “The tone of Tesla’s conference call was ebullient and filled with Musk prognostications that have historically polarized bull and bear investors, and was more akin to a pep rally, with the company only taking two questions from sell-siders.”\n\nMusk has for years promised shareholders a software upgrade that can turn Teslas into robotaxis. That hasn’t happened yet. Musk has also promised a refreshed version of the Tesla Roadster since 2017. The design of the vehicle is not yet complete. \n\nThe Bernstein analysts wrote, “We continue to struggle to see Tesla overcoming the technological and regulatory hurdles needed to leapfrog current level 4 robotaxis, and believe fully unsupervised FSD could be years away.”\n\nThey pointed to Musk’s “long history of being overly optimistic about FSD” and said crowdsourced research that shows “Tesla continues to lag well behind competitors” on robotaxis.\n\nThe share rally Thursday was the sharpest since a 24% gain in May 2013. The jump erased Tesla’s loss for the year and left the stock up 3% in 2024, though it still trails the 22% gain for the Nasdaq.\n\nSource: https://www.cnbc.com/2024/10/24/tesla-shares-surge-as-analysts-react-to-q3-earnings-musk-predictions.html",
        "created_utc": 1729801558.0,
        "subreddit_name": "stocks",
        "comments": 387
    },
    {
        "title": "Boeing machinists reject new labor contract extending more than 5-week strike",
        "score": 444,
        "url": "https://www.reddit.com/r/stocks/comments/1gas7id/boeing_machinists_reject_new_labor_contract/",
        "content": "Boeing machinists rejected a new labor deal that included 35% wage increases over four years, their union said Wednesday, extending a more than five-week strike that has halted most of the company’s aircraft production, which is centered in the Seattle area.\n\nBoeing machinists reject new labor contract extending more than 5-week strike https://www.cnbc.com/2024/10/24/boeing-machinists-new-labor-contract-strike.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
        "created_utc": 1729736789.0,
        "subreddit_name": "stocks",
        "comments": 142
    },
    {
        "title": "Nvidia supplier SK Hynix posts record Q3 profit, beats forecasts",
        "score": 96,
        "url": "https://www.reddit.com/r/stocks/comments/1gara3z/nvidia_supplier_sk_hynix_posts_record_q3_profit/",
        "content": "SEOUL (Reuters) -South Korea's SK Hynix on Thursday posted a record quarterly profit as the Nvidia (NASDAQ:NVDA) supplier saw strong sales of its advanced chips such as high bandwidth memory (HBM) ones used in generative AI chipsets.\n\nThe world's second-biggest memory chipmaker reported a 7 trillion won ($5.07 billion) operating profit for the July-September quarter versus a 1.8 trillion won loss a year earlier.\n\nThat compared with a 6.8 trillion won average forecast by LSEG SmartEstimate, which is weighted toward analysts who are more consistently accurate.\n\nSK Hynix has outperformed rivals Samsung Electronics (KS:005930) and Micron Technology (NASDAQ:MU) in recent quarters, as it has benefited the most from AI-driven appetite for high-end memory chips following its early entry and large investments in HBM chip development.\n\n\"HBM sales showed excellent growth, up more than 70% from the previous quarter and more than 330% from the same period last year,\" SK Hynix said in a statement.\n\nSK Hynix sees HBM sales making up 40% of its total DRAM revenue in the fourth quarter, up from 30% in the third quarter, and added it expects memory chip demand for AI servers to grow further next year as global tech companies continue developing generative AI.\n\nRevenue for the quarter rose 94% year-on-year to 17.6 trillion won.\n\nSK Hynix shares have jumped 38.5% so far this year, outperforming Samsung, whose stocks has slumped 24.7% over the same period.\n\nLast month, SK Hynix, the main supplier of HBM chips to Nvidia, said it had started mass production of HBM3E 12-layer chips and plans to supply the latest products to unidentified customers by the end of this year.",
        "created_utc": 1729733950.0,
        "subreddit_name": "stocks",
        "comments": 18
    },
    {
        "title": "Europe's top court rules for Intel to end long-running antitrust case",
        "score": 47,
        "url": "https://www.reddit.com/r/stocks/comments/1gb44gb/europes_top_court_rules_for_intel_to_end/",
        "content": "BRUSSELS, Oct 24 (Reuters) - The EU Court of Justice, Europe's top court, ruled on Thursday in favour of Intel, opens new tab, ending a nearly two-decade-long fight between the U.S. chipmaker and EU regulators who had said it had tried to thwart a rival.\n\n\"The Court of Justice dismisses the Commission’s appeal, thereby upholding the judgment of the General Court,\" the court said.\n\nSource: https://www.reuters.com/technology/europes-top-court-rules-intel-long-running-antitrust-case-2024-10-24/",
        "created_utc": 1729780572.0,
        "subreddit_name": "stocks",
        "comments": 8
    },
    {
        "title": "Is $SMR facing badluck or it will eventually breakthough?",
        "score": 19,
        "url": "https://www.reddit.com/r/stocks/comments/1gb96ql/is_smr_facing_badluck_or_it_will_eventually/",
        "content": "Badluck\n\n1. This past November, the Utah Associated Municipal Power Systems, or UAMPS, terminated what was to be “the first NuScale Power small modular reactor plant to begin operation in the United States.” This was a death foretold; the red flags have been obvious for years now.\n\nhttps://www.utilitydive.com/news/nuscale-uamps-project-small-modular-reactor-ramanasmr-/705717/\n\n2. NuScale also didn't make the final cut to build SMR in the UK\n\n>US company eliminated from race to build Britain’s first mini-nuclear plant\n\nhttps://www.telegraph.co.uk/business/2024/09/25/us-firm-eliminated-from-race-build-britain-first-mini-nuke/\n\nThe naysayers are stating due to unproven technology, nobody wants to be the 1st guinea pig.  It is costly upfront and if something goes wrong they might be on hook in fines and penalties (hazardous material handling).\n\nBut this said... recently, the Biden admin has greenlit financial assistance approval for nuclear energy related projects.  \n\nChina and Russia already have approved SMRs and I believe they have a few already up and running.  \n\nThe unfairness is that - their gov't can absorb the costs if something goes wrong. \n\nQuestions\n\n1. Why doesn't the US gov't go a little deeper into the projects and bear some of the costs/potential dangers associated with it? \n\n2. Big companies like Amazon and Google have signed up partnerships with energy companies for SMR to be designed/built.  Why don't they just partner with a company like NuScale instead (approved SMR design)?\n\nAt the end of day, in 10 years... if energy infrastructure stays the way it is - the US could be way behind Russia/China in terms of energy source/efficienct. Nevermind inability to power many data centers etc. and not ability to meet its clean energy goals. \n\nThoughts?\n",
        "created_utc": 1729793280.0,
        "subreddit_name": "stocks",
        "comments": 13
    },
    {
        "title": "My whole portfolio is in this single stock...",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gbb64c/my_whole_portfolio_is_in_this_single_stock/",
        "content": "Does anyone put all or most of their entire portfolio into a single stock? I know it's not the mainstream thinking but I am trying to go back to 90s when nobody knew anything about investing and everybody who bought hot shot stocks like Apple and Amazon became rich. \n\nI'm considering putting my entire IRA into GEV. It can potentially ride off the AI boom and climate change politics while maintaining the stability of a well established energy company. Could GEV be the next Amazon? What stock are you all in?",
        "created_utc": 1729798274.0,
        "subreddit_name": "stocks",
        "comments": 90
    },
    {
        "title": "Three stocks that you feel will outperform the market over the next 5 years",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gb1i5u/three_stocks_that_you_feel_will_outperform_the/",
        "content": "Like the title says: which three stocks, individual equities, do you believe will outperform the market, Market Index Funds: VOO, ONEQ, or DIA?\n\nMy takes:\n\nCOST -- Costco has a great expansion model, a great business model, and loyalty like few other companies: customer, employee, and vendors.\n\nAAPL -- I continue to see them innovate, they won't stick with something that isn't working, and their stuff just works.\n\nThird slot is a bit tougher: GOOG, NVDA, or JPM in that order.\n\n",
        "created_utc": 1729773116.0,
        "subreddit_name": "stocks",
        "comments": 58
    },
    {
        "title": "Explain how Fiverr exists in a world with AI agents",
        "score": 1149,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/",
        "content": "I’ve been thinking on it, and there’s no way a company that is based on hiring freelancers to do coding (and steal IPs) can stay at their current valuations when AI agents become main stream. I mean, I made a Reddit scanner to look for certain keywords in comments on posts in an hour, works perfectly. It’s like 250 lines of code, and it was free. I have zero coding experience.\n\nSomeone explain why I shouldn’t go all in on puts against them and low-level development companies like Appian. Because to me, they seems like the next Chegg.\n\nFor context, I’ve already purchased some deep OTM puts a year or so out on Fiverr, Appian, and a couple consulting companies.\n\nEdit: Because a lot of people don’t seem to know what release I’m taking about, or know its abilities, you can watch and read more [here](https://m.youtube.com/watch?v=ODaHJzOyVCQ&embeds_referring_euri=https%3A%2F%2Fcointelegraph.com%2F&source_ve_path=MjM4NTE). \nYou can basically share your screen with the AI, allowing it to click around for you if you are using their API. Meaning that code that it wrote? It can put it into action, your average consumer doesn’t need to know how to do that anymore. Now picture this in 6 months to a year, given how much we’ve moved forward in that same time period. \n\nTL;DR: Fiverr, Appian, SaaS companies are going to lose revenue.\n\n\nEdit 2: Since I’ve got you all here: The [White House](https://www.whitehouse.gov/briefing-room/presidential-actions/2024/10/24/memorandum-on-advancing-the-united-states-leadership-in-artificial-intelligence-harnessing-artificial-intelligence-to-fulfill-national-security-objectives-and-fostering-the-safety-security/) just put out a statement that they’re going all in on AI too, which I think is pretty neat\n\nEdit 3: Okay, thank you all. Maybe Fiverr as of 10/24/2024 isn’t the play, but it will be some day ",
        "created_utc": 1729783662.0,
        "subreddit_name": "wallstreetbets",
        "comments": 470
    },
    {
        "title": "Redwire - The 3rd Musketeer Rocketlab SpaceX",
        "score": 64,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gb9dbh/redwire_the_3rd_musketeer_rocketlab_spacex/",
        "content": "Redwire already supplies Rocketlab with parts, a contractual agreement which started in May 2024. The also supply NASA, Lockheed Martin, Boeing, Blue Origin and many more.\n\n* They are currently working with $LLY on 3D bio-printing organs in space, which they’re making great progress of.\n* They acquired Hera systems to increase the dominance for national security space customers.\n* They were selected to provide advanced RF payloads to a leading defense contractor.\n* They have joined the US-U.A.E council where Danny Sebright stated “Redwire’s pioneering advancements in Space Infrastructure showcase the very best of American innovation and ingenuity. As a member Redwire joins an elite list of member companies at the forefront of almost every industry.\n* They signed a MOU with NASA’s REMIS-2 mission to provide Spaceflight hardware, ground hardware and software, engineering services, payload facility integration and more.\n* Selected to provide a critical onboard computer system for the European Space Agency Hera Mission, Europes flagship planetary defense mission.\n* To supply Solar Arrays for Thales Alenia Telecommunications product line.\n* Selected by (SCA) to develop, build and deliver advanced thruster technology nicknamed the (Valkyrie Thurster) designed for reliable, high-volume production for the surge in national security space programmes.\n* Awarded Darpa Prime Contract to be the prime mission integrator for the development of revolutionary air-breathing satellite that will demonstrate the use of Novel electric propulsion in very-low earth orbit (VLEO).\n* Awarded Contract by the European Space agency to develop a Robotic Arm to support the landing for the International Lunar Exploration Mission.\n* Selected by Rocketlab to provide Antennas and RF hardware.\n\nAnd those are just some of the latest contracts & advancements Redwire has made. They’ve been prolific aquirers since going public and continue to aggressively expand their footprint across all space sectors.\n\nIt’s why their CEO goes by the Moto of “If space wins Redwire wins”, a confident statement backed by their foundational success of becoming the “building blocks to space”\n\nYet it’s currently one of the cheapest and most undervalued Space stocks there is. Trading at a P/S of just 1.58 compared to Rocket Labs 11.5. A market cap of just $450m vs Rocketlabs $4.28b & ASTS $6.73b\n\nThis isn’t about who’s better, it’s about Redwire being drastically undervalued and under the radar of most growth investors.\n\nI shared my thoughts on Rocketlab 3-4 months ago after scooping the October and January calls.\n\nSince then people have finally started to realise the potential in the company. To sit are similar valuations based upon growth and income, Redwire would not to hit approximately $42/share. At this point it would still remain once of the cheapest yet most advanced space companies out there.\n\nWhy now?\n\nStocks move in themes, every success trader from here to Timbuktu will tell you that. It’s caused by the excitement and willingness of investors to take on risk on what they believe to be innovative and early stage Giants. The recent news of SpaceX, the parabolic run in ASTS and Rocketlabs 50th successful launch, all set the stage for a new theme and fomo rally to emerge.\n\nJust like when EVs moved thanks to the hype in Tesla we saw the entire sector move.\n\nJust like when $AI started the AI run and others such as NVDA (plus plenty of others) took the button and ran for 12-18 months.\n\nI see the Space sector as an emerging theme and names such as Redwire could potentially take the baton and garner worldwide interest.\n\nFor me, I see the worst case, bear case, as Redwire being a $1bn+ market cap by Christmas, which still represents a 100% move. Best case I see buyers stepping into calls of which market makers are drastically under-positioned for, creating a substantial over the top rally.\n\nPlease note: I haven’t a fucking clue what I’m talking about and none of this is advice.\n\nMy calls for December posted below.",
        "created_utc": 1729793738.0,
        "subreddit_name": "wallstreetbets",
        "comments": 62
    },
    {
        "title": "Girl without smartphone unable to join in lesson",
        "score": 3953,
        "url": "https://www.bbc.com/news/articles/cn030kjz04xo",
        "content": "",
        "created_utc": 1729801486.0,
        "subreddit_name": "news",
        "comments": 610
    }
]