[
    {
        "title": "Tesla stock has best day in over a decade on Musk's 2025 growth projection",
        "score": 556,
        "url": "https://www.reddit.com/r/stocks/comments/1gbcgse/tesla_stock_has_best_day_in_over_a_decade_on/",
        "content": "Tesla shares soared 22% to close at $260.48 on Thursday, the stock’s best day since 2013, following the company’s better-than-expected earnings report.\n\nThe company late Wednesday reported revenue of $25.18 billion, which came in just under analysts’ expectations of $25.37 billion, but was up 8% compared with a year earlier. Tesla reported earnings per share of 72 cents adjusted, topping the average analyst estimate of 58 cents.\n\n“We expect this surprising earnings beat to power a strong positive reaction in Tesla shares Thursday, given the degree to which investors have become conditioned to earnings misses from the company,” analysts at JPMorgan wrote in a note.\n\nTesla’s profit margins in the third quarter were boosted by $739 million in revenue for environmental regulatory credits, which the JPMorgan analysts noted were a “potentially unsustainable driver” of earnings and cash flow.\n\nAutomakers are required to obtain a certain amount of regulatory credits every year, and if they can’t meet the target, they can buy credits from other companies. Tesla has excess credits because it only makes electric vehicles.\n\nTesla earnings also got a boost from FSD, the company’s Full Self-Driving Supervised system. CFO Vaibhav Taneja said on the earnings call that FSD contributed $326 million in revenue in the quarter after Tesla made it available for use in the Cybertruck and added a feature called “Actually Smart Summon.”\n\nCEO Elon Musk said on the call that his “best guess” is that “vehicle growth” will reach 20% to 30% next year, citing “lower cost vehicles” and the “advent of autonomy.” Analysts surveyed by FactSet were expecting delivery growth of about 15% for 2025.\n\nEven bullish Deutsche Bank analysts doubted Musk’s forecast and wrote, in a note following the earnings report, “Our view remains more reserved at 10-15% (~2.03m),” and assumes Tesla can roll out a cheaper version of its Model Y at a price under $30,000 after subsidies, and other variants of the small SUV.\n\nAnalysts at Morgan Stanley who also recommend buying the stock, called Musk’s 2025 vehicle delivery growth prediction a “maybe.” They set their estimate at 14%.\n\nIt “clearly depends on the company’s ability to improve affordability through cheaper model (next gen) introduction, financing offers and improved features,” the Morgan Stanley analysts wrote in a note Thursday.\n\nA grain of salt\n\nMusk said on the Wednesday call that Tesla plans to start production of its recently unveiled Cybercab, a robotaxi with butterfly doors and no steering wheel or pedals, by the end of 2026. He also said Tesla would conduct driverless ridehailing in California and Texas next year in its existing cars, which are not currently safe to use without a human driver ready to steer or brake at any time.\n\nBernstein analysts, who have a bearish price target of $120 on shares of Tesla, wrote in a note out Thursday: “The tone of Tesla’s conference call was ebullient and filled with Musk prognostications that have historically polarized bull and bear investors, and was more akin to a pep rally, with the company only taking two questions from sell-siders.”\n\nMusk has for years promised shareholders a software upgrade that can turn Teslas into robotaxis. That hasn’t happened yet. Musk has also promised a refreshed version of the Tesla Roadster since 2017. The design of the vehicle is not yet complete. \n\nThe Bernstein analysts wrote, “We continue to struggle to see Tesla overcoming the technological and regulatory hurdles needed to leapfrog current level 4 robotaxis, and believe fully unsupervised FSD could be years away.”\n\nThey pointed to Musk’s “long history of being overly optimistic about FSD” and said crowdsourced research that shows “Tesla continues to lag well behind competitors” on robotaxis.\n\nThe share rally Thursday was the sharpest since a 24% gain in May 2013. The jump erased Tesla’s loss for the year and left the stock up 3% in 2024, though it still trails the 22% gain for the Nasdaq.\n\nSource: https://www.cnbc.com/2024/10/24/tesla-shares-surge-as-analysts-react-to-q3-earnings-musk-predictions.html",
        "created_utc": 1729801558.0,
        "subreddit_name": "stocks",
        "comments": 387
    },
    {
        "title": "Boeing machinists reject new labor contract extending more than 5-week strike",
        "score": 444,
        "url": "https://www.reddit.com/r/stocks/comments/1gas7id/boeing_machinists_reject_new_labor_contract/",
        "content": "Boeing machinists rejected a new labor deal that included 35% wage increases over four years, their union said Wednesday, extending a more than five-week strike that has halted most of the company’s aircraft production, which is centered in the Seattle area.\n\nBoeing machinists reject new labor contract extending more than 5-week strike https://www.cnbc.com/2024/10/24/boeing-machinists-new-labor-contract-strike.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
        "created_utc": 1729736789.0,
        "subreddit_name": "stocks",
        "comments": 142
    },
    {
        "title": "Nvidia supplier SK Hynix posts record Q3 profit, beats forecasts",
        "score": 96,
        "url": "https://www.reddit.com/r/stocks/comments/1gara3z/nvidia_supplier_sk_hynix_posts_record_q3_profit/",
        "content": "SEOUL (Reuters) -South Korea's SK Hynix on Thursday posted a record quarterly profit as the Nvidia (NASDAQ:NVDA) supplier saw strong sales of its advanced chips such as high bandwidth memory (HBM) ones used in generative AI chipsets.\n\nThe world's second-biggest memory chipmaker reported a 7 trillion won ($5.07 billion) operating profit for the July-September quarter versus a 1.8 trillion won loss a year earlier.\n\nThat compared with a 6.8 trillion won average forecast by LSEG SmartEstimate, which is weighted toward analysts who are more consistently accurate.\n\nSK Hynix has outperformed rivals Samsung Electronics (KS:005930) and Micron Technology (NASDAQ:MU) in recent quarters, as it has benefited the most from AI-driven appetite for high-end memory chips following its early entry and large investments in HBM chip development.\n\n\"HBM sales showed excellent growth, up more than 70% from the previous quarter and more than 330% from the same period last year,\" SK Hynix said in a statement.\n\nSK Hynix sees HBM sales making up 40% of its total DRAM revenue in the fourth quarter, up from 30% in the third quarter, and added it expects memory chip demand for AI servers to grow further next year as global tech companies continue developing generative AI.\n\nRevenue for the quarter rose 94% year-on-year to 17.6 trillion won.\n\nSK Hynix shares have jumped 38.5% so far this year, outperforming Samsung, whose stocks has slumped 24.7% over the same period.\n\nLast month, SK Hynix, the main supplier of HBM chips to Nvidia, said it had started mass production of HBM3E 12-layer chips and plans to supply the latest products to unidentified customers by the end of this year.",
        "created_utc": 1729733950.0,
        "subreddit_name": "stocks",
        "comments": 18
    },
    {
        "title": "Europe's top court rules for Intel to end long-running antitrust case",
        "score": 47,
        "url": "https://www.reddit.com/r/stocks/comments/1gb44gb/europes_top_court_rules_for_intel_to_end/",
        "content": "BRUSSELS, Oct 24 (Reuters) - The EU Court of Justice, Europe's top court, ruled on Thursday in favour of Intel, opens new tab, ending a nearly two-decade-long fight between the U.S. chipmaker and EU regulators who had said it had tried to thwart a rival.\n\n\"The Court of Justice dismisses the Commission’s appeal, thereby upholding the judgment of the General Court,\" the court said.\n\nSource: https://www.reuters.com/technology/europes-top-court-rules-intel-long-running-antitrust-case-2024-10-24/",
        "created_utc": 1729780572.0,
        "subreddit_name": "stocks",
        "comments": 8
    },
    {
        "title": "Is $SMR facing badluck or it will eventually breakthough?",
        "score": 19,
        "url": "https://www.reddit.com/r/stocks/comments/1gb96ql/is_smr_facing_badluck_or_it_will_eventually/",
        "content": "Badluck\n\n1. This past November, the Utah Associated Municipal Power Systems, or UAMPS, terminated what was to be “the first NuScale Power small modular reactor plant to begin operation in the United States.” This was a death foretold; the red flags have been obvious for years now.\n\nhttps://www.utilitydive.com/news/nuscale-uamps-project-small-modular-reactor-ramanasmr-/705717/\n\n2. NuScale also didn't make the final cut to build SMR in the UK\n\n>US company eliminated from race to build Britain’s first mini-nuclear plant\n\nhttps://www.telegraph.co.uk/business/2024/09/25/us-firm-eliminated-from-race-build-britain-first-mini-nuke/\n\nThe naysayers are stating due to unproven technology, nobody wants to be the 1st guinea pig.  It is costly upfront and if something goes wrong they might be on hook in fines and penalties (hazardous material handling).\n\nBut this said... recently, the Biden admin has greenlit financial assistance approval for nuclear energy related projects.  \n\nChina and Russia already have approved SMRs and I believe they have a few already up and running.  \n\nThe unfairness is that - their gov't can absorb the costs if something goes wrong. \n\nQuestions\n\n1. Why doesn't the US gov't go a little deeper into the projects and bear some of the costs/potential dangers associated with it? \n\n2. Big companies like Amazon and Google have signed up partnerships with energy companies for SMR to be designed/built.  Why don't they just partner with a company like NuScale instead (approved SMR design)?\n\nAt the end of day, in 10 years... if energy infrastructure stays the way it is - the US could be way behind Russia/China in terms of energy source/efficienct. Nevermind inability to power many data centers etc. and not ability to meet its clean energy goals. \n\nThoughts?\n",
        "created_utc": 1729793280.0,
        "subreddit_name": "stocks",
        "comments": 13
    },
    {
        "title": "My whole portfolio is in this single stock...",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gbb64c/my_whole_portfolio_is_in_this_single_stock/",
        "content": "Does anyone put all or most of their entire portfolio into a single stock? I know it's not the mainstream thinking but I am trying to go back to 90s when nobody knew anything about investing and everybody who bought hot shot stocks like Apple and Amazon became rich. \n\nI'm considering putting my entire IRA into GEV. It can potentially ride off the AI boom and climate change politics while maintaining the stability of a well established energy company. Could GEV be the next Amazon? What stock are you all in?",
        "created_utc": 1729798274.0,
        "subreddit_name": "stocks",
        "comments": 90
    },
    {
        "title": "Three stocks that you feel will outperform the market over the next 5 years",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gb1i5u/three_stocks_that_you_feel_will_outperform_the/",
        "content": "Like the title says: which three stocks, individual equities, do you believe will outperform the market, Market Index Funds: VOO, ONEQ, or DIA?\n\nMy takes:\n\nCOST -- Costco has a great expansion model, a great business model, and loyalty like few other companies: customer, employee, and vendors.\n\nAAPL -- I continue to see them innovate, they won't stick with something that isn't working, and their stuff just works.\n\nThird slot is a bit tougher: GOOG, NVDA, or JPM in that order.\n\n",
        "created_utc": 1729773116.0,
        "subreddit_name": "stocks",
        "comments": 58
    },
    {
        "title": "Explain how Fiverr exists in a world with AI agents",
        "score": 1149,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gb5c9e/explain_how_fiverr_exists_in_a_world_with_ai/",
        "content": "I’ve been thinking on it, and there’s no way a company that is based on hiring freelancers to do coding (and steal IPs) can stay at their current valuations when AI agents become main stream. I mean, I made a Reddit scanner to look for certain keywords in comments on posts in an hour, works perfectly. It’s like 250 lines of code, and it was free. I have zero coding experience.\n\nSomeone explain why I shouldn’t go all in on puts against them and low-level development companies like Appian. Because to me, they seems like the next Chegg.\n\nFor context, I’ve already purchased some deep OTM puts a year or so out on Fiverr, Appian, and a couple consulting companies.\n\nEdit: Because a lot of people don’t seem to know what release I’m taking about, or know its abilities, you can watch and read more [here](https://m.youtube.com/watch?v=ODaHJzOyVCQ&embeds_referring_euri=https%3A%2F%2Fcointelegraph.com%2F&source_ve_path=MjM4NTE). \nYou can basically share your screen with the AI, allowing it to click around for you if you are using their API. Meaning that code that it wrote? It can put it into action, your average consumer doesn’t need to know how to do that anymore. Now picture this in 6 months to a year, given how much we’ve moved forward in that same time period. \n\nTL;DR: Fiverr, Appian, SaaS companies are going to lose revenue.\n\n\nEdit 2: Since I’ve got you all here: The [White House](https://www.whitehouse.gov/briefing-room/presidential-actions/2024/10/24/memorandum-on-advancing-the-united-states-leadership-in-artificial-intelligence-harnessing-artificial-intelligence-to-fulfill-national-security-objectives-and-fostering-the-safety-security/) just put out a statement that they’re going all in on AI too, which I think is pretty neat\n\nEdit 3: Okay, thank you all. Maybe Fiverr as of 10/24/2024 isn’t the play, but it will be some day ",
        "created_utc": 1729783662.0,
        "subreddit_name": "wallstreetbets",
        "comments": 470
    },
    {
        "title": "Redwire - The 3rd Musketeer Rocketlab SpaceX",
        "score": 64,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gb9dbh/redwire_the_3rd_musketeer_rocketlab_spacex/",
        "content": "Redwire already supplies Rocketlab with parts, a contractual agreement which started in May 2024. The also supply NASA, Lockheed Martin, Boeing, Blue Origin and many more.\n\n* They are currently working with $LLY on 3D bio-printing organs in space, which they’re making great progress of.\n* They acquired Hera systems to increase the dominance for national security space customers.\n* They were selected to provide advanced RF payloads to a leading defense contractor.\n* They have joined the US-U.A.E council where Danny Sebright stated “Redwire’s pioneering advancements in Space Infrastructure showcase the very best of American innovation and ingenuity. As a member Redwire joins an elite list of member companies at the forefront of almost every industry.\n* They signed a MOU with NASA’s REMIS-2 mission to provide Spaceflight hardware, ground hardware and software, engineering services, payload facility integration and more.\n* Selected to provide a critical onboard computer system for the European Space Agency Hera Mission, Europes flagship planetary defense mission.\n* To supply Solar Arrays for Thales Alenia Telecommunications product line.\n* Selected by (SCA) to develop, build and deliver advanced thruster technology nicknamed the (Valkyrie Thurster) designed for reliable, high-volume production for the surge in national security space programmes.\n* Awarded Darpa Prime Contract to be the prime mission integrator for the development of revolutionary air-breathing satellite that will demonstrate the use of Novel electric propulsion in very-low earth orbit (VLEO).\n* Awarded Contract by the European Space agency to develop a Robotic Arm to support the landing for the International Lunar Exploration Mission.\n* Selected by Rocketlab to provide Antennas and RF hardware.\n\nAnd those are just some of the latest contracts & advancements Redwire has made. They’ve been prolific aquirers since going public and continue to aggressively expand their footprint across all space sectors.\n\nIt’s why their CEO goes by the Moto of “If space wins Redwire wins”, a confident statement backed by their foundational success of becoming the “building blocks to space”\n\nYet it’s currently one of the cheapest and most undervalued Space stocks there is. Trading at a P/S of just 1.58 compared to Rocket Labs 11.5. A market cap of just $450m vs Rocketlabs $4.28b & ASTS $6.73b\n\nThis isn’t about who’s better, it’s about Redwire being drastically undervalued and under the radar of most growth investors.\n\nI shared my thoughts on Rocketlab 3-4 months ago after scooping the October and January calls.\n\nSince then people have finally started to realise the potential in the company. To sit are similar valuations based upon growth and income, Redwire would not to hit approximately $42/share. At this point it would still remain once of the cheapest yet most advanced space companies out there.\n\nWhy now?\n\nStocks move in themes, every success trader from here to Timbuktu will tell you that. It’s caused by the excitement and willingness of investors to take on risk on what they believe to be innovative and early stage Giants. The recent news of SpaceX, the parabolic run in ASTS and Rocketlabs 50th successful launch, all set the stage for a new theme and fomo rally to emerge.\n\nJust like when EVs moved thanks to the hype in Tesla we saw the entire sector move.\n\nJust like when $AI started the AI run and others such as NVDA (plus plenty of others) took the button and ran for 12-18 months.\n\nI see the Space sector as an emerging theme and names such as Redwire could potentially take the baton and garner worldwide interest.\n\nFor me, I see the worst case, bear case, as Redwire being a $1bn+ market cap by Christmas, which still represents a 100% move. Best case I see buyers stepping into calls of which market makers are drastically under-positioned for, creating a substantial over the top rally.\n\nPlease note: I haven’t a fucking clue what I’m talking about and none of this is advice.\n\nMy calls for December posted below.",
        "created_utc": 1729793738.0,
        "subreddit_name": "wallstreetbets",
        "comments": 62
    },
    {
        "title": "Girl without smartphone unable to join in lesson",
        "score": 3953,
        "url": "https://www.bbc.com/news/articles/cn030kjz04xo",
        "content": "",
        "created_utc": 1729801486.0,
        "subreddit_name": "news",
        "comments": 610
    },
    {
        "title": "iOS 18.2 Lets Children Report Nudity in iMessages, Starting in Australia",
        "score": 959,
        "url": "https://www.macrumors.com/2024/10/24/ios-18-2-imessage-feature-for-reporting-nudity/",
        "content": "",
        "created_utc": 1729782142.0,
        "subreddit_name": "apple",
        "comments": 98
    },
    {
        "title": "iOS 18.2 to Allow Third-Party Browser Web Apps With Custom Engines in EU",
        "score": 520,
        "url": "https://www.macrumors.com/2024/10/24/ios-18-2-eu-third-party-browser-web-apps/",
        "content": "",
        "created_utc": 1729772973.0,
        "subreddit_name": "apple",
        "comments": 118
    },
    {
        "title": "Apple Releases New AirPods Pro 2 Firmware Ahead of Hearing Aid Feature Launch",
        "score": 452,
        "url": "https://www.macrumors.com/2024/10/24/apple-releases-airpods-pro-2-firmware-7b19/",
        "content": "",
        "created_utc": 1729796148.0,
        "subreddit_name": "apple",
        "comments": 58
    },
    {
        "title": "iPhone Could Inherit Apple Watch Series 10's Power Efficient [LTPO3] Display",
        "score": 426,
        "url": "https://www.macrumors.com/2024/10/24/iphone-get-apple-watch-series-10-efficient-display/",
        "content": "",
        "created_utc": 1729767357.0,
        "subreddit_name": "apple",
        "comments": 87
    },
    {
        "title": "Apple Shares Private Cloud Compute Virtual Research Environment, Provides Bounties for Vulnerabilities",
        "score": 265,
        "url": "https://www.macrumors.com/2024/10/24/apple-private-cloud-compute-security-info/",
        "content": "",
        "created_utc": 1729799267.0,
        "subreddit_name": "apple",
        "comments": 1
    },
    {
        "title": "Daily Advice Thread - October 24, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/apple/comments/1gayym9/daily_advice_thread_october_24_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1729764032.0,
        "subreddit_name": "apple",
        "comments": 40
    },
    {
        "title": "The FCC will review the broadband industry’s lousy customer support | The formal inquiry will tackle hard-to-cancel subscriptions, phone tree “doom loops” and poor accessibility options.",
        "score": 820,
        "url": "https://www.engadget.com/big-tech/the-fcc-will-review-the-broadband-industrys-lousy-customer-support-204329886.html",
        "content": "",
        "created_utc": 1729761250.0,
        "subreddit_name": "technology",
        "comments": 38
    },
    {
        "title": "Apple and Goldman Sachs ordered to pay $89 million over Apple Card failures",
        "score": 413,
        "url": "https://www.npr.org/2024/10/23/g-s1-29566/apple-goldman-sachs-fine-apple-card-cfpb",
        "content": "",
        "created_utc": 1729739409.0,
        "subreddit_name": "technology",
        "comments": 17
    },
    {
        "title": "Got a free 2011 iMac. Should be a fun refresh project ",
        "score": 80,
        "url": "https://i.redd.it/9ib9l8nlnqwd1.jpeg",
        "content": "So picked this up earlier and to my dismay I can’t reinstall Maverick on it since it won’t let me log in with my Apple ID from the utility screen. So likely going to go the route of a USB installer with OCLP and see if I can at least get Ventura to run on it. Also going to be putting in 16gb of Ram",
        "created_utc": 1729790619.0,
        "subreddit_name": "mac",
        "comments": 14
    },
    {
        "title": "battery bulge?",
        "score": 21,
        "url": "https://www.reddit.com/gallery/1gbbyyx",
        "content": "i was seeing a little bit of asymmetry on the sides of my 13 in macbook pro m1 and was wondering if this is normal",
        "created_utc": 1729800308.0,
        "subreddit_name": "mac",
        "comments": 37
    },
    {
        "title": "Wierd screen bug in my macbook",
        "score": 19,
        "url": "https://www.reddit.com/gallery/1gb7ea5",
        "content": "",
        "created_utc": 1729790080.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "Dell 40 UltraSharp vs Dual Monitor",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gb7jie/dell_40_ultrasharp_vs_dual_monitor/",
        "content": "Which is better for programming im on the edge of buying second monitor to my current 27 Ultrasharp Dell but i have the money and want the best workflow which one to get ? 3 27 UltraSharp Dell monitors will still be cheaper but i think with the window management and no bezel in between i can don't have to roll my head around and just have windows stack next to each other and i can have the current 27 inch Vertically or use laptop 16 inch MacBook screen. I really think the bezel and the position of your head not being centered with the dual/triple makes it lesser but most websites and forums say Dual Monitor is better than ultrawide but they maybe didn't implement the feature that there exists something in the middle and that is the Dell 40 UltraSharp. It has also more height than the 27 inch right?",
        "created_utc": 1729789191.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Apple Photos won't import downloaded iCloud Photos from SSD",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gb0fp1/apple_photos_wont_import_downloaded_icloud_photos/",
        "content": "Moving all my iCloud Photos to an external SSD that I run my photos library from. I got my photos from apple but when I try to import them into my Apple Photos library, it says there isn't enough free disk space. This even happens if I just try to import 1 JPEG. I have 187 gb free on my internal drive and have 1 TB free on my external SSD. \n\nI'm on Sonoma with all updates installed. I also tried moving one of the images to another external SSD and did Disk Utility first aid to check and got no error and Photos still won't import 1 single photo. Anyone else have this issue or know a solution? ",
        "created_utc": 1729769689.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Apple Intelligence Isn't Driving iPhone 16 Sales the Way Apple Hoped, Analyst Says",
        "score": 1802,
        "url": "https://gizmodo.com/apple-intelligence-iphone-16-sales-2000515926",
        "content": "",
        "created_utc": 1729777333.0,
        "subreddit_name": "gadgets",
        "comments": 716
    },
    {
        "title": "Apple Watch sleep apnea detection now available in Canada following approval",
        "score": 176,
        "url": "https://9to5mac.com/2024/10/23/apple-watch-sleep-apnea-canada-2/",
        "content": "",
        "created_utc": 1729765362.0,
        "subreddit_name": "gadgets",
        "comments": 20
    },
    {
        "title": "Samsung Galaxy S24 FE review: A great phone, but I wish it was cheaper | engadget",
        "score": 44,
        "url": "https://www.engadget.com/mobile/smartphones/samsung-galaxy-s24-fe-review-a-great-phone-but-i-wish-it-was-cheaper-190032655.html",
        "content": "",
        "created_utc": 1729797191.0,
        "subreddit_name": "gadgets",
        "comments": 11
    },
    {
        "title": "Location tracking of phones is out of control. Here’s how to fight back | Unique IDs assigned to Android and iOS devices threaten your privacy. Who knew?",
        "score": 239,
        "url": "https://arstechnica.com/information-technology/2024/10/phone-tracking-tool-lets-government-agencies-follow-your-every-move/",
        "content": "",
        "created_utc": 1729776158.0,
        "subreddit_name": "technews",
        "comments": 11
    },
    {
        "title": "r/Stocks Daily Discussion & Options Trading Thursday - Oct 24, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/stocks/comments/1gayjng/rstocks_daily_discussion_options_trading_thursday/",
        "content": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nRequired info to start understanding options:\n\n* [Call option Investopedia video](https://www.investopedia.com/terms/c/calloption.asp) basically a call option allows you to buy 100 shares of a stock at a certain price (strike price), but without the obligation to buy\n* [Put option Investopedia video](https://www.investopedia.com/terms/p/putoption.asp) a put option allows you to sell 100 shares of a stock at a certain price (strike price), but without the obligation to sell\n* Writing options switches the obligation to you and you'll be forced to buy someone else's shares (writing puts) or sell your shares (writing calls)\n\nSee the following word cloud and click through for the wiki:\n\n[Call option - Put option - Exercising an option - Strike price - ITM - OTM - ATM - Long options - Short options - Combo - Debit - Credit or Premium - Covered call - Naked - Debit call spread - Credit call spread - Strangle - Iron condor - Vertical debit spreads - Iron Fly](https://www.reddit.com/r/stocks/wiki/options-themed-post)\n\nIf you have a basic question, for example \"what is delta,\" then google \"investopedia delta\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1729762210.0,
        "subreddit_name": "stocks",
        "comments": 185
    },
    {
        "title": "getting cute with my Roth IRA",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gb37yz/getting_cute_with_my_roth_ira/",
        "content": "37 year old male.  \n\n13k in a personal roth IRA in VFIFX\n\n25k in a 403b company sponsored match 8%, currently doing 10%\n\n8k in a personal brokerage as an emergency fund\n\n5k in an Acorns acount because I like pilfering for savings.  \n\n  \nObviously I'm very behind in my savings for retirement.  I make \\~85k/year gross.  In my Roth IRA I have set automatic investments $100/wk into VFIFX.  would it be a smart move to start investing that $100/wk into an ETF such as SPY or something more aggressive?   Would there be drawbacks to this plan?",
        "created_utc": 1729778187.0,
        "subreddit_name": "investing",
        "comments": 12
    },
    {
        "title": "Ideas for a upcoming market downturn",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gazyig/ideas_for_a_upcoming_market_downturn/",
        "content": "Just collecting thoughts on a potential market down turn for a 6 month rotation.  I have been seeing and hearing about the Warren buffet indicator (debt ratio to GDP) and it’s not looking good.  Maybe it’s something maybe it’s nothing.  We also are not sure if we have a soft landing yet as well.  \n\nI have a few thoughts feel free to add in.  If you have done something similar leave the idea\n\n1.  Move my 401k and Roth into a money market and collect ~4%.  I am not moving the whole thing possibly 25-50%.  I have fidelity and Blackrock so SPAXX and I’m limited in my 401k to blackrock money market that’s available.\n\n2.  Move 50%.  25% to money markets 25% to SQQQ.\n\nMy investments are pretty basic.  I have blackrock my2055 retirement fund.  \n\nRoth is 60% Spy \n20% Qqq \n10% TSLA\n10% PLTR\n\n",
        "created_utc": 1729767933.0,
        "subreddit_name": "investing",
        "comments": 20
    },
    {
        "title": "Russian spy nabbed in Poland after 10-month manhunt",
        "score": 3104,
        "url": "https://www.polskieradio.pl/395/7784/Artykul/3438623,russian-spy-nabbed-in-poland-after-10month-manhunt",
        "content": "",
        "created_utc": 1729775130.0,
        "subreddit_name": "worldnews",
        "comments": 19
    },
    {
        "title": "What is your favorite stock to scalp?",
        "score": 17,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gau39n/what_is_your_favorite_stock_to_scalp/",
        "content": "I usually scalp SPY when I got time, but I want to stay away from it for a while as I recently realized pretty big loss and don't want to be targeted by wash sales rule. Thinking about NVDA. Any other ideas?",
        "created_utc": 1729743002.0,
        "subreddit_name": "DayTrading",
        "comments": 60
    },
    {
        "title": "QQQ candlestick pattern help (1D chart)",
        "score": 4,
        "url": "https://i.redd.it/ockkdjhhbswd1.jpeg",
        "content": "Hello! So I would like your input on this candlestick formation. So I see it is above the SMA20, although yesterday it closed below, today is above it again but with a green doji candle. Seems like the lower wick is rejecting the SMA so rhere is bullish pressure trying to not let it go below the SMA20, but seems like buyers are getting exhausted. Meaning, the QQQ is looking like it will enter the lower side of SMA20 soon. Is this correct? What do you think? The days with biggest volume also seem to be the bearish days.",
        "created_utc": 1729810754.0,
        "subreddit_name": "DayTrading",
        "comments": 6
    },
    {
        "title": "Buy $aapl before earnings.",
        "score": 28,
        "url": "https://www.reddit.com/r/AAPL/comments/1gb6w9n/buy_aapl_before_earnings/",
        "content": "You’re welcome.\n\nEdit: this is semi professional advice. Do not bet your life savings on it ffs.",
        "created_utc": 1729787568.0,
        "subreddit_name": "AAPL",
        "comments": 54
    },
    {
        "title": "Updates On Apple’s $490M Investor Settlement",
        "score": 3,
        "url": "https://www.reddit.com/r/AAPL/comments/1gb8noz/updates_on_apples_490m_investor_settlement/",
        "content": "Hey guys, I posted about this settlement already, but since we have an update for it, I decided to post it again. In case you missed it, it's about Tim Cook’s comments about China’s sales back in 2018.So, if you checked the news in 2018, those comments were before the first Apple's revenue cut and loss of more than $70B with the stock fall.\n\n\n\nDuring the call in the same 2018, he said that though Apple had sales problems in a few countries with high inflation rates (like Brazil and Russia), there were no such problems for China. But then, just a few days later, Apple cut production and requested it from the suppliers, so I think it was obviously otherwise.\n\n\n\nAnd just two months later, Apple shocked everyone with its first announcement about the revenue cut since the iPhone establishment in 2007, causing AAPL to drop by 10% and resulting in 70B losses.\n\n\n\nThis was the reason for several scandals and lawsuits based on Cook's comments, but Apple denied that they had any wrongdoing in this case (and they continue to deny it to this day).\n\n\n\nSo, this whole story is going to an end because recently Apple decided to pay $490M to investors due to the situation (even before the court hearing). And  I just found out that even though the deadline already passed, they are taking late claims on this. So if you were hit by this, you can [check it out](https://11thestate.com/cases/apple-investor-settlement).\n\n\n\nHowever, does that half a billion even come close to covering the $70 billion loss? Especially with all the drama Apple's dealing with in China?\n\n",
        "created_utc": 1729791994.0,
        "subreddit_name": "AAPL",
        "comments": 0
    }
]