[
    {
        "title": "The Apple Watch feature I once thought was a throwaway novelty is now crucial to me.",
        "score": 15175,
        "url": "https://www.reddit.com/r/apple/comments/6i0qba/the_apple_watch_feature_i_once_thought_was_a/",
        "content": "Not sure how many people frequently use the digital touch heartbeat on their Apple Watch, but I wasn't one of them until a month ago. I bought my Apple Watch when it first came out, and my wife and I exchanged heartbeat messages maybe two or three times and then never used it again. Last month, my sister passed away from a rare form of cancer. While she was on her deathbed, my wife suggested taking her pulse with my Watch, just to see how she was doing internally. I gently rested the watch on her wrist, took the pulse, and, in the process, remembered the heartbeat feature. I sent her heartbeat to myself, so I could easily keep track of where it was. She passed away a few hours later. Today, whenever I need to feel as though she's with me, I just bring up that heartbeat and let it pulse. I wanted to share this with fellow Apple enthusiasts, as a use case I never thought about when I bought my watch, and one I hope you'll remember going forward if you're ever in a similar situation.\n\nTL;DR my sister passed away and I use the digital touch heartbeat to keep her with me.\n\nEdit: I had some people asking what kind of cancer (and others pointing out the potential to raise awareness), so I'll share it here. She had Small Cell Carcinoma of the Ovary Hypercalcemic. My family was told it affects 1% of women in the world, but I don't have the link to back that up. If you want to donate to something that helps people in her situation, consider [The Ballard House](https://www.theballardhouse.org) (They provided my sister with temporary housing while she was going through radiation treatments), or any cancer-fighting/support non-profit.",
        "created_utc": 1497805631.0,
        "subreddit_name": "apple",
        "comments": 564
    }
]