[
    {
        "title": "Nvidia passes Alphabet in market cap, now the third most valuable U.S. company",
        "score": 2712,
        "url": "https://www.reddit.com/r/stocks/comments/1ar26eu/nvidia_passes_alphabet_in_market_cap_now_the/",
        "content": "Nvidia surpassed Google parent Alphabet in market capitalization on Wednesday. It’s the latest example of how the artificial intelligence boom has sent the chipmaker’s stock soaring.\n\nNvidia rose over 2% to close at $739.00 per share, giving it a market value of $1.83 trillion to Google’s $1.82 trillion market cap. The move comes one day after Nvidia surpassed Amazon in terms of market value.\n\nThe symbolic milestone is more confirmation that Nvidia has become a Wall Street darling on the back of elevated AI chip sales, valued even more highly than some of the large software companies and cloud providers that develop and integrate AI technology into their products.\n\nNvidia shares are up over 221% over the past 12 months on robust demand for its AI server chips that can cost more than $20,000 each. Companies like Google and Amazon need thousands of them for their cloud services. Before the recent AI boom, Nvidia was best known for consumer graphics processors it sold to PC makers to build gaming computers, a less lucrative market.\n\nGoogle was largely expected to benefit from AI, especially since employees at the company pioneered many of the techniques — such as transformer architecture — used in cutting-edge models like ChatGPT.\n\nGoogle shares are still up 55% in the past 12 months, though the company has grappled with layoffs and culture issues after it declared a “code red” situation to build AI services into its products. Google announced a $20 per month AI subscription called Gemini Advanced earlier this week, one of its first paid generative AI products.\n\nNvidia is now the third largest U.S. company, only behind Apple and Microsoft. Nvidia reports quarterly earnings on Feb. 21. Analysts expect 118% annual growth in sales to $59.04 billion.\n\nSource: https://www.cnbc.com/2024/02/14/nvidia-passes-alphabet-market-cap-now-third-most-valuable-us-firm.html",
        "created_utc": 1707956054.0,
        "subreddit_name": "stocks",
        "comments": 499
    }
]