[
    {
        "title": "Elon Musk’s Trump bet has paid off so well that Tesla is now worth more than most of the rest of the car industry combined",
        "score": 9118,
        "url": "https://www.reddit.com/r/stocks/comments/1gowwdj/elon_musks_trump_bet_has_paid_off_so_well_that/",
        "content": "[https://fortune.com/2024/11/11/elon-musk-donald-trump-election-tesla-auto-industry-carmakers-market-value/](https://fortune.com/2024/11/11/elon-musk-donald-trump-election-tesla-auto-industry-carmakers-market-value/)\n\n>Tesla CEO Elon Musk’s ‘all-in’ gamble to get Donald Trump elected president has proven so successful that a veritable chasm has opened up between his EV manufacturer and the rest of the auto industry. As conventional carmakers trade at rock-bottom prices amid a broad industry malaise brought on by China’s economic slowdown and growing fears of Trump tariffs, Tesla’s stock continues to soar, creating one of the biggest valuation gaps it’s ever seen.\n\n>On Friday, Tesla reclaimed its place in the elite club of companies worth more than $1 trillion after adding a full third in market capitalization since Election Day less than a week ago. The last time Tesla was worth this amount of money it was April 2022, Musk had just revealed his $44 billion plan to acquire Twitter.\n\n>Relative to its peers, Tesla is now worth more than the next 15 largest carmakers combined—from Toyota and General Motors all the way down to Jeep’s parent company Stellantis and Hyundai. Toss in lower ranked names like Kia and Renault, respectively worth $26.6 billion and $12.6 billion, and Tesla is still is still ahead, only drawing even once the $8.8 billion from Japan’s Nissan is thrown into the mix.",
        "created_utc": 1731344115.0,
        "subreddit_name": "stocks",
        "comments": 770
    },
    {
        "title": "NVDA has become the largest position in retail portfolios in the first half of the year",
        "score": 185,
        "url": "https://www.reddit.com/r/stocks/comments/1gp0l4n/nvda_has_become_the_largest_position_in_retail/",
        "content": "Data on the 15 most widely held stocks and ETFs in retail portfolios and sorted by weight, NVDA tops the list with a 9.3% weighting over other popular stocks. Such as Apple, S&P 500 EFT, Tesla, Nasdaq 100 EFF, Meta, and others.\n\nThis compares to NVDA's 4.2% weighting in the average retail portfolio a year ago\n\nNVDA's popularity is largely due to its rapidly rising stock price, earnings reports that have repeatedly beaten expectations, and retail investors' preference for tech stocks - over the past year, NVDA's stock price has risen 203%, and in the second quarter, NVDA's revenues of $30 billion were up 15% sequentially and 122% year-on-year, well above the $28 billion estimate",
        "created_utc": 1731352880.0,
        "subreddit_name": "stocks",
        "comments": 70
    },
    {
        "title": "ELF has unlimited potential and is up sharply today ",
        "score": 44,
        "url": "https://www.reddit.com/r/stocks/comments/1gov28j/elf_has_unlimited_potential_and_is_up_sharply/",
        "content": "U.S. e.l.f. Beauty was founded in 2005, mainly to do affordable fast-fashion makeup, but not until after the epidemic suddenly became very popular in the U.S., and make its market value wildly, from about 500 million in early 2020, to a maximum of 12 billion in March 2024, and because of the lower-than-expected earnings report, the management lowered its guidance, predicting that the 25-year growth slowed down to 25% (23 years for 80-percent), now November 2024 market cap of $7.3 billion;\n\nIn a nutshell: now $7.3B market cap, ELF has unlimited potential for future growth.\n\n Company business:\n\n1, the main category is color cosmetics, the latest signature product is Soft Glam Satin Foundation, also have skin care products, but the share is very low. The main focus is on cost-effective, light operation, U.S. design + China manufacturing (third-party production);\n\n2. Revenue by region, US market accounts for 85%, international market 15%; in the US, it mainly relies on Walmart, Target, CVS, Ulta Beauty, and other channels for sales; ELF is currently available in 14+ countries, and distributes globally mainly through eShopWorld;\n\nRevenue by channel, retailers occupy 85%, e-commerce channel 15%;\n\n3. Main reasons for its success:\n\n(1) By OEM in China, it reduces cost (70% gross margin) and creates cost-effective selling points; and it responds quickly, with new products taking only 13 weeks from R&D to launch;\n\n(2) Through new media and netizen cooperation, it is very influential on social media like Tiktok and Instagram, and develops marketing content and so on separately according to different social media attributes;\n\n(3) Pushing new products by cross-branding with many brands (jeans, fast food restaurants, etc.);\n\nNovelty, fast fashion, new media marketing approach, making it popular among teenagers represented by Generation Z. It ranks in the top three in terms of market share of cosmetics (may refer to the United States alone);\n\n4. Brand awareness is rising rapidly:\n\nWithin the U.S., ELF's brand awareness increased from 13% in 2020 to 26% in 23 and 33% in 24;\n\nIt is the fourth largest brand in the UK and Canada, compared to eighth and sixth respectively a year ago.\n\n Company strategy:\n\nCost-effective products + new media marketing + low-cost channels\n\n Executives and shareholdings:\n\n(1) All are predominantly institutional holdings and are relatively diversified; Pioneer Pilot 10-percent, BlackRock 9-percent, Berkey Investments 7-percent, and so on;\n\n2, CEO joined and served as CEO in 2014, with prior track record of experience in a variety of industries. cfo and VP joined the position in 19, also not previously in the beauty industry.\n\n3, As of March 31, 2024, there are just under 500 full-time employees, including 100 in China.\n\n Financial:\n\n1. Income Statement: revenue for fiscal year 2024 (2024.03) is $1.1 billion, gross profit is $800 million, selling and administrative expenses are $650 million, and net income is $120 million; revenue from fiscal year 2019 to 2024 is, in order, $27, $2.8, $3.2, $4, $5.8, $1.0, and $1.13 billion; revenue increases from FY21 to FY24 are, in order, 12%, 23%, 48%, and 77%; net income from 2019 to 2024 fiscal years in order: 0, 0.2, 0, 0.2, 0.6, 1.3, 120 million;\n\n2, cash flow statement: operating cash flow of 0.7 billion and free cash flow of 0.6 billion in 2024; it has basically no financing since its IPO, with 0.2 billion in buybacks, and in August '24 it said that the board of directors authorized up to $500 million in buybacks ;\n\n3, balance sheet: as of the end of March 24, total assets were $1.2 billion, total liabilities were $500 million, shareholders' equity was close to $700 million, and the debt ratio was 40%; among assets, cash assets were $100 million, inventory was $200 million, fixed assets were $0.07 billion, and goodwill + intangibles were $0.6 billion; on the liability side, interest-bearing liabilities were $260 million (short $1+long $16), and the financial position was good.\n\n4, valuation: the current (2024.11) market capitalization of 7.3 billion U.S. dollars, corresponding to the annual revenue of about 1 billion per year, after spending 700 million per year after the sale of the management costs, to get 100 million in profit and free cash flow; assets on the books of 100 million in cash, 250 million in liabilities, shareholders' equity of 700 million (most of the goodwill and intangible assets)\n\n Market views:\n\n1, the short side:\n\n(1) The U.S. and Canadian markets are very close to saturation, ELF is certain categories have been ranked one or two, like the previous substantial growth is unlikely;\n\n(2) The international market is a vast space for development, but it is estimated that the U.S. market can not be achieved as high-speed expansion;\n\n(3) industry EV / EBITDA valuation, for those with growth, generally at 25 times, ELF in 22, 23 years, respectively, 37, 46;\n2, multiple parties:\n\n(1) international market has great potential, by FY27, revenues will reach 1.8 billion (now 1 billion), should be given a valuation of 71 times the P/E ratio, the target share price is $250\n\n Summary:\n\nELF was founded in 05, fast fashion beauty brand, with the success of the new media marketing in the past few years, the brand influence has increased greatly, after 21 years, the average 50% increase in revenues, the market capitalization is also soaring, soaring from $500 million to $12 billion, back to $7.3 billion now.\n\nThe biggest problem with fast fashion brands is that they tend to rise fast and fall fast; to form a brand moat, they still need more than a decade of precipitation.\n\nSo the observation of ELF is mainly to see whether its hotness in the United States can be sustained, as well as the development of overseas markets;\n\nOverall, fast fashion beauty, because of its low technology and high profit, belongs to the products that need strong marketing, and it is considered a good idea to use new media + Netflix as the main marketing method.",
        "created_utc": 1731339560.0,
        "subreddit_name": "stocks",
        "comments": 23
    },
    {
        "title": "US Tech Stocks will push back against EU pressure as Trump signals tariffs and 'America First' policies",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1govegm/us_tech_stocks_will_push_back_against_eu_pressure/",
        "content": "Honestly, it feels like Apple and the whole US tech sector are finally standing up to the EU's Digital Markets Act (DMA) and all the over-the-top regulations. With Trump hinting at tariffs and pushing that \"America First\" vibe, the U.S. tech giants might finally have the leverage to say \"no thanks\" to a lot of the stuff Europe’s trying to force on them. The DMA is supposed to keep things competitive, but for companies like Apple, it’s just restrictive and honestly impacts their ability to innovate. If the U.S. government throws its weight behind them, these companies could really start pulling back from Europe’s grip and go about their business without being bogged down by EU red tape.\n\n\n\nEurope’s supposed to be an innovation hub, but it’s really starting to look like the opposite. For startups, the endless admin, complex regulations, and sky-high taxes make it pretty much impossible to thrive. You have great ideas coming out of Europe, but the bureaucracy and costs just suffocate them before they can take off. Compare that to the U.S., where taxes are lower and there’s way less red tape, and you can see why so many are ditching Europe altogether. It’s like the EU’s digging its own grave when it comes to tech innovation, and the U.S. might be there to pick up the pieces.\n\nit's time to heavily long US Tech Stocks imo ",
        "created_utc": 1731340427.0,
        "subreddit_name": "stocks",
        "comments": 61
    },
    {
        "title": "$80,000 to $1.12M in 7 days. Thank you Elon Musk! $TSLA",
        "score": 17918,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gouy6r/80000_to_112m_in_7_days_thank_you_elon_musk_tsla/",
        "content": "https://preview.redd.it/5i2pyzrxja0e1.jpg?width=1098&format=pjpg&auto=webp&s=c2f04c7bed78f9c752e85e916ed65fb1503dccc2\n\nhttps://preview.redd.it/capdss2yja0e1.jpg?width=831&format=pjpg&auto=webp&s=7d7840950b254bfbef13d3c2bb56be8b2a0a005d\n\n(Repost from 30 minutes ago because my post wasn't clear enough according to the mods)  \n  \nSo, I wanted to bet on Tesla mooning as a result of Trump winning due to their new close relationship, and the deregulation that was coming for Tesla in the new administration. I'm not a political person, just trading off an idea!\n\nSo here's what I did:  \n  \nBought $15,000 on 3:1 Kamala bets to win $30,000 to hedge my $50,000 in TSLA weekly calls. If she had won, I'd lose $10K-15K Max. If Trump won, this happens... Rolled my weekly calls to 29 Nov/ 20 Dec and held till today. Closed 95%.",
        "created_utc": 1731339263.0,
        "subreddit_name": "wallstreetbets",
        "comments": 1431
    },
    {
        "title": "Thank you Elon! $TSLA $10k to $149k in under a week",
        "score": 4285,
        "url": "https://i.redd.it/k519nqm4xc0e1.jpeg",
        "content": "Opened a lotto account last week after the elections and full send $TSLA FDs . Holding 49 contracts $450c for 3/22/2025 for now. ",
        "created_utc": 1731367715.0,
        "subreddit_name": "wallstreetbets",
        "comments": 398
    },
    {
        "title": "Time to inverse WSB, 50k puts on $TSLA",
        "score": 2544,
        "url": "https://i.redd.it/f0dbekftrb0e1.png",
        "content": "You are all so bullish on TSLA. Time to do the opposite, this week we have CPI, multiple fed speakers and unemployment. See you all back at 250$",
        "created_utc": 1731353825.0,
        "subreddit_name": "wallstreetbets",
        "comments": 596
    },
    {
        "title": "Hedge Funds Shorting Tesla Just Lost More Than $5 Billion\n",
        "score": 2267,
        "url": "https://finance.yahoo.com/news/hedge-funds-shorting-tesla-just-190000159.html",
        "content": "",
        "created_utc": 1731334410.0,
        "subreddit_name": "wallstreetbets",
        "comments": 234
    },
    {
        "title": "$TSLA Calls Closed +$400k",
        "score": 875,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gp6tf7/tsla_calls_closed_400k/",
        "content": "Haven't gotten any sleep holding these Tesla calls, but it finally paid off. Exited everything today for peace of mind and a good night's rest. Rolled the profits into Tesla shares targeting $400. It’s been a brutal yet humbling ride and now ready for the next chapter.\n\nHere’s to those who hold the line for the moon 🚀💎🤲\n\nhttps://preview.redd.it/zf9h5ghxyc0e1.jpg?width=1257&format=pjpg&auto=webp&s=ebac47352deb82b8e1976bdc32c6f45091d12175\n\nhttps://preview.redd.it/l2nhwagxyc0e1.jpg?width=1282&format=pjpg&auto=webp&s=31cf665a90f13ffb87532fe3ecb6a42cee602c59\n\n",
        "created_utc": 1731368338.0,
        "subreddit_name": "wallstreetbets",
        "comments": 109
    },
    {
        "title": "Today’s Gain 🚀",
        "score": 320,
        "url": "https://i.redd.it/ofqmri927c0e1.jpeg",
        "content": "Bought TSLA 285 call on Nov. 6th intraday\n\nBecause I knew that TSLA would undoubtedly be the biggest gainer after Trump's victory\n\nSo I bought TSLA calls and kept them until now, I was overwhelmed with excitement during the days of waiting and thankfully I stuck with it and got the gains I have now\n\nI'm considering whether to sell it for my gains or not",
        "created_utc": 1731358951.0,
        "subreddit_name": "wallstreetbets",
        "comments": 39
    }
]