[
    {
        "title": "JPMorgan Chase to pay record $920 million to resolve U.S. investigations into trading practices",
        "score": 2852,
        "url": "https://www.reddit.com/r/investing/comments/j235ft/jpmorgan_chase_to_pay_record_920_million_to/",
        "content": "Looks like a record fine for JPMorgan Chase who is accused of manipulating the precious metals and treasuries markets. \n\n\n\"The order finds that, from at least 2008 through 2016, JPM, through numerous traders on its precious metals and Treasuries trading desks, including the heads of both desks, placed hundreds of thousands of orders to buy or sell certain gold, silver, platinum, palladium, Treasury note, and Treasury bond futures contracts with the intent to cancel those orders prior to execution. Through these spoof orders, the traders intentionally sent false signals of supply or demand designed to deceive market participants into executing against other orders they wanted filled. According to the order, in many instances, JPM traders acted with the intent to manipulate market prices and ultimately did cause artificial prices.\"\n\nSources:\n\nhttps://www.cftc.gov/PressRoom/PressReleases/8260-20\n\nhttps://www.cnbc.com/2020/09/29/jpmorgan-chase-to-pay-920-million-to-resolve-us-investigations-into-trading-practices-.html",
        "created_utc": 1601398382.0,
        "subreddit_name": "investing",
        "comments": 258
    },
    {
        "title": "Investing in ETFs",
        "score": 2475,
        "url": "https://www.reddit.com/r/stocks/comments/j21rk1/investing_in_etfs/",
        "content": "A couple of weeks ago, I posted a comment in response to a question about ETFs. This question comes up very often; usually two or three times a week. Maybe more than that.  Several people suggested that it be \"pinned.\"  I obviously cannot do that, however if a mod wants to pin this, feel free to do so.  I did make a few modifications and additions to that comment and for those who haven't gone back to see the changes, I thought I'd post it again here.  Hopefully, this helps people who are interested in an investing approach that is either made up of ETFs or that includes ETFs as a part of their portfolio.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**QQQ** \\- This one uses the NASDAQ 100 as its benchmark. Obviously it's an Indexed, non-managed ETF. XTF used to rate this one as a perfect 10.0 out of 10 rating, but recently dropped it to 9.9 out of 10. It has one of the highest rates of return over the past 10 years of any ETF. It does tend to be tech-heavy, especially with the FAANG +M stocks. (Facebook, Apple, Amazon, Netflix, Google and Microsoft). Other top holdings include TSLA, NVDA and ADBE. (The rating dropped recently when the portfolio of the NASDAQ 100 was re-balanced).\n\n**VOO**/**SPY** \\- **VOO** and **SPY** are non-managed funds indexed to the S&P 500 Index. These funds are very popular on this subreddit, for good reason. They are well diversified, broad market funds investing in mostly US stocks. XTF rates these funds at 9.6 out of 10 because their return on investment over the long term is somewhat tempered by some of the blue chip stocks in the funds. But those stocks also help reduce volatility relative to some other ETFs. These are solid investments, but keep in mind that in the top 10 holdings there will be a lot of crossover between these funds and other broad market funds that hold US stocks like **QQQ**, **VTI**, **VGT**, **VOOG** and **SPYG**. There are differences, of course, as well, but you always want to know where those duplications exist.\n\n**IWF** \\- This is a Russell 1000 Growth fund. It is one of my favorites that doesn't get talked about much. It does have a lot of crossover with the other funds mentioned above, but the mix is slightly different. Other funds that use the Russell 1000 Growth Index include **RWGV** and **VONG**. I would describe this fund as more aggressive than **VOO/SPY**, less volatile than **QQQ**.  **VONE** and **IWB** use the Russell 1000 Index as their benchmark.  **SPYG** and **VOOG** use the S&P 500 Growth Index for their benchmark and would be similar (but not identical) to **IWF**, **VONG** and **RWGV**.\n\n**IWM** \\- for someone looking to diversify a little bit, this is a great fund to look into. This fund is a non-managed, indexed fund that uses the Russell 2000 index as its benchmark. The big difference between the Russell 2000 index and many of the the other indexes is that the Russell 2000 index looks at small and mid-cap companies, rather than large-cap companies. Thus, there is zero crossover between this one and the funds mentioned above. While this fund will move up and down with the market, it is often less volatile than the market overall. If you look at the charts, this fund has under-performed some of the other funds over the past few months while the market has been very volatile in an upward direction, but in a crash, this fund would probably outperform the rest of the market. It has a 9.0/10 XTF rating.\n\n**VXUS** \\- Vanguard Total International Index Fund ETF - top holdings include BABA, Tencent, Samsung, Taiwan Semiconductors, Novartis, Toyota. This is a broad market fund investing only in companies overseas. I'm not generally bullish on foreign markets, but this one is a very solid ETF with some companies that are likely to do extremely well for the foreseeable future. XTF rates this one a perfect 10.0 out of 10.\n\n**EEM** \\- iShares MSCI Emerging Markets ETF - This one is going to have a lot of crossover with **VXUS**. It is an Emerging Markets ETF with a lot of focus on China. It includes Alibaba, Tencent, [JD.com](https://jd.com/), along with companies like Samsung and Taiwan Semiconductors. This one should be a solid performer as long as our trade relations with China remain normal.\n\n**EFA** \\- This is another international ETF, but here the focus is mainly on more established companies in Europe and Japan. This is a Large Cap ETF that includes companies like Nestle SA, Roche, Toyota, Novartis and AstraZeneca.\n\n**S*****ector fund ETFs:***\n\n**ICLN**/**TAN/FAN** \\- These funds are clean/renewable energy ETFs. ICLN is more broad while TAN focuses more specifically on solar energy and FAN specifically on wind generated energy. I think renewable energy companies are the future. There is no crossover in the top holdings of this fund with the top holdings of QQQ and most of the other broad market funds. Also, these are global, not just US based companies. QCLN and PBW are also renewable energy funds, but they also contain a lot of TSLA, NIO and W.K. H.S. in their top holdings making them \"electric vehicle\" funds, as well. No problem if you want to add that, but you'll find a lot of Tesla in some of the funds mentioned above.\n\n**ARK** group of funds: **ARKG**, **ARKF**, **ARKK ARKW**, **ARKQ**, **PRNT** and **IZRL**. These are managed funds investing in companies that invest in disruptive companies in their respective industries. Most posters on this subreddit are bullish on these funds. They are aggressive growth ETFs, but should be considered somewhat risky and volatile.\n\n* **ARKG** \\- Genomic Revolution\n* **ARKF** \\- Fintech\n* **ARKK** \\- Disruptive Companies (broader market)\n* **ARKW** \\- Internet/computer/technology (Telsa is a top holding)\n* **ARKQ** \\- Robotics and artificial intelligence\n* **PRNT** \\- 3D printing technology\n* **IZRL** \\- disruptive companies based in Israel\n\n**XL series of funds**. Similar to the ARK series, these tend to be more aggressive growth funds, however these are passively managed indexed funds with various benchmarks that usually are overloaded in the better companies within a sector:\n\n* **XLV** \\- Health Care\n* **XLK** \\- Technology\n* **XLY** \\- Consumer Discretionary\n* **XLF** \\- Financial\n* **XLU** \\- Utilities\n* **XLE** \\- Energy\n* **XLB** \\- Materials\n* **XLC** \\- Communications\n* **XLG** \\- S&P Top 50\n* **XLI** \\- Industrial\n* **XLP** \\- Consumer Staples\n* **XLRE** \\- Real Estate\n\n**CLOUD COMPUTING:** **WCLD**, **SKYY**, **CLOU**, **BUG** and **XIKT**. Of these **WCLD** has the best 52 week performance. Top holdings in **WCLD** include **ZM**, **PLAN**, **CRM**, **CRWD**, **ZEN**, **WDAY**, **TENB**, **PCTY**, **DDOG**, **BL**. Many of these are likely to also appear in **QQQ**, however, they would be in very small percentages as the Cap on these companies is much smaller.\n\n**Aerospace and Defense:** XAR, ITA, PPA\n\n**Real Estate:**  VNQ, FREL, SCHH, IYR, PSR, BBRE\n\n**Transportation:**  FTXR, XTN, IYT, RGI, JETS\n\n**Oil/Energy:** IYE, FENY, VDE\n\n**Consumer Staples:** FSTA, VDC, IECS\n\n**Media/Entertainment:** IEME, PBS, PEJ, IYC\n\n**Robotics, AI, Innovative Technologies:**  THNQ, ROBO, XITK, SKYY, GDAT\n\n**Semiconductors:**  SOXX, QTEC, QTUM, SMH, FTXL\n\n**IT:** FTEC, VGT, IWY, IGM, FDN\n\n**Cyber Security:** HACK, CIBR, IHAK, BUG, FITE\n\n**Consumer Discretionary:**  FDIS, VCR, IEDI, JHMC, IYC\n\n**5G, Connectivity:** FIVG, NXTG, WUGI\n\n**Self Driving EV:** IDRV, DRIV, MOTO\n\n**Gaming/Esports:**  NERD, HERO, ESPO, GAMR, SOCL\n\n**Casinos/Gambling:**  BETZ, BJK\n\n**Online Retail:**  IBUY, EBIZ, ONLN, CLIX, GBUY, BUYZ\n\n**Utilities:** IDU, VPU, FUTY, RYU\n\n**Health Care:** FHLC, VHT, IYH\n\n**Medical Devices and Equipment:**  IHI, IEHS, XHE\n\n&#x200B;\n\n**Other Unique ETFs, non-sector based:**\n\n**CHGX:**  US Large Cap Fossil Fuel Free ETF\n\n**VIRS:**  Biothreat Strategy ETF\n\n&#x200B;\n\n&#x200B;\n\n***A nice portfolio might look something like this:***\n\n**20% -** Broad market US fund such as QQQ, VOO or IWF\n\n**20%** \\- VXUS - International\n\n**20%** \\- IWM - Small/Mid-cap broad market fund\n\n**10%** each in four sector funds of your choice\n\n*I'm not a financial expert or advisor and this is not financial advice, just an opinion from a random internet person. I do own shares in several, but not all of the funds listed above, including QQQ, IWF, some ARK funds, ICLN, VXUS, etc.*\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Edit**: In one of my previous edits, I accidentally erased a bunch of the sector funds.  Please feel free to comment with your favorite sector funds and let me know if I forgot to add back some that I had before.",
        "created_utc": 1601394366.0,
        "subreddit_name": "stocks",
        "comments": 293
    }
]