[
    {
        "title": "Apple reportedly releasing iOS 18.1 with Apple Intelligence features on October 28",
        "score": 3630,
        "url": "https://9to5mac.com/2024/10/06/apple-intelligence-ios-18-1-release-date/",
        "content": "",
        "created_utc": 1728217521.0,
        "subreddit_name": "apple",
        "comments": 503
    },
    {
        "title": "Apple Slowly Moves Away From Its Annual Product Release Strategy",
        "score": 2008,
        "url": "https://www.bloomberg.com/news/newsletters/2024-10-06/when-will-apple-intelligence-be-released-when-is-apple-releasing-m4-macs-ipad-m1xksx7q",
        "content": "",
        "created_utc": 1728218781.0,
        "subreddit_name": "apple",
        "comments": 228
    },
    {
        "title": "New unboxing video allegedly reveals unannounced M4 MacBook Pro, benchmark results",
        "score": 1081,
        "url": "https://9to5mac.com/2024/10/06/m4-macbook-pro-unboxing-benchmarks/",
        "content": "Single-core score: 3864\n\nMulti-core score: 15288",
        "created_utc": 1728256703.0,
        "subreddit_name": "apple",
        "comments": 279
    },
    {
        "title": "Gurman: New M4 Macs and iPad mini 7 to launch on November 1",
        "score": 891,
        "url": "https://9to5mac.com/2024/10/06/m4-macs-release-date-ipad-mini/?utm_source=dlvr.it&utm_medium=mastodon",
        "content": "",
        "created_utc": 1728217083.0,
        "subreddit_name": "apple",
        "comments": 249
    },
    {
        "title": "My basic philosophy for day trading",
        "score": 117,
        "url": "https://www.reddit.com/r/Daytrading/comments/1fxks93/my_basic_philosophy_for_day_trading/",
        "content": "I'm a day trader, and I only trade options.  Whatever ticker I'm looking at trading, I have three charts pulled up that I'm viewing.  I use the daily, hourly, and 5-minute charts.  I use the 5, 10, 20, 50, 100, 150, & and 200-day moving averages and simple moving averages.  I also use bollinger bands with a two standard deviation.\n\nImo the 50-day moving average is the most important.  In general, if a stock is above the 50-day, it's bullish, and if it's below the 50-day, it's bearish.  The more it builds above or below the 50-day, the more likely it will continue in that direction.\n\nI first look at the daily chart, viewing the high and low of the previous day.  A stock can not go higher if it doesn't take out the previous day's high, and it can not go lower if it doesn't take out the previous day's low.  If it does, neither then it's an inside day and will trade up/down in the previous day's channel.  The daily chart provides me with my initial levels.\n\n\n\n\nAfter that, I look at the hourly chart to have a clearer picture of the levels for the day.  Using the MA, SMA, and BBs I mentioned. I'm able to see where the support and resistance are in the hourly time frame.  I use the hourly because it provides me with stronger levels and only changes each hour.  If a stock starts moving above or below a strong support/resistance, then I know where the price is most likely to go.  Finally, I watch the 5-minute chart to see where the short-term support and resistance are.  One of the most important things is to know these levels and also know your risk.  I don't put on a trade every day, but I do watch the charts and look for the best setups with the highest probability for a larger move is at.  When I go into a trade, I expect to make money.  It doesn't if the price action is up or down, I'm not a bull or a bear.  I'm a trader, and I'm only concerned with making money.  I usually take at least ten contracts.  When a trade goes in my favor, I start securing profit based on the level I expect it to go to, and I'll keep some runners in case it continues in my direction.  If a trade goes against me, I will cut it for a small loss.  Before I enter a trade, I know where I want to start taking profit, and I also know how much risk I'm willing to take if it doesn't go my way.\n\nTrading isn't easy, and nothing is guaranteed, so I secure profit and cut losses quickly.\n\nI keep a close eye on the QQQ, futures, and the market as a whole.  I only trade a few tickers in general.  Since I'm an options trader, my preference is to trade beta names with high liquidity.  I don't want extreme volatility, I want orderly movement within the levels I'm viewing.  I have lost a lot of money in the past, and I've learned that in order to have success, you need to put in the hard work that's required to have success.  I quit being stubborn, I'm not a bull or bear, I'm a trader.  I could care less what a stock is going to do next week.  I'm willing to flip on a dime if the charts tell me to. \n\n\n\n\n\n\n\n\n\n\nI'm a day trader, and I like to use a simplistic approach that gives me consistent gains.  I only trade mega cap stocks.  For me, I find that learning how these stocks trade helps me to identify the personality of this group.  I'm familiar with them and how they generally trade.  I look for quality setups with the highest measured potential.  I have some basic rules that I use.\n\n1 - Patience \nYou don't have to trade just because the market is open.  If there aren’t any quality setups, I don't trade.  The market is going anywhere.  \n\n2 - Less is more\nYou only need one.  By finding the best quality setup with the best measured potential, I do better than trading multiple subpar setups.\n\n3 - Secure profit and minimize loss\nBefore I put on a trade, I have a plan.  I know the measured potential, and I take profits along the way.  I'll leave a percentage on when a trade goes in my favor, but there's no guarantee it will reach that potential.  I also know my max pain. If a trade goes against me, I get out.  \n\n4 - Forever a student \nThere's no one size fits all in trading.  What works for me might not work for you, and that's OK.  Find a style of trading that resonates with you.  There are many styles of trading. Whatever style suits you best, learn that style and continue to develop your skills.  The market will throw you many curve balls along the way.  You need to be able to adapt accordingly and know what type of environment you're trading in.  I highly recommend having an experienced mentor with a proven track record.  Trading is a lot easier when you have a great mentor.\n\n5 - Acceptance \nA good trader is not someone who is always right.  I mess up trades. Everyone does.  When my thesis plays out, I pay myself along the way. Being greedy is costly.  When my thesis is wrong, I get out quickly and minimize my losses.  If I am having a bad day, I accept it, and I evaluate what I could have done differently.  If I feel uncomfortable trading for whatever reason, I don't trade.  If I miss my entry, I don't trade.  On any given day, I'm looking at a few different tickers, and I take a trade that has the best-looking measured potential.  Sometimes, the trade only gives me a small profit or small loss, and I miss one of the other trades that I was looking at, and it really runs, and I miss the better trade.  Oh well, it happens, and I accept it.  They'll always be another day.  I hope sharing my basic trading philosophy is helpful.  I encourage everyone to continue to learn.  What works for me may not work for you, but it's very important to have a process, and there's always room for improvement.\n\nI wish everyone the best",
        "created_utc": 1728232988.0,
        "subreddit_name": "DayTrading",
        "comments": 34
    }
]