[
    {
        "title": "Anyone else think the dip on semiconductors will be a once in a decade opportunity to build wealth?",
        "score": 1763,
        "url": "https://www.reddit.com/r/stocks/comments/sqvm4k/anyone_else_think_the_dip_on_semiconductors_will/",
        "content": "Two major catalysts playing out for semis right now:\n\n* Fed raising rates.\n* Russia sanctions and possible invasion [cutting off key semiconductor materials](https://www.reuters.com/technology/white-house-tells-chip-industry-brace-russian-supply-disruptions-2022-02-11/).\n\nIn the next few months, these will play out and really pummel the semi stocks. But the good news is these are temporary events. After 1-2 years, we'll find a way around Russian chokehold on these key materials, and inflation will probably be slowed. While that's happening, covid is still subsiding and innovation continue it's relentless march of driving productivity forward.\n\nTo be clear, **I'm not saying to buy the dip right now.** But I'm tempted to start a \"eat ramen\", \"get a third job\", \"cancel Netflix\" regime for myself to start preparing as much as possible to start buying mid or later this year.\n\nThese semi stocks are becoming the new FANGS, and this upcoming dip this year might be the best chance to buy them before they rocket into FANG status.\n\nOK here's the cons in my theory:\n\n* China could still be a ticking time bomb. Most experts say their lockdown strategy is not viable for Omicron. Could be their supply chain is a lot more broken than we realize. Plus that real estate problem is still ongoing and their president is kinda insane.\n\n* The Fed could freak out and raise rates too quickly, putting us into a recession.\n\n* Some industry reports say oversupply of semiconductors could happen as early as 2023.\n\n(Disclosure not investment advice and I'm long on NVDA AMD QCOMM MRVL TSM and maybe Int)",
        "created_utc": 1644684312.0,
        "subreddit_name": "stocks",
        "comments": 621
    },
    {
        "title": "MoviePass will track people’s eyes through their phone’s cameras to make sure they don’t look away from ads.",
        "score": 39239,
        "url": "https://www.independent.co.uk/tech/moviepass-track-eyes-phone-cameras-b2013273.html",
        "content": "",
        "created_utc": 1644681889.0,
        "subreddit_name": "technology",
        "comments": 3803
    }
]