[
    {
        "title": "Big drop last week in the Volatility index 🫣",
        "score": 53,
        "url": "https://www.reddit.com/r/investing/comments/1bxwkzi/big_drop_last_week_in_the_volatility_index/",
        "content": "With the VIX up 21% since January and roughly 17% just in the past week, how concerned are you?\n\nIran and Russia tensions, U.S. election drama, maybe some stock market froth, the VIX/oil jumping a lot this year, Tesla and Apple unable to hold gains, etc…all a bit unnerving to say the least. The S&P500 index and others seem to be stalled also. ",
        "created_utc": 1712467648.0,
        "subreddit_name": "investing",
        "comments": 79
    },
    {
        "title": "Apple Is Rebooting Its Search for a New Next Big Thing",
        "score": 1646,
        "url": "https://www.bloomberg.com/news/newsletters/2024-04-07/apple-aapl-future-products-could-include-robots-and-smart-home-push-lupinmna",
        "content": "",
        "created_utc": 1712494016.0,
        "subreddit_name": "apple",
        "comments": 729
    },
    {
        "title": "iOS Emulator Delta receives Apple approval to be released on AltStore",
        "score": 1293,
        "url": "https://mastodon.social/@rileytestut/112230643639698085",
        "content": "Assuming rules are the same for both third party stores and the AppStore, this confirms community emulators can be published",
        "created_utc": 1712523375.0,
        "subreddit_name": "apple",
        "comments": 290
    },
    {
        "title": "134 S&P 500 index stocks that have beaten the S&P 500 index",
        "score": 547,
        "url": "https://www.reddit.com/r/stocks/comments/1byeabm/134_sp_500_index_stocks_that_have_beaten_the_sp/",
        "content": "I wanted to identify stocks that are in the Standard & Poor's 500 (S&P 500) index whose total return (with dividends reinvested) has beaten the S&P 500 index either since 1993 or since the stock's IPO (Initial Public Offering) if it was after 1993. I used the ETF (Exchange Traded Fund) SPY as my benchmark for the S&P 500 index because the web site I used to make comparisons [https://totalrealreturns.com/n/SPY](https://totalrealreturns.com/n/SPY) needed an S&P 500 index ETF for comparison, and since SPY - which started in 1993 - is the oldest S&P 500 index, I used SPY and that's why the cutoff is 1993.\n\nI used a stock screener to make a first pass filter, looking for the following criteria:\n\n* Included in the S&P 500 index. This limited the cohort to large. profitable US companies that meet the requirements to be included in the S&P 500 index [https://corporatefinanceinstitute.com/resources/equities/sp-500-index/](https://corporatefinanceinstitute.com/resources/equities/sp-500-index/) S&P 500 stocks are available as fractional shares at my brokerage Charles Schwab and at other major brokerages.\n*  Pays a dividend and has a non-negative 3 year dividend Compound Annual Growth Rate (CAGR). Companies that pay a dividend - and particularly companies that initiated paying a dividend or have been increasing their dividend - have outperformed the S&P 500 index and experienced the highest returns relative to other stocks since 1973—with significantly less volatility.  [https://www.hartfordfunds.com/insights/market-perspectives/equity/the-power-of-dividends.html](https://www.hartfordfunds.com/insights/market-perspectives/equity/the-power-of-dividends.html)\n* 5 year total return (with dividends reinvested) close to or better than the 5 year total return of the S&P 500 index. This was to help narrow down the cohort to stocks that have continued good performance in recent years, and to exclude stocks that perhaps were outperforming the S&P 500 many years ago but have been lagging the past 5 years. The 5 year total return of the S&P 500 the past 5 years is +94.69% so I used a minimum of +90% 5 year total return as a cutoff.\n\nI then compared the total return (with dividends reinvested) of the filtered stocks and eliminated any that had a total return less than that of the S&P 500 since 1993, or since the stock's IPO if it was after 1993. Each stock was compared head-to-head against the S&P 500 index (SPY) during equal time frames. For example, this is the comparison of SPY vs MSFT [https://totalrealreturns.com/n/SPY,MSFT](https://totalrealreturns.com/n/SPY,MSFT) which had its IPO in 1986, and the comparison of SPY vs NVDA [https://totalrealreturns.com/n/SPY,NVDA](https://totalrealreturns.com/n/SPY,NVDA) which had its IPO in 1999.\n\nI made a spreadsheet of the 134 stocks that meet the criteria. I did this at the end of last month so the results are current as of the end of March 2024. The spreadsheet has the following columns:\n\n* Symbol: self explanatory\n* Company: self explanatory\n* Total Return: the total return (with dividends reinvested) of the stock since 1993, or since the stock's  IPO if it was after 1993\n* S&P 500 TR: the total return of the S&P 500 index (with dividends reinvested) during the exact same time frame displayed for the total return of the stock being compared to the S&P 500 index\n* Ratio: the total return of the stock divided by the total return of the S&P 500 index during the same time frame. A Ratio of 2 means the stock had 2x the total return of the S&P 500 index during the same time period. A Ratio of 10 means the stock had 10x the total return of the S&P 500 index during the same time period, and so on. Even a Ratio of 2 is significant because it means the stock had double the total return of the S&P 500 index during the same time period.\n* 5 Yr Total Return: the total return of the stock the past 5 years. For comparison, the total return of the S&P 500 the past 5 years is +94.69%\n* 3 Yr Div Growth Rate: the 3 year dividend Compound Annual Growth Rate (CAGR) of the stock.  The Compound Annual Growth Rate (CAGR) represents the year over year rate at which dividends would have grown annually if they had grown at a steady rate over the time period. Steady dividend growth - growth in dividend per share, *not* the dividend yield - is associated with company vitality and is a positive. If a stock has not been paying dividends for at least 3 years the value is blank, but that isn't a negative because it means the stock recently initiated paying a dividend, and that is associated with outperformance. [https://www.hartfordfunds.com/insights/market-perspectives/equity/the-power-of-dividends/\\_jcr\\_content/root/readmore/readmoreresponsivegrid/mainfullgrid\\_1524872/mainFull\\_container/highlighter\\_copy\\_cop/highlighter\\_container/image.coreimg.80.1280.png/1711374546518/wp106-8.png](https://www.hartfordfunds.com/insights/market-perspectives/equity/the-power-of-dividends/_jcr_content/root/readmore/readmoreresponsivegrid/mainfullgrid_1524872/mainFull_container/highlighter_copy_cop/highlighter_container/image.coreimg.80.1280.png/1711374546518/wp106-8.png)\n* Dividend Yield: the current annual dividend yield\n\nThe spreadsheet can be sorted by each column to find the highest or lowest values in each column. I colored the highest values in each column in varying shades of green. The darker the shade of green the higher the value range. I did not use rigid criteria for coloring different value ranges, but looked for natural separation points or certain arbitrary values, such as >3 or >200%, etc.\n\nLooking for stocks that are some shade of green in the Ratio AND 5 Yr Total Return AND 3 Yr Div Growth Rate columns can help identify strong performers. For example, familiar stocks like AVGO, AMAT, MSFT, and LLY are green in three columns, but so are lesser known stocks like KLAC, MPWR, PCAR and others.\n\nThe spreadsheet:\n\n[https://docs.google.com/spreadsheets/d/1Hh20ZoGg9mOamnSMZcdlOWjSIS9ppthhOI-mgQxe\\_pA/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1Hh20ZoGg9mOamnSMZcdlOWjSIS9ppthhOI-mgQxe_pA/edit?usp=sharing)\n\nYes, past performance is not a *guarantee* of future results, but a stock that has a documented track record of beating the S&P 500 index over an extended period of time is more likely to continue doing so than a stock that has been unable to beat the S&P 500 index over an extended period of time.\n\nI hope this is helpful to people, especially young people looking to explore the universe of individual stocks that exists beyond ETFs.",
        "created_utc": 1712521305.0,
        "subreddit_name": "stocks",
        "comments": 85
    }
]