[
    {
        "title": "Earnings plays (Part 1) - 10/28-11/01",
        "score": 65,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gdnojx/earnings_plays_part_1_10281101/",
        "content": "Fellow regards,\n\nNext week is one of the busiest earnings weeks for this year with >150 S&P 500 companies reporting Q3 earnings. It's also time for making the biggest plays to get that elusive 5-20x returns!\n\nNow the important question is which ones to play to make money and limit losses? I did some research/TA and found few interesting plays which are worth looking into. All my plays are based on TA/past earnings insights. My goal is to keep most of the plays with $200-$500 (exceptions big tech), so that even if I am wrong, I am not busting my entire account on couple of plays. \n\nThis is part 1 of the series focusing on earnings of 10/28 and 10/29 (bmo). \n\nOf course, do your own research and don't blindly follow any regard like me online. I work in Wendy's and eat crayons for dinner.\n\n**1. VFC**: Another regard did an entire post on this company, so I won't go into details. Based on its chart, I am bearish to neutral on it. It has recently broken its uptrend and is now heading for gap fill at $14. So this is my plan:\n\n* Buy 2 15p Nov15, 2024: $100 \n* If you want to hedge and save your dick in this pumps, buy 20c Dec20, 2024: $50 \n* **Expected profit: $200/200%** (excl. hedge)\n\n[VFC has broken the uptrend and looks good for $14 gap fill](https://preview.redd.it/eua4kpqf8dxd1.png?width=1906&format=png&auto=webp&s=5d1ca94e55b0c6b093518cc464bb360625ef77ba)\n\n**2. PYPL:** One of WSB old favorites!! This has been on a strong upward run since end of July with \\~40% up. However, the chart looks overextended in short term with 50 SMA close to 75 and gap fill around \\~74. Also showing bearish divergence with RSI trending lower and price going up! I am bearish on it for the short term.\n\nHere's my plan:\n\n* Buy 70p Dec20, 2024: $110 (buying more time in case this goes up for short term but turns down after election)\n* To hedge, buy 100c Dec20, 2024: $70 \n* **Expected returns: $122/112%** (excl. hedge)\n\n[Pypl gap fill at $74 ](https://preview.redd.it/ewi5ylohkdxd1.png?width=1899&format=png&auto=webp&s=81fceffa17008fa1842c12b2c2b09c05b2e7d0ec)\n\n**3. RCL:** Royal Caribbean is a monster stock and money printer for the last few years. Unlike CCL and NCLH, this is one of the best cruise stock to own. While I like this company, it's setup is very similar to PYPL. Overextended on the short term, bearish divergence on RSI, gap fill at $185. I am bearish on it for the short term.\n\nHere's my plan:\n\n* Buy 180p Nov15, 2024: $170 \n* To hedge, buy 220c Nov1, 2024: $75 \n* **Expected profit: $284/171%** (excl. hedge)\n\n[RCL gap fill at $184](https://preview.redd.it/si10wtbapdxd1.png?width=1900&format=png&auto=webp&s=b902040d2d3ee469918ee04035e6ceab89757b70)\n\nI will be posting my positions in comments on Monday morning when I buy these options. Posting it earlier for all of you to make more tendies! I chose at least 2 weeks expiry for all my plays, you can make far more (or lose more) if you gamble weeklies!!\n\nTLDR: **VFC, PYPL, RCL go down, buy puts!🚀🚀🚀🚀**\n\n",
        "created_utc": 1730069898.0,
        "subreddit_name": "wallstreetbets",
        "comments": 27
    }
]