[
    {
        "title": "I don't even know how to title this, typing from the floor. We raised $27,355 yesterday. *TWENTY SEVEN THOUSAND DOLLARS*. They told me that's the largest single day fundraiser IN THEIR HISTORY. Thank you so so so so so much, the Reddit Apple community is beyond incredible at saving animals. 🐶🐱🐰",
        "score": 7231,
        "url": "https://www.reddit.com/r/apple/comments/cg11x7/i_dont_even_know_how_to_title_this_typing_from/",
        "content": "I legitimately have no idea how to start this and I refreshed the page a few different times over the course of 10 minutes to make sure I was seeing the right number.\n\nI make a free Reddit app for iOS called [Apollo for Reddit](https://itunes.apple.com/app/id979274575), and yesterday you might have saw I [posted a little fundraiser here](https://www.reddit.com/r/apple/comments/cfmlca/i_build_the_apollo_reddit_app_and_im_donating_100/) in the Apple subreddit basically stating all the proceeds for the day from Apollo (it's free but has in-app purchases for some cool extra Pro/Ultra features) will go to the my local SPCA animal shelter in Nova Scotia. It's definitely the hardest time of the year for them right now, because cats give birth in tremendous numbers in these warm months (dubbed Kitten Season) which creates a massive influx of orphaned and abandoned kitties, and shelters are seriously strained and need all the help they can get.\n\nI was hoping to do some good for the shelter, but legitimately in my wildest dreams I did not expect so many people to come out and give support, I'm truly unable to form cohesive thoughts right now. They are legitimately such great people at that shelter, just for one example we recently had a cat in the community who was found badly abused and they looked after her, helped her with her bad leg (it ended up requiring an amputation) and [now Phoebe got adopted into a loving home](https://www.cbc.ca/news/canada/nova-scotia/phoebe-cape-breton-cat-shot-adoption-1.5201865). Like that's just one example.\n\nI also got my two cats Ruby and Hugo from there. Here's Ruby spinning in circles in delight when I told her: https://i.imgur.com/QWyckgy.gifv and here's Hugo somewhat annoyed I woke him up to tell him but undoubtedly stoked inside: https://i.imgur.com/S5ztw0T.gifv\n\nHere's a tally of the donations. It came mostly from proceeds for the day but also was helped immensely by people commenting ($0.10 per comment on the Apple thread, and [I also did an AMA](https://www.reddit.com/r/IAmA/comments/cfnfu8/my_names_christian_selig_i_used_to_work_at_apple/)) and retweeting, as well as awesome PayPal and crypto donations. It's easiest to show the breakdown/proof with a pic: \n\nPic: https://i.imgur.com/YLjn7da.png\n\nI'm working with them to get the money over to them ASAP. I was legitimately not expecting to hit anywhere near this much, so I thought my credit cards would do but I don't have a limit high enough to pay this much in one go, so I sent over $16,000, which is all my cards could handle, and I promise I'll get the rest over as soon as I can figure that out (SPCA said it was totally okay, and Apple doesn't pay until the following month, so it's not as if I have the money right now). Proof of $16K (we're over half way there): https://i.imgur.com/vTcijTn.png\n\n(And before anyone asks, as much as I wish it was, this is extraordinarily far far far far more than Apollo makes on a normal day obviously.)\n\nLike this is absolutely nuts, I actually can't believe or wrap my head around that we raised this much money. We actually broke records. Like seriously, here's the most recent (2017) [document I could find on their donors](http://www.novascotiaspca.ca/wp-content/uploads/2018/08/ANNUAL-REPORT-2017.pdf). Walmart donated $2,000 - $5,000 (which is amazing). Not that it's a competition (every donor is a hero), but we did 5-10x more than WALMART for reference! How are we that awesome. I talked to them this morning and they said they were crying.\n\nYou have made my week, month, year, everything with this generosity. If you got Apollo Pro or Ultra yesterday I genuinely hope you love it and I'll continue to work my tail off to create the best Reddit app possible for all of you. Thank you so much again.\n\n\\- Christian",
        "created_utc": 1563727508.0,
        "subreddit_name": "apple",
        "comments": 264
    }
]