[
    {
        "title": "Nvidia passes Alphabet in market cap, now the third most valuable U.S. company",
        "score": 2712,
        "url": "https://www.reddit.com/r/stocks/comments/1ar26eu/nvidia_passes_alphabet_in_market_cap_now_the/",
        "content": "Nvidia surpassed Google parent Alphabet in market capitalization on Wednesday. It’s the latest example of how the artificial intelligence boom has sent the chipmaker’s stock soaring.\n\nNvidia rose over 2% to close at $739.00 per share, giving it a market value of $1.83 trillion to Google’s $1.82 trillion market cap. The move comes one day after Nvidia surpassed Amazon in terms of market value.\n\nThe symbolic milestone is more confirmation that Nvidia has become a Wall Street darling on the back of elevated AI chip sales, valued even more highly than some of the large software companies and cloud providers that develop and integrate AI technology into their products.\n\nNvidia shares are up over 221% over the past 12 months on robust demand for its AI server chips that can cost more than $20,000 each. Companies like Google and Amazon need thousands of them for their cloud services. Before the recent AI boom, Nvidia was best known for consumer graphics processors it sold to PC makers to build gaming computers, a less lucrative market.\n\nGoogle was largely expected to benefit from AI, especially since employees at the company pioneered many of the techniques — such as transformer architecture — used in cutting-edge models like ChatGPT.\n\nGoogle shares are still up 55% in the past 12 months, though the company has grappled with layoffs and culture issues after it declared a “code red” situation to build AI services into its products. Google announced a $20 per month AI subscription called Gemini Advanced earlier this week, one of its first paid generative AI products.\n\nNvidia is now the third largest U.S. company, only behind Apple and Microsoft. Nvidia reports quarterly earnings on Feb. 21. Analysts expect 118% annual growth in sales to $59.04 billion.\n\nSource: https://www.cnbc.com/2024/02/14/nvidia-passes-alphabet-market-cap-now-third-most-valuable-us-firm.html",
        "created_utc": 1707956054.0,
        "subreddit_name": "stocks",
        "comments": 499
    },
    {
        "title": "Blackrock Vs Vanguard investment funds. Who owns the underlying companies. ",
        "score": 41,
        "url": "https://www.reddit.com/r/investing/comments/1arkuv9/blackrock_vs_vanguard_investment_funds_who_owns/",
        "content": "I just learned this myself, a bit embarrassingly late, that vanguard is owned by it's investors. So in that case, if I invested in a vanguard fund, then I should also be the partial owner in the company in relation to my percentage ownership of the fund? Eg, if the fund owns 100 shares of apple, and I own 1 percent of the fund, then I own 1 share of apple. Of course in reality the ownership stake would be negligible. \n\nIs this actually true? And do we not get voting rights in each underlying company due to just how many there are and how insane it would be to tally every single investors vote for every single company, in say the SP500. Or is it because we only own a partial stake in vanguard and it means nothing for the underlying companies they invest in? If someone had a larger, majority stake in a vanguard fund, would they have voting rights, or am I missing something?\n\nNext question is about BlackRock. It's a public company. So if I invest in a BlackRock fund, who is the owner partially, of the underlying companies? Is it me indirectly through my stake in the fund, while the shareholders in BlackRock profit from the money BlackRock earns through charging me fees. Or is it the shareholders who own BlackRock and then BlackRock invests in companies with the money provided by investors?",
        "created_utc": 1708018040.0,
        "subreddit_name": "investing",
        "comments": 33
    },
    {
        "title": "First ever iOS trojan discovered — and it’s stealing Face ID data to break into bank accounts",
        "score": 5363,
        "url": "https://www.tomsguide.com/computing/malware-adware/first-ever-ios-trojan-discovered-and-its-stealing-face-id-data-to-break-into-bank-accounts",
        "content": "",
        "created_utc": 1708024714.0,
        "subreddit_name": "technology",
        "comments": 259
    }
]