[
    {
        "title": "Nvidia briefly passes $3 trillion market cap on back of AI boom ",
        "score": 1233,
        "url": "https://www.reddit.com/r/stocks/comments/1d8y4gs/nvidia_briefly_passes_3_trillion_market_cap_on/",
        "content": "Nvidia surpassed $3 trillion in market cap during intraday trading on Wednesday as investors continue to clamor for the company making most of the chips powering the AI boom.\n\nNvidia shares were up more than 4% to $1,219 at one point during intraday trading on Wednesday.\n\nNvidia’s milestone is the latest stunning mark in a run where the stock price has gone parabolic as investors bet on artificial intelligence. Shares are up over 3,224% over the last five years. It will split its stock 10-1 later this month.\n\nApple was the first U.S. company to reach a $3 trillion market cap in January 2022. Microsoft hit $3 trillion in market value in January 2024.\n\nIn May, Nvidia reported first-quarter earnings that suggested demand for the company’s pricey and powerful AI chips, often called GPUs, showed no sign of slowing down. Nvidia reported overall sales of $26 billion, more than triple what the company reported a year ago. Nvidia also beat Wall Street expectations for sales and earnings and said it would report revenue of about $28 billion in the current quarter.\n\nNvidia shares have surged in recent years, powered by the tech industry’s need for its chips, which are used to develop and deploy big artificial intelligence models like the one at the heart of OpenAI’s ChatGPT.\n\nCompanies such as Google, Microsoft, Meta, Amazon and OpenAI are buying billions of dollars of Nvidia’s graphics processing units.\n\nSource: https://www.cnbc.com/2024/06/05/nvidia-briefly-passes-3-trillion-market-cap-on-back-of-ai-boom.html",
        "created_utc": 1717614687.0,
        "subreddit_name": "stocks",
        "comments": 344
    },
    {
        "title": "NVDA's market cap surpasses AAPL's market cap for the first time.",
        "score": 2652,
        "url": "https://i.redd.it/dxwwwg9sys4d1.png",
        "content": "",
        "created_utc": 1717614855.0,
        "subreddit_name": "wallstreetbets",
        "comments": 284
    },
    {
        "title": "Nvidia briefly passes Apple as second most valuable public U.S. company",
        "score": 576,
        "url": "https://www.reddit.com/r/investing/comments/1d8zcp3/nvidia_briefly_passes_apple_as_second_most/",
        "content": "[https://www.cnbc.com/2024/06/05/nvidia-passes-apple-in-market-cap.html](https://www.cnbc.com/2024/06/05/nvidia-passes-apple-in-market-cap.html)\n\n[Nvidia](https://www.cnbc.com/quotes/NVDA/) briefly passed [Apple](https://www.cnbc.com/quotes/AAPL/) in market cap on Wednesday during intraday trading as the chipmaker emerges as the primary beneficiary of the [artificial intelligence](https://www.cnbc.com/ai-artificial-intelligence/) boom. If it holds until the close, it will be the second most valuable U.S. company.\n\nNvidia hit a [$3 trillion market cap](https://www.cnbc.com/2024/06/05/nvidia-briefly-passes-3-trillion-market-cap-on-back-of-ai-boom.html) milestone during intraday trading. Nvidia had a market value of $3.007 trillion at one point, versus Apple’s, which stood at $3.005 trillion.\n\nNvidia shares have risen over 24% since the company [reported first-quarter earnings](https://www.cnbc.com/2024/05/22/nvidia-nvda-earnings-report-q1-2025-.html) in May and have been on a tear since last year. The company has an estimated 80% market share in AI chips for data centers, on which big tech companies spend billions.\n\nInvestors are also becoming more comfortable that Nvidia’s huge growth in sales to a handful of cloud companies can persist. For the most recent quarter, its data center business, which includes its GPU sales, rose 427% in a year to $22.6 billion in sales, about 86% of the company’s overall revenue.\n\nMeanwhile, Apple shares are only about 5% this year, as Apple’s sales growth has stalled in recent months. In its most recent quarterly earnings report, Apple said overall sales dropped 4% and iPhone sales fell 10% from the year-ago period. Apple faces strategic questions and issues about demand in China, manufacturing, and mixed reactions to its new virtual reality headset, Vision Pro.\n\nApple was the first company to reach $1 trillion and $2 trillion market caps. It has frequently been the most valuable U.S. company over the past few years but was again [passed by Microsoft](https://www.reuters.com/technology/microsoft-overtakes-apple-worlds-most-valuable-company-2024-01-11/) earlier this year. Microsoft has benefitted from the same investor demand for AI as Nvidia.\n\nNvidia’s stock has been more volatile than Apple. Founded in 1991, it was primarily a gaming company, selling hardware to play 3D computer games. More recently it has sold cryptocurrency mining chips and cloud subscription services.\n\nNvidia shares have gone parabolic as its AI business has developed, rising over 3,290% in the past five years. It announced a [10-1 stock split in May](https://www.cnbc.com/2024/05/22/nvidia-announces-10-for-1-stock-split.html).",
        "created_utc": 1717617690.0,
        "subreddit_name": "investing",
        "comments": 154
    }
]