[
    {
        "title": "Intel shares pop 12% on earnings beat, uplifting guidance",
        "score": 522,
        "url": "https://www.reddit.com/r/stocks/comments/1ggnzbb/intel_shares_pop_12_on_earnings_beat_uplifting/",
        "content": "Intel shares jumped 12% in extended trading on Thursday after the chipmaker reported better-than-expected revenue and issued quarterly guidance that topped expectations.\n\nHere’s how the company did in comparison with LSEG consensus:\n\n* **Earnings per share:** Loss of 46 cents adjusted\n* **Revenue:** $13.28 billion vs. $13.02 billion expected\n\nIntel’s revenue declined 6% year over year in the quarter, which ended on Sept. 28, according to a statement. The company registered a net loss of $16.99 billion, or $3.88 per share, compared with net earnings of $310 million, or 7 cents per share, in the same quarter a year ago.\n\nAs part of its cost reduction plan, Intel recognized $2.8 billion in restructuring charges during the quarter. There were also $15.9 billion in impairment charges.\n\nIntel has been mired in an extended slump due to market share losses in its core businesses and an inability to crack artificial intelligence. CEO Pat Gelsinger revealed plans during the quarter to turn the company’s foundry business into an independent subsidiary, a move that would enable outside funding options.\n\nCNBC reported that Intel had engaged advisors to defend itself against activist investors. In late September, news surfaced that Qualcomm reached out to Intel about a possible takeover.\n\nThe Client Computing Group that sells PC chips recorded $7.33 billion in revenue, down about 7% from a year earlier and below the $7.39 billion consensus among analysts surveyed by StreetAccount.\n\nRevenue from the Data Center and AI segment came to $3.35 billion, which was up about 9% and more than the $3.17 billion consensus from StreetAccount.\n\nIntel called for fiscal third-quarter adjusted earnings of 12 cents per share and revenue between $13.3 billion and $14.3 billion. Analysts had expected 8 cents in adjusted earnings per share and $13.66 billion in revenue.\n\nDuring the quarter, Intel announced the launch of Xeon 6 server processors and Gaudi artificial intelligence accelerators.\n\nAs of Thursday’s close, Intel shares were down about 57% in 2024, while the S&P 500 index had gained 20%.\n\nSource: [https://www.cnbc.com/2024/10/31/intel-intc-q3-earnings-report-2024.html](https://www.cnbc.com/2024/10/31/intel-intc-q3-earnings-report-2024.html)",
        "created_utc": 1730405816.0,
        "subreddit_name": "stocks",
        "comments": 192
    },
    {
        "title": "Alphabet Deserves A Better Valuation",
        "score": 334,
        "url": "https://www.reddit.com/r/stocks/comments/1ggjotg/alphabet_deserves_a_better_valuation/",
        "content": "**I had recommended Alphabet (GOOG)** [**as a great long-term buy at $150**](https://www.reddit.com/r/stocks/comments/1anr3id/alphabet_goog_150_looks_like_an_excellent_long/), several months ago.\n\nLast evening, Google knocked it out of the park with really stellar results. I bought more shares this morning, and am reiterating a Buy.\n\nI believe analysts’ consensus earnings could be a little conservative and Google should continue to beat estimates with better growth and operating margins.\n\nGoogle's earnings quality is better than several tech giants for the following reasons.\n\n* It has a near monopoly in Search\n* Market leadership in media with YouTube.\n* A strong first-mover advantage with Waymo.\n* A fast-growing Google Cloud business, third only to and catching up with Azure and AWS.\n\n**Its earnings and growth are sustainable, thus it deserves a better valuation and multiple.**\n\nLet's take a closer look at Q3 earnings.\n\nQ3 GAAP EPS came in at $2.12 per share, beating expectations of $1.85 per share $0.27, or 14% - **This was a substantial beat.**\n\nRevenue of $88.3Bn (+14.9% Y/Y) beat by $2.05B or 3%.\n\nConsolidated Alphabet revenues in Q3 2024 increased 15%, or 16% in constant currency, YoY to $88.3Bn reflecting strong momentum across the business.\n\nGoogle Services revenues increased 13% to $76.5 billion, led by strength across Google Search & other, Google subscriptions, platforms, and YouTube ads.\n\n**Total operating income increased 34% and operating margin percent jumped a huge 4.5% to 32%.**\n\nGoogle Cloud revenues grew a whopping 35% to $11.4Bn led by accelerated growth in Google Cloud Platform (GCP) across AI Infrastructure, Generative AI Solutions, and core GCP products, **with record operating margins of 17%** as the cost per AI query decreased by 90% over the past 18 months.\n\nCloud titans Amazon (AWS) and Microsoft (Azure) have commanded huge valuations for their cloud computing businesses; with Google Cloud growing at 35%, it should continue to narrow the gap over the next 5 years. Also importantly, AWS and Azure have operating margins over 30%, and should Google continue to scale and leverage their existing fixed costs, they can reach the same margins. I also believe as they get better at AI, they should be able to charge more.\n\nBased on consensus analysts’ estimates Alphabet’s EPS should grow to $11.60 in 2027 from $5.80 in 2023 - that’s an annual growth rate of 18%. Comparatively, Apple‘s estimated EPS growth through FY2027 is slower at 14%, and it sports a P/E of 33 compared to Google’s 22. Alphabet’s P/E is closer to the S&P 500’s P/E of 21!\n\nI believe this is too low, and there is a lot of potential for its stock to appreciate on the lower valuation.\n\nBesides the strong EPS, a lot of Google’s expenses are noncash depreciation and amortization and their cash flow margins are strong. They generated operating cash of $31Bn on $88Bn last quarter, or a 35% cash flow margin.\n\nThe antitrust regulation will remain a possible negative on Alphabet, but the final decision is still years away as Alphabet vigorously appeals the decision.\n\n**I recommend Alphabet as a buy at $176**",
        "created_utc": 1730394807.0,
        "subreddit_name": "stocks",
        "comments": 165
    },
    {
        "title": "Amazon Announces Q3 FY24 Earnings: Beats in Retails, Meets in AWS, Strong Guidance",
        "score": 313,
        "url": "https://www.reddit.com/r/stocks/comments/1ggnqgd/amazon_announces_q3_fy24_earnings_beats_in/",
        "content": "Amazon Earnings: https://www.businesswire.com/news/home/20241030305950/en/Amazon.com-Announces-Third-Quarter-Results\n\nSEATTLE--(BUSINESS WIRE)--Amazon.com, Inc. (NASDAQ:AMZN) today announced financial results for its third quarter ended September 30, 2024.\n\nNet sales increased 11% to $158.9 billion in the third quarter, compared with $143.1 billion in third quarter 2023. \n\nExcluding the $0.2 billion unfavorable impact from year-over-year changes in foreign exchange rates throughout the quarter, net sales increased 11% compared with third quarter 2023.\n\nNorth America segment sales increased 9% year-over-year to $95.5 billion.\n\nInternational segment sales increased 12% year-over-year to $35.9 billion.\n\nAWS segment sales increased 19% year-over-year to $27.5 billion.\n\nOperating income increased to $17.4 billion in the third quarter, compared with $11.2 billion in third quarter 2023.\n\nNorth America segment operating income was $5.7 billion, compared with operating income of $4.3 billion in third quarter 2023.\n\nInternational segment operating income was $1.3 billion, compared with an operating loss of $0.1 billion in third quarter 2023.\n\nAWS segment operating income was $10.4 billion, compared with operating income of $7.0 billion in third quarter 2023.\n\nNet income increased to $15.3 billion in the third quarter, or $1.43 per diluted share, compared with $9.9 billion, or $0.94 per diluted share, in third quarter 2023.\n\nOperating cash flow increased 57% to $112.7 billion for the trailing twelve months, compared with $71.7 billion for the trailing twelve months ended September 30, 2023.\n\nFree cash flow increased to $47.7 billion for the trailing twelve months, compared with $21.4 billion for the trailing twelve months ended September 30, 2023.\n\nFree cash flow less principal repayments of finance leases and financing obligations increased to $44.9 billion for the trailing twelve months, compared with $15.9 billion for the trailing twelve months ended September 30, 2023.\n\nFree cash flow less equipment finance leases and principal repayments of all other finance leases and financing obligations increased to $46.1 billion for the trailing twelve months, compared with $20.2 billion for the trailing twelve months ended September 30, 2023.",
        "created_utc": 1730405185.0,
        "subreddit_name": "stocks",
        "comments": 72
    },
    {
        "title": "Apple Q4 FY24 Earnings: Meets Targets, Record Install Base, Slight Misses on Services, China",
        "score": 141,
        "url": "https://www.reddit.com/r/stocks/comments/1ggoca5/apple_q4_fy24_earnings_meets_targets_record/",
        "content": "Apple Earnings: https://investor.apple.com/investor-relations/default.aspx\n\nCUPERTINO, Calif.--(BUSINESS WIRE)--Apple® today announced financial results for its fiscal 2024 fourth quarter ended September 28, 2024. The Company posted quarterly revenue of $94.9 billion, up 6 percent year over year, and quarterly diluted earnings per share of $0.97. Diluted earnings per share was $1.64,1 up 12 percent year over year when excluding the one-time charge recognized during the fourth quarter of 2024 related to the impact of the reversal of the European General Court’s State Aid decision.\n\n“Today Apple is reporting a new September quarter revenue record of $94.9 billion, up 6 percent from a year ago,” said Tim Cook, Apple’s CEO. “During the quarter, we were excited to announce our best products yet, with the all-new iPhone 16 lineup, Apple Watch Series 10, AirPods 4, and remarkable features for hearing health and sleep apnea detection. And this week, we released our first set of features for Apple Intelligence, which sets a new standard for privacy in AI and supercharges our lineup heading into the holiday season.”\n\n“Our record business performance during the September quarter drove nearly $27 billion in operating cash flow, allowing us to return over $29 billion to our shareholders,” said Luca Maestri, Apple’s CFO. “We are very pleased that our active installed base of devices reached a new all-time high across all products and all geographic segments, thanks to our high levels of customer satisfaction and loyalty.”\n\nApple’s board of directors has declared a cash dividend of $0.25 per share of the Company’s common stock. The dividend is payable on November 14, 2024 to shareholders of record as of the close of business on November 11, 2024.\n\nApple will provide live streaming of its Q4 2024 financial results conference call beginning at 2:00 p.m. PT on October 31, 2024 at apple.com/investor/earnings-call. The webcast will be available for replay for approximately two weeks thereafter.",
        "created_utc": 1730406782.0,
        "subreddit_name": "stocks",
        "comments": 88
    },
    {
        "title": "What Should I Buy Today When It's Mostly Red?",
        "score": 67,
        "url": "https://www.reddit.com/r/stocks/comments/1ggh1h4/what_should_i_buy_today_when_its_mostly_red/",
        "content": "Is Warren Buffet shopping today? What's on your to buy or DCA list when the market turns red?\n\nAdvice and recommendations are welcome.\n\nI'm actually looking possibly at PLTR or NVDA but ideas are all welcome for the next red day.",
        "created_utc": 1730387974.0,
        "subreddit_name": "stocks",
        "comments": 216
    },
    {
        "title": "Dropbox - The outsider with a sticky product",
        "score": 6,
        "url": "https://www.reddit.com/r/stocks/comments/1gg24n1/dropbox_the_outsider_with_a_sticky_product/",
        "content": "**1.0 Introduction**\n\nBack in 2017, two MIT students (Drew Houston and Arash Ferdowsi) secured funding from seed accelerator Y Combinator, for what would become Dropbox, one of the first companies to offer **cloud storage and file syncing**.\n\nIt had a first-mover advantage, that combined with a simple user-friendly interface, and a freemium model, allowed the company to grow from **1 million** registered users back in April 2009, to over **700 million** in 2021. Although this sounds impressive, I’ll argue this is *a pointless metric*, but I’ll get back to that.\n\nThe freemium model attracted many users to test out their product and access a limited amount of storage for free. If they need more storage, then they can opt for various paid plans (Dropbox Plus, Dropbox Business).\n\n\n\n**2.0 An incredibly sticky product**\n\nA crucial property to take into account is the **stickiness** of the product**.**\n\n***The perceived risk and effort involved in transferring large volumes of data often outweigh the potential savings of switching services.***\n\nCloud storage platforms hold critical, often irreplaceable, data that users depend on for continuity and productivity. The migration process can seem risky—not just for the potential of data loss or corruption, but also for the disruption it could cause to established workflows and collaborative setups.\n\nMoreover, the time cost of planning, executing, and verifying a migration is significant for larger organizations.\n\n***Even if a competitor offers a cheaper option, the combined weight of time, complexity, and the fear of potential issues can make the cost savings feel secondary.***\n\nFor many users, the existing service might offer just enough value or reliability to make the switch feel unnecessary, reinforcing Dropbox's and similar platforms' stickiness.\n\n\n\n**3.0 The pointless metric & what actually matters.**\n\nIt is not unusual for companies to have some sort of storytelling element in their disclosures, press releases, or earnings reports. The purpose of these elements is nothing else but to create excitement, even if it is pointless.\n\nYou’ll notice, Dropbox chose **registered**, instead of **active**. Given that their base model is free, once someone becomes a user, that person remains a user **forever!** So the number of registered users will always go up.\n\nHowever, if we take a look at the paid subscribers, historically, that is **\\~2.5%** of the registered users. **So, 97.5% of all registered users are freeloaders** ***(including myself)*** **and add no value to the company.**\n\nDon’t get me wrong, having over 18 million paid subscribers is impressive. It is important to focus on this number and acknowledge that the growth days are behind.\n\nThe competition is fierce, ranging from Google and Amazon to Microsoft and Apple. What surprised me was that during the pandemic, there was ***no growth acceleration.***\n\n\n\n**4.0 The past acquisitions**\n\nThe company has engaged in numerous acquisitions:\n\n* **July 2012, TapEngage** \\- *a startup that enables advertisers and publishers to collaborate on tablet-optimized advertising.*\n* **December 2012, Audiogalaxy** \\- *a startup allowing users to store their music files and playlists in the cloud and then stream them to any device.*\n* **December 2012, Snapjoy** \\- *a company allowing users to \"aggregate, archive and view all of their digital photos from their cameras, phones and popular apps.*\n* **July 2013, Endorse** \\- *a mobile coupon startup.*\n* **April 2014, Loom** \\- *a photo-sharing company which would be shut down and integrated with the then-recently announced Carouse*\n* **April 2014, Hackpad** \\- *a document-sharing startup*\n* **May 2014, Bubbli -** *a startup that has built some innovative ways of incorporating 3D technology into 2D views, and packaging it in a mobile app.*\n* **January 2015, CloudOn** \\- *a company that provided mobile applications for document editing and creation.*\n* **January 2019, HelloSign** \\- *e-signature company* ***(largest acquisition $230m).***\n* **March 2021, DocSend** \\- *secure document sharing and analytics product.*\n* **October 2021, Command E** \\- universal search company\n* **November 2022, Boxcryptor** \\- *end-to-end zero-knowledge encryption for cloud storage services*\n* **December 2022, FormSwift** \\- *form management platform*\n\n\n\nThere have been many studies that acquisitions (on average) tend to destroy shareholders’ value. If you agree with that, then Dropbox should be avoided like the plague given their past activity.\n\n\n\n**5.0 The financials**\n\nIf you look at the financials, this is impressive, especially given the fact that they’re competing with Google, Amazon, Microsoft, and Apple.\n\nThe revenue grew from $845m back in 2016 to $2.5 billion in the last twelve months.\n\nThe operating margin improved from **-23%** (-$194m) to **+26%** ($670m).\n\nA lot of focus (especially from the management) goes to FCF and there’s a reason for that. Every company that has high stock-based compensation would like to focus on the free cash flow, as SBC is a non-cash expense.\n\nFrom 2018 (when the company became public) until H1-2024, the company generated **$3.9 billion** in free cash flow. This might sound impressive, given its market cap is $8.5 billion, however, it incurred **$2.3 billion** in stock-based compensation.\n\nSo, where did the $3.9 billion go to? **Share buybacks.** The number of shares outstanding is down \\~20% since becoming a public company.\n\nBased on their capital allocation over the last 5 years, it seems as if their capital allocation strategy has changed from **acquiring more companies** to **returning capital to the shareholders via buybacks**.\n\n  \n**6.0 The valuation**\n\nHow does one value a company of this kind?\n\nIt has a sticky product that generates relatively stable cash flow that is returned to the shareholders via buybacks. I’ll argue that it has a lot of similarities with a bond and a **dividend discount model** is an appropriate model to value a company of this kind.\n\nExcept, instead of using the dividend, I’ll use **free cash flow** **- SBC.**\n\nInputs:\n\nFree cash flow - SBC of $450m.\n\nGrowth in perpetuity of 4%.\n\nDiscount rate of 8%.\n\nAdjusting for cash/debt\n\nThe value of the company is $8.8 billion ($27/share), which isn't that far off from today's share price of $26/share.\n\n  \n**7.0 My thoughts**\n\nA company with a sticky product that has stable financial performance is expected to be less volatile than the average company out there. This is indeed the case, and the stock price beta is 0.6. Beta is a measure of risk that compares the volatility of the share price vs. an index (in this case, the S&P500). However, low risk goes hand in hand with low return. Therefore, expecting \\~8% long-term yield seems fair.\n\nI don’t find this an attractive opportunity, at this price point. However, *if the share price decreases to $20*, then the answer would be different.\n\nThe only scenario where I see a significant upside is if Dropbox is being acquired by a giant, such as Salesforce.\n\nI hope you enjoyed this post, feel free to share your thoughts.",
        "created_utc": 1730335247.0,
        "subreddit_name": "stocks",
        "comments": 5
    },
    {
        "title": "RDDT - pump & dump territory? ",
        "score": 2,
        "url": "https://www.reddit.com/r/stocks/comments/1ggfqip/rddt_pump_dump_territory/",
        "content": "I posted about reddit stock a few weeks ago with a general mindset while it was in the 70s its potentially undervalued, but since their earnings report 2 days ago this went from 84 to current 120s and rising. \n\nWhile I believe longer term it's possible for them to grow more into the valuation wallstreet is pumping on the ticker, it's up 45% in a day and a half.\n\nIts the nature of the beast sometimes for a stock to uncontrollably run up. It's rare a stock stays up that high. Only exception to the rule is something like tsla stock.\n\nIs anyone buying post earnings in the triple digits? If so, what's your target or are you just chasing/fomoing into this ticker?",
        "created_utc": 1730384603.0,
        "subreddit_name": "stocks",
        "comments": 49
    },
    {
        "title": "$UBER is positioned extremely well for the future",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1ggehhq/uber_is_positioned_extremely_well_for_the_future/",
        "content": "At the time of writing this post, UBER is down 7% in premarket, which is a big overreaction, after their earnings report. I suspect the cause of the drop is the miss on Bookings, which is not significant in my opinion.\n\nKey factors:\n\n- EPS of $1.20, beating expectations of $0.41\n\n- Revenue of $11.2B, beating expectations of $11B\n\n- Total Gross Bookings of $41B, missing expectations of $43B\n\nUBER had a record quarter, for the first time it generated an all time high GAAP operating profits of more than $1B.\n\nIn the conference call the CEO and CFO reiterated that they have a very high standard for doing M&A, so the Expedia deal is not set in stone, rather just a rumor.\n\nThey've also stated they are looking to reduce share count in 2025, meaning doing share buybacks, which will in turn drive higher share price.\n\nBut what I want to talk mostly about is the AV section.\n\n**AV**\n\nThe AV (Autonomous vehicle or self driving cars) is a hot topic right now, especially after Teslas event. Despite Tesla being clearly very far behind actual FSD, Waymo is doing AV, and doing it good. They are partenered with UBER and the AV fleet actually had the highest rated score on the platform (as mentioned by their CEO in the earnings call). Beside Waymo, they are partenered with 14 AV companies, including Aurora which they also have a big stake in. AV is coming, maybe not now, maybe not next year, but it is inevitably coming. And all these AV, especially the smaller ones, need a platform to operate their fleet. Do you build it from the ground up or join UBER who has 25 million rides a day already?\n\nThey are also partnered with BYD for the electrification of their fleet. Guess what is BYD also working on? Yeah, thats right, AVs. And judging BYD/China success on doing EVs, I think thats a pretty good chance they will also succeed on the AV side. And since they are already partenered, where do you think BYDs AV fleet will be used? In UBER.\n\nI think the company is positioned greatly for the future, its profitable after multiple years of negative EPS, it has a clear plan moving forward about their free cash flow, including reducing $2B out of their debt by the end of the year. \n\nDisclaimer, I do have a position in UBER.",
        "created_utc": 1730381197.0,
        "subreddit_name": "stocks",
        "comments": 16
    },
    {
        "title": "NVDA & DJT Puts +200k 🥳",
        "score": 376,
        "url": "https://www.reddit.com/gallery/1ggfyoh",
        "content": "Positions in the 2nd image... Sorry, didn't have the time to upload the YOLO for this, immediate closed everything after taking the screenshot...\n\nSold all the DJT 40p @ 5.25",
        "created_utc": 1730385197.0,
        "subreddit_name": "wallstreetbets",
        "comments": 73
    }
]