[
    {
        "title": "Why Apple simply doesn't provide a cloud service?",
        "score": 250,
        "url": "https://www.reddit.com/r/stocks/comments/1bbz8zd/why_apple_simply_doesnt_provide_a_cloud_service/",
        "content": "With AAPL growing now at what I consider to be a  \"GDP premium rate\" ~ 5% and with the iphone growth slowing down, what is left now for Apple is to capitalize on its services. This is now under attack in the EU. I am not a financial specialist but as a European I do however foresee a hard time for Apple to grow services revenue in the EU. Now that Apple has to offer search choices, that revenue with Google might also see some decline. With the self-driving car cancelled, it is hard to picture any sectors where Apple could still push double digit growth. VisionPro? too expensive at the moment, it would still to be at least in the $1000 range for the mass. While we have seen positive news on the tech, it is still unknown how many people who bought the device hasn't yet returned it.\n\nGenAI? They reshuffled the entire team working on Titan to focus on GenAI. How is that possible? are the skills really transferable? Vision Problem != LLM but again not an expert.\n\nThis led me to wonder, why isn't Apple competing in the cloud business? I don't mean like AWS or Azure but for its developers? When a developer onboard on IOS, they make use of the store and the SDK but all cloud services the app uses is running somewhere else. Wouldn't Apple be able to justify 30%+ cut of the developer's revenue if part of the deal was access to Apple cloud infrastructure to run the App services?\n\nDo you guys think this is far fetched? What other sectors do you guys think Apple can still tap in to to go back to double digit growth?\n\nLeadership wise, i am a bit split. Post Steve Jobs, all they had truly done was innovate on the iPhone and in a way that phone was conceptualized during Steve's time. So what exactly did Tim Cook do? I would still pick Tim Cook over Sundar but he is not Satya who was more of an opportunist that turned Microsoft around.\n\nAnyway, lots of questions and a bit of a rant. Curious what you geniuses think of what lies ahead of the big Apple.",
        "created_utc": 1710149633.0,
        "subreddit_name": "stocks",
        "comments": 184
    },
    {
        "title": "If Nvidia becomes bigger than Apple I will eat an H100 Tensor Core",
        "score": 3972,
        "url": "https://i.redd.it/s810hdhqmqnc1.png",
        "content": "",
        "created_utc": 1710177335.0,
        "subreddit_name": "wallstreetbets",
        "comments": 495
    },
    {
        "title": "Surgeons use Apple's VR goggles in an operation for the first time in the UK as they repair a patient's spine",
        "score": 1248,
        "url": "https://www.dailymail.co.uk/news/article-13181017/Surgeons-use-Apples-VR-goggles-operation-time-UK-repair-patients-spine.html",
        "content": "",
        "created_utc": 1710166974.0,
        "subreddit_name": "apple",
        "comments": 135
    },
    {
        "title": "Apple Reportedly 'Just Started Formal Development' of M4 MacBook Pro",
        "score": 1000,
        "url": "https://www.macrumors.com/2024/03/11/apple-reportedly-developing-m4-macbook-pro/",
        "content": "",
        "created_utc": 1710199572.0,
        "subreddit_name": "apple",
        "comments": 314
    },
    {
        "title": "Apple CEO Tim Cook Makes Unusual Appearance in Porsche Taycan Turbo GT Premiere Video",
        "score": 847,
        "url": "https://www.macrumors.com/2024/03/11/tim-cook-appears-in-porsche-premiere-video/",
        "content": "",
        "created_utc": 1710175069.0,
        "subreddit_name": "apple",
        "comments": 93
    }
]