[
    {
        "title": "Tesla earnings are out — here are the numbers",
        "score": 1627,
        "url": "https://www.reddit.com/r/stocks/comments/1cbei70/tesla_earnings_are_out_here_are_the_numbers/",
        "content": "Tesla reported a 9% drop in first-quarter revenue on Tuesday, the biggest decline since 2012, as the electric vehicle company weathers the impact of ongoing price cuts.\n\nHere are the results.\n\nEarnings per share: 45 cents adjusted vs. 51 cents per share expected by LSEG\n\nRevenue: $21.30 billion vs. $22.15 billion expected by LSEG\n\nRevenue declined from $25.17 billion a year earlier. Net income dropped 55% to $1.13 billion from $7.93 billion a year ago.\n\nA livestream of the earnings call is scheduled for 5:30 p.m. ET.\n\nSource: https://www.cnbc.com/2024/04/23/tesla-tsla-earnings-q1-2024-.html",
        "created_utc": 1713902903.0,
        "subreddit_name": "stocks",
        "comments": 752
    },
    {
        "title": "Spotify turns a profit as earnings and revenue beat estimstes",
        "score": 677,
        "url": "https://www.reddit.com/r/stocks/comments/1cb1vuq/spotify_turns_a_profit_as_earnings_and_revenue/",
        "content": "Spotify Technology (SPOT) reported fiscal first quarter earnings on Tuesday that beat expectations on both the top and bottom lines. The audio giant also swung to a profit as it continues to implement its recent \"efficiency\" strategy.\n\nOver the past year, Spotify has committed to multiple rounds of layoffs in addition to price increases and other initiatives to boost top-line growth and improve margins. The company said it will be more intentional about future investments after spending billions on its push into the crowded podcast market.\n\nThe audio giant reported operating income of 168 million euros ($179 million), compared with a loss of 156 million euros in the prior-year period. This was below company guidance of 180 million euros as social charges came in higher than expected, \"driven by share price appreciation during the quarter\", according to Spotify.\n\nIt also guided to a strong Q2 operating income of 250 million euros, well ahead of Wall Street consensus expectations. Revenue guidance for the second quarter also came in ahead of estimates — 3.8 billion euros versus the 3.76 billion euros that was expected.\n\nOn top of more deliberate spending, Spotify will reportedly once again raise prices after hiking the cost of certain subscription plans last summer.\n\nAccording to Bloomberg, Spotify plans to raise prices by about $1 to $2 a month in five markets, including the UK, Australia, and Pakistan. The changes are expected to come at the end of April, with US prices to rise \"later this year.\" The report also said Spotify plans to introduce a cheaper option that does not include audiobooks.\n\nThe stock moved more than 9% higher in pre-market trading on Tuesday following the results.\n\nThe streaming service reported net income of 197 million euros ($210 million), or earnings of 0.97 euros per share. That was ahead of analyst expectations of earnings of 0.65 euros per share. It also compares with the year-earlier period loss of 225 million euros, or a loss of 1.16 euros a share.\n\nGross margins came in stronger than expected at 27.6%, beating company guidance of 26.4%. The streamer said it expects margins to tick up to 28.1% in the second quarter, primarily driven by year-over-year improvements in music and podcasting.\n\nSpotify has previously said it expects the metric to come in between 30% and 35% over the long term amid plans to further scale its podcasting and ads business.\n\nRevenue, meanwhile, totaled 3.64 billion euros ($3.88 billion) — 20% higher compared with the first quarter of 2023, and above Wall Street expectations of 3.61 billion euros.\n\nUser figures\n\nTotal monthly active users (MAUs) came in below company estimates of 618 million to hit 615 million in the quarter — but still a 19% improvement compared with the total in the year-ago period. The streaming service anticipates Q2 MAUs to come in at 631 million.\n\nPremium subscribers met Wall Street expectations of 239 million — a 14% year-over-year jump. Spotify expects that subscriber count to increase to 245 million in the second quarter.\n\nFree cash flow, another key metric for investors, came in at 207 million euros in the quarter compared to 57 million euros in the year-ago period.\n\nThe average revenue per user, or ARPU, for Premium subscriptions increased 7% to 4.55 euros (or 5% year over year, excluding foreign exchange headwinds.) ARPU was driven by price increase benefits that were partially offset by discounted plans and lower prices in emerging markets, the company said.\n\nProfit pledge\n\nOverall, analysts have been bullish on Spotify after the audio giant pledged to improve its profitability beginning in 2023 on a gross margin and operating income basis.\n\nSpotify stock has surged more than 100% over the past year and is up 43% year to date.\n\nSpotify spent $1 billion pushing into the podcast market over the past four years with splashy A-list deals and $400 million-plus studio acquisitions.\n\nThat spending took a significant bite out of gross margins and weighed heavily on profitability. In response, Spotify committed to several rounds of layoffs — three in 2023 alone.\n\nSpotify CFO Paul Vogel stepped down from his position on March 31. He will be replaced by Christian Luiga, previously at Swedish aerospace and defense company Saab. Luiga will take over in the third quarter, the company said.\n\nIn addition to layoffs and price increases, Spotify also changed up its royalty structure, made audiobooks free to paying subscribers, and locked in new deals with popular podcasters like Joe Rogan and Alexandra Cooper of \"Call Her Daddy.\"\n\nThe new deals come as Spotify further revamps its podcast strategy to focus more on distribution rather than exclusivity.\n\nThe audio giant announced that Rogan's podcast, its most popular on the platform, will be available on additional services like Apple Podcasts (AAPL), Amazon Music (AMZN), and YouTube (GOOGL) for the first time in years. Spotify will handle distribution and ad sales as it works to maximize revenue. Rogan will receive a guaranteed minimum rate and cut of the advertising revenue.\n\nCooper's \"Call Her Daddy\" deal will have a similar structure with the podcast now available on all major audio platforms after more than two years as a Spotify exclusive. The company will maintain the exclusive rights to the podcast's video portion.\n\nSource: https://ca.finance.yahoo.com/news/spotify-turns-a-profit-as-earnings-and-revenue-beat-estimates-102727402.html",
        "created_utc": 1713870699.0,
        "subreddit_name": "stocks",
        "comments": 85
    },
    {
        "title": "Apple Vision Pro demand falls 'sharply beyond expectations'. Apple reviewing and adjusting product roadmap and strategy.",
        "score": 537,
        "url": "https://www.reddit.com/r/stocks/comments/1cbct4h/apple_vision_pro_demand_falls_sharply_beyond/",
        "content": "* Apple has cut its 2024 Vision Pro shipments to 400–450k units (vs. market consensus of 700–800k units or more). \n* Apple cut orders before launching Vision Pro in non-US markets, which means that demand in the US market has fallen sharply beyond expectations, making Apple take a conservative view of demand in non-US markets.\n* Apple is reviewing and adjusting its head-mounted display (HMD) product roadmap, so there may be no new Vision Pro model in 2025 (the previous expectation was that there would be a new model in 2H25/4Q25). Apple now expects Vision Pro shipments to decline YoY in 2025.\n\nSource: Ming-chi Kuo",
        "created_utc": 1713898872.0,
        "subreddit_name": "stocks",
        "comments": 239
    },
    {
        "title": "Tesla Driver Charged With Killing Motorcyclist After Turning on Autopilot and Browsing His Phone",
        "score": 10975,
        "url": "https://gizmodo.com/tesla-motorcycle-crash-death-autopilot-washington-1851428850",
        "content": "",
        "created_utc": 1713883419.0,
        "subreddit_name": "technology",
        "comments": 1303
    },
    {
        "title": "Apple Cuts Vision Pro Shipments As Demand Falls 'Sharply Beyond Expectations'",
        "score": 5852,
        "url": "https://www.macrumors.com/2024/04/23/apple-cuts-vision-pro-shipments/",
        "content": "",
        "created_utc": 1713894340.0,
        "subreddit_name": "technology",
        "comments": 1359
    },
    {
        "title": "Apple Finally Plans to Release a Calculator App for iPad Later This Year",
        "score": 2374,
        "url": "https://www.macrumors.com/2024/04/23/calculator-app-for-ipad-rumor/",
        "content": "",
        "created_utc": 1713889255.0,
        "subreddit_name": "apple",
        "comments": 367
    },
    {
        "title": "Apple announces special event for May 7: ‘Let Loose’",
        "score": 1943,
        "url": "https://9to5mac.com/2024/04/23/apple-announces-special-event-for-may-7-let-loose/?extended-comments=1",
        "content": "",
        "created_utc": 1713881511.0,
        "subreddit_name": "apple",
        "comments": 562
    },
    {
        "title": "Apple Reportedly Developing Its Own Custom Silicon for AI Servers",
        "score": 846,
        "url": "https://www.macrumors.com/2024/04/23/apple-developing-its-own-ai-server-processor/",
        "content": "",
        "created_utc": 1713880650.0,
        "subreddit_name": "apple",
        "comments": 136
    },
    {
        "title": "Apple cuts 2024 & 2025 Vision Pro shipment forecasts, unfavorable to MR headset, Pancake, and Micro OLED Trends",
        "score": 813,
        "url": "https://medium.com/@mingchikuo/apple-cuts-2024-2025-vision-pro-shipment-forecasts-unfavorable-to-mr-headset-pancake-and-micro-38796834f930",
        "content": "",
        "created_utc": 1713891038.0,
        "subreddit_name": "apple",
        "comments": 424
    }
]