[
    {
        "title": "Focus on ONE Setup & Take This Seriously to Become Profitable.",
        "score": 302,
        "url": "https://www.reddit.com/r/Daytrading/comments/wybpz1/focus_on_one_setup_take_this_seriously_to_become/",
        "content": "***Focus on one setup, just ONE.***\n\nI've been a profitable trader for the past 8 years and live off my trading income; Yet I'm not the smartest man in the room. I have no qualifications, I didn't attend university/college. I can barely speak the queens English, my grammar is terrible and I like to indulge in too much alcohol at family events.\n\nSo now we have that out the way I'm going to explain what took me from a disastrous gambler to an extremely profitable trader. My average return is 8% a week with my best year in 2020 at over 2,000%\n\n**Focus on ONE setup.**\n\nOne of the top reasons in my experience that practically everybody fails at trading is they run around like lunatics. Imagine trying to become a good basketball player whilst trying to become a deadlift champion, a golfer, a marathon runner and a body builder. It doesn't work because they all conflict with each other. Your daily life will be an absolute mess and every action you take conflicts with another. You're just doing a little bit of this and a little bit of that.\n\nNow what happens if you have a shootout and you're up against the guy that wakes up at 6am and shoots 1,000 balls every morning. Then heads to work and comes back to shoot another 1,000 before bed. You have zero chance of winning, NONE.\n\n**This applies to trading.**\n\n***You only need to be really good at one set up to make more money than you know what to do with.*** yet instead you're likely \"just ok\" at many, ok is not enough in this game.\n\nJust like the sport example of trying to learn 5-10 sports you can't be looking for 5-10 different styles of set ups each day. Your routine will be an absolute mess, in my opinion you can manage 2 at best after years of experience.\n\nIf you're looking for short breakdowns, long breakouts, parabolic shorts and future scalps then everything will simply conflict. It's why you'll notice the best traders and investors in the world seem almost boring. They just repeat the same thing every single day.\n\nIt's that repetition that gives them an edge, it's that focus that turns them into a silent killer.\n\nThe market is full of noise and distraction, almost like a kindergarten school at playtime; it's chaotic. People just running around and screaming.\n\n**So here's what you need to do:**\n\nYou need to focus on one style of set up and you need to master it. Every single day should be focused towards getting better at that style of trading. You should have entry requirements that must be ticked off before you take a trade and every trade should be preplanned.\n\nAs you review the past 50 trades take a look at characteristics from each winning and each losing trade. Then filter down your requirements even more, get stricter, leaner and sharper.\n\n**So for example I only trade stocks going up**. **I'm not taking the piss, I literally only buy names which are going from the bottom left to the top right.**\n\nI don't watch SPY, I don't watch Level 2, I don't listen to Powell, I don't watch the news.\n\nBull market, bear market, chop market, I don't care.\n\n**I focus on leading names that are breaking out of ranges and when they do I buy them.**\n\nAs you may be aware this year has been one of the most aggressive starts in 50 years yet my current return is 380% Since January 1st 2022.\n\nOIL names, Gas names, Metals, Fertilisers, Renewable Energy etc have all been ripping. So whilst it may seem like it's been a great market to short (which it has) I simply do not care. Every single day I search for the leading names, every single day I then create a list of those names and narrow it down by the ones which appear to be breaking out. I then create and write out a business plan (watchlist) every morning.\n\nIf I haven't planned for the trade I won't take it. I don't care how good it is. If it hasn't been planned that day or previously then It's not my trade to take.\n\nWhen the market opens you're a button clicker. You're not a hero, you're a button clicker.\n\nThe money is in the plan. The better you get at making that plan each morning the more profitable you'll become and the money will flow as a result of your daily actions not your daily desire.\n\nThink about all the work you currently do at your Job right now on a day to day basis. Yet 99.9% of people in the markets won't spend an hour a day to create an action plan. You won't spend time actually trying to improve just a little bit each day?\n\nSeriously sit there and think if you had just wrote out your plan each day this week. Firstly it would stop you doing something stupid, as typing it out would make your realise you're a fool.\n\n\"I'm taking this trade because the company is terrible, it's just broke support and so I am going to buy it hoping to goes up\" **You see the power in a plan...**\n\nHow many times have you gone \"Dammit I knew X would do that\" but you took some random name instead and lost money.\n\nHow many times have you held a losing trade for too long? Do you know how hard it becomes to hold a losing trade when your plan says \" IF IT BREAKS X LEVEL THEN IT'S FAILED, SO SELL EVERYTHING AND RUN LIKE FOREST GUMP\"\n\nYour plan at the start will suck so bad it'll be laughable. Then a week later you'll go \"Wow almost none of that worked but these did\". The lightbulb will switch on, you'll feel a glimmer of hope and you'll jump down the rabbit hole. Slowly you'll get a little wiser, you'll start to notice the type of trades that clearly don't work. Your subconscious pattern recognition, that exists in all of us, will begin to focus.\n\nAfter just a few months your plan will be a lot cleaner. You'll have added parameters like\n\n\"Is this a growing company\"\n\n\"What's the volume like\"\n\n\"Is it a name that can easily gap down and wreck my account like a Biotech or pump and dump\"\n\n\"How long as it been in this range\"\n\nYou may have noticed the daily watchlist I've been posting. These aren't created for you these are created for me, I just simply share them.\n\nYou see I create these watchlists because they're my business plan for the day. They tell me what to do once the chaotic beast awakens and noise hits you from every direction. All I have to do when that bell rings is follow that plan. The experience in execution is as it says on the tin \"experience\". So if a name breaks out from my watchlist BUT it doesn't have enough volume then I know it'll likely fail. In which case I don't click that little button on that object you're using to read this right now.\n\n**So let's say you prefer shorting:**\n\nYou'd want to be scanning for names already down on the year, names that nobody wants. Scan for names missing earnings and reducing in revenue. Scan for names under all their MAs. Scan for names with insider sells, inst sells etc.\n\nThen narrow that list down on a technical front by what names are about to break through support.\n\nLearn to stay away from the low floats that can gap up 20-30% on a pumpers tweet.\n\nMy point is this. If you focus one just one style of trading you'll accelerate to profitability. All of the noise around you will be drowned out, you literally won't care.\n\n**Summary:**\n\nIf you want to actually become profitable in this profession, work from anywhere, pull $10,000s/week out the markets and live a life that so many fake on the gram then..\n\n**You need to give it the respect it deserves**. **You need to treat it like you're starting a $500,000/yr business not like you're chucking $50 into a slot machine.**\n\nStick to a set up and spend every damn minute becoming a master at it. Make sure you have an action plan typed up every morning with the names, levels and criteria for entry. Review your trades often and find the characteristics between those that win and those that lose.\n\nLastly, Don't give up. It's horrendous and first but the rewards are worth it.\n\n**Example of my latest watchlist posted to reddit:** [https://www.reddit.com/r/Daytrading/comments/wy1xdp/breakout\\_setups\\_watchlist\\_26th\\_august/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/Daytrading/comments/wy1xdp/breakout_setups_watchlist_26th_august/?utm_source=share&utm_medium=web2x&context=3)\n\n**Prime example Today:** Everybody is shouting about how the market is tanking right? QQQs is down 2.5% right now.\n\nYet I took zero short positions and only took one trade $DQ\n\nThoughts: With china showing some strength once again my attention was drawn to the sector. $DQ happens to be one of the strongest setups in the Chinese market and one of the only names that isn't too far off ATH. It also happens to be one of the only names china that has had institutions increasing their positions. It also has tremendous growth and EPS growth.\n\nOnto of that solar names have been some of the strongest this year. Check $ENPH $TAN $FSLR etc.. I know this because I only focus on one thing.\n\nSo with China bullish, Solar bullish and a weekly breakout on RVOL it's game on. See details below:\n\n&#x200B;\n\nhttps://preview.redd.it/i9n2fnt0r2k91.png?width=327&format=png&auto=webp&s=d766e5f443d65f1d046d0d3d55f54b69675c0165\n\n&#x200B;\n\nChart premarket:\n\n&#x200B;\n\nhttps://preview.redd.it/mfhegad9r2k91.png?width=1727&format=png&auto=webp&s=9f444170e094d563452b81878eb2376671c0c24a\n\nChart Now:\n\n&#x200B;\n\nhttps://preview.redd.it/cx37jsxgr2k91.png?width=1727&format=png&auto=webp&s=ed016caad8afa62d6d42af572ec16701f439e6ac\n\n**P.S. A lot of messages have been asking for learning material.**\n\nI’ve read so many books I’ve lost count but the two most important ones are:\n\n**“How to make money in stocks”** by William O’Neil \n\n“Atomic Habits” by James clear\n\nI’ve also posted one of my favourite set ups and hundreds of watchlists if you click on my Reddit profile and read through it’ll answer lots of questions. Practically all of them are posted in this day trading channel. \n\nQullamaggie is also another great trader with good content, you can search for him.\n\nI also post a lot of trades and DD to Twitter which you can review.\n\nWill continue to answer and questions after the weekend, I hope you all have a good one & thanks for the love ❤️ 🥂",
        "created_utc": 1661526733.0,
        "subreddit_name": "Daytrading",
        "comments": 129
    },
    {
        "title": "A friend of mine is a long term investor. He showed me one of his investments. He invested $400,000 into QQQ",
        "score": 2452,
        "url": "https://www.reddit.com/r/stocks/comments/wxyp15/a_friend_of_mine_is_a_long_term_investor_he/",
        "content": "But he did this over 20 years and started with a $30 cost basis. My guess is that it wasn’t until the last eight or 10 years of his career that he earned a six-figure salary, yet he will retire in 2 years with close to 4.5 million dollars invested. His advice to me was to invest everything into QQQ. His attitude is that it gives you action in the top marketcap stocks and investing in the top 100 is typically a very safe bet and will offer the best growth/risk balance. Thoughts? If I wanted to spread my money out between Tesla, Amazon, Microsoft, Ford, etc, aren’t I better off just investing in QQQ?",
        "created_utc": 1661485908.0,
        "subreddit_name": "stocks",
        "comments": 541
    }
]