[
    {
        "title": "Warren Buffett’s Berkshire Hathaway sold ~$14 billion worth of Apple this quarter. Cash pile hits record ~$325 billion.",
        "score": 1040,
        "url": "https://www.reddit.com/r/stocks/comments/1ghv5qo/warren_buffetts_berkshire_hathaway_sold_14/",
        "content": "Berkshires cash on hand hits a record $325 Billion\n\nCurrently owns ~$69.9 Billion worth of Apple $AAPL as of the end of Q3 down from $84.2B worth as of the end of Q2\n\nNo brk.a or brk.b shares repurchase in Q3\n\nPosts Q3 revenue of $92.9B compared to $93.2B YoY\n\nOperating earnings fell 6% from a year earlier to $10.09 billion as insurance underwriting earnings slumped\n\n#\n\n>**It is being widely reported that Berkshire's operating earnings declined 6.2% in the quarter. No. The reported figures include unrealized currency losses in 2024 and gains in 2023 on BRK's debt denominated in foreign currencies, largely yen. Earnings really grew 8.5% in Q3 to $11.2 billion against $10.3 billion and were up 18.0% for the nine months to $33.0 billion from $28.0 billion. Just as short-term movements in equity prices can distort the reporting of operating profits, so to do currency swings on debt outstanding. Both should be excluded from an analysis of operating and economic profit.**\n\nPer Christopher Bloomstran on X ",
        "created_utc": 1730549971.0,
        "subreddit_name": "stocks",
        "comments": 333
    },
    {
        "title": "Tesla and Uber partner to give drivers $2,000 to switch to Tesla",
        "score": 321,
        "url": "https://www.reddit.com/r/stocks/comments/1ghmcyw/tesla_and_uber_partner_to_give_drivers_2000_to/",
        "content": "[https://www.evuniverse.io/p/tesla-and-uber-partner-giving-2000-to-drivers](https://www.evuniverse.io/p/tesla-and-uber-partner-giving-2000-to-drivers)\n\n>Tesla just launched a collaboration with Uber, this time to give eligible Model 3 & Y buyers: $1,000 in Tesla Credits upon taking delivery + $1,000 in cash from Uber after completing 100 trips. The Tesla Credits can be used toward Supercharging, a new Tesla vehicle, service appointments or select Tesla Shop or upgrade purchases. Just for your info, Tesla Tequila is excluded though. The incentive is available after verifying eligibility with Uber through their system, find the button on Tesla’s fresh [tesla.com/uber](http://tesla.com/uber) website.\n\n>The 100 trips need to be completed before February 15, 2025 and the deal is not available for used vehicles. Interestingly the offer is stackable with Tesla Military Purchase Program, but is not stackable with other Tesla promotions, including its Refer and Earn Program.",
        "created_utc": 1730513789.0,
        "subreddit_name": "stocks",
        "comments": 138
    },
    {
        "title": "Etsy's declining gross merchandising sales - from a buyer",
        "score": 74,
        "url": "https://www.reddit.com/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/",
        "content": "Etsy reported a 6% decline in gross merchandising sales in the third quarter. Active buyers decreased as well as habitual buyers.\n\nI can tell you one of the reasons why (a contributing factor). I have been a buyer on Etsy since 2016. I am also a seller. I cannot purchase multiple items on Etsy say more than 10 items at a time because of Etsy's faulty cart. This has been the case for at least a couple of years. I first started having the problem in my main shop a couple of years ago.\n\nI buy a lot of jewelry supplies so I can easily purchase many items at once and have. I am a habitual buyer who has probably spent approximately $40k maybe more on Etsy all these years.\n\nI started using a second account to purchase because the constant popups in the shop I sell on are too annoying. Many sellers/buyers report the same. Etsy does not care.\n\nAnyway, in my second account I have been trying to add items to my cart (all beads) to purchase from this one shop. I would have bought from them elsewhere if they had their own site but they do not.\n\nLast Sunday I spent a couple of hours looking through the shops over 2000 listings. They have awesome beads and shopping is fun for me. The first time around that is. Thereafter, it is no longer fun and now like work. I added the items on Sunday. I came back on Monday to purchase and I could not access my cart. I contact support who said I would get an email. I did not. I contacted them the next day and asked if they were going to fix my cart. They told me they thought it was a problem with 14 items in the saved for later. I specifically told Etsy support DO NOT remove the 97 items in my cart, but you could the saved for later.\n\nThe next day to my surprise the cart was fixed. But Etsy removed those 97 items in my cart that I wanted to buy! That was time consuming. The problem is that some buyers are not able to add more than 10 items in their cart at a time to purchase, but the cart allows up to 100. I was upset. Support gave me a $20 credit for the inconvenience.\n\nAs it is now like work for me and not fun I go to add the items back in my cart and it is quite time consuming. I did make two purchases earlier today but they were not more than 5 items. I figured I could add up to not more than 40 items and be good. At 38 items my cart glitched out and I cannot access the cart!\n\nI contact support again tonight and told them this. Support was able to get the items down to 20 in my cart to where it works. So it seems I can safely purchase 20 items. But I will have to do a multiple item purchase for all I want to buy. Support gave me another $10 credit. They claim Etsy is trying to fix this problem for buyers.\n\nMost buyers would not persist as I have. Most buyers would move on elsewhere to Amazon, Ebay, etc. And most probably do.\n\nSellers are losing out on sales and so is Etsy because Etsy is incapable of fixing this cart issue. They don't care.\n\nFor 5 days I have tried to purchase a large amount of beads from this one shop and still trying! I have written the COO twice this past week. I probably wrote management a couple of years ago when it happened. They know about it.\n\nI have been buying on Amazon as a prime member for several years. I have been buying on Ebay since 2016. I have NEVER experienced a glitch or malfunction on those marketplaces ever! It is always a seamless experience as a buyer and seller. Etsy has daily glitches and malfunctions. If Amazon and Ebay can do it why can't Etsy?\n\nAnd accessing support as a buyer and seller is quite difficult. I can imagine the average buyer is not going to take the time to try to get through the maze to access support thus they abandon Etsy.\n\nI can imagine how much manpower and $ Etsy has spent fixing buyers cart issues and credits they are issuing. Rather than just fixing the problem once and for all so the cart functions normally and seamlessly.\n\nDon't even get me started on seller's pain points, there are many of them as well.\n\nThe moral of this story is do you want to invest in a company that can't have a functioning cart and treats their buyers and sellers like they do? They don't care obviously that they are losing sales since this has gone on for a long, long time.\n\nEtsy are you listening? No they are not. Elliot management are you listening? Analysts are you listening? Investors are you listening?",
        "created_utc": 1730509574.0,
        "subreddit_name": "stocks",
        "comments": 27
    },
    {
        "title": "Globalstar and Apple expanded partnership ",
        "score": 31,
        "url": "https://www.reddit.com/r/stocks/comments/1gi2s7x/globalstar_and_apple_expanded_partnership/",
        "content": "Does anyone have anymore information on Globalstar GSAT and Apple AAPL expanded partnership? Is GSAT a buy after the 40% rise in share price?.\n\nHere is some information I have , but is there anything I should be aware of ? \n\nThe expanded partnership between Globalstar (GSAT) and Apple (APL) could bring significant long-  term benefits to Globalstar's stock, though some challenges may stil lie ahead.  \nPotential Positive Impacts  I. Revenue Growth: With Apple prepaying up to $1.1 billion and committing to pay additional  service fees, Globalstar can expect substantial revenue growth. The agreement is projected to  more than double Globalstar's annual revenue compared to 2024 levels, primarily driven by the  new satellite network's capacity and performance milestones  2. Market Confidence: Apple's involvement and the substantial upfront payments provide market  validation for Globalstar, boosting investor confidence. A stronger association with Apple, along  with its 20% equity stake in Globalstar's satellite network, reinforces the viability and demand for  satellite-enabled connectivity, especially in remote and underserved areas\n3. Future Expansion Opportunities: The network's design and expanded ground infrastructure  allow Globalstar to potentially explore new revenue streams, including other high-reliability  C  industries (e.g., maritime or government sectors), beyond its arrangement with Apple cOwews  \nPotential Risks  \n1. High Dependency on Apple: The partners. p heavily ties Globalstar's growth trajectory to zero.\n3. Future Expansion Opportunities: The network's design and expanded ground infrastructure  allow Globalstar to potentially explore new revenue streams, including other high-reliability  industries (e.g. maritime or government sectors), beyond its arrangement with Apple.\nPotential Risks  \n1. High Dependency on Apple: The partnership heavily ties Globalstar's growth trajectory to  Apple's needs and future directions. If Apple shifts its strategic focus away from satellite  communication, Globalstar's revenue and stock could be negatively affected,  \n2. Execution Risks: Globalstar must deliver the new MSS network according to Apple's  performance milestones. Failing to meet these milestones could result in reduced or delayed  payments, which would likely impact the stock negatively.\nIn the near term, Globalstar's stock may experience heightened volatility, as its year-to-date  performance has already been variable. However, if Globalstar manages this partnership successfully.  it could see sustained growth, especially as satelite connectivity becomes increasingly relevant to  tech giants like Apple.\n",
        "created_utc": 1730571638.0,
        "subreddit_name": "stocks",
        "comments": 9
    },
    {
        "title": "Why I think TSM/INTC will outpace NVDA/AMD growth in the next decade. ",
        "score": 1156,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1ghyq7o/why_i_think_tsmintc_will_outpace_nvdaamd_growth/",
        "content": "Tech giants like Amazon, Google, Microsoft, and Meta are spending billions of CapEx on AI. Lets just look at their last 2 quarters spending:\n\n* **Amazon**: Increased CapEx from $60 billion in Q2 2024 to $70 billion in Q3 2024.\n* **Google**: Increased CapEx from $44 billion to $49 billion in the same period.\n* **Microsoft**: Increased CapEx from $44 billion to $49 billion.\n* **Meta**: Increased CapEx from $29 billion to $31 billion.\n\nHowever not all that CapEx is going to third party AI solutions like Nvidia/AMD. Each and every company listed above has or is developing it's own custom AI silicon.\n\nLets look how they are transitioning from 3rd party to In-House AI silicon:\n\n**Amazon**: Developed AWS Inferentia and Tranium chips for AI processing (manufactured by TSM & INTC).\n\n**Google**: Developed Tensor Processing Unite (TPU) and Axion chip for AI processing (manufactured by TSM).\n\n**Microsoft**: Developed Azure Maia AI chip and Azure Cobalt for AI processing (manufactured by TSM & INTC).\n\n**Meta**: Developed Meta trading and Inference Accelerator (MTIA) for AI processing (manufactured by TSM).\n\nAll those developments reduce dependence on external GPU suppliers, allow more customized/efficient AI processing and most importantly huge cost savings.\n\nJust to understand the level of savings (and why would they invest huge R&D budget on this):\n\nA **regular Nvidia H100 GPU**, cost approximately **$3,320** to manufacture from TSMC. However it is being sold at **$25,000 to $30,000** each!\n\nThat's almost 800%-900% profit margins that has to be paid by the companies above, when they opt not to choose In-House Silicon.\n\nAs more of the AI CapEx goes to custom silicon (will never be 100%, but expect that percentage only to grow larger over time, driven by cost savings)  TSMC and Intel foundries will benefit directly from this trend (both have EUV capabilities, INTC will mass produce 18A EUV chips next year, with Amazon as first client)\n\nAnd this will position TSMC and INTC for substantial growth, because **the rate limiting factor for AI growth will be how much silicon can TSMC or INTC manufacture** for the entire world's AI demand.  \n  \n\n\n\n\n",
        "created_utc": 1730560665.0,
        "subreddit_name": "wallstreetbets",
        "comments": 249
    },
    {
        "title": "Dow Jones Industrial Average (DOW) Adding NVIDIA (NVDA) replacing Intel (INTC) on Novmeber 8th",
        "score": 210,
        "url": "https://www.spglobal.com/spdji/en/documents/indexnews/announcements/20241101-1475162/1475162_djiadjuaintcdowaes.pdf",
        "content": "",
        "created_utc": 1730510885.0,
        "subreddit_name": "wallstreetbets",
        "comments": 32
    }
]