[
    {
        "title": "Tesla shares jump 6% on profit beat",
        "score": 342,
        "url": "https://www.reddit.com/r/stocks/comments/1gak7c4/tesla_shares_jump_6_on_profit_beat/",
        "content": "* Tesla reported third-quarter earnings on Wednesday that topped analysts’ estimates even as revenue came in just shy of expectations.\n\nHere’s what the company reported compared with what Wall Street was expecting, based on a survey of analysts by LSEG:\n\n* **Earnings per share:** 72 cents vs. 58 cents expected\n* **Revenue:** $25.18 billion vs. $25.37 billion expected\n\nRevenue increased 8% in the quarter from $23.35 billion a year earlier. Net income rose to about $2.17 billion, or 62 cents a share, from $1.85 billion, or 53 cents s share, a year ago.\n\nTesla’s profit margins were bolstered by $739 million in automotive regulatory credit revenue during the quarter. The company has also been offering an array of discounts and incentives to spur sales.\n\nAutomotive revenue increased 2% to $20 billion from $19.63 billion in the same period a year earlier. Energy generation and storage revenue soared 52% to $2.38 billion, while services and other revenue jumped 29% to $2.79 billion.\n\nOperating margin was reported at 10.8% of sales to improve from last quarter's mark of 6.3%, and top last year's mark of 7.6%. Total GAAP gross margin was 19.8% vs. 17.9% a year ago and 18.0% in the prior quarter. Adjusted EBITDA was $4.67 billion vs. $3.76 billion a year ago. For the quarter, the EV juggernaut's adjusted EBITDA margin rose to 18.5% of sales from 16.1% a year ago.\n\n# \n\nTesla had already disclosed 462,890 deliveries for Q3. The electric vehicle maker said it produced 469,796 vehicles during the quarter. Tesla noted that 3% of the deliveries were subject to operating lease accounting. For reference, Tesla delivered 443,956 vehicles in Q2 of this year and 435,059 vehicles in Q3 of last year. Tesla's  all-time deliveries record was 484,507 vehicles in Q4 of 2023. Looking ahead, Tesla reiterated that plans for new vehicles, including more affordable models, remain on track for start of production in the first half of 2025.\n\n# More than just EVs\n\nTesla said energy storage deployments decreased sequentially in Q3 to a record 6.9 GWh, but were up 75% Y/Y. Overall, Tesla said energy services and other businesses are becoming increasingly profitable parts of the company. \"As energy storage products continue to ramp, and our vehicle fleet continues to grow, we are expecting continued profit growth from these businesses over time,\" noted TSLA. The company also said that it deployed and is training ahead of schedule on a 29k H100 cluster at Gigafactory Texas, where it expects to have 50k H100 capacity by the end of October.\n\n# Balance sheet\n\nTesla ended the quarter with a cash position of $33.6 billion. The sequential increase of $2.9 billion was a result of positive free cash flow of $2.7 billion. Operating cash flow was $6.3 billion during the quarter.\n\n**SUMMARY**\n\nWe delivered strong results in Q3 with growth in vehicle deliveries both sequentially and year-on-year, resulting in record third-quarter volumes. We also recognized our second-highest quarter of regulatory credit revenues as other OEMs are still behind on meeting emissions requirements.\n\nOur cost of goods sold (COGS) per vehicle came down to its lowest level ever at \\~$35,100. In order to continue accelerating the world’s transition to sustainable energy, we need to make EVs affordable for everyone, including making total cost of ownership per mile competitive with all forms of transportation. Preparations remain underway for our offering of new vehicles – including more affordable models – which we will begin launching in the first half of 2025. At our \"We, Robot\" event on October 10, we detailed our long-term goal of offering autonomous transport with a cost per mile below rideshare, personal car ownership, and even public transit.\n\nThe Energy business achieved another strong quarter with a record gross margin. Additionally, the Megafactory in Lathrop produced 200 Megapacks in a week, and Powerwall deployments reached a record for the second quarter in a row as we continue to ramp Powerwall 3.\n\nDespite sustained macroeconomic headwinds and others pulling back on EV investments, we remain focused on expanding our vehicle and energy product lineup, reducing costs and making critical investments in AI projects and production capacity. We believe these efforts will allow us to capitalize on the ongoing transition in the transportation and energy sectors.",
        "created_utc": 1729714585.0,
        "subreddit_name": "stocks",
        "comments": 489
    },
    {
        "title": "Trading strategy advice",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gadf74/trading_strategy_advice/",
        "content": "So every day on robinhood I’ve been day trading flipping some Apple stocks when I see it drop a little in the morning I buy it then when it goes up just .2% I sell. I have 10k in there atm  so I’m able to make like $20-$40 a day and have been doing so for a few months but it’s tedious.\n\nThis is such a manual process though - what are ways or things or AI I can use to help automate this?\n\nI also have 20k in Acorns that’s more safety net money I’m growing for retirement",
        "created_utc": 1729697510.0,
        "subreddit_name": "stocks",
        "comments": 33
    },
    {
        "title": "Alphabet To $7 Trillion By 2025?",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1ga9gk5/alphabet_to_7_trillion_by_2025/",
        "content": "We believe Alphabet (NASDAQ:GOOG) is positioned to grow its valuation by well over 3x from the already huge $2-trillion figure now – potentially becoming the world’s most valuable company by a huge margin – as its often-overlooked Waymo autonomous driving business quietly revolutionizes the transportation sector. This would take the stock to over $500 a share. Here’s why.\n\nFact: Waymo has grown the number of weekly paid rides from 10,000 to over 100,000 in the last 12 months. It went from 50,000 weekly rides to 100,000 just in the last six months.\n\nThe growth is compelling and the addressable market is massive\n\nCase in point: Uber does more than 200 million rides each week. Let’s let that sink in. So if autonomous rides can capture even half that market, that would mean 100 million rides per week. That’s about 1,000 times where Waymo is today. 200 million rides a week translates to about a billion a month and over 10 billion a year. At $30 per ride, we’re talking revenues of close to $300 billion per year.\n\nBut wait… there is more to the growth story\n\nIf Waymo is already delivering over 100,000 driverless rides, how many more people might switch from driving their cars to being driven by autonomous vehicles? The shift could be massive. For each person hailing a cab, there are at least 10 others driving their own cars. Many of these drivers might reconsider once they see millions of people relaxing in the back seat, streaming Netflix, while they’re stuck behind the wheel.\n\nIn fact, early data backs this up. According to Earnest Analytics, Waymo is already retaining riders at a higher rate compared to other ride-hailing services like Uber or Lyft. People enjoy the experience of autonomous vehicles. Safety could also be another attraction. Waymo published a report last year indicating that its autonomous vehicles achieved an 85% reduction in injury-causing crashes compared to national rates for human-operated cars.\n\nInvestors will soon recognize that the $300 billion revenue figure for the current ride-hailing market has substantial growth potential – it could easily expand by 2-3x. A $1 trillion market for autonomous rides isn’t out of the question. This growth would also translate to significant revenue opportunities for automakers like Tesla (NASDAQ:TSLA), which are working on their driverless vehicle technologies.\n\nBut wait aren’t so many automakers and tech players working on autonomous driving?\n\nYes, but not all of them are making the same progress. Waymo has a head start in the market. Its main competitor, General Motor’s backed Cruise lost its driverless permits in California after a serious accident, making Waymo the only publicly available robotaxi service in San Francisco. Uber exited its self-driving taxi program about six years ago and has partnered with Waymo to bring its services to the Uber app in some cities. While electric vehicle behemoth Tesla is seen as a leader of sorts in the self-driving space, given its large base of vehicles, it is only slowly getting into the space after the unveiling of its Robotaxi vehicle earlier this month.\n\nWaymo has some advantages in terms of tech as well. It uses a fleet equipped with high-resolution cameras, LiDAR, and radar systems, creating a comprehensive view of its surroundings. And don’t forget Google’s got a secret weapon. It crowdsources annotated data such as CAPTCHA codes from its massive user base, using that to train its machine-learning models. That’s a big advantage in terms of understanding complex driving environments.\n\nThe best part?\n\nThese are self-driving cars – no human drivers, no unions, no employee or contractor issues, and no human cost. While there will be other expenses, such as software development and battery costs, the absence of driver wages could lead to exceptionally high margins. Margins of 50% aren’t unrealistic when you consider that driver earnings account for a substantial portion of gross fares in traditional ride-hailing models.\n\nIf Waymo can capture about one-third of the $1 trillion autonomous rides market, it could generate annual revenues of around $300 billion. With a 50% margin, that’s a neat $150 billion in profits. What’s that worth? At a 30x earnings multiple, that would imply an additional valuation of about $4.5 trillion for Alphabet. Considering that Alphabet is worth roughly $2 trillion presently, this could take the company’s market cap to over $6.5 trillion, or over $500 per share.\n\nTo be sure, building this sort of scale can take a good deal of time – quite different from signing up for say a Google or Netflix account. However, investors will need to look well out into the future. Think 2030 (not 2025), maybe even more. The point is not to get stuck – if you’re concerned, look even further out, say 2035! The bottom line: Alphabet is growing Waymo quickly, has the technology and competitive edge, and is addressing a potentially massive market, making this high valuation within reach.\n\nSource: Alphabet To $7 Trillion By 2025? https://www.forbes.com/sites/greatspeculations/2024/10/23/alphabet-to-7-trillion-by-2025/",
        "created_utc": 1729686932.0,
        "subreddit_name": "stocks",
        "comments": 71
    },
    {
        "title": "$TSLA: The DD of a lifetime. ",
        "score": 3765,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gai1a7/tsla_the_dd_of_a_lifetime/",
        "content": "Hello, everyone! As we all know, $TSLA is having their quarterly earnings, which is a big deal for some bears. But let’s crack down on the bear party just for a second and use *logical* reasoning for why TSLA might not end up in the gutter as many would think. \n\n1. Expectations are low, just like Q1 (will get back to this later).\n2. Their shittiness is priced in already after Robotaxi event.\n3. Elon Musk is a master stock manipulator. \n\nKeeping all of this in mind, this isn’t even the *real* part of this DD. The actual, most integral part is looking at Elon Musk’s Twitter, which I decided to keep a close look on the past couple of earnings reports. \n\nOn the day of Tesla’s Q1, Elon Musk tweeted a total of 5 times, where the stock ended up going up 13% and then an additional 16% the next 2 weeks. \n\nOn the day of Tesla Q2, Elon Musk didn’t tweet **anything**, and the stock ended up falling 14%. \n\nSeems like a pattern has been drawn up, huh? Elon tweets a bit when the Tesla stock is going to moon on earnings while he’s in a cocky mood, and is dead silent when Tesla is going to fall. \n\nNow guess how many times Elon Musk has tweeted *so far* today? \n\n*15 fucking times*. \n\nYou heard that right, folks! 15 GODDAMN times. That’s triple the amount of tweets he had made on Q1, where the stock roared 13 - 15%! Meaning that Elon is much more confidence and cockier than he was in Q1! This man knows when his stock will fall and when it doesn’t, and he’s letting us know right below our own nose! \n\nAll of this is a *clear* indicator that Tesla is going to the moon today and the next week to come, regardless of whether they beat estimates or not. I’m betting that Tesla WILL beat estimates simply because of Elon Musk’s tweets and the fact that everyone has low confidence in the stock as of late. \n\nThis is your DD to buy calls. Whether you want free money or not is up to you. \n\nPositions: 15 minutes before market close, I’ll buy 3 217.5C exp. OCT. 25th. \n\n*note*: This is NOT financial advice. Any losses on $TSLA options deep OOTM is a result of your regardedness, not mine. ",
        "created_utc": 1729708815.0,
        "subreddit_name": "wallstreetbets",
        "comments": 527
    },
    {
        "title": "Tsla yolo, my final play",
        "score": 539,
        "url": "https://i.redd.it/t7foh74oikwd1.jpeg",
        "content": "I understand it doesn’t fit the rules given the position size. Mods please let it slide. I’ve been here for a while, and it’s been a ride. Decorative gourd futures, that stuffedness oreo bear indicator, mattress company that is named after a color dude, the forbidden meme ticker,god I’m gonna miss yall.  But, I rode the face ripping meme stocks, tsla moons, nvda earnings, and have nothing to show for it. I realized I’m doing this for the feeling it gives me, other than trading nothing really brings me joy. But I’m not here to be a Debbie downer, just wanted to commemorate this somewhere. To all you in the red, remember-you’re only 10 trades away from being a multimillionaire. To those few in the all time green, **congrats and fuck you** god speed autists. ***to the moon***",
        "created_utc": 1729716315.0,
        "subreddit_name": "wallstreetbets",
        "comments": 131
    },
    {
        "title": "How to become a millionaire overnight（ TSLA）",
        "score": 199,
        "url": "https://i.redd.it/47yk4zjlelwd1.png",
        "content": "",
        "created_utc": 1729727054.0,
        "subreddit_name": "wallstreetbets",
        "comments": 155
    },
    {
        "title": "It is very clear to me that WSB goes full regard when it comes to TSLA.",
        "score": 86,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gao0i1/it_is_very_clear_to_me_that_wsb_goes_full_regard/",
        "content": "Never go full regard. Stop letting your hate for musk cloud your already ill advised judgment. I’m mad because time and time again every time this dumb sub says to buy puts on TSLA, I do and I’ve finally learned my lesson.\n\n\nThese things are true:\n\n\n1) Cybertruck is not a failure. Demand is still high.\n\n\n2) FSD continues to improve and is postured better to scale than any of its competitors including wAyMo. FSD is transformational, a lot of you boneheads just refuse to admit it. FSD will be successful. But “muh LiDaR”. Shut up. You know nothing about sensors, inference, AI, etc.\n\n\n3) Tesla will be the king of EVs for the foreseeable future. No competitor is even close.\n\n\n4) Tesla continues to print money and hoard money. All this talk about “TSLA doesn’t trade on fundamentals only musk failed promises” is equally regarded. They’ve been successful at reinvesting in areas where they either created demand or already have demand. TSLA is a successful fucking company, deal with it, idiots.\n\n\n5) “But musk is a liar who manipulates the stock”. Shut up. TSLA isn’t a conspiracy. This often referenced “cult” doesn’t have enough money combined to move the stock $1.\n\n\n6) Robotaxi will turn out to be a success.\n\n\n7) Optimus is also postured to scale for practical use better than any of its competitors. It will also be a success.\n\n\nIn other words. I’m done listening to you losers.",
        "created_utc": 1729724531.0,
        "subreddit_name": "wallstreetbets",
        "comments": 257
    },
    {
        "title": "TSLA YOLO fail ",
        "score": 60,
        "url": "https://i.redd.it/vgxx0adrtkwd1.jpeg",
        "content": "Never beat against Elon kids ",
        "created_utc": 1729720044.0,
        "subreddit_name": "wallstreetbets",
        "comments": 26
    },
    {
        "title": "TSLA Earnings beat ",
        "score": 33,
        "url": "https://i.redd.it/i19yf2irgkwd1.jpeg",
        "content": "Tesla shares jump 6% on profit beat\n\n* Tesla Q3 Non-GAAP EPS of $0.72 beats by $0.12.\n* Revenue of $25.18B (+7.8% Y/Y) misses by $490M.\n* Capex: $3.51B vs. $2.46B in 3Q23. FCF: $2.74B vs. $848M in 3Q23\n* Initial Impact on Share Price +6%.\n\nTSLA Beat on profit, miss on revenue - after the bloodbath today and the elections coming up.. what’s next and how do you plan to play it?\n\nI’m heavy tech (AAPL GOOG) with a few long pot shots (lol INTC) and ofc some degen SPY/QQQ/TQQQ plays.\n\nLink to Deck: [2024 Q3 Quarterly Update Deck](https://digitalassets.tesla.com/tesla-contents/image/upload/IR/TSLA-Q3-2024-Update.pdf)",
        "created_utc": 1729715675.0,
        "subreddit_name": "wallstreetbets",
        "comments": 20
    }
]