[
    {
        "title": "GM lays off more than 1,000 salaried software and services employees",
        "score": 1189,
        "url": "https://www.reddit.com/r/stocks/comments/1ew1ewp/gm_lays_off_more_than_1000_salaried_software_and/",
        "content": "General Motors is laying off more than 1,000 salaried employees globally in its software and services division following a review to streamline the unit’s operations, CNBC has learned.\n\nThe layoffs, including roughly 600 jobs at GM’s tech campus near Detroit, come less than six months after leadership changes overseeing the operations, including former Apple executive Mike Abbott leaving the automaker due to health reasons.\n\n“As we build GM’s future, we must simplify for speed and excellence, make bold choices, and prioritize the investments that will have the greatest impact,” a GM spokesman said in an emailed statement. “As a result, we’re reducing certain teams within the Software and Services organization. We are grateful to those who helped establish a strong foundation that positions GM to lead moving forward.”\n\nGM declined to disclose the entire number of layoffs, but a source familiar with the action confirmed more than 1,000 salaried employees would be laid off, including 600 in Warren, Michigan.\n\nSource: https://www.cnbc.com/2024/08/19/gm-lays-off-more-than-1000-salaried-software-and-services-employees.html",
        "created_utc": 1724073067.0,
        "subreddit_name": "stocks",
        "comments": 259
    },
    {
        "title": "Bronze-Like iPhone 16 Pro Color Could Be Called 'Desert Titanium'",
        "score": 895,
        "url": "https://www.macrumors.com/2024/08/19/iphone-16-pro-color-desert-titanium/",
        "content": "",
        "created_utc": 1724062656.0,
        "subreddit_name": "apple",
        "comments": 177
    },
    {
        "title": "AAPL trading August so far. 08/19/24 12:19pm PDT",
        "score": 3,
        "url": "https://i.redd.it/t33llr4b8ojd1.jpeg",
        "content": "",
        "created_utc": 1724095234.0,
        "subreddit_name": "AAPL",
        "comments": 3
    }
]