[
    {
        "title": "Netflix users 'don't really care' whether content is created by Netflix, co-CEO says",
        "score": 2291,
        "url": "https://www.reddit.com/r/stocks/comments/iry8rp/netflix_users_dont_really_care_whether_content_is/",
        "content": "https://finance.yahoo.com/news/netflix-users-dont-really-care-whether-content-is-original-co-ceo-says-121745211.html\n\nDespite a coronavirus shutdown this year that temporarily halted most TV production, Netflix plans to release even more originals in 2021 than in 2020 — which would mark the latest achievement for a company’s whose massive investment in original content inspires both envy and ridicule.\n\nLast year, Netflix spent $15 billion on content, which put its investment even with ViacomCBS (VIAC) but behind Comcast (CMCSA) at $15.4 billion and Disney (DIS), which shelled out $27.8 billion — according to data compiled by Variety. The streaming giant will up its spend this year to $17.3 billion, most of which will go toward original content, said BMO Capital Markets analyst Dan Salmon in January.\n\nNetflix added nearly 26 million subscribers over the first six months of this year, bringing its total subscribers worldwide to about 193 million. By comparison, Disney Plus had 60.5 million subscribers worldwide as of Aug. 3 — though the platform has operated for a far shorter time, having launched last November.\n\nThanks for the awards.",
        "created_utc": 1600003568.0,
        "subreddit_name": "stocks",
        "comments": 391
    },
    {
        "title": "Uber is in deep shit.",
        "score": 1468,
        "url": "https://www.reddit.com/r/stocks/comments/irnwlx/uber_is_in_deep_shit/",
        "content": "Posting from my Alt.\nIf you own Uber stock, gtfo and sell while you're still ahead.  \nCountless drivers are reporting on UP and other places that Uber is not paying cancel fees to drivers and not logging the cancelled ride.   Also recently Uber has not been paying tips to drivers and when reported by a driver of the issue, Uber responded \"We are working on a fix for tips not showing up for drivers\".  In the history of Uber this is first time they mentioned tips not showing need a fix.  And yet ride fares show up just fine for drivers.  There is good reason to believe Uber is troubled due to Covid19 and lack of people travelling so Uber got rid of all phone support and fired California and other US fulltime employees.  It has only a handful of offshore support pretty much handling all issues for low pay of a few dollars an hour.",
        "created_utc": 1599955831.0,
        "subreddit_name": "stocks",
        "comments": 322
    },
    {
        "title": "Apple will not let Epic re-apply to the Developer Program for at least a year",
        "score": 8654,
        "url": "https://twitter.com/zhugeex/status/1304944442584059904?s=21",
        "content": "",
        "created_utc": 1599958227.0,
        "subreddit_name": "apple",
        "comments": 1329
    }
]