[
    {
        "title": "S&P 500 rallies 1% to all-time high, surpassing previous record set in 2022: Live updates",
        "score": 1351,
        "url": "https://www.reddit.com/r/stocks/comments/19au3bn/sp_500_rallies_1_to_alltime_high_surpassing/",
        "content": "The S&P 500 closed at an all-time high on Friday as investors returned to buying equities in force in recent days following a short-lived market stumble to start the new year.\n\nThe S&P 500 rose 1.23% to settle at 4,839.81, surpassing both the prior record intraday and closing highs. Meanwhile, the Dow Jones Industrial Average, which set its own record at the end of last year, added 395.19 points, or 1.05%. The Nasdaq Composite advanced 1.7%. The smaller, more tech-focused Nasdaq-100 gained 1.8% to also hit a record high.\n\nAll three major averages are now in positive territory for 2024, with the 30-stock Dow going green during Friday's rally.\n\nFollowing a 19% loss in 2022, the S&P 500 roared back in 2023, posting a 24% gain as the economy skirted a recession that many had expected and inflation came down to levels that allowed the Federal Reserve to pause its interest rate hikes. The benchmark came close to reaching a record following a forceful fourth-quarter rally, but ultimately fell short. The market rally paused a bit to start 2024 as investors took some profits in the Big Tech leaders like Apple.\n\nBut they returned to buying those tech leaders in recent days. Friday's milestone confirms that the stock market is officially in a bull market that began in October 2022, and not just a bounce within a bear market. The S&P 500 is up more than 35% since that low.\n\n\"In the mind of the investor, [companies] leading in AI or having a product set that's differentiated in the tech space are very, very strongly leading the market. That's been a wave that's persisted throughout the remainder of last year and into 2024,\" said Matt Stucky, chief portfolio manager at Northwestern Mutual Wealth Management.\n\nThe tech sector gained 2.1% on Friday and jumped more than 4% during the trading week, making it the S&P 500's best-performing sector week to date.\n\nWhether the broader market index can maintain its growth momentum in 2024 \"is going to be a question of whether the Fed is able to stick a soft landing or not,\" Stucky said. He noted that the driver of the S&P 500's growth in 2023 was tied to multiples, rather than earnings.\n\n\"Multiples rise coming out of economic slowdowns, because investors are pricing in a recovery. If that recovery doesn't materialize, then you do have to question the sustainability of not only holding on to new highs, but making new highs beyond that,\" Stucky added.\n\nFresh consumer data on Friday indicated that consumers are becoming more confident on the economy and inflation. The University of Michigan's Survey of Consumers showed a 21.4% year-over-year jump to reach its highest level since July 2021.\n\nInsurance company Travelers rose more than 5% after posting an earnings beat. Schlumberger gained nearly 2% after beating on top and bottom lines, and Ally Financial surged over 10% after reporting strong quarterly results and a sale of a business unit to Synchrony Financial.\n\nhttps://www.cnbc.com/amp/2024/01/18/stock-market-today-live-updates.html",
        "created_utc": 1705699202.0,
        "subreddit_name": "stocks",
        "comments": 412
    },
    {
        "title": "Apple Vision Pro prices",
        "score": 1820,
        "url": "https://www.apple.com/shop/buy-vision/apple-vision-pro",
        "content": "256GB: US$3499\n512GB: US$3699\n1TB: US$3899\n\nAppleCare+ Costa US$499",
        "created_utc": 1705669360.0,
        "subreddit_name": "apple",
        "comments": 1237
    },
    {
        "title": "Chart: Apple Ramps Up R&D Intensity to Pre-iPhone Levels",
        "score": 927,
        "url": "https://www.statista.com/chart/2502/apples-r-and-d-expenditure/",
        "content": "",
        "created_utc": 1705679461.0,
        "subreddit_name": "apple",
        "comments": 141
    },
    {
        "title": "Apple Vision Pro Repairs Cost Up to $2,400 Without AppleCare+",
        "score": 883,
        "url": "https://www.macrumors.com/2024/01/19/vision-pro-repair-cost/",
        "content": "",
        "created_utc": 1705697690.0,
        "subreddit_name": "apple",
        "comments": 217
    },
    {
        "title": "Tim Cook (@tim_cook) on X",
        "score": 692,
        "url": "https://twitter.com/tim_cook/status/1748337010191077462",
        "content": "Apple Vision Pro pre-orders begin today! We’re so excited for you to experience spatial computing for the first time!",
        "created_utc": 1705673218.0,
        "subreddit_name": "apple",
        "comments": 163
    },
    {
        "title": "In 2 yrs I blew up 20 small accounts",
        "score": 132,
        "url": "https://www.reddit.com/r/Daytrading/comments/19amsck/in_2_yrs_i_blew_up_20_small_accounts/",
        "content": "All from put options from SPY QQQ and TSLA, never had a single loss from calls… \n\nPuts are the absolute worst way to make money, it is extremely difficult if you don’t time your puts correctly, I have closed my eyes and randomly bought calls and made profit multiple time. No strategy required just buy calls when SPY or QQQ goes down and it always bounces, works best with 0dte \n\nI have bought puts at the top overbought levels and it just keeps pumping away, I have never seen SPY goes down and not have a bounce, calls = free money\n\nTLDR fuck put options\n\nSorry for the angry rant\n\nEdit: Today was a PERFECT example of what I’m talking about, it was going up with ZERO pullbacks, anywhere you got puts you would get your head taken off unless you timed your puts perfectly and took profits immediately, I’ve never seen SPY goes down the same way without some sort of bounce before going back down even during the 2022 bear market\n\nJust go on Stocktwits and see how many blew up their account buying puts on QQQ NVDA\n\nI’ve read all the positive helpful comments and took notes",
        "created_utc": 1705681079.0,
        "subreddit_name": "DayTrading",
        "comments": 152
    },
    {
        "title": "S&P500 Prints Record Highs | $SAVE $AMD $TSLA $MARA $AAPL | Most Active ...",
        "score": 2,
        "url": "https://youtube.com/watch?v=NrWEoW1A0-8&si=aW5jidHzi1rZnd3M",
        "content": "",
        "created_utc": 1705704196.0,
        "subreddit_name": "AAPL",
        "comments": 0
    }
]