[
    {
        "title": "ARKK has lost $9.586billion for its investors",
        "score": 1386,
        "url": "https://www.reddit.com/r/investing/comments/yhggir/arkk_has_lost_9586billion_for_its_investors/",
        "content": "Total inflows (ETA: Net inflows, not total inflows) into the fund since inception equal approx. $17.37billion, while total assets stand at $7.78billion as of Oct 28. That equates to a net loss of $9.59 billion.\n\n&#x200B;\n\nThe fund had most of its inflows, net inflows of $14.27billion, in the 8 months from August 2020 to March 2021.\n\n&#x200B;\n\nIt then proceeded to lose 67.82% of its value from April 2021 from $120.85/share to $38.89/share after peaking in Feb 2021 at $156.68 per share. The huge loss stems from the fact that inflows peaked around the same time as the price of the underlying shares peaked.\n\n&#x200B;\n\nThe fund has underperformed the S&P 500 by 53.7% in the last year(ARKK -67.67% vs S&P 500 -13.97%)\n\nETA since some people are defending the funds performance on account of the recent rout, the fund has underperformed the S&P 500 since inception (65.7% v 19.8% in cumulative returns). This is not a high beta strategy at all",
        "created_utc": 1667142188.0,
        "subreddit_name": "investing",
        "comments": 256
    },
    {
        "title": "How is Apple mitigating the risk of a Chinese invasion of Taiwan, which would render TSMC inoperable?",
        "score": 5,
        "url": "https://www.reddit.com/r/AAPL/comments/yhhtsz/how_is_apple_mitigating_the_risk_of_a_chinese/",
        "content": "TSMC has begun construction of a $12 billion fabrication plant, but that will not be ready for production until 2024.\n\nTSMC supplies Apple, as well as Nvidia, AMD, Qualcomm, Broadcom, and many others.\n\nI image that the most likely course of action would be for Apple to switch back to Intel (CPUs and GPUs) for its mac lineup, and perhaps Samsung for its iPhone lineup, as these two foundries would be most prepared for such types of processors at large volumes (maybe less so for Intel and its Arc graphics processors).\n\nHowever, those are just my thoughts (with not too much insight into the whole situation). Does anyone know any sources that discuss, in detail, Apple's contingency plan in the event of an invasion?\n\nThank you.",
        "created_utc": 1667145599.0,
        "subreddit_name": "AAPL",
        "comments": 2
    }
]