[
    {
        "title": "Nine US governors press U.S. lawmakers to pass 52 Billion semiconductor funding bill. Taiwan unreliable potentially trillions at risk.",
        "score": 2696,
        "url": "https://www.reddit.com/r/stocks/comments/qrvyuc/nine_us_governors_press_us_lawmakers_to_pass_52/",
        "content": ">https://www.governor.pa.gov/newsroom/governor-wolf-bipartisan-governors-urge-congress-to-pass-chips-act-to-create-american-jobs-boost-semiconductor-production/\n\nSo far the shortage has cost 2.2 Million vehicles. That could just be a tiny fraction if Taiwan has more serious future issues such as natural disasters or China invasion, which could cost businesses TRILLIONS in damages to companies such as:  Ford (F) , General Motors (GM) , and Toyota (TM), Dell Technologies (DELL),  Apple (AAPL), Google (GOOGL), AMD, NVDA, and many more.\n\n\n>The group, which also includes the governors of auto-producing states like Alabama, said the shortage had cost automakers 2.2 million vehicles and affected 575,000 jobs in the industry.\n\n>The semiconductor funding passed the U.S. Senate earlier this year by 68-32 as part of the broader U.S. Innovation and Competition Act, or USICA. But it has not passed the House of Representatives.\n\n\n\nhttps://www.reuters.com/world/us/nine-governors-press-us-lawmakers-pass-semiconductor-funding-bill-2021-11-10/\n\nEdit: this news has been censored and removed from:  r/finance r/Economics r/StockMarket . Youve got to hope it isnt because their mods support Taiwan at the expense of the stability of the USA.",
        "created_utc": 1636667425.0,
        "subreddit_name": "stocks",
        "comments": 567
    },
    {
        "title": "I’m a importer, in my point of view, the true cost of inflation isn’t there’s too much money, it’s because—",
        "score": 3036,
        "url": "https://www.reddit.com/r/stocks/comments/qriwag/im_a_importer_in_my_point_of_view_the_true_cost/",
        "content": "It’s because the logistic is a nightmare right now. \n\nI import things from China. There are thousands of companies like mine. We are the one that sells shit to ur the distributors, the distributors sells to stores. We are also the one directly sells on Amazon and other e-commerce website. \n\nPre COVID, a 40ft high cube costs me only $4000 from China to Long Beach. Currently it costs me god damn $20000, and that doesn’t include land transport. If I want to sent a container of goods to Ohio, the total cost on shipping alone is like $40000, excluding import duties. Back in the day shipping make up abt 30% of my cost, it makes up 60-70% now. Pre COVID a container of nice double layer fleece lining hoodies cost me 60k includes shipping. It costs me 100k this year. \n\nThere are 110 some container ships stuck outside of Long Beach. You probably have no idea how many that is..ima use the nice fleece lining hoodies as example again. Each 40ft high cube carry’s 6000 this hoodie (so 20ft carry abt 3000). Each ship carry 20000 TEU (20ft equivalent units). there are also some 2 million TEU still in the port waiting to be hauled.. \n\nLet’s do the math\n\n3000*20000=60 million hoodies \n110*20000=2.2million containers on ship stuck outside still. \n2.2million+2million=4.2 millions on containers total. \n4200000*60000000=252000000000000\n\nUS population is 333000000 \nThat’s 756 thousand hoodies for each person just stuck there waiting to be distributed! \n\nLet’s say my number is off by 50%, it’s still 378 thousands hoodies just stuck there! \n\nWe can’t unload at Houston or New York cuz it will cost us even more… \n\nThe problem Is not the demand, it’s supply. \n\nIt’s not that there are too many monies were printed, who cares if we print more money, we can print unlimited useless pieces of paper and buy real goods from China ( export our Inflation)!\n\nSo, if u see on the news that the supply chain has been fixed, or the port of Long Beach has been cleared, or you know inflation is about to stapled.. until that , whatever the fed say is bs.\n\nSide note Biden should declare national emergency and have nat guard come in and help haul these stucked goods.\n\n\nEdit-----\nGuys, sorry I did this math before I went to sleep on my phone.\n\nMy math is wrong.\n\nIt should be\n\n3000*(110*20000+2000000)\n\n=3000*4200000\n\n=12600000000 hoodies\n\n12600000000/333000000=38.18 hoodies per person.\n\nMy math is wrong but the fact still stands. Thank you Shmeepsheep for catching my mistake.",
        "created_utc": 1636628676.0,
        "subreddit_name": "stocks",
        "comments": 1036
    }
]