[
    {
        "title": "r/Stocks Daily Discussion & Fundamentals Friday Nov 22, 2024",
        "score": 15,
        "url": "https://www.reddit.com/r/stocks/comments/1gx4upj/rstocks_daily_discussion_fundamentals_friday_nov/",
        "content": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.\n\nExpect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nBut growth stocks don't rely so much on EPS or revenue as long as they beat some other metric like subscriber count:  Going from 1 million to 10 million subscribers means more revenue in the future.\n\nValue stocks do rely on earnings reports, investors look for wall street expectations to be beaten on both EPS & revenue.  You'll also find value stocks pay dividends, but never invest in a company solely for its dividend.\n\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia page](https://www.investopedia.com/fundamental-analysis-4689757/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp) and read [their PDF on the topic.](http://i.investopedia.com/inv/pdf/tutorials/fundamentalanalysis_intro.pdf)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1732271412.0,
        "subreddit_name": "stocks",
        "comments": 245
    },
    {
        "title": "Indonesia wants Apple to sweeten its $100 million proposal as tech giant lobbies for iPhone 16 sales",
        "score": 22,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gxkjsx/indonesia_wants_apple_to_sweeten_its_100_million/",
        "content": "“Apple’s iPhone 16 model doesn’t meet Indonesia’s 40% domestic content requirements for smartphones and tablets and hasn’t been granted clearance to be sold in the country. \n\nAccording to Indonesian state media, the government is looking for more than the $100 million in investments the American tech giant has proposed.”\n\nSource: https://www.cnbc.com/2024/11/22/indonesia-wants-apple-to-sweeten-its-100-million-proposal-as-tech-giant-lobbies-for-iphone-16-sales.html",
        "created_utc": 1732315419.0,
        "subreddit_name": "wallstreetbets",
        "comments": 10
    },
    {
        "title": "AMD: The $145 Recovery Rally is Coming Next Week",
        "score": 230,
        "url": "https://www.reddit.com/r/stocks/comments/1gxj8ob/amd_the_145_recovery_rally_is_coming_next_week/",
        "content": "**The Why**\n\n* **Earnings beat** revenue expectations with $6.82B (+18% YoY) and EPS of .92 (+31% YoY and spot on with projection) \n* Data center revenue surged **+122%**, proving AMD is gaining AI momentum.\n* Recent selloff (-$30/share) was a **market overreaction** to slightly soft Q4 guidance.\n* The market shifted focus to NVIDIA's upcoming earnings stalling an AMD rally.\n* **Catalysts**: Workforce optimization, IBM partnership, and AI-focused leadership changes.\n\n# The Setup\n\nAMD is streamlining its org for an **AI-dominated future**:\n\n1. **Reduction in Force**: Cutting 4% of workforce to focus on AI chip development.\n2. **New Leadership**: CFO transition positions AMD for its next growth phase.\n3. **IBM Partnership**: MI300X accelerators are now a key piece of IBM Cloud’s AI stack.\n\n# The Target\n\nWith analysts targeting **$160-$180** and the market ready to refocus on AMD’s strengths, **$145+ next week is on the table**. This dip is a gift. The rally is coming. Get ready!",
        "created_utc": 1732311868.0,
        "subreddit_name": "stocks",
        "comments": 151
    },
    {
        "title": "YOLO $MARA Play until March ",
        "score": 45,
        "url": "https://www.reddit.com/gallery/1gxjqpb",
        "content": "Still riding my $MARA Calls. Still allin with all my savings. \n\nI will probably take first profits at $36-38 or rotate them to Calls which have a later expiration date. \n\nSmallest Position:\n44c 17.01.2025\n\nMid Position:\n27.5c 20.12.2024\n\nBiggest position:\n36c 21.03.2025\n\nI have a banbet for Wednesday with $28 for $MARA \n\nI am bullish about Bitcoin. I think we will see 130-135k until mid February. \n\nMiners will outperform now. They have a big catch up to do. \n\nMy AI friend helps me to see if my thesis is still on track for my calls:\n\n„Based on previous calculations, the average simulated price for December 18 would now likely exceed $45, further emphasizing the bullish outlook.“\n\nNo financial advice ",
        "created_utc": 1732313218.0,
        "subreddit_name": "wallstreetbets",
        "comments": 47
    },
    {
        "title": "$U - A potential game engine comeback story.",
        "score": 14,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gxj4i7/u_a_potential_game_engine_comeback_story/",
        "content": "Wanted to try it out so here's my first 'analysis'! Let me know if my points are valid and if my structuring is good or not.\n\nFirstly for some background information, $U or Unity Software Inc is primarily game engine company where although producing a relatively good game engine, has made some incredibly poor choices - such as mass layoffs and diverging from their engine to focus more on advertising, merging with Iron Source. The company peaked in value November '21 at almost $200 (USD) where the company began merging with other companies, months after the decently successful IPO - the first merger being with Weta Digital. After that peak, it was all downhill from there tumbling into the $40s over the course of two years, where Unity made gaming history by announcing the runtime fee. This lead to the regarded CEO resigning (the CEO that once ran EA, go figure) and most of management being fired, with major restructuring a few months after occurring under interim CEO Jim Whitehurst and then Matthew Bromberg, where they promised to work on what truly mattered, the engine itself.\n\nIn recent times, Unity has made great strides in their engine with massive new features on the way - promising better performance (they don't say it, but they subtly hint it in their advertising that Unity is the engine for good performance, as opposed to Unreal), and new innovative uses of that big A word that investors climax over. They announced Unity 6, their big update and reversion back to a normal naming system as opposed to their weird yearly naming scheme (which was objectively bad for pressuring new releases on a yearly schedule), and announced 6.1 with some features currently in alpha releases, and some credible promises for later big versions which they appear committed on.\n\nOverall, they seem to be on a comeback, at least on the engine side. Financially, they've been recovering from the whole runtime debacle (around Q4-23) where the next quarter being their first missed earnings for a while, by quite a bit as well. Where only recently in Q2-24 have they started to beat the target and are on track to go above $0 per share in the next two years. In addition, as a result of the cancellation of the runtime fee and the new CEO reaching out to businesses and the community, growth has been re-sparked. Moreover, their profits from their engine have increased 5% year over year and is still going strong. In the recent Q3 earnings their total profits in EBITDA is over 10% over their initial estimate of $70-80m at $92m.\n\nMy verdict, is that the company under its new leadership has shifted its focus towards the user. They are focussing on updating their engine without hurting users using older features, and are in the testing phases of new AI technologies for both advertising (reducing ROI and boosting user acquisition + monetary gain), and game development (with two AI systems for both helping developers make games, and running AI within games for either NPCs or game systems). Thus, after a 'company reset' they seem to be on the track to make a profit and become the defacto game engine - one that won't be made fun of crappy games.\n\nDisclaimer - this is not financial advice. I'm a game developer and I enjoy using their engine (which is how I can say the engine is getting far better in recent releases for engine users), I recently got into trading/investing and I read these analysis posts or bets, and I decided to try one out myself.\n\nHow'd I do?\n\nEdit: MB forgor to say my position. I'm dirt poor so I put $70 in Unity at around $17usd with 5x leverage... if that means anything to u guys?",
        "created_utc": 1732311554.0,
        "subreddit_name": "wallstreetbets",
        "comments": 13
    },
    {
        "title": "C3AI begins to turn the tide",
        "score": 64,
        "url": "https://www.reddit.com/r/stocks/comments/1gx8r3n/c3ai_begins_to_turn_the_tide/",
        "content": "C3.ai shares jumped 25% in a single day on the announcement of a deeper partnership with Microsoft. The new agreement clarifies Microsoft Azure as C3.ai's preferred cloud services platform and C3.ai's AI applications as Azure's preferred enterprise solutions. Although the two have been working together since 2018, this announcement pushes the market's focus on its AI potential higher.\n\nUnderestimated potential: c3.ai's revenue grew 21% in the quarter and is expected to grow 24% going forward. Current market capitalization is \\~$4 billion and trades at a multiple of 11x its FY2025 revenue target.\n\nPilots: The company has 224 pilots, 85% of which are active, representing a 117% year-over-year increase in the number of pilots. 70% of pilots are expected to be converted into formal contracts.\n\nFuture Potential: Revenues are expected to pick up to 30% from current growth rates through pilots to formal deals. 2026 FY projected revenue target is $462 million, with a share price potential of up to $36 if it reaches an 8x EV/revenue valuation.\n\nWhile the partnership has boosted market enthusiasm, I would wait for market sentiment to pull back before getting in. In addition, the conversion of pilots to full-fledged programs is key to future growth.\n\n\n\n[C3.ai](http://C3.ai) will release its latest earnings report on Dec. 9, so watch for sales growth and pilot conversion to further assess its potential.",
        "created_utc": 1732284810.0,
        "subreddit_name": "stocks",
        "comments": 51
    },
    {
        "title": "Are we putting too much faith in generative AI? Could this hurt AI investments more broadly?",
        "score": 32,
        "url": "https://www.reddit.com/r/stocks/comments/1gxezqq/are_we_putting_too_much_faith_in_generative_ai/",
        "content": "Obviously a lot of money is being made off of AI-related stocks. I'm not one of those lucky investors. Part of the reason is that I fear we're not in a general AI bubble, as many have discussed, but rather a *generative AI* bubble. I'd appreciate hearing how others feel about this.\n\nRight now, by far the bulk of investment is focused on generative AI (especially LLMs), with NVDA at or very near the center of it all, thanks to its GPUs. Meanwhile, alternative AI approaches (e.g., neuromorphic computing, symbolic AI, reinforcement learning, and hybrid models) have been getting far less attention.\n\nThe problem? As impressive as it may seem, generative AI has some significant (and inherent) drawbacks:\n\n* Factually unreliable outputs (it can’t reliably distinguish fact from fiction)\n* Probabilistic reasoning (no true causal understanding)\n* High computational costs (questionable sustainability)\n* Limited real-world problem-solving abilities\n\nAt some point, the reality of generative AI's limitations will become apparent enough to investors that we could see an AI market correction or even collapse. This would not only hurt AI stocks like NVDA, but it could also starve funding for alternative AI approaches that have long-term potential yet have been largely overlooked.\n\nWhat do you think? How is this influencing your investment decisions?",
        "created_utc": 1732300870.0,
        "subreddit_name": "stocks",
        "comments": 31
    },
    {
        "title": "If a new product is brought to market, is it's value additive? Or does it always have to take from the market cap of another company?",
        "score": 6,
        "url": "https://www.reddit.com/r/stocks/comments/1gx1bkr/if_a_new_product_is_brought_to_market_is_its/",
        "content": "For instance, with AI. Is the market stuck with the money thats in circulation? Or can the value of the new product add to the overall market value? I guess another way to ask is Does VT increase when there's an IPO? Sorry if this is a dumb question, still learning and I felt this might be too specific for the wiki",
        "created_utc": 1732255910.0,
        "subreddit_name": "stocks",
        "comments": 5
    },
    {
        "title": "Big win with $hims, FDA didn’t side with pharma like everyone thought they would💊📈\n",
        "score": 75,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gx0t1m/big_win_with_hims_fda_didnt_side_with_pharma_like/",
        "content": "**Background:**\n\n* **GLP-1 Demand :** Wegovy (Novo) and Zepbound are dominating the branded weight-loss markets but face demand that they cannot keep up with.\n* **Trump’s Legacy:** Under the Trump administration, rules around drug compounding were clarified, allowing pharmacies to fill gaps during shortages. Now, these policies will be central to ongoing lawsuits ([see this executive order](https://trumpwhitehouse.archives.gov/presidential-actions/executive-order-ensuring-essential-medicines-medical-countermeasures-critical-inputs-made-united-states/?utm_medium=email&utm_source=ncl_amplify&utm_campaign=230724-agenda47_returning_production_of_essential_medicines_back_to_america_and_ending_bidens_pharmaceutical_shortages&utm_content=ncl-7CGRrbfsEr&_nlid=7CGRrbfsEr&_nhids=NJKu9Lb)).\n* **FDA issues:** The FDA pulled tirzepatide (Zepbound/Mounjaro) from the shortage list in October but has since walked back on this after legal challenges, extending the compounding window significantly.\n\n**Why It Matters:**\n\n* **HIMS’ Edge:** FDA uncertainty + Trump-era compounding policies = opportunity for HIMS to take over affordable GLP-1 market.\n* **GLP-1 Customer base:** There are even more GLP-1 customers than expected which leaves a huge opportunity to take advantage of.  There is [over 6% of the U.S.](https://www.kff.org/health-costs/poll-finding/kff-health-tracking-poll-may-2024-the-publics-use-and-views-of-glp-1-drugs/#:~:text=Overall%2C%2012%25%20of%20adults%20say,Obesity%20Drugs%20for%20Racial%20Disparities) taking a variant of it currently.\n* **Hims Undervalued:** Hims is currently significantly undervalued due to the risk of lawsuits and competitors. My research into their competitors showed that they are not great considering some like RO health require a $145 month subscription to be prescribed GLP-1 which is another $300 a month subscription on top of that vs HIMS being a flat rate $200 a month which includes free chatting with a doctor anytime.\n* **Hims In-house Compounding Advantage:** Hims acquired their own [compounding pharmacy](https://news.hims.com/newsroom/building-our-pharmacy-operations-with-the-customer-in-mind) to produce their drugs. This allows them to control the quality and ensure their customers get what they order which is important with compounded drugs. They recently got a [global head of quality & safety](https://investors.hims.com/news/news-details/2024/Hims--Hers-Appoints-Tenured-Pharmaceutical-Regulatory-and-Quality-Experts-to-Key-Leadership-Positions/default.aspx) who has over 30 years in pharma and FDA so the FDA cannot say it is unsafe to compound.\n* **Big Pharma Hit:** Lilly and Novo stocks have been tumbling for the past few months due to the wavering support for Medicare/Medicaid covering their drugs for anti-obesity which is now very unlikely to pass with RFK being staunchly against it. It is still possible to get it if you have an added health benefit like Obesity + diabetes etc.\n\n**Takeaway:**\n\n* FDA delays + Trump rules = lifeline for $HIMS. The compounded drug wave could crash if regulators tighten up but the price is already undervalued. This becomes more unlikely further into the Trump presidency as cutting off a European company that has the GDP of Denmark aligns with their goals.\n\nOh, and Hims added meal replacements today. Branching out and adding more streams of revenue that align with their goals is a +1 in my book.\n\n**TL;DR**: Hims & Hers ($HIMS) was up 11% as the FDA delayed its decision on Eli Lilly’s ($LLY[) Zepbound and Mounjaro shortage status](https://www.barrons.com/articles/eli-lilly-zepbound-wegovy-hims-hers-stock-8e6d9861). This pause keeps compounders going and sets precedence for HIMS when Semaglutide is removed from shortage list. There is also Trumps past executive order which will most likely be pushed through to this situation if the court cases are dragged out. European companies like Novo would be significantly impacted by this and the trump administration will take this as a win.\n\nPositions:\n\n1500 shares & 10 calls @$20 1/16/26",
        "created_utc": 1732253950.0,
        "subreddit_name": "wallstreetbets",
        "comments": 45
    },
    {
        "title": "Is nuclear space is the next new frontier in AI race?",
        "score": 32,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gwvd2a/is_nuclear_space_is_the_next_new_frontier_in_ai/",
        "content": "Is smart money shifting away from mag 7 to nuclear stocks? Lately, there is big momentum into nuclear stocks supported by volume and sustained rally. Take a look at CCJ SMR NNE OKLO.\n\nRecently FN Media quoted that Industry insiders are saying that “the next big artificial intelligence opportunity could be Nuclear Power. As AI continues to drive unprecedented advancements across industries, the demand for robust, energy-efficient infrastructure to support AI computations has skyrocketed. Data centers, the backbone of the AI revolution, consume immense amounts of energy to power and cool their servers. To sustain this growth sustainably, companies are increasingly turning to nuclear power—an energy source capable of providing gigawatt-scale, low-cost, and low-emission electricity continuously.”\n\nNuclear energy can not only meet the massive energy demands but also aligns with global sustainability goals. Personally, I have shifted $$ to URA and continue to profitably trade many of these nuclear stocks. CCJ continues to be one my favorites in this space. Look at its 4hr chart. Sounds like it is ready to explode.\n\nhttps://preview.redd.it/0z6fzq1poc2e1.png?width=3002&format=png&auto=webp&s=c60f974ed9e097ee190fce47d2b31ef09a11510f\n\nCCJ 4 hour chart.",
        "created_utc": 1732236629.0,
        "subreddit_name": "wallstreetbets",
        "comments": 77
    },
    {
        "title": "Intuit shares drop as quarterly forecast misses estimates due to delayed revenue",
        "score": 38,
        "url": "https://www.reddit.com/r/stocks/comments/1gwxwu8/intuit_shares_drop_as_quarterly_forecast_misses/",
        "content": "Intuit shares fell 6% in extended trading Thursday after the finance software maker issued a revenue forecast for the current quarter that trailed analysts’ estimates due to some sales being delayed.\n\nHere’s how the company performed in comparison with LSEG consensus:\n\nEarnings per share: $2.50 adjusted vs. $2.35 expected\n\nRevenue: $3.28 billion vs. $3.14 billion\n\nRevenue increased 10% year over year in the quarter, which ended Oct. 31, according to a statement. Net income fell to $197 million, or 70 cents per share, from $241 million, or 85 cents per share, a year ago.\n\nWhile results for the fiscal first quarter topped estimates, second-quarter guidance was light. Intuit said it anticipates a single-digit decline in revenue from the consumer segment because of promotional changes for the TurboTax desktop software in retail environments. While that will affect revenue timing, it won’t have any impact on the full 2025 fiscal year.\n\nIntuit called for second-quarter earnings of $2.55 to $2.61 per share, with $3.81 billion to $3.85 billion in revenue. The consensus from LSEG was $3.20 per share and $3.87 billion in revenue.\n\nFor the full year, Intuit expects $19.16 to $19.36 in adjusted earnings per share on $18.16 billion to $18.35 billion in revenue. That implies revenue growth of between 12% and 13%. Analysts polled by LSEG were looking for $19.33 in adjusted earnings per share and $18.26 billion in revenue.\n\nRevenue from Intuit’s global business solutions group came in at $2.5 billion in the first quarter. The figure was up 9% and in line with estimates, according to StreetAccount. Formerly known as the small business and self-employed segment, the group includes Mailchimp, QuickBooks, small business financing and merchant payment processing.\n\n“We are seeing good progress serving mid-market customers in MailChimp, but are seeing higher churn from smaller customers,” Sandeep Aujla, Intuit’s finance chief, said on a conference call with analysts. “We are addressing this by making product enhancements and driving feature discoverability and adoption to improve first-time use and customer retention.”\n\nBetter outcomes are a few quarters away, Aujla said.\n\nCreditKarma revenue came in at $524 million, above StreetAccount’s $430 million consensus.\n\nAt Thursday’s close, Intuit shares were up about 9% so far in 2024, while the S&P 500 has gained almost 25% in the same period.\n\nOn Tuesday Intuit shares slipped 5% after The Washington Post said President-elect Donald Trump’s proposed “Department of Government Efficiency” had discussed developing a mobile app for federal income tax filing. But a mobile app for submitting returns from Intuit is “already available to all Americans,” CEO Sasan Goodarzi told CNBC’s Jon Fortt.\n\nGoodarzi said on CNBC that he’s personally communicating with leaders of the incoming presidential administration.\n\nOn the earnings call, Goodarzi sounded optimistic about the economy.\n\n“Our belief, which is not baked into our guidance, is that we will see an improved environment as we look ahead in 2025, particularly just with some of the things that I mentioned earlier around just interest rates, jobs, the regulatory environment,” he said. “These things have a real burden on businesses. And we believe that a better future is to come.”\n\nSource: https://www.cnbc.com/2024/11/21/intuit-intu-q1-earnings-report-2025.html",
        "created_utc": 1732244313.0,
        "subreddit_name": "stocks",
        "comments": 0
    },
    {
        "title": "Thoughts on building a 10Y high risk portfolio",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1gx83cf/thoughts_on_building_a_10y_high_risk_portfolio/",
        "content": "Over the past few years I’ve built a portfolio consisting of S&P, Apple, Meta, Amazon, Microsoft, JPM and BRK. It has done rather well, consistently giving returns of 25%+ annually (except 2022). \n\nHowever in recent times my conviction on adding more capital to this portfolio has waned. I just feel the best days in terms of returns for some of the big tech groups may not be what they were for the past decade.\n\nI could 100% be wrong and there is no doubt there is certain bias seeing the return of my smaller positions this year dwarfing the ones of the traditional blue chip guys if you will.\n\nSo saying all this I’m considering: \n\n50% S&P\n\n10% Hood\n\n10% Rddt\n\n10% Rolls Royce\n\n10% Cava\n\n5% Lunr\n\n5% ASTS\n\nQuick rationale for each:\n\nHood: Expanding to Europe and offering very exciting new products like Hood Gold \n\nRddt: Fastest growing social media, ARPU and monetisation only getting better and seeing many more people using\n\nRolls Royce: Slight European exposure, building low cost Nuclear plants and capturing the wide body aircraft market\n\nCava: Fantastic management, strong customer retention and expected to double stores in next 5 years\n\nLunr & ASTS: Moonshot (literally), this is just in case space works out and much more speculative \n\n\n\nSo having said all that, what is everyone’s thoughts on this proposed portfolio allocation. Is this too risky, not enough diversification into the different sectors? Any thoughts and opinions on this would be great!",
        "created_utc": 1732282858.0,
        "subreddit_name": "stocks",
        "comments": 33
    },
    {
        "title": "Investing in What You Know: Modern Tools for Finding Hidden Gems",
        "score": 11,
        "url": "https://www.reddit.com/r/investing/comments/1gww4no/investing_in_what_you_know_modern_tools_for/",
        "content": "In 'One Up On Wall Street' (great book, highly recommend) Peter Lynch emphasizes the idea of \"investing in what you know\". Specifically, he talks about how some of his best investing ideas initially came from a friend or family member raving about a particular product:\n\n>*\"Taco Bell, I was impressed with the burrito on a trip to California; La Quinta Motor Inns, somebody at the rival Holiday Inn told me about it; Volvo, my family and friends drive this car; Apple Computer, my kids had one at home and then the systems manager bought several for the office; Service Corporation International, a Fidelity electronics analyst (who had nothing to do with funeral homes, so this wasn’t his field) found on a trip to Texas; Dunkin’ Donuts, I loved the coffee; and recently the revamped Pier 1 Imports, recommended by my wife. In fact, Carolyn is one of my best sources. She’s the one who discovered L’eggs.”*\n\nAccording to Lynch, this is the key advantage retail investors have over Wall Street: spotting great products and brands in their daily lives, often long before they arrive on an Investment analyst's desk.\n\nI'm wondering whether this process can be modernised, and expanded.\n\nOne challenge I face, for instance, is that I don’t live in the U.S., so the American products I notice are often already global, and likely already on Wall Street’s radar. This limits my ability to discover the kind of early opportunities Lynch described if I want to invest in American companies. \n\nSame goes for brands in Asia or Africa—surely there are great companies out there, future ten-baggers, but many of us won't come across simply because we're not exposed to their products, and by the time we are we've missed the boat.\n\nI’m curious if people know of tools or methods to help identify these hidden gems. \n\nPerhaps something like an online product rating site or resource for finding universally loved brands that haven’t gone mainstream yet. I’ve thought about using tools like Amazon's “top rated” section, but reviews can be manipulated, and often it's just Chinese tat you can't invest in. I also checked out r/buyitforlife, but it’s not quite what I'm after.\n\nThoughts?\n\nAnd please no \"put it all in VOO and come back in 80 years\". Yes most of my money is already in Index funds. This is an investing sub, and people should be interested in investment discussion, not just parroting the same old Bogleheads shit ad nauseam.",
        "created_utc": 1732238885.0,
        "subreddit_name": "investing",
        "comments": 4
    },
    {
        "title": "Considering building a new 10Y high risk portfolio. Any thoughts? ",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gx88cw/considering_building_a_new_10y_high_risk/",
        "content": "Over the past few years I’ve built a portfolio consisting of S&P, Apple, Meta, Amazon, Microsoft, JPM and BRK. It has done rather well, consistently giving returns of 25%+ annually (except 2022). \n\nHowever in recent times my conviction on adding more capital to this portfolio has waned. I just feel the best days in terms of returns for some of the big tech groups may not be what they were for the past decade.\n\nI could 100% be wrong and there is no doubt there is certain bias seeing the return of my smaller positions this year dwarfing the ones of the traditional blue chip guys if you will.\n\nSo saying all this I’m considering: \n\n50% S&P\n\n10% Hood\n\n10% Rddt\n\n10% Rolls Royce\n\n10% Cava\n\n5% Lunr\n\n5% ASTS\n\nQuick rationale for each:\n\nHood: Expanding to Europe and offering very exciting new products like Hood Gold \n\nRddt: Fastest growing social media, ARPU and monetisation only getting better and seeing many more people using\n\nRolls Royce: Slight European exposure, building low cost Nuclear plants and capturing the wide body aircraft market\n\nCava: Fantastic management, strong customer retention and expected to double stores in next 5 years\n\nLunr & ASTS: Moonshot (literally), this is just in case space works out and much more speculative\n\nSo having said all that, what is everyone’s thoughts on this proposed portfolio allocation. Is this too risky, not enough diversification into the different sectors? Any thoughts and opinions on this would be great!",
        "created_utc": 1732283264.0,
        "subreddit_name": "investing",
        "comments": 3
    },
    {
        "title": "Need some advice on where to invest $3 million",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gxdb1b/need_some_advice_on_where_to_invest_3_million/",
        "content": "\nRecently my uncle passed away very unexpectedly. He left behind 3 million I believe in his portfolio. My aunt doesn’t know what to do with this money. I have been learning about stocks for a little over a month now, just reading some books and trading myself. I have made $500 when Trump got elected and because of this I guess my family thinks i’m the most qualified to give advice on what to do. I’m only 20 with 10k to my name and now it sounds like they are ready to make big financial decisions based off of what I say. I really need advice on what to do here cause I honestly have no idea. It seems he is already getting $48,000 a year off dividends. I just got off the phone with my Mom and my aunt seems most concerned with securing a method of getting passive income, so I suggested investing into dividend focused index funds. I also told them they could put the money into something like VOO if they want growth. I don’t know if this is even good advice for $3 million, to me thats more money than I can even comprehend. My mom said shes gonna send me the company’s he was invested into to make sure they are good companies, and I have no idea how to do that but I just said I’ll look cause they seem to be understandably upset and I didn’t want to just say no. I’m in way over my head on this so any advice will be greatly appreciated. My mom said she is literally going to write down what I say. If anyone is wondering why they won’t get a financial advisor, it is because they don’t want to pay them large percentages of the money. ",
        "created_utc": 1732296685.0,
        "subreddit_name": "investing",
        "comments": 13
    },
    {
        "title": "Supreme Court steps into fight over FCC's $8 billion subsidies for internet and phone services",
        "score": 2472,
        "url": "https://apnews.com/article/supreme-court-fcc-subsidies-telecommunications-01fe0754c2bf71d17d34bde21a3825de",
        "content": "",
        "created_utc": 1732319568.0,
        "subreddit_name": "technology",
        "comments": 159
    },
    {
        "title": "Indonesia wants Apple to sweeten its $100 million proposal as tech giant lobbies for iPhone 16 sales",
        "score": 10,
        "url": "https://www.cnbc.com/2024/11/22/indonesia-wants-apple-to-sweeten-its-100-million-proposal-as-tech-giant-lobbies-for-iphone-16-sales.html",
        "content": "",
        "created_utc": 1732315221.0,
        "subreddit_name": "technology",
        "comments": 1
    },
    {
        "title": "iPhone 17 and 'iPhone 17 Air' Expected to Lack 5x Optical Zoom Lens",
        "score": 646,
        "url": "https://www.macrumors.com/2024/11/22/iphone-17-and-17-air-said-to-lack-5x-optical-zoom/",
        "content": "",
        "created_utc": 1732311693.0,
        "subreddit_name": "apple",
        "comments": 176
    },
    {
        "title": "Indonesia rejects Apple's $100 million bid to lift the iPhone 16 ban",
        "score": 2746,
        "url": "https://appleinsider.com/articles/24/11/22/indonesia-rejects-apples-100-million-bid-to-lift-the-iphone-16-ban",
        "content": "",
        "created_utc": 1732277602.0,
        "subreddit_name": "apple",
        "comments": 705
    },
    {
        "title": "EU closes antitrust probe into Apple's e-book and audiobook rules after complaint withdrawn ",
        "score": 349,
        "url": "https://techcrunch.com/2024/11/22/eu-closes-antitrust-probe-into-apples-e-book-and-audiobook-rules-after-complaint-withdrawn/",
        "content": "",
        "created_utc": 1732295028.0,
        "subreddit_name": "apple",
        "comments": 31
    },
    {
        "title": "Apple Intelligence On-device vs Cloud features",
        "score": 97,
        "url": "https://www.reddit.com/r/apple/comments/1gxhsx7/apple_intelligence_ondevice_vs_cloud_features/",
        "content": "Edit: thank you EVERYONE who asked questions and helped out with testing some of these features, I'll make a post tomorrow clearly outlining what's on-device and what's online because we all deserve that level of privacy disclosure!\n\nSo I've been trying out Apple Intelligence on the stable build for macOS. For basic stuff it seems pretty nice, the notification summaries are cool etc.\n\nI would like to understand what features EXACTLY are on-device vs using private cloud compute. This is what I know so far through experimentation (by turning off internet):\n\n**Writing Tools:**\n\n* **On-device:** Proofread, rewrite, friendly, professional, concise\n* **PCC:** Summary, key points, list, table\n\n**Mail:**\n\n* **On-device:** Email preview summaries, Priority emails\n* **PCC:** Email summarization, smart reply\n\n**Messages:**\n\n* **On-device:** Message preview summaries, Smart reply\n\n**Siri:**\n\n* **On-device:** (I was able to ask about emails and calendar events)\n\n**Safari:**\n\n* **PCC:** Web page summaries\n\n**Notes:**\n\n* **PCC:** Audio recording summaries\n\n**Photos:**\n\n* **On-device:**\n   * Intelligent search (after indexing)\n   * Clean up (after downloading the clean-up model)\n\n**Notifications/Focus:**\n\n* **On-device:** Notification summaries, Reduce interruptions focus\n\nDoes anyone have any insight on this? And is there any way I can restrict Apple intelligence from using the internet so I can only use the on-device features? Thanks!",
        "created_utc": 1732308057.0,
        "subreddit_name": "apple",
        "comments": 52
    },
    {
        "title": "Daily Advice Thread - November 22, 2024",
        "score": 8,
        "url": "https://www.reddit.com/r/apple/comments/1gx5a3l/daily_advice_thread_november_22_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1732273233.0,
        "subreddit_name": "apple",
        "comments": 41
    },
    {
        "title": "Magic Mouse 2024 (USB-C) requires latest macOS Sequoia!",
        "score": 1019,
        "url": "https://i.redd.it/9dwrxfxjog2e1.jpeg",
        "content": "Just bought the 2024 version of Magic Mouse (with USB-C) and I was dumb enough to not knowing beforehand that it requires macOS Sequoia at latest version to be fully functional!\n\nMy Mac is still on Sonoma and this new MM is recognized only as a generic mouse, no gesture or scrolling possible! Now I have to proceed with the upgrade which I don’t like as Sonoma is quite stable to me 😐.\n\nThis mouse is identical to its Lightning sibling right (of course except for the port)? Then why did Apple try to limit its functionality to macOS 15.1 and above?",
        "created_utc": 1732284956.0,
        "subreddit_name": "mac",
        "comments": 303
    },
    {
        "title": "remember RAM doubler? Could something similar be programmed nowadays for MacOS?",
        "score": 566,
        "url": "https://i.redd.it/24tvxu43oc2e1.jpeg",
        "content": "",
        "created_utc": 1732236463.0,
        "subreddit_name": "mac",
        "comments": 118
    },
    {
        "title": "My new M4 Pro iMac Pro",
        "score": 567,
        "url": "https://www.reddit.com/gallery/1gwz56e",
        "content": "Using a twelve-south back pack on my Studio Display to rest and hide the M4 Pro Mac Mini. Clean and powerful. \n\n",
        "created_utc": 1732248250.0,
        "subreddit_name": "mac",
        "comments": 36
    },
    {
        "title": "How does the M4 Max MacBook Pro compare to the M2 Ultra? ",
        "score": 14,
        "url": "https://i.redd.it/2zgz7grboi2e1.jpeg",
        "content": "Ready to upgrade my 2017 MacBook Pro, I need something to be able to render pretty complicated video files from AfterEffects. Currently it takes my laptop about 3 hours sometimes for a 6 min video so I know it's time. \n\nMy husband wants me to get: the 14inch MacBook Pro (16-core Neural Engine _ 14-inch Liquid Retina XDR display^2 _ Three Thunderbolts 5 ports _ HDMI port, SDXC card slot, headphone Jack, MagSafe 3 port _ Magic Keyboard with Touch ID _ Forcetouch trackpad _ 96W USB-C Power Adapter) at $3199 \n\nBut I feel like the Mac Studio (Apple M2 Max with 12-CORE CPU, 30-core GPU, 16 core Neutral Engine) at just around $2k would be just fine.\n\nI work from home so I don't need it to be a laptop. I need it to render videos and would like to be able to work on other animations while I'm rendering a large file from After Effects. \n\nMy friend who reccomended the Mac Studio said: \"maybe would be good to ask on reddit how m4 max macbook pro compare to m2 ultra. Based off of stats I think mac studio will be better. More cores for both GPU and CPU and 2x more memory, and will have a much bigger heat sink to push the GPU harder\"\n\nI would like to enhance my workflow but I don't want to spend too much and have it be overkill. \n\nThanks so much for taking time to read!! any help would be very much appreciated! ",
        "created_utc": 1732309093.0,
        "subreddit_name": "mac",
        "comments": 21
    },
    {
        "title": "Removing linux from old mbp",
        "score": 2,
        "url": "https://www.reddit.com/gallery/1gxcsbr",
        "content": "I set my 2011 mbp as a dual boot machine, but for some reason (pls don't ask) i would like to go back. But when I installed linux mint, it made ubuntu the default on my system, and when I go into startup disk settings in macos, the only option is osx base, which is greyed out.\n\nStep 1. Mount EFI, and delete ubuntu folder\nStep 2. Delete the linux partition.\nWill this revert my system back? Or is it not that easy?",
        "created_utc": 1732295382.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Searching via 'Command F' suddenly not working...",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gx0kgf/searching_via_command_f_suddenly_not_working/",
        "content": "Non Techie here, so pretend you're answering this like you're talking to a five year old. Or a Dodo...\n\nI have a 2020 27-inch iMac...finally upgraded a month ago or so to Sequoia 15.1.1. Everything's been going smoothly until sometime late this afternoon.\n\nI'm an artist/photographer/writer, and if I need to find an image/document/folder, etc., I've always just hit 'command + F', typed in the image or folder name, and it appears.\n\nNot today/tonight. I can't even \"find\" an image or folder that's clearly on my desktop. \n\nUnsure of what happened, but would sincerely appreciate any tips or advice.\n\nThanks in advance.",
        "created_utc": 1732253080.0,
        "subreddit_name": "mac",
        "comments": 17
    },
    {
        "title": "Meet me where I'm at - bad computer user needs good computer, what to buy?!",
        "score": 1,
        "url": "https://www.reddit.com/r/mac/comments/1gxjrtt/meet_me_where_im_at_bad_computer_user_needs_good/",
        "content": "Hi y'all. I'm planning to go freelance and will lose my company laptop. Looking to buy something for Black Friday. I don't want to spend more than a grand, and if I could bring it down to under $700 that'd be rad. \n\nI spend all my time multi-tasking, mostly word processing- I usually have several documents, a couple of excel docs, and 10+ chrome tabs that I'm flitting between, at any one time. While also  streaming a show. 8 hours a day. 5 days a week. And then also on and off Zoom, and with a couple other programs running in the background (Asana desktop, spotify?).  \n\n\nSo not complex stuff, just a lot of juggling. I currently have a 2020 macbook pro with the lowest specs, intel whatever, 8gb RAM, etc etc. It sucks. It's slow. It freezes. The fan is always going like it's in a sauna, despite always being on a laptop stand with vents.  \n  \nI know I want an M series processor. I'm looking for a mac with a bigger screen (14inches plus). I'm not sure if it's better for my generally chaotic approach to life to get:\n\n\\- a newer macbook air (2023?), M2 processer, 16gb RAM, 15 inch screen.\n\n\\- an older macbook pro (2021?), M1 processer, 16gb RAM, 16 inch screen.\n\nOr something older/shitter if y'all think I can get away with it! I really just want this thing to last me as long as possible. I'm scared that the air doesn't have a fan. \n\nThanks for any input you can provide! Thank you for being good at tech, on behalf of those of us who aren't! ",
        "created_utc": 1732313298.0,
        "subreddit_name": "mac",
        "comments": 13
    },
    {
        "title": "Apple Care showing as $139.99 / month (Canadian) ",
        "score": 1,
        "url": "https://www.reddit.com/r/mac/comments/1gxi1s4/apple_care_showing_as_13999_month_canadian/",
        "content": "I've been in contact with Apple support since September to get this resolved but the error is still showing. Apple has confirmed that is not the correct price (clearly!). I'm obviously worried that the very wrong amount of $139.99/month will actually be charged if I click the \"Link Plan to Your Apple Account\" button but want to continue Apple Care.\n\n$139.99/month (Canadian dollars) was showing on the previous OS so I contacted Apple, and then updated that OS with all patches. Then when it still showed this amount contacted them again then waited because I'd been told \"the website will be updated to the correct amount\". Today I finally updated to Sequoia and still has the error.\n\nI'm running out of time since I have to accept before Dec. 4 but am understandably worried about being very much overcharged. :/\n\nAnyone seeing the same thing? Any advice what more to do?\n\nhttps://preview.redd.it/cxprf15sni2e1.png?width=3024&format=png&auto=webp&s=b037b2ad6d5e8532d4955a4648be0e1647e22bf7\n\nhttps://preview.redd.it/5n4lv05sni2e1.png?width=3024&format=png&auto=webp&s=bbad0f02d69d58f5d040f078ef90119f070a2388\n\n  \n",
        "created_utc": 1732308699.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "macbook pro 13\" 2017 turns on unconcistently",
        "score": 1,
        "url": "https://www.reddit.com/r/mac/comments/1gxhnsr/macbook_pro_13_2017_turns_on_unconcistently/",
        "content": "My mom's macbook doesn't turns on everytime the button is pressed (almost once in 4-5 days), we are thinking about battery issue but we aren't sure and we don't want to make useless repairs. Who know where it comes from ?",
        "created_utc": 1732307697.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "How do I prevent my child from running apps outside of the Application folder",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gxbf26/how_do_i_prevent_my_child_from_running_apps/",
        "content": "Hi all, my child is using my MacBook for school.   \nI created a standard user for him so he can't install anything. But I had to realise that almost everything comes as a DMG file, meaning he can just drag the apps onto the desktop and run it from there. \n\nIs there any way to prevent this?  \nIs it possible to prevent DMGs from being mountable?",
        "created_utc": 1732291939.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "Can I Boost Apple Studio Display Fans to Clear Dust?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gxa8w1/can_i_boost_apple_studio_display_fans_to_clear/",
        "content": "Is there a way to max out the fans on an Apple Studio Display to blow out dust? Workers sanded drywall mud nearby and didn’t cover it properly. I’ve heard that the dust particles can be harmful to the longevity of electronics. I know compressed air and vacuums aren’t recommended, so I’m wondering if running the fans at full speed for a minute could help? \n\nThanks in advance for the advice!!",
        "created_utc": 1732288909.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "My Decision - Raycast v Alfred",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gx6lmw/my_decision_raycast_v_alfred/",
        "content": "While Spotlight is good, especially when coming from the Windows world....I went down the Spotlight replacement rabbit hole. Raycast or Alfred?  Sorry if this has been covered ad nauseam, but thought that my experience may benefit others.   \n  \nWell, I bought the Pro of both. Both are very good at what they do.  But in the end I found myself with a clear favorite.  \n  \n**Alfred - thoughts**  \n•Alfred is a touch faster than Spotlight or Raycast.  \n•It allows for switching to dedicated file search by pressing space after activating it.  \n•The interface feels dated but the simplicity of it is probably why it is faster.  \n•It took a little bit of extra time on my part to get it setup, but pretty painless.  \n•Like that the cost is a one time thing and you can get lifetime updates.  \n•Alfred’s interface feels like it was meant for someone that already knows the interface. Getting help, I needed to dive a little into the menus and such.  \n•I like the idea of the workflow system(low code/no code build of functionality if you choose to create your own), but in practice, trying to install them and then have them work….they either needed additional stuff installed like Brew, PHP and some other things which didn’t always work or the workflows just didn’t work period. Ran into this roughly 50% of the time.  \n•Alfred at the base or free level is basically just a faster version of Spotlight. You have to buy the Pro to get really any advanced features at all.  \n•You can integrate with AI (chatfred workflow). You create an AI account with OpenAI, then you have to go into that account as a developer and get your client ID and secret code. Link that into the workflow and you have your account available. The rub? You are limited to the access and usage that you have for your account. Mine was a free account so after a few uses, I was limited and could not use it anymore unless I upgrade to pro or wait for my credits to recharge next month.  \n  \n**Raycast - thoughts**  \n•Near pain free installation.  \n•Why “near”? When swapping out the hotkey for activation (replacing spotlight’s command+space), I remapped spotlight to CTRL+Space, but then I had to try and map the Raycast command to CMD+Space three or four times and it kept telling me that the emoji’s pallet was now mapped to that hotkey sequence.  \n•Not sure if that was a thing the OS was doing or not…but eventually got through it. After that though, everything was basically run the installer and you are ready to go.  \n•At first, I was a bit displeased with the interface. Seems that a lot of the commands, you put in the keyword and then have to hit return to go into that mode. After using it for a while, it kind of makes sense as then you know exactly what you are working in and what to expect.  \n•Raycast has extensions and so far, I’ve had 100% success on install and each of them functioning as expected.  \n•You can create your own extensions, but that is a little more complicated as you need to code them. Unlike Alfred, this is not a drag and drop and setup and object…this is actual coding.  \n•AI is available as part of the Pro/paid offering. You access it simply by pressing TAB after you initiate Raycast. I did not have to do anything special, add any secret keys. It just works and I have not bumped up against any limits on usage at this point - other than whatever functionality the selected AI engine you setup has.  \n  \n**Common To Both - Thoughts**  \n•Assign hotkeys or quick commands to fire things up.  \n•For example, you can set up a quick link to your browser with the YouTube search URL. Assign “yt” as the keyword, Alfred/Raycast prompt for the search parameter. Once you hit enter, the tools open up the browser to the proper URL and do the search for you in one easy step.  They both also have \"plugins\" to do something similar if you prefer.  \n•Anything you can imagine, there is probably a plugin (extension or workflow) to do what you want. A system function you want to get to quickly? Its probably already built in to control in the tool. For example, there is a “quit all applications” command to shut down all active running programs. Instead of going into the menus to force quit something, you can install a “kill” plugin to do it right from the tools prompt.  \n•Clipboard history - you can go back and search through clipboard history. Limited time on the free versions, but the pro will allow you to go back as far as you want. You can also setup a limit on how long to keep stuff so that it doesn’t get too unwieldy.  \n•Syncing - love the fact that you can cloud sync the plugins and settings across multiple machines. Setup all this first on my Mac Mini, did a cloud sync and then installed on my MacBook Air. Once signed into the account on the MacBook, it automatically pulled all the settings and plugins over for you.  \n  \n**End of the day -** ***Raycast*** **is the one that I see long term usage.**",
        "created_utc": 1732278228.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "My Macbook pro 2018 keeps randomly restarting  anything I should do ",
        "score": 2,
        "url": "https://i.redd.it/a8b9m72mof2e1.jpeg",
        "content": "",
        "created_utc": 1732272870.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "15.1.1 update = Slow Internet ",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gx4zts/1511_update_slow_internet/",
        "content": "Hey, after updating to 15.1.1 my internet is basically to a crawling stop. Either nothing loads or super slow. On my phone no problem but after updating my MBP M2 Pro it's now totally useless online. I tried everything from restart to resetting router. And it's not just Safari but all browsers.\n\nWhat gives? Any idea how to fix? ",
        "created_utc": 1732272013.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Help before this Apple gets squished",
        "score": 2,
        "url": "https://i.redd.it/r9tc4vlu8d2e1.jpeg",
        "content": "Thrifted this guy for $20 and I'm determined to get it going. It will install high sierra until the 2 minutes remaining and hit me with this error. How can I fix/get around it? I've tried everything I found on google and I can't do a bootable usb unless I go find someone else with an iMac to make one. ",
        "created_utc": 1732243355.0,
        "subreddit_name": "mac",
        "comments": 22
    },
    {
        "title": "Delete apps in recovery mode?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gww219/delete_apps_in_recovery_mode/",
        "content": "Is there a way to delete applications in recovery mode? \n\nI have a friend who needs just 2.5gb of space cleared to reinstall MacOS, but can’t access her system outside of recovery mode due to the issue I talked abt in my previous post. \n\nI am mildy okay with using Terminal if that helps. \n\nWe do not have a Thunderbolt connector to hook my mac to hers, and no Ext. Hard Drive. Not interested in erasing all her data either. ",
        "created_utc": 1732238662.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "How can I delete videos 2 sec or shorter in Apple Photos?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gwvb29/how_can_i_delete_videos_2_sec_or_shorter_in_apple/",
        "content": "I want to remove videos 2 sec or shorter from an Apple Photos library. File size is not a suitable determiner of duration. One solution is exporting all video files, deleting the originals from the library, deleting the short duration exports in Finder, then importing them into the library -- but that seems absurd. PowerPhotos is powerful but does not sort by video duration. Exif data is so limited in Photos! I don't want to switch to using Lightroom or Photoshop for managing photos on the Mac because Apple Photos is so well integrated into the Apple ecosystem, iCloud sharing, and general family use.",
        "created_utc": 1732236470.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "What's with some people here trading with 7 digit figures when they can retire already?",
        "score": 3500,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gx2d1q/whats_with_some_people_here_trading_with_7_digit/",
        "content": "I see some whales post here time to time with astounding gains (or losses), but also a very large portfolio to begin with. I'm talking about those regards with $1M+ portfolios. Like why the hell are you guys even still trading for? Can't you retire with that sum of money already? Or at least just throw into VOO/SPY and chill with passive safe income?  Or are you guys just gambling with extra money out of boredom or something? It seems crazy some people just do this for fun\n\nEDIT: Jeez, with everyone here focusing out of context on the $1M+ example I gave, I'm gonna change it to $10M+ portfolios. Is this better now...? Still can't retire with $10M? Does it need be $100M? My point is if you're rich enough to retire, why are you still gambling? Instead everyone here talking about how you need 1 billion dollars or something to retire",
        "created_utc": 1732260203.0,
        "subreddit_name": "wallstreetbets",
        "comments": 1336
    },
    {
        "title": "Advice on what to do with insurance policy funds",
        "score": 1,
        "url": "https://www.reddit.com/r/investing/comments/1gxgq5t/advice_on_what_to_do_with_insurance_policy_funds/",
        "content": "My father recently transferred ownership of a life insurance policy to me that he started when I was just a year old. To my understanding, it’s a variable permanent life insurance policy, and I now have full control of it. The current beneficiaries are my father and my sister.\n\nI’ve been seeking advice on what to do with this policy. One suggestion I received was to transfer it via a 1035 exchange into a variable annuity. However, I’m hesitant about this option because I dislike the idea of having limited access to my funds until retirement and having them managed by an external company.\n\nAt this stage in my life, my investments are structured primarily for growth. I’m 23, with no dependents or immediate plans for large purchases in the next few years. That said, I’d like to position myself to use some of my portfolio’s gains toward a down payment on a home in the future.\n\nCurrently, I’m considering cashing out the policy, paying the associated capital gains tax, and reallocating the funds into a taxable brokerage account, where I can invest in a mix of ETFs or index funds to maintain flexibility and control.\n\nHere’s a summary of how I’ve structured my investments:\n• Roth IRA (maxed yearly, with VOO and QQQ holdings)\n• VTSAX \n• 401(k)\n• High-Yield Savings Account (HYSA)\n• Some cryptocurrency\n• Individual blue-chip stocks\n\n\nGiven that I already actively manage my investments and have a clear plan, I’m leaning toward cashing out rather than transferring to a variable annuity. However, I’d appreciate any insights or alternative perspectives you might have. It’s possible there are aspects of this decision that I haven’t fully considered since I am still learning as I grow. ",
        "created_utc": 1732305297.0,
        "subreddit_name": "investing",
        "comments": 1
    },
    {
        "title": "Bullish Divergence - $SPY",
        "score": 6,
        "url": "https://i.redd.it/g3ews1tend2e1.jpeg",
        "content": "Still think we are heading towards $600 before the end of November. Anyone think the same? \n\nWanted to share the trade I took today and why. Divergences are one of the main strategies I use on a daily basis, and we had a bullish divergence play out about an hour after market open today. \n\nSo, if you look on the chart, we’re making new lows on every dip, but on the TSI at the bottom, we’re making higher lows. This ALWAYS indicates to me that price may reverse. \n\nWhen I get a signal, I take the trade, this one ended up being a perfect scenario because the signal came as it was crossing through VWAP and the 200ma (Another confluence/confirmation) \n\nRode this for around 35% today. Hope this is simple enough to understand, if you have any questions let me know. Let’s end the week strong fellas! ",
        "created_utc": 1732248249.0,
        "subreddit_name": "DayTrading",
        "comments": 3
    },
    {
        "title": "Paradoxical Movement Following News",
        "score": 1,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gxj9nd/paradoxical_movement_following_news/",
        "content": "I’ve been day/swing trading for many years now, and time and time again I notice a strange phenomenon. When news or a catalyst is released about a stock or the market they tend to react in the exact opposite way for the next few days. \n\nPerfect example, NVDA. Earnings were a success, and please let’s not argue this point. It got price upgrades from literally 30 analysts and every major Wall Street firm. This is not subjective, it’s objective, this was a good earnings report. And yet, the immediate reaction has been largely negative. \n\nI don’t think this is a buy the rumor sell the news situation because the price action has been neutral the last couple of weeks. For the same reason, I don’t think there was extreme optimism baked in or buyers who got caught out of position. Those are the likely suspects for a paradoxical reaction to good news, and they don’t exist here. Frankly, they don’t exist in many plays that react the opposite way to news. \n\nAnyone have any ideas, preferably people who have noticed this phenomenon before and pondered it? Maybe even someone who’s worked on Wall Street and executed such a strategy. \n\nMy first thought is this is a zero sum game, and the market makers and algos are just looking to punish retail traders. The pain trade, in other words. And I would suspect the pain trade is certainly down in this case. \n\nI’ve never been entirely comfortable with that idea though, the pain trade. Yes, it makes sense, and certainly seems to exist, but it doesn’t provide a particularly good explanation for why that happens. It’s like saying a football team won a game because they were the better team. What are the mechanics behind the pain trade? Without knowing how or why pain trades pop up so frequently that information feels worthless in figuring out when they will occur. \n\nOr maybe there’s some other reason? I don’t know. What I do know is that time and time again I see the same thing happen: good news comes out and we plummet, bad news comes out and we leap higher. There is a reason and mechanism for this, and man oh man I’d like to know what it is.",
        "created_utc": 1732311941.0,
        "subreddit_name": "DayTrading",
        "comments": 1
    },
    {
        "title": "[Noob] why did the premium price drop hard even though stock price increased?",
        "score": 1,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gxfpzh/noob_why_did_the_premium_price_drop_hard_even/",
        "content": "Hi all, I've recently started paper trading to get a hang of it and noticed the price drop significantly.\n\n\nPrice of AAPL at the time: 229.75\nStrike price: 230\nPrice of call: 0.36\nExpiration at time: same day in ~4 hours (today)\n\n\nThe price got to about 230 with the option going to 0.40.\n\nHowever within 20 minutes the price dropped to 0.27 even though the stock price increased to ~230.40\n\n\nWhy did it drop so hard even though stock price increased? Is it simply due to the little amount of time left till expiration and it not being worth to exercise the contract due to very little profit?",
        "created_utc": 1732302702.0,
        "subreddit_name": "DayTrading",
        "comments": 1
    },
    {
        "title": "Help me get started",
        "score": 1,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gxe5w4/help_me_get_started/",
        "content": "Hello everyone,ı want to start day trading but ı dont know how to start,which steps ı should take,reading candlestick charts is a truth or a lie? My interest in bitcoin started last year,ı installed \"StormGain\" on my phone and open a demo account there. ı play a bit,lose the demo money and try to understand how an position,leverage and bitcoin itself work. At the start it wasnt the best,ı just made the leverage 400x and lost really hard but ı knew ı would lost so ı didnt used real money. then ı buy buy and buy again and my last 5 positions were all above +500,ı saw +4500 once and +2000 twice thanks to USA elections. I want people who read this to give me a little bit of their time,tell me about how could ı do it,which networks or apps ı can use,where can ı learn candlestick charts. it is alright if you dont know a lot like me,feel free to comment,ı read all of them. have a nice day! \n\n  \nOP note: ım under 18 and dont have a bank account,please have this in mind when commenting\n\n",
        "created_utc": 1732298781.0,
        "subreddit_name": "DayTrading",
        "comments": 2
    },
    {
        "title": "Recommend me specs for a PC.",
        "score": 1,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gxhxqr/recommend_me_specs_for_a_pc/",
        "content": "I currently use a laptop to trade and it is hindering me. I am going to get a PC and due to only seeing from one eye, I want to get several screens, possibly 4. I want them as big as I can get without going overboard so I can see everything clearly. Also want to avoid switching screens to see the information I need, that is also the reason I want several screens. I usually watch 4 tickers at a time and scalp. \n\nSo basically need a pc that will not be slow and be able to run 4 screens or a big screen that I can fit what I need. Any recommendations?",
        "created_utc": 1732308401.0,
        "subreddit_name": "Daytrading",
        "comments": 11
    },
    {
        "title": "Eh. I mistakenly bought 400 shares of SPY this AM.",
        "score": 0,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gwxah1/eh_i_mistakenly_bought_400_shares_of_spy_this_am/",
        "content": "Just a funny story… Got an auto text from my broker saying so before I woke up. I guess my options got exercised? I freaked out then I was like why not, lol.  Set up a limit sell at 594 and boom. Lucky duck.",
        "created_utc": 1732242412.0,
        "subreddit_name": "Daytrading",
        "comments": 10
    },
    {
        "title": "Apple fights to keep DOJ antitrust suit from reaching trial",
        "score": 47,
        "url": "https://www.theverge.com/2024/11/20/24301660/apple-doj-motion-dismiss-antitrust-lawsuit",
        "content": "",
        "created_utc": 1732305520.0,
        "subreddit_name": "technology",
        "comments": 4
    },
    {
        "title": "Apple M4 vs Snapdragon X Elite: Benchmark Comparison",
        "score": 8,
        "url": "https://beebom.com/apple-m4-vs-snapdragon-x-elite-benchmark-comparison/",
        "content": "",
        "created_utc": 1732287686.0,
        "subreddit_name": "technology",
        "comments": 6
    },
    {
        "title": "I ditched my Apple and Galaxy watches for a Garmin, and you should too",
        "score": 0,
        "url": "https://www.androidcentral.com/wearables/i-ditched-my-apple-and-galaxy-watches-for-a-garmin-and-you-should-too",
        "content": "",
        "created_utc": 1732288407.0,
        "subreddit_name": "technology",
        "comments": 19
    }
]