[
    {
        "title": "Nvidia closes at record as AI chipmaker's market cap tops $3.4 trillion",
        "score": 919,
        "url": "https://www.reddit.com/r/stocks/comments/1g3pofm/nvidia_closes_at_record_as_ai_chipmakers_market/",
        "content": "Nvidia shares closed at a record on Monday as Wall Street gears up for earnings season and updates from all of the chipmaker’s top customers on their planned spending on artificial intelligence infrastructure.\n\nThe stock climbed 2.4% to close at $138.07, topping its prior high of $135.58 on June 18. The shares are now up almost 180% for the year and have soared more than nine-fold since the beginning of 2023.\n\nNvidia, widely viewed as the company selling the picks and shovels for the AI gold rush, has been the biggest beneficiary of the generative AI boom, which started with the public release of OpenAI’s ChatGPT in November 2022. Nvidia’s graphics processing units (GPUs) are used to create and deploy advanced AI models that power ChatGPT and similar applications.\n\nCompanies including Microsoft, Meta, Google, and Amazon are purchasing Nvidia GPUs in large quantities to build increasingly large clusters of computers for their advanced AI work. Those companies are all slated to report quarterly results by the end of October.\n\nOf the billions of dollars the top tech companies are spending annually on their AI buildouts, an outsized amount is going to Nvidia, which controls about 95% of the market for AI training and inference chips, according to analysts at Mizuho.\n\nNvidia’s revenue has more than doubled in each of the past five quarters, and at least tripled in three of those periods. Growth is expected to modestly slow the rest of the year, with analysts projecting expansion of about 82% to $32.9 billion in the quarter ending in October, according to LSEG.\n\nNvidia recently said that demand for its next-generation AI GPU called Blackwell is “insane” and it expects billions of dollars in revenue from the new product in the fourth quarter.\n\nWith a market cap of $3.4 trillion, Nvidia is the second most valuable publicly traded U.S. company, behind Apple at about $3.55 trillion.\n\nSource: https://www.cnbc.com/2024/10/14/nvidia-shares-hit-a-record-as-chipmaker-market-cap-tops-3point4-trillion.html",
        "created_utc": 1728937199.0,
        "subreddit_name": "stocks",
        "comments": 242
    },
    {
        "title": "How do you get/ look for info or intel to make stock decisions? ",
        "score": 65,
        "url": "https://www.reddit.com/r/stocks/comments/1g3jqye/how_do_you_get_look_for_info_or_intel_to_make/",
        "content": "How do you look/ get info for your stock decisions? \n\nAll full-time and not full-time investors here.\n\nI’ve been investing the last few years (not full time as I have a business) & I’m trying to figure out a good stack/ way to get updated and quality data/information, to make my stock investment decisions. (Buy /hold/sell)…. like for example, institutional and professional traders use a Bloomberg terminal or the Reuters terminal.\n\nThere are so many paid unpaid blogs, and people randomly talking about stuff on forums/ Subs. \n\nWould love to hear how folks are managing this? \n\n",
        "created_utc": 1728922752.0,
        "subreddit_name": "stocks",
        "comments": 145
    }
]