[
    {
        "title": "Nvidia closes at record as AI chipmaker's market cap tops $3.4 trillion",
        "score": 919,
        "url": "https://www.reddit.com/r/stocks/comments/1g3pofm/nvidia_closes_at_record_as_ai_chipmakers_market/",
        "content": "Nvidia shares closed at a record on Monday as Wall Street gears up for earnings season and updates from all of the chipmaker’s top customers on their planned spending on artificial intelligence infrastructure.\n\nThe stock climbed 2.4% to close at $138.07, topping its prior high of $135.58 on June 18. The shares are now up almost 180% for the year and have soared more than nine-fold since the beginning of 2023.\n\nNvidia, widely viewed as the company selling the picks and shovels for the AI gold rush, has been the biggest beneficiary of the generative AI boom, which started with the public release of OpenAI’s ChatGPT in November 2022. Nvidia’s graphics processing units (GPUs) are used to create and deploy advanced AI models that power ChatGPT and similar applications.\n\nCompanies including Microsoft, Meta, Google, and Amazon are purchasing Nvidia GPUs in large quantities to build increasingly large clusters of computers for their advanced AI work. Those companies are all slated to report quarterly results by the end of October.\n\nOf the billions of dollars the top tech companies are spending annually on their AI buildouts, an outsized amount is going to Nvidia, which controls about 95% of the market for AI training and inference chips, according to analysts at Mizuho.\n\nNvidia’s revenue has more than doubled in each of the past five quarters, and at least tripled in three of those periods. Growth is expected to modestly slow the rest of the year, with analysts projecting expansion of about 82% to $32.9 billion in the quarter ending in October, according to LSEG.\n\nNvidia recently said that demand for its next-generation AI GPU called Blackwell is “insane” and it expects billions of dollars in revenue from the new product in the fourth quarter.\n\nWith a market cap of $3.4 trillion, Nvidia is the second most valuable publicly traded U.S. company, behind Apple at about $3.55 trillion.\n\nSource: https://www.cnbc.com/2024/10/14/nvidia-shares-hit-a-record-as-chipmaker-market-cap-tops-3point4-trillion.html",
        "created_utc": 1728937199.0,
        "subreddit_name": "stocks",
        "comments": 242
    },
    {
        "title": "How do you get/ look for info or intel to make stock decisions? ",
        "score": 65,
        "url": "https://www.reddit.com/r/stocks/comments/1g3jqye/how_do_you_get_look_for_info_or_intel_to_make/",
        "content": "How do you look/ get info for your stock decisions? \n\nAll full-time and not full-time investors here.\n\nI’ve been investing the last few years (not full time as I have a business) & I’m trying to figure out a good stack/ way to get updated and quality data/information, to make my stock investment decisions. (Buy /hold/sell)…. like for example, institutional and professional traders use a Bloomberg terminal or the Reuters terminal.\n\nThere are so many paid unpaid blogs, and people randomly talking about stuff on forums/ Subs. \n\nWould love to hear how folks are managing this? \n\n",
        "created_utc": 1728922752.0,
        "subreddit_name": "stocks",
        "comments": 145
    },
    {
        "title": "AirPods 4 vs. AirPods Pro 2 Buyer's Guide: 20 Differences Compared",
        "score": 917,
        "url": "https://www.macrumors.com/guide/airpods-4-vs-airpods-pro-2/",
        "content": "",
        "created_utc": 1728909254.0,
        "subreddit_name": "apple",
        "comments": 179
    },
    {
        "title": "Apple Seeds Seventh Developer Betas of iOS 18.1 and iPadOS 18.1 With Apple Intelligence",
        "score": 643,
        "url": "https://www.macrumors.com/2024/10/14/apple-seeds-seventh-developer-beta-ios-18-1/",
        "content": "",
        "created_utc": 1728930694.0,
        "subreddit_name": "apple",
        "comments": 93
    },
    {
        "title": "One of my best trades to this day. Thanks to those on this sub who said to trust my own process and to detach emotionally",
        "score": 129,
        "url": "https://www.reddit.com/gallery/1g3brtd",
        "content": "Using a very small account to \"train my psychology\". Entered a bit late (higher)as I wasn't on my laptop, but my stop loss would have been the same. There was that small rise in volume around 62050 when it bottomed shortly before my entry and then a bullish crossover of the fast WMA over the slow WMA. Normally I enter at candle close on the crossover candle (3m), but I readjusted my entry size and entered an hour late anyway as there was confluence of the signals I needed (from volume profile fixed with beginning at start of last week). Price swung from 59k to 63.4k and tested a resistance zone 3 times which was resting at the top of the high volume node. I then waited to see what price would do when it retraced to the bottom of the high volume node where there was bound to be a support. To define its strength, I just look at price action and volume at the bottom. V shaped price action supported by a lot of volume candles that were well above the 20ma for volume, which indicated buying interest for me.\n\nI try to keep my TA as simple as possible only using price action, volume, volume profile and a couple of weighted moving averages. Open to criticism and feedback on this.\n\nNormally, I would have started to move stop loss up as soon as it hit the green, but this time I didn't touch the trade, just watched it into the night while reading a book. My psychological weakness of being too proactive on a trade to try and reduce the downside was eating into my profits and made my strategy unprofitable compared to when I was backtesting on paper trading.\n\nMy advice to myself going forward. If you really have to watch a trade, read a book and don't touch the commands.\n\nBtw top of long position box isn't my target, I didn't set one. My SL has now moved up at 63.7k",
        "created_utc": 1728897925.0,
        "subreddit_name": "DayTrading",
        "comments": 45
    },
    {
        "title": "$SPY Bearish Divergence on a very bullish day 🤫",
        "score": 68,
        "url": "https://i.redd.it/zjhm34h9dsud1.jpeg",
        "content": "I know some may call me stupid and that’s fine but these setups are some of my favorite to take, and sometimes don’t work out as good as this, but this was textbook! \n\nOn the chart you can clearly see higher highs being made, but lower highs on the TSI at the bottom, which indicates a bearish divergence. Waited for the signal to close, and took the trade. $583 Puts and grabbed 30%. \n\nI want to see some of you implement this in your trading, it has absolutely given me better confidence and the added confluence may be what you need to turn the corner. You can ask me any questions, I’m here to help. \n\nFor reference as well the blue and pink lines are VWAP and the 200ma. I use the 2-3-4m charts typically trading 0DTE. \n\nHope you guys got killed it today! ",
        "created_utc": 1728939656.0,
        "subreddit_name": "DayTrading",
        "comments": 56
    }
]