[
    {
        "title": "Nancy Pelosi's husband just snapped up $2.6 million of Apple and Microsoft stock, closing out an options bet that the shares would soar",
        "score": 2436,
        "url": "https://www.reddit.com/r/stocks/comments/14k8vwr/nancy_pelosis_husband_just_snapped_up_26_million/",
        "content": "* Nancy Pelosi's husband exercised roughly $2.6 million worth of Apple and Microsoft stock options this month.\r\n* Paul Pelosi bought 5,000 shares of both Apple and Microsoft stocks on June 15, exercising 50 call options.\r\n* Nancy Pelosi has repeatedly said her husband's investments have nothing to do with her political knowledge.                                                                                                                       \n\nNancy Pelosi's husband exercised roughly $2.6 million worth of Apple and Microsoft stock options this month, according to a regulatory disclosure Thursday.\r  \n\r  \nThe transactions on the filing, marked with \"SP\" for the spouse, indicate that Paul Pelosi bought 5,000 shares of both Apple and Microsoft stocks on June 15, exercising 50 call options purchased on May 24, 2022, with a listed expiration date of June 16.\r  \n\r  \nThe Apple options had a strike price of $80, and the Microsoft options had a strike price of $180. On Friday, those shares closed at $186.68 and $335.02, respectively, totaling about $933,000 and $1.7 million.\r  \n\r  \nSince the options were purchased last May, Apple shares have gained 33%, and Microsoft has climbed 29%. The upside from the strike price is even higher, at 131% and 83%, respectively.\r  \n\r  \nFirst highlighted by Quiver Quantitative and Unusual Whales, the disclosure comes after Congress failed to make progress on new legislation around lawmakers and their relatives trading stocks.\r  \n\r  \nEarlier this year, Insider and several other news organizations identified 78 members of Congress who didn't properly report their financial trades as mandated by the Stop Trading on Congressional Knowledge Act of 2012, also known as the STOCK Act.\r  \n\r  \nCongress passed the law a decade ago to combat insider trading and conflicts of interest. But many lawmakers have not fully complied with reporting requirements, leading to calls for a complete ban on trading individual stocks among members of Congress.\r  \n\r  \nLegislation on such a ban advanced last year, but the bill ultimately died.\r  \n\r  \nMeanwhile, Paul Pelosi has faced backlash over stock trades that seem to coincide with legislation in the technology sector.\r  \n\r  \nFor example, in July 2021, he pocketed a $4.8 million gain in a Alphabet stock trade the week before the House Judiciary Committee advanced bipartisan antitrust bills targeting Google, Apple, and Amazon.\r  \n\r  \nHowever, Nancy Pelosi has said repeatedly that her financier husband's trades have nothing to do with her political knowledge.\r  \n\r  \nOpenSecrets estimated that Pelosi has a net worth of $114.6 million.",
        "created_utc": 1687858457.0,
        "subreddit_name": "stocks",
        "comments": 381
    }
]