[
    {
        "title": "Bear Case: Why I believe Alphabet will do everything right and still lose",
        "score": 290,
        "url": "https://www.reddit.com/r/stocks/comments/1dbvyv3/bear_case_why_i_believe_alphabet_will_do/",
        "content": "Alphabet will excel in the AI and automation sectors, but the resulting industry shift will be a net loss for the M7 company as AI eats into its search revenue.\n\nWith the \"Attention is all you need\" paper Alphabet has already etched itself into AI history. Its cloud computing arm is keeping up with AWS and Azure. Waymo threatens to eat Tesla's lunch. Its TPU may very well knock Nvidia off its perch.\n\nBut even if all that happens, it won't make up for the losses to its search business when AI chatbots take over many of the functions of search. Despite all the efforts into diversification, more than half of Alphabet's revenue still comes from search. So if people turn to Chat-GPT instead of Google as the primary web surfing tool, Alphabet will take a big hit to its most important segment. If GPT can give me the results I want, plus summaries and links and review aggregates, all on voice command, why would I ever need to go on Google and get exposed to its sponsored results? The OAI partnership with Apple may signal the beginning of this shift.\n\nMuch of Alphabet's valuation comes from its ridiculous dominance in search. All of its other ventures face stiff competition from other M7 companies and OAI, and I have a hard time believing Alphabet will crush them the way it crushed Yahoo.\n\nUltimately, Alphabet stands to lose heavily early in the AI revolution. The company will survive, but without a massive moat in a crucial industry, it may go the way of Netflix and lose its elite status among the likes of META, MSFT, and NVDA.",
        "created_utc": 1717945881.0,
        "subreddit_name": "stocks",
        "comments": 245
    },
    {
        "title": "With decline in smartphone sales, how is AAPL poised to tackle this?",
        "score": 265,
        "url": "https://www.reddit.com/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/",
        "content": "We are seeing [decline](https://www.npr.org/2024/05/03/1248865513/apple-quarterly-decline-iphone-sales) in smartphone sales year over year. I expect sales to rise somewhat this year with AI featured iphones but phones are becoming more like PCs with lengthy replacement cycles and less people interested in buying the latest version. Can Apple's appstore and other services revenues would be enough to offset the declining sales year over year? What could the market look like in 5-10 years. \n\nWe are depending on future Apple Vision pro being slimmer and and more affordable but even then unless it's literally rayban glasses sized and it has an interface which is faster than phones, it can never have mass popularity. With so much of their fortune tied in iphone sales, it's not hard to imagine that Apple could trade sideways for many years to come. (until they make the next big thing maybe?)",
        "created_utc": 1717969139.0,
        "subreddit_name": "stocks",
        "comments": 154
    },
    {
        "title": "iOS 18 Will Let You Lock Apps Behind Face ID, Sources Say",
        "score": 2619,
        "url": "https://www.macrumors.com/2024/06/08/ios-18-face-id-app-locking-rumor/",
        "content": "",
        "created_utc": 1717905704.0,
        "subreddit_name": "apple",
        "comments": 337
    },
    {
        "title": "iOS 18 to include ability to schedule messages to send later, emoji reactions for iMessage!",
        "score": 1650,
        "url": "https://9to5mac.com/2024/06/07/ios-18-to-include-emoji-reactions-for-imessage-ability-to-schedule-messages-to-send-later/",
        "content": "",
        "created_utc": 1717973553.0,
        "subreddit_name": "apple",
        "comments": 285
    },
    {
        "title": "iOS 18 Will Extend Dark Mode to Home Screen, Sources Say",
        "score": 1187,
        "url": "https://www.macrumors.com/2024/06/09/ios-18-home-screen-dark-mode-rumor/",
        "content": "",
        "created_utc": 1717908652.0,
        "subreddit_name": "apple",
        "comments": 112
    },
    {
        "title": "Unapologetically Plastic",
        "score": 784,
        "url": "https://youtu.be/eCSX3pWFKYc?si=Ff8BoOdWgNvSVwT8",
        "content": "In a lot of the online chatter, I see folks poking fun at Apple for calling the iPhone 5c \"unapologetically plastic,\" like Apple is trying to spin plastic as some kind of high-end material (for example, Linus from LTT mocked Apple for it in one of the Wan show episodes right after Apple launched M1). While it’s true that this is something Apple loves to do, but I think in this particular case, there's a misunderstanding here about what Apple was really getting at.\n\nLet me first introduce some context, the year is 2013, and a lot of phone manufacturers use plastic in their flagship products, for example, Samsung, with their Galaxy S5. The S5 has a full plastic build, it uses plastic frame and plastic back plate. However they slapped metallic paint on the frame and added fake leather textures on the back. Why? It seems like they're a bit embarrassed to just embrace the plastic—they feel the need to dress it up as something more 'premium.' Leather and aluminum are more premium than plastic, thus the disguising. (It’s a design choice, I’m not judging it. In fact I own a S5 and a Note 4. But my point is valid.) In Apple or Jony Ive’s book, these people are being “apologetic” for their use of plastic.\n\nApple took a different approach with the iPhone 5c. When they said \"unapologetic plastic,\" they meant that they're not trying to disguise the material with tricks. Instead, they're embracing it head-on—highlighting the aesthetic and functional benefits of plastic without pretending it's something it's not. If you check out the design video Apple released for the 5c, it's pretty clear. They're not justifying a premium price by claiming the material is something revolutionary; they're just showcasing plastic, pure and simple.",
        "created_utc": 1717938164.0,
        "subreddit_name": "apple",
        "comments": 154
    },
    {
        "title": "Apple needs to show us the other half of the iPad Pro - The Verge",
        "score": 726,
        "url": "https://www.theverge.com/2024/6/9/24169016/apple-ipad-pro-ipados-18-wwdc-ai-features",
        "content": "",
        "created_utc": 1717948529.0,
        "subreddit_name": "apple",
        "comments": 271
    }
]