[
    {
        "title": "Bear Case: Why I believe Alphabet will do everything right and still lose",
        "score": 290,
        "url": "https://www.reddit.com/r/stocks/comments/1dbvyv3/bear_case_why_i_believe_alphabet_will_do/",
        "content": "Alphabet will excel in the AI and automation sectors, but the resulting industry shift will be a net loss for the M7 company as AI eats into its search revenue.\n\nWith the \"Attention is all you need\" paper Alphabet has already etched itself into AI history. Its cloud computing arm is keeping up with AWS and Azure. Waymo threatens to eat Tesla's lunch. Its TPU may very well knock Nvidia off its perch.\n\nBut even if all that happens, it won't make up for the losses to its search business when AI chatbots take over many of the functions of search. Despite all the efforts into diversification, more than half of Alphabet's revenue still comes from search. So if people turn to Chat-GPT instead of Google as the primary web surfing tool, Alphabet will take a big hit to its most important segment. If GPT can give me the results I want, plus summaries and links and review aggregates, all on voice command, why would I ever need to go on Google and get exposed to its sponsored results? The OAI partnership with Apple may signal the beginning of this shift.\n\nMuch of Alphabet's valuation comes from its ridiculous dominance in search. All of its other ventures face stiff competition from other M7 companies and OAI, and I have a hard time believing Alphabet will crush them the way it crushed Yahoo.\n\nUltimately, Alphabet stands to lose heavily early in the AI revolution. The company will survive, but without a massive moat in a crucial industry, it may go the way of Netflix and lose its elite status among the likes of META, MSFT, and NVDA.",
        "created_utc": 1717945881.0,
        "subreddit_name": "stocks",
        "comments": 245
    },
    {
        "title": "With decline in smartphone sales, how is AAPL poised to tackle this?",
        "score": 265,
        "url": "https://www.reddit.com/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/",
        "content": "We are seeing [decline](https://www.npr.org/2024/05/03/1248865513/apple-quarterly-decline-iphone-sales) in smartphone sales year over year. I expect sales to rise somewhat this year with AI featured iphones but phones are becoming more like PCs with lengthy replacement cycles and less people interested in buying the latest version. Can Apple's appstore and other services revenues would be enough to offset the declining sales year over year? What could the market look like in 5-10 years. \n\nWe are depending on future Apple Vision pro being slimmer and and more affordable but even then unless it's literally rayban glasses sized and it has an interface which is faster than phones, it can never have mass popularity. With so much of their fortune tied in iphone sales, it's not hard to imagine that Apple could trade sideways for many years to come. (until they make the next big thing maybe?)",
        "created_utc": 1717969139.0,
        "subreddit_name": "stocks",
        "comments": 154
    }
]