[
    {
        "title": "Nvidia Earnings: Beat Across the Board, Strong Guidance",
        "score": 547,
        "url": "https://www.reddit.com/r/stocks/comments/1gvzyeh/nvidia_earnings_beat_across_the_board_strong/",
        "content": "Earnings: https://nvidianews.nvidia.com/news/nvidia-announces-financial-results-for-third-quarter-fiscal-2025\n\nRecord quarterly revenue of $35.1 billion, up 17% from Q2 and up 94% from a year ago\n\nRecord quarterly Data Center revenue of $30.8 billion, up 17% from Q2 and up 112% from a year ago\n\nSANTA CLARA, Calif., Nov. 20, 2024 (GLOBE NEWSWIRE) -- NVIDIA (NASDAQ: NVDA) today reported revenue for the third quarter ended October 27, 2024, of $35.1 billion, up 17% from the previous quarter and up 94% from a year ago.\n\nFor the quarter, GAAP earnings per diluted share was $0.78, up 16% from the previous quarter and up 111% from a year ago. Non-GAAP earnings per diluted share was $0.81, up 19% from the previous quarter and up 103% from a year ago.\n\n“The age of AI is in full steam, propelling a global shift to NVIDIA computing,” said Jensen Huang, founder and CEO of NVIDIA. “Demand for Hopper and anticipation for Blackwell — in full production — are incredible as foundation model makers scale pretraining, post-training and inference.\n\n“AI is transforming every industry, company and country. Enterprises are adopting agentic AI to revolutionize workflows. Industrial robotics investments are surging with breakthroughs in physical AI. And countries have awakened to the importance of developing their national AI and infrastructure,” he said.\n\nNVIDIA will pay its next quarterly cash dividend of $0.01 per share on December 27, 2024, to all shareholders of record on December 5, 2024.",
        "created_utc": 1732137958.0,
        "subreddit_name": "stocks",
        "comments": 247
    },
    {
        "title": "Snowflake Q3 Earnings",
        "score": 84,
        "url": "https://www.reddit.com/r/stocks/comments/1gvzu5w/snowflake_q3_earnings/",
        "content": "- Product revenue of $900.3 million in the third quarter, representing 29% year-over-year growth\n\n- Net revenue retention rate of 127%\n\n- 542 customers with trailing 12-month product revenue greater than $1 million\n\n- 754 Forbes Global 2000 customers\n\n- Remaining performance obligations of $5.7 billion, representing 55% year-over-year growth\n\nSnowflake (NYSE: SNOW), the AI Data Cloud company, today announced financial results for its third quarter of fiscal 2025, ended October 31, 2024.\n\nRevenue for the quarter was $942.1 million, representing 28% year-over-year growth. Product revenue for the quarter was $900.3 million, representing 29% year-over-year growth. Net revenue retention rate was 127% as of October 31, 2024. The company now has 542 customers with trailing 12-month product revenue greater than $1 million and 754 Forbes Global 2000 customers, representing 25% and 8% year-over-year growth, respectively. Remaining performance obligations were $5.7 billion, representing 55% year-over-year growth. See the section titled \"Key Business Metrics\" for definitions of product revenue, net revenue retention rate, customers with trailing 12-month product revenue greater than $1 million, Forbes Global 2000 customers, and remaining performance obligations.\n\n\"Snowflake delivered a strong third quarter, with product revenue of $900 million, up 29% year-over-year, and remaining performance obligations of $5.7 billion, with year-over-year growth accelerating to 55%,\" said Sridhar Ramaswamy, CEO of Snowflake. \"Our obsessive drive to produce product cohesion and ease of use has built Snowflake into the easiest and most cost effective enterprise data platform. That is what’s leading us to win new logo after new logo, expand within our customer base, and displace our competition over and over again.\"\n\nhttps://finance.yahoo.com/news/snowflake-reports-financial-results-third-210500687.html",
        "created_utc": 1732137547.0,
        "subreddit_name": "stocks",
        "comments": 37
    },
    {
        "title": "Okta - my analysis and thoughts",
        "score": 15,
        "url": "https://www.reddit.com/r/stocks/comments/1gvcfnz/okta_my_analysis_and_thoughts/",
        "content": "I'd appreciate any and all feedback to see if I feel I'm on track or not and your perspective on my take. I know Okta took the hit after the social engineering \"hack\", but there's no doubt they're still the leader in the IAM space. I believe there's way more upside, but I also realize that they \\*could\\* be a serious M&A target.\n\n**Executive Investment Summary: Okta, Inc.**\n\n**Overview**\n\nOkta, Inc. is a leading provider of identity and access management (IAM) solutions, serving enterprises globally with secure authentication systems. Its strong revenue growth, cash flow, and leadership in the cybersecurity market make it an attractive acquisition target.\n\n\n\n***Key Financial Highlights***\n\n\\- Revenue (TTM): $2.45 billion, reflecting 16.2% YoY growth.\n\n\\- Profitability:\n\n\\- Net Income: -$136 million (improved from -$355 million YoY).\n\n\\- EBITDA: -$145 million.\n\n\\- Cash Flow Positive: Despite unprofitability, generating $607M in free cash flow.\n\n\\- Cash Position: $2.2 billion; current ratio of 1.83 (strong liquidity).\n\n\\- Debt Profile: $1.297 billion in total debt; net debt of $820 million (manageable).\n\n\\- Market Cap: \\~$12–15 billion.\n\n\\- Valuation Multiples: Acquisition valuation estimated at $16–18 billion, reflecting 6–9x revenue multiples.\n\n\n\n**Strategic Acquisition Rationale**\n\n\n\nMarket Opportunity\n\nThe IAM market is expanding due to hybrid work and zero-trust security models. Okta’s leadership in this high-demand space adds immediate value to acquirers.\n\n\n\nSynergies\n\n1. Revenue Synergies:\n\n\\- Cross-selling within SaaS, cloud, and cybersecurity ecosystems.\n\n\\- Increases customer retention via integrated security offerings.\n\n2. Cost Synergies:\n\n\\- Consolidation of R&D, sales, and administrative functions.\n\n\n\n**Tax Advantages**\n\n1. Net Operating Losses (NOLs):\n\n\\- Okta’s significant NOLs can offset taxable income for the acquirer under U.S. tax rules (IRC Section 382), reducing the acquirer’s overall tax burden.\n\n\\- For cash-flow-positive acquirers like *Microsoft* or *Salesforce*, this could be an immediate financial benefit.\n\n2. R&D Tax Credits:\n\n\\- Okta’s investment in IAM technology qualifies for R&D tax credits, which the acquirer can leverage to reduce tax liability.\n\n3. Capital Gains Protection:\n\n\\- If the acquirer has large realized gains in 2024, purchasing Okta could offset these with acquisition-related costs.\n\n\n\nTiming Considerations\n\n2024: Lower valuation; earlier synergies and immediate tax benefits from NOLs.\n\n2025: Higher valuation but lower operational risk as Okta achieves profitability milestones.\n\n\n\n**Potential Acquirers and Recommendations**\n\nAcquirer: Microsoft\n\nTiming Recommendation: Acquire in 2024\n\nWhy? Integrates into Azure AD; removes a competitor; strengthens security leadership. Early acquisition maximizes synergies and tax advantages from Okta’s NOLs.\n\n\n\nAcquirer: Google (Alphabet)\n\nTiming Recommendation: Wait until 2025\n\nWhy? Conservative M&A approach; IAM complements Google Cloud; may prefer profitability first.\n\n\n\nAcquirer: Amazon (AWS)\n\nTiming Recommendation: Wait until 2025\n\nWhy? Less urgent; would act only if Microsoft or others make a move.\n\n\n\nAcquirer: Salesforce\n\nTiming Recommendation: Acquire in 2024\n\nWhy? Complements Slack and Salesforce’s SaaS stack; increases enterprise value. Tax advantages can offset acquisition costs while enhancing shareholder value.\n\n\n\nAcquirer: Cisco\n\nTiming Recommendation: Acquire in 2024\n\nWhy? Aligns with Cisco’s cybersecurity strategy; enhances subscription revenue growth. Okta’s NOLs can be applied against Cisco’s strong operating profits.\n\n\n\n**Valuation and Stock Price Impact**\n\n\n\nAcquisition Valuation\n\n2024: $16–18 billion (20–40% premium).\n\n2025: $18–22 billion, assuming profitability.\n\n\n\nStock Price Impact\n\n2024 Acquisition:\n\n\\- Stock Price Range: $95.81–$107.78 per share.\n\n\\- Upside: +29% to +45% (from \\~$74.51 current price).\n\n\n\n2025 Acquisition:\n\n\\- Stock Price Range: $107–$130 per share.\n\n\\- Upside: +44% to +75%.\n\n\n\n**Final Recommendation**\n\n\n\nFor Acquirers\n\n2024 Acquisition:\n\n\\- Microsoft, Salesforce, Cisco: Act now to secure market share, synergies, and tax advantages while Okta is undervalued.\n\n\n\n2025 Acquisition:\n\n\\- Google, Amazon: Wait for profitability milestones, reducing operational risks.\n\n\n\nFor Stockholders\n\nHold the stock for potential 29–75% upside over the next 12–18 months through organic growth or an acquisition.\n\n**Conclusion**\n\nOkta is a prime acquisition target with robust growth potential, strategic synergies, and significant tax advantages for tech giants. While aggressive acquirers like Microsoft, Salesforce, and Cisco should act in 2024 to maximize these benefits, more conservative companies like Google and Amazon may wait until 2025 for improved profitability metrics. Either way, Okta presents a compelling investment with projected stock price increases of $95–$130 per share.\n\n  \nDISCLAIMER: I'm already a shareholder",
        "created_utc": 1732062039.0,
        "subreddit_name": "stocks",
        "comments": 14
    },
    {
        "title": "Nvidia nearly doubles revenue on strong AI demand",
        "score": 3656,
        "url": "https://www.cnbc.com/2024/11/20/nvidia-nvda-earnings-report-q3-2025.html?__source=androidappshare",
        "content": "",
        "created_utc": 1732138717.0,
        "subreddit_name": "wallstreetbets",
        "comments": 450
    },
    {
        "title": "$RIVN: Riding to Valhalla",
        "score": 856,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gvxea5/rivn_riding_to_valhalla/",
        "content": "Alright, degenerates. Rivian isn’t just the dorky little brother of Tesla anymore—it’s the ex-nerd who’s going to show up at the 10-year reunion ripped and in a tux, ready to steal the prom queen. This play has all the makings of a **10x banger** if you’re willing to hold on like your life depends on it. Buckle up, because this ride is going 0 to 69 faster than you can swipe right.\n\n## Why Rivian Is About to Deliver\n\n**Tesla’s Fumbling the Ball** \n\nElon’s gone off the deep end and is alienating the very crowd that made EVs sexy to begin with. Progressive elites? Millennials? The kinds of people who buy organic kale and want their car to save the planet? Yeah, they’re turning the corner to RIVN, who’s out here whispering sweet nothings about sustainability, inclusivity, and not being a hot mess. Basically, Tesla’s stuck doing the walk of shame while Rivian’s already at brunch ordering mimosas.\n\n**How Rivian Could Ride Trump’s EV Rollercoaster**\n\nYou’d think Trump and EVs go together like oil and water, but here’s the twist: RIVN could totally benefit from his likely “America First” policies. With Rivian’s production fully based in the U.S., any federal push for domestic manufacturing would be a tailwind. Meanwhile, Trump’s cozy relationship with Elon might have TSLA in the spotlight, but every infrastructure boost for Tesla chargers indirectly benefits RIVN since its vehicles now play nice with Tesla's Supercharger network. Most any other policy that benefits TSLA will help RIVN as well. Rivian’s set to snag the benefits without the baggage, making it the sneaky winner here. Everyone’s FOMOing into TSLA right now, but RIVN is the sleeper play here, and it’s only a matter of time until the market realizes this.\n\n**New Models That’ll Make You Feel Things** \n\nLet’s talk about Rivian’s R2 SUV and its new lineup. Starting at $45K, it’s the hot-but-affordable option that’s ready to steal hearts (and market share). Tri-motor setup? Level 3 autonomy? Integration with Tesla’s Supercharger network? That’s not just sexy—that’s full-blown EV porn. This isn’t a one-night stand; Rivian’s building long-term market appeal. And if that $45k price tag isn’t inclusive enough for you Wendy’s employees, they’re adding a cheaper R3 model just for you (dumpster price point model still TBD).\n\n**Efficiency: More Bang for Their Buck** \n\nSure, Rivian’s been burning through cash faster than you can dump your paycheck into hookers and blow, but they’ve learned to keep it tight. Cutting the Georgia plant saved $2.25B, and now they’ve found [a sugar daddy in Volkswagen to the tune of $5 billion](https://www.spglobal.com/mobility/en/research-analysis/rivian-volkswagen-production-forecast.html), exactly what they need to hold them over until their new models roll out. That’s efficiency, baby.\n\n**Analysts Are Hot for RIVN**\n\n Some of the suits on Wall Street are swooning over Rivian. Their buy rating and price target of $15.67 give it a potential upside of 54%. They’re hyped about Rivian’s leaner operations, aggressive production targets, and a fat pipeline of new EVs. But there are still plenty of doubters who like losing money: [a short interest of 18%](https://fintel.io/ss/us/rivn) means the minute this stock turns around, the squeeze will make it run.\n\nRIVN shot from current levels all the way to $18 when the VW news first dropped, plus the recent pop to $12 when VW upped their commitment from $5B to $5.8B, but they’re now being valued the same as they were before the deal existed. People who think a cash injection of half the company’s market cap isn’t going to move the needle are delusional. Not to mention they have $6.73B cash on hand, and they’re only valued at $10B? Seems like a steal to me.  \n\n\nhttps://preview.redd.it/tc3jgmanu32e1.png?width=1012&format=png&auto=webp&s=8b4d1888d8fc95e1f6fc9412032bb443304282aa\n\n## The Risks (Nothing to See Here)\n\n**Dilution** \n\nRivian’s diluted more shares than a frat house dilutes vodka in jungle juice. But that jungle juice is funding some spicy R&D and scaling production, which means the hangover might just be worth it. And with VW’s cash infusion (with potentially more in the future?) and affordable models on the horizon, they might not need to rely on dilution going forward.\n\n**Cash Burn**\n\nRivian’s like the guy spending money he doesn’t have to impress his date. Sure, it’s a gamble, but if those new models hit like I think they will, it’s a gamble that pays off big. Plus with Trump in the White House, do you honestly think he’s going to let American manufacturing jobs disappear when that’s all he talks about? Hell no, he’ll make sure RIVN stays alive until their investments pay off.\n\n## TL;DR: \n\nRIVN isn’t just another EV play—it’s *the EV play* for those with the balls to handle a little risk. With Tesla already overvalued and fumbling its game, Trump protectionism acting as the ultimate wingman, and Rivian’s lineup of models hotter than a summer fling, the potential upside is enormous. Analysts see at least 50% upside, with room to double. This stock’s the real deal, and I’m strapping in for the ride.\n\nAnd if I haven’t sold you on it, take it instead from this guy who turned $182k into $11.7 million:  \n\n\nhttps://preview.redd.it/nf2e38yju32e1.png?width=966&format=png&auto=webp&s=021287bb576580c5ce190c54c2f8b7495f521944\n\nPosition: $35k in shares, 20 $35 Jan 2026 calls, 10 $20 Jan 2027 calls  \n\n\nhttps://preview.redd.it/ev420hmou32e1.jpg?width=1179&format=pjpg&auto=webp&s=a1150f94bd0b078404049d6534e0b469878bec71\n\nEDIT: u/Additional-Ad-1021 and u/geraldor732 have some good points below too; expansion to Europe and potential for AMZN fleet purchases could be huge!",
        "created_utc": 1732129689.0,
        "subreddit_name": "wallstreetbets",
        "comments": 364
    },
    {
        "title": "Nvidia Forecast Fails to Meet the Loftiest Estimates for AI Star",
        "score": 469,
        "url": "https://www.bloomberg.com/news/articles/2024-11-20/nvidia-forecast-fails-to-meet-the-loftiest-estimates-for-ai-star",
        "content": "> Nvidia Corp. delivered a revenue forecast that failed to meet the highest expectations, showing that its dizzying AI-fueled growth run has its limits. \n\n> Fiscal fourth-quarter sales will be about $37.5 billion, the company said in a statement Wednesday. Though the average analyst estimate was $37.1 billion, according to data compiled by Bloomberg, projections ranged as high as $41 billion. ",
        "created_utc": 1732138102.0,
        "subreddit_name": "wallstreetbets",
        "comments": 109
    },
    {
        "title": "Snowflake Q3 Earnings: Revenue Beat, EPS Beat, Guidance Raise, AI Acquisition, Anthropic Partnership And More",
        "score": 83,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gw0ouj/snowflake_q3_earnings_revenue_beat_eps_beat/",
        "content": "[https://www.benzinga.com/news/earnings/24/11/42099986/snowflake-q3-earnings-revenue-beat-eps-beat-guidance-raise-ai-acquisition-anthropic-partnership-and-more](https://www.benzinga.com/news/earnings/24/11/42099986/snowflake-q3-earnings-revenue-beat-eps-beat-guidance-raise-ai-acquisition-anthropic-partnership-and-more)\n\nHuge hit on this for anyone playing earnings. Up 18% after hours. 🚀🚀🚀",
        "created_utc": 1732140418.0,
        "subreddit_name": "wallstreetbets",
        "comments": 21
    },
    {
        "title": "MU: Earns a Spot on the Watchlist ",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gvvn7g/mu_earns_a_spot_on_the_watchlist/",
        "content": "Micron is probably one of the best opportunities to pick up some shares. Long-term, this company is set to do very well. As one of the only large chip manufacturers with most of its manufacturing presence in the U.S., the company is poised for expansion.\n\nWhile Intel is set to receive the largest amount from the CHIPS Act ($8.5 billion directly) and a further $11 billion in loans combined with additional tax credits, Micron is not far behind, with plans to receive $6.14 billion in direct funding.\n\nThis is meaningful because Micron is a smaller, newer company, and as a result, it has much more potential for growth compared to an already established giant like Intel.\n\nIn addition to the CHIPS Act, the United States currently has bipartisan support to bring manufacturing back to the U.S., which would be more effective than imposing costly tariffs on China without building up a domestic manufacturing presence.\n\nMicron is currently a key supplier of high-bandwidth memory (HBM3E) for NVIDIA's Blackwell GPUs. Although they are not solely supplying their chips to NVIDIA, having an initial edge in what will likely be the leading chip line (NVIDIA's Blackwell line) will be crucial.\n\nMicron’s customization options for customers are also a significant advantage, though it’s not currently getting much attention.\n\nAdditionally, Micron's new chips provide major breakthroughs in energy savings:\n\n* **HBM3E (High Bandwidth Memory 3E)**: This advanced memory technology offers over 1.2 TB/s bandwidth and is built on Micron's 1β process node. It delivers a 2.5x improvement in performance per watt compared to previous generations.\n* **LPDDR5**: Targeted at mobile devices, Micron's LPDDR5 DRAM provides 50% faster data speeds and 20% more power efficiency than earlier LPDDR generations, resulting in 5-10% better battery life for applications like 8K video and virtual reality.\n* **1β DRAM Process Node**: Micron's 1β (1-beta) DRAM technology enhances power efficiency by 15% and increases bit density by 35% over previous nodes.\n\nAlthough Micron has faced challenges in the past, with its revenue recovering from its 2022 high of nearly $30 billion, this provides a good opportunity for a potential bounce back, which could ultimately drive its share price higher.\n\nWith AI expansion and the new U.S. policies, I anticipate domestic chip manufacturers will receive favorable treatment in terms of tax breaks and other incentives, further strengthening their position over foreign competitors.\n\nWhile the share price has fallen from $150 down to $100 at the time of writing, I see a strong possibility of it bouncing back to previous levels, as long as they continue the work they are doing now.\n\nAnd although people are questioning the high P/E ratios, I expect earnings growth to bring this ratio under control in future quarters. Besides, we have seen stocks with high P/E ratios perform exceptionally well based solely on their growth potential.\n\n",
        "created_utc": 1732125451.0,
        "subreddit_name": "investing",
        "comments": 1
    },
    {
        "title": "$hood YOLO 40k . Will 250+ in 3-4 years ",
        "score": 528,
        "url": "https://i.redd.it/ire8frq3p02e1.jpeg",
        "content": "YOLO $hood go to $100 by mid 2025\n\nNot financial advice but $hood will be $100 in no time in 1-2 years. Yolo’d 40k last year on June (yes I know long term capital gains thank god).\n\nOkay! So. Their last earning report was missed… WHY?! Recently they were running promotions during the past months-  marketing customers switch brokage (robinhood  was essentially burning their cash) which made up a huge percentage of their expenses in the short term.Practically sacrificing CASH for customer loyalty. It was an edgy but risky move. It wasn’t a no brainer that they missed their recent earnings report by a small percentage. This is their game plan. Hood’s expectation is that… customers are more likely to invest with that said capital once they see it. ALSO… since the promotion is about to end, (I think it has already) their upcoming earnings report will beat expectations by a TON. If not, definitely the next one. Due to saved expenses. Compared to Coinbase, Robinhood is the jack of all trades where young investors will have an entry to learn how to invest. People believe that $hood is undervalued, but I confidently say it is still super undervalued. Keep in mind. Coinbase is 300+ in shares price because they withhold 50 BILLION plus of crypto equity. \n\nFunny thing is that.. I was using Charles Schwab the other day and it was fucking hard to find my entry cost. Their mobile UI is terrible to say the least. Spent 5-7 minutes tapping buttons and I STILL couldn’t find my cost.\n\nAnother thing. Their recent acquisition of TradePMR- wealth management corp. This move will essentially set their ground footing towards a banking industry.. I wouldn’t be surprised if they were to acquired SOFI. Adding in Futures + Index and the desktop app that they’ve recently released, would be another reason and THE pinnacle of their success. In the future $hood will be a Bank. \n\nAll in all… I believe $hood will shoot up to $100 very easily. In the next 4-5 years  $250+. Mark my words. ",
        "created_utc": 1732091429.0,
        "subreddit_name": "wallstreetbets",
        "comments": 163
    },
    {
        "title": "EVGO is Going To Change the World",
        "score": 31,
        "url": "https://www.reddit.com/gallery/1gvywa1",
        "content": "I am holding these contracts and over 150k shares on another account. \n\n\nEveryone here will have an electric car in the future. The electric cars are just so damn good. I hated them for so long but they’re like Covid - they can’t be stopped (tax credit or not). \n\nThere are not enough super chargers. There are lines in NJ for them and the problem is only getting worse. You live in an apartment then you’re going to supercharge. Margin on these superchargers in nuts - 100 percent markup per KW.\n\nEVgo is the only public company with a large super charger presence in the US. \n\nBillion dollar DOE loan about to close before year end per JPM. 30% of the float is shorted. \n\nThis is it boys - it’s about to pop. ",
        "created_utc": 1732133354.0,
        "subreddit_name": "wallstreetbets",
        "comments": 76
    },
    {
        "title": "Apple is selling Apple News ads directly for the first time",
        "score": 510,
        "url": "https://www.axios.com/2024/11/19/apple-news-ads-direct-sales-publishers",
        "content": "",
        "created_utc": 1732072685.0,
        "subreddit_name": "apple",
        "comments": 115
    },
    {
        "title": "iPhone SE 4 With Apple's Own 5G Modem 'Confirmed' to Launch in March",
        "score": 459,
        "url": "https://www.macrumors.com/2024/11/19/iphone-se-4-expected-to-launch-in-march/",
        "content": "",
        "created_utc": 1732067180.0,
        "subreddit_name": "apple",
        "comments": 127
    },
    {
        "title": "Daily Advice Thread - November 20, 2024",
        "score": 7,
        "url": "https://www.reddit.com/r/apple/comments/1gvmxbj/daily_advice_thread_november_20_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1732100433.0,
        "subreddit_name": "apple",
        "comments": 56
    },
    {
        "title": "Anyone Can Buy Data Tracking US Soldiers and Spies to Nuclear Vaults and Brothels in Germany - More than 3 billion phone coordinates collected by a US data broker expose the detailed movements of US military and intelligence workers in Germany—and the Pentagon is powerless to stop it.",
        "score": 1158,
        "url": "https://www.wired.com/story/phone-data-us-soldiers-spies-nuclear-germany/",
        "content": "",
        "created_utc": 1732114529.0,
        "subreddit_name": "technology",
        "comments": 36
    },
    {
        "title": "The world's first foldable phone maker is now out of business",
        "score": 65,
        "url": "https://www.androidauthority.com/royole-technologies-bankrupt-3501513/",
        "content": "",
        "created_utc": 1732132012.0,
        "subreddit_name": "technology",
        "comments": 13
    },
    {
        "title": "Why Doesn't iPad Mirroring Exist?",
        "score": 51,
        "url": "https://www.reddit.com/r/mac/comments/1gvvfyo/why_doesnt_ipad_mirroring_exist/",
        "content": "Apple has recently introduced iPhone mirroring to Mac. Why didn't they also implement iPad mirroring? It would seem simple to implement. Maybe I'm wrong?",
        "created_utc": 1732124948.0,
        "subreddit_name": "mac",
        "comments": 27
    },
    {
        "title": "Best value macbook as of today",
        "score": 41,
        "url": "https://www.reddit.com/r/mac/comments/1gvl1ps/best_value_macbook_as_of_today/",
        "content": "Although I’m really tempted by the base m4 mac mini I still need portability at least three times a year, so I’m curious, what is the m4 mini’s equivalent value king in the macbook lineup as of today?",
        "created_utc": 1732091716.0,
        "subreddit_name": "mac",
        "comments": 41
    },
    {
        "title": "Bestbuy was very accommodating during my Macbook Pro purchase details below. ",
        "score": 27,
        "url": "https://i.redd.it/jz5blkm1042e1.jpeg",
        "content": "I was looking for a silver Macbook Pro M4 Max but most retailers only had black for the 16\".\n \nHowever, Bestbuy had the one I wanted, along with a very flexible return policy, Jan 15.   \n\nDuring my search I noticed my local Microcenter had far and away the best price and in stock but only in black and a short return window, just 15 days.\n\nLong story short, Bestbuy price matched Microcenter, even though colors didn't match, providing the discount along with the extended return window without a hitch.\n\nHopefully this helps someone else in a similar conundrum in the future hunting for a good discount while obtaining the item you really need.\n\nHappy computing. \n",
        "created_utc": 1732131429.0,
        "subreddit_name": "mac",
        "comments": 8
    },
    {
        "title": "Any reason why my Macbook Pro does this?",
        "score": 23,
        "url": "https://www.reddit.com/gallery/1gvt9tp",
        "content": "From my own deductions I can sorta say that it's something regarding heating up, but it's just kinda annoying that it does this whenever I do any sort of performance heavy task. Vid on screen is just a random vid to show the glitches clearer. The model is a Macbook Pro 15-inch 2016, thank you in advance for the feedback!",
        "created_utc": 1732119635.0,
        "subreddit_name": "mac",
        "comments": 26
    },
    {
        "title": "Struggling to fully switch over to MacOS..",
        "score": 17,
        "url": "https://www.reddit.com/r/mac/comments/1gvqzng/struggling_to_fully_switch_over_to_macos/",
        "content": "As the title says, I'm struggling to switch over from windows to Mac, it just feels.. new, sleek, extremely modern, almost like technology has outgrown me and i'm only 28.\n\nI've moved all of my accounts over, I don't even use my old laptop anymore but it's like i've fallen out of love with technology almost? its weird? i've stopped coding, stopped doing any form of security research, stopped interacting with 99% of everything on my Mac over past month or two, I pretty much turn it on, go to do something, then lose motivation, spend half an hour to an hour doing menial/trivial nonsense then I switch it off.\n\nShould I have switched to Mac? I don't miss my old windows laptop, it was from 2012/2013 (old as hell), frankensteined it together with ssd's and rams.\n\nI wonder if it's more to do with my own productivity? \n\nthanks guys :)\n\n",
        "created_utc": 1732113667.0,
        "subreddit_name": "mac",
        "comments": 66
    },
    {
        "title": "Mac mini m4 Sound output",
        "score": 9,
        "url": "https://www.reddit.com/gallery/1gvla8o",
        "content": "Hi,\n\nHoping some Mac / Sonos buffs or generally anyone who knows what they're talking about can help me. I currently have a Mac mini m4 connected to my LG C3, This is then connected to my Sonos system via E-arc. \n\nBasically everything playing from my mac plays In stereo only. See images. Not sure if I need to change OS native Audio MIDI setup settings to get atmos content to play in atmos. 7.1/5.1 to play in there respective formats\n\nMac Mini M4 OS Sequoia 15.1.1, \nSonos ARC+Era300(x2)+Sub Gen 3, \nLG C3\n\nI am expecting the Sonos app to show atmos is playing like it does on Netflix content or Apple Music etc. Instead it's showing just stereo output\nNot sure what to do or try next.\n\nThanks !",
        "created_utc": 1732092826.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Reboot in Verbose mode but it never stopped",
        "score": 6,
        "url": "https://i.redd.it/gns8m3qev42e1.jpeg",
        "content": "My MacBook Air was stuck in loading screen, then I reboot in Verbose mode.. but it never stopped and looping these same messages..\n\nDoes anyone know what's going on? what do I do now? how do I start up my mac?\n\nThank you",
        "created_utc": 1732141979.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "NVMe + enclosure",
        "score": 4,
        "url": "https://www.reddit.com/r/mac/comments/1gvmclf/nvme_enclosure/",
        "content": "Hi !\n\nI'd like to replace my archaic external storage with something fast and ideally safe.\n\nBy “safe”, I mean that there is no risk of electrical problems due to overheating.\n\nWith my current low-cost hub, I'm often stressed by electrical noise.\n\nMy current SSDs are SATA and don't exceed 350MB/s.\n\nSo here I'd like to acquire a 4TB NVMe that will reach maximum speeds of 3000MB/s, assuming I can't get more with my iMac M1.\n\nCan you recommend a configuration that I won't regret ?\n\nMy budget is around $400.\n\nTY !\n\nhttps://preview.redd.it/iggz45u4812e1.jpg?width=960&format=pjpg&auto=webp&s=593d6710bd094d6ef1e93ef9a41579549ca4d8ac",
        "created_utc": 1732097883.0,
        "subreddit_name": "mac",
        "comments": 27
    },
    {
        "title": "Macbook M3 Air vs Macbook Pro M4 Which one should I choose?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gvp6w0/macbook_m3_air_vs_macbook_pro_m4_which_one_should/",
        "content": "Hi guys, I've been exploring the mac mini option for portable use but I've come to the conclusion that it won't be the best for me. So I decided to go for a macbook, at the moment I'm undecided between the macbook air M3 base model with 16gb 512gb ssd CPU-8 and GPU-10 for 1500€ or if it will pay 500€ more (1979€ in total) for the macbook pro M4 base model also with 16gb and 512gb ssd CPU-10 and GPU-10.\n\nI'm not focusing on the 4 thunderbolt ports or the memory card slot, I'm happy with just 2 thunderbolt ports.\n\nThe Macbook will be used for graphic design and UX/UI work.\n\nIs it worth it? is it not? I'd like to know what you think.\n\nThank you",
        "created_utc": 1732108404.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "switching from a macbook to an imac (FOMO)",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gw03tu/switching_from_a_macbook_to_an_imac_fomo/",
        "content": "i’ve been a long time user of macbook pros from programming to video editing to ecommerce. \n\ni’ve been using a 16” m1 since they released in 2021 and it has all the power i would need, but it can be ergonomically uncomfortable without a monitor. i dont think there are any good monitors on the market at a fair price, and im kind of a minimalist - so no monitor. \n\nthe funny thing is, i never even take it with me anywhere - it just sits on my desk. so i’ve been thinking, maybe i should just switch to an imac. \n\ni’m wondering if anyone else has done this, and if they regret it at all. ",
        "created_utc": 1732138490.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Is it worth waiting until black friday to buy a refurbished mac?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gvvtsx/is_it_worth_waiting_until_black_friday_to_buy_a/",
        "content": "Basically the title.\n\nDo Apple Refurbished Store products get Black Friday discounts or participate in Apple's Black Friday deals, like gift card promotions?",
        "created_utc": 1732125883.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Switch apps with trackpad only?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gvoal0/switch_apps_with_trackpad_only/",
        "content": "New Mac user here o/   \n  \nSo far I've been unable to find a way to easily swipe between the apps. With Windows 11 you can swipe the trackpad and it shows you the currently open apps where you can, using the same fingers, pick the one you were after very quickly. I often use this in Windows to quickly check my apps (as they all pop-up to the screen much like in Mission Control) if some of them has an update. Is there a Mac equivalent? \n\nI know I can swipe between apps if they're full screen, but it's slow and I prefer them not being full screen.\n\nI can also do command + tab, but it doesn't open minimized windows directly and you don't see the app, just the icon, before selecting it. \n\nMission Control is the closest thing that I'm after, but that also requires two different motions.\n\nIs there some other methods that I'm unaware of? Should I be using multiple desktops always and if, can I set-up them that specific programs always to Desktop 2 for example? What is the power user way?:)\n\nThere must be ton of great things I'm still unaware of.",
        "created_utc": 1732105549.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "Apple Further Expanding Into Ads, Now Directly Selling Ads in News App",
        "score": 15,
        "url": "https://www.macrumors.com/2024/11/19/apple-now-directly-selling-ads-in-news-app/",
        "content": "",
        "created_utc": 1732072429.0,
        "subreddit_name": "technews",
        "comments": 6
    },
    {
        "title": "How to set up Hearing Aid mode on your AirPods",
        "score": 6,
        "url": "https://mashable.com/article/how-to-use-apple-airpods-hearing-aids",
        "content": "",
        "created_utc": 1732129593.0,
        "subreddit_name": "technews",
        "comments": 4
    }
]