[
    {
        "title": "U.S. developing plans to spend $52 billion on chips supply [semis stimulus news]",
        "score": 1547,
        "url": "https://www.reddit.com/r/investing/comments/opjbxe/us_developing_plans_to_spend_52_billion_on_chips/",
        "content": "Via Reuters: \n\n“The Biden administration is developing plans to quickly spend $52 billion to deal with semiconductor supply issues if Congress passes a bill funding such efforts, U.S. Commerce Secretary Gina Raimondo said on Thursday.”\n\nSo no definite plans, but no deviations noted from previous discussions which gave the nod to INTC, QCOM, and TXN (primarily) as direct beneficiaries of any bill that gets passed. \n\nWorth keeping an eye on I think of you’re into semis plays.",
        "created_utc": 1626976862.0,
        "subreddit_name": "investing",
        "comments": 331
    },
    {
        "title": "Netflix bleeds subscribers in US and Canada, with no sign of recovery",
        "score": 7769,
        "url": "https://www.reddit.com/r/stocks/comments/opbdt0/netflix_bleeds_subscribers_in_us_and_canada_with/",
        "content": "Netflix lost 430,000 subscribers in the US and Canada in the second quarter and issued weaker than expected forecasts for later in the year, rekindling investor doubts over how the streaming group will fare after the economic reopening.\n\nThe California-based company predicted it would add 3.5m subscribers in the third quarter, disappointing investors who were looking for a stronger rebound in the second half of the year. Analysts had forecast that Netflix would add 5.9m subscribers during the third quarter.\n\nIn the past year and a half, Disney, Apple, WarnerMedia, Comcast and others have launched streaming platforms, and there are more than 100 streaming services for consumers to choose from, according to data company Ampere.\n\n https://arstechnica.com/gaming/2021/07/netflix-bleeds-subscribers-in-us-and-canada-with-no-sign-of-recovery/?amp=1",
        "created_utc": 1626950900.0,
        "subreddit_name": "stocks",
        "comments": 1778
    },
    {
        "title": "For Fidelity Customers if Internet goes down",
        "score": 380,
        "url": "https://www.reddit.com/r/Daytrading/comments/opk83j/for_fidelity_customers_if_internet_goes_down/",
        "content": " \n\nFellow Traders...\n\nFor any reason if the internet goes down and something crazy happens where you can not trade, please use their Fidelity Fast line.\n\n[Fidelity's Automated Service Telephone (FAST)](https://www.fidelity.com/customer-service/phone-numbers/fast/overview)\n\nAlso go ahead and download their PDF and get yourself oriented with all the helpful hints on their info page.\n\nGood luck out there!",
        "created_utc": 1626979434.0,
        "subreddit_name": "Daytrading",
        "comments": 40
    },
    {
        "title": "APPLE $150 FRIDAY",
        "score": 17,
        "url": "https://www.reddit.com/r/AAPL/comments/opq8xo/apple_150_friday/",
        "content": "AAPL will touch $150 Friday at some point",
        "created_utc": 1626998180.0,
        "subreddit_name": "AAPL",
        "comments": 18
    },
    {
        "title": "LEAPS vs Shares",
        "score": 2,
        "url": "https://www.reddit.com/r/AAPL/comments/opkazq/leaps_vs_shares/",
        "content": "I’m somewhat new to the world of options and I was trying to get a feel of which would be better to buy, Leaps or shares. It seems at least in theory, I could make a lot more if I held it for a year or two compared to holding shares. What are the advantages and disadvantages of buying leaps or holding shares of $aapl? What do you prefer? Thank you in advance!\n\n[View Poll](https://www.reddit.com/poll/opkazq)",
        "created_utc": 1626979659.0,
        "subreddit_name": "AAPL",
        "comments": 10
    },
    {
        "title": "Big breakout or correction ?",
        "score": 1,
        "url": "https://www.reddit.com/r/AAPL/comments/opfoa5/big_breakout_or_correction/",
        "content": "\nIm looking for a breakout at around 149/150. As of now a lot of earnings especially in FAANG have resulted in the stock declining,  is Apple the exception considering were near those highs as of now? Or will we see a correction again? Just wanted to hear some opinions.",
        "created_utc": 1626966378.0,
        "subreddit_name": "AAPL",
        "comments": 1
    }
]