[
    {
        "title": "Epic Games wins antitrust lawsuit against Google",
        "score": 938,
        "url": "https://www.reddit.com/r/stocks/comments/18g9t8e/epic_games_wins_antitrust_lawsuit_against_google/",
        "content": "\nSAN FRANCISCO — Epic Games won an antitrust lawsuit against Google on Monday, in a landmark decision where a jury found Google broke competition laws in how it ran its app store.\n\nThe decision is a major blow to the tech giant and the concept that Big Tech companies should have complete control over how pricing and payments are done on their massive internet platforms. It could open up other challenges to how large tech companies govern their marketplaces, potentially forcing them to allow alternate payment processors. That could cut into revenue for Google and other companies like Apple and Amazon, which make money by charging fees on any transactions on their platforms.\n\nIn summer 2020, Epic had revolted against Apple and Google’s payment-sharing systems for app developers. Epic tweaked its popular Fortnite app so users could pay the company directly. First Apple, then Google, booted Fortnite from their app stores for violating terms. Epic sued both companies, arguing the rules violated the Sherman Antitrust Act.\n\nhttps://www.washingtonpost.com/technology/2023/12/11/epic-google-trial-verdict/",
        "created_utc": 1702343630.0,
        "subreddit_name": "stocks",
        "comments": 164
    },
    {
        "title": "Jack Smith to use Trump's phone data at trial",
        "score": 14629,
        "url": "https://www.axios.com/2023/12/12/jack-smith-trump-phone-data-trial",
        "content": "",
        "created_utc": 1702386185.0,
        "subreddit_name": "news",
        "comments": 722
    },
    {
        "title": "GM Says It's Ditching Apple CarPlay and Android Auto for Your Safety",
        "score": 12280,
        "url": "https://www.motortrend.com/news/general-motors-removing-apple-carplay-android-auto-for-safety-tim-babbitt/",
        "content": "",
        "created_utc": 1702422776.0,
        "subreddit_name": "technology",
        "comments": 2754
    },
    {
        "title": "iOS 17.3 Beta Adds New Stolen Device Protection Feature to iPhone",
        "score": 1624,
        "url": "https://www.macrumors.com/2023/12/12/ios-17-3-stolen-device-protection-feature/",
        "content": "",
        "created_utc": 1702406012.0,
        "subreddit_name": "apple",
        "comments": 273
    },
    {
        "title": "iPhone 16 Early Prototypes: What Apple's Next-Generation iPhone Will Look Like",
        "score": 863,
        "url": "https://www.macrumors.com/2023/12/12/early-iphone-16-prototypes/",
        "content": "",
        "created_utc": 1702423108.0,
        "subreddit_name": "apple",
        "comments": 259
    }
]