[
    {
        "title": "FB & the Metaverse... Time to Sell?",
        "score": 1891,
        "url": "https://www.reddit.com/r/investing/comments/qhv6us/fb_the_metaverse_time_to_sell/",
        "content": " Seems to me that this re branding and Metaverse hype is really just an attempt to drive attention away from the recent confirmation that FB is actually horrible for our societies. Trying to keep the stock buoyed while deflecting. I've never been a heavy user of FB, always found it creepy, but I bought the IPO and bough more when it dropped to the $20 level. Been holding since. Now, I'm thinking of selling. It's been a good run for FB but their user base isn't growing with younger people and frankly I'm not sure I want to be invested in a company that is so blatantly bad for humanity. FB is on the verge of becoming like Philip Morris and listening to Zuch today... (he's just so insincere & unlikable) it's clear that neither he or FB is interested in addressing the issues. Not to mention the Metaverse is 10y out. I'm disappointed in this company and to quote Kramer (ya, I know) re. the recent FB news “This time just feels different.”",
        "created_utc": 1635451027.0,
        "subreddit_name": "investing",
        "comments": 745
    },
    {
        "title": "Amazon badly misses on earnings and revenue, gives disappointing fourth-quarter guidance",
        "score": 1845,
        "url": "https://www.reddit.com/r/stocks/comments/qhvgrf/amazon_badly_misses_on_earnings_and_revenue_gives/",
        "content": "https://www.cnbc.com/2021/10/28/amazon-amzn-earnings-q3-2021.html\n\nEarnings: $6.12 vs $8.92 per share expected, according to analysts surveyed by Refinitiv\n\nRevenue: $110.81 billion vs $111.6 billion expected, according to analysts surveyed by Refinitiv\n\nRevenue from Amazon Web Services totaled $16.11 billion in the quarter, up almost 39% from a year ago, according to a statement. Analysts polled by StreetAccount had expected $15.48 billion. Revenue had grown 37% in the second quarter.\n\nThe stock is dropping almost 5% after the earning release. The EPS miss is due to the tough comparison from last year 3rd quarter when Amazon enjoyed the pandemic e-commerce advantage. The miss on revenue also disappointed investors. The stock will still benefit going forward as it is dominating in cloud and e-commerce penetration is still in early stage.\n\nThanks for the awards.",
        "created_utc": 1635451818.0,
        "subreddit_name": "stocks",
        "comments": 427
    }
]