[
    {
        "title": "Nvidia to join Dow Jones Industrial Average, replacing Intel",
        "score": 1175,
        "url": "https://www.reddit.com/r/stocks/comments/1ghghq5/nvidia_to_join_dow_jones_industrial_average/",
        "content": "Nvidia is replacing Intel on the Dow Jones Industrial Average, a shakeup to the blue-chip index that replaces a flagging semiconductor company with the primary vendor of GPUs for AI.\n\nThe switch will take place on Nov. 8. In a separate move, Sherwin Williams will replace Dow Inc in the average as well, S&P Global said in a statement.\n\nShares of Nvidia have climbed over 180% so far in 2024 as investors have seen the company as the primary beneficiary of the AI boom.\n\nOn the other hand, Intel shares have fallen 51% so far this year as the company struggles with manufacturing, new competition for its central processors, and the impression that it has missed out on the AI trend.\n\nThe Dow contains 30 components and is weighted by the share price of the individual stocks instead of the companies total market value.\n\nSource: https://www.cnbc.com/2024/11/01/nvidia-to-join-dow-jones-industrial-average-replacing-intel.html",
        "created_utc": 1730496690.0,
        "subreddit_name": "stocks",
        "comments": 137
    },
    {
        "title": "Amazon CEO pledges AI investments will pay off as capital expenditures surge 81%",
        "score": 403,
        "url": "https://www.reddit.com/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/",
        "content": "Amazon CEO Andy Jassy is trying to reassure investors who may be worried about the future payoff of the company’s massive investments in generative artificial intelligence.\n\nOn a conference call with analysts following the company’s third-quarter earnings report on Thursday, Jassy pointed to the success of Amazon’s cloud computing business, Amazon Web Services, which has become a crucial profit engine despite the extreme costs associated with building data centers.\n\n“I think we’ve proven over time that we can drive enough operating income and free cash flow to make this a very successful return on invested capital business,” Jassy said. “We expect the same thing will happen here with generative AI.”\n\nAmazon spent $22.6 billion on property and equipment during the quarter, up 81% from the year before. Jassy said Amazon plans to spend $75 billion on capex in 2024 and expects an even higher number in 2025.\n\nThe jump in spending is primarily being driven by generative AI investments, Jassy said. The company is rushing to invest in data centers, networking gear and hardware to meet vast demand for the technology, which has exploded in popularity since OpenAI released its ChatGPT assistant almost two years ago.\n\n“It is a really unusually large, maybe once-in-a-lifetime type of opportunity,” Jassy said. “And I think our customers, the business and our shareholders will feel good about this long term that we’re aggressively pursuing it.”\n\nAI spending was a big topic on tech earnings calls this week. Meta on Wednesday raised its capital expenditures guidance, and CEO Mark Zuckerberg said he was “quite happy” with the team’s execution. Meanwhile, Microsoft’s investment in OpenAI weighed on its fiscal first-quarter earnings released on Wednesday, and the company said capital spending would continue to rise. A day earlier, Alphabet CFO Anat Ashkenazi warned the company expects capital spending to grow in 2025.\n\nAmazon has said its cloud unit has picked up more business from companies that need infrastructure to deploy generative AI models. It’s also launched several AI products for enterprises, third-party sellers on its marketplace and advertisers in recent months. The company is expected to announce a souped-up version of its Alexa voice assistant that incorporates generative AI, something Jassy said will arrive “in the near future.”\n\nAmazon hasn’t disclosed its revenue from generative AI, but Jassy said Thursday it’s become a “multi-billion-dollar revenue run rate” business within AWS that “continues to grow at a triple-digit year-over-year percentage.”\n\n“It’s growing more than three times faster at this stage of its evolution as AWS itself grew, and we felt like AWS grew pretty quickly,” he added.\n\nSource: [https://www.cnbc.com/2024/10/31/amazon-ceo-pledges-ai-investments-will-pay-off-as-capex-surges-81percent.html](https://www.cnbc.com/2024/10/31/amazon-ceo-pledges-ai-investments-will-pay-off-as-capex-surges-81percent.html)",
        "created_utc": 1730421881.0,
        "subreddit_name": "stocks",
        "comments": 76
    },
    {
        "title": "BlackRock launches ETF that expands beyond the ‘Magnificent Seven’",
        "score": 145,
        "url": "https://www.reddit.com/r/stocks/comments/1gh4zwd/blackrock_launches_etf_that_expands_beyond_the/",
        "content": "https://www.cnbc.com/2024/10/31/megacap-tech-gets-new-blackrock-etf.html\n\n\n> BlackRock’s iShares is trying to appeal to investors who want to diversify beyond from the so-called Magnificent Seven. The firm launched the iShares Top 20 U.S. Stocks ETF (TOPT) this month. It doesn’t just hold the Magnificent Seven — Apple, Amazon, Meta, Alphabet, Microsoft, Nvidia and Tesla. It’s made up of the 20 largest U.S. stocks by market capitalization. “What the iShares build ETFs are designed to do is to deliver a tool kit of simple solutions for investors to be able to capture the growth of some of the largest companies within the U.S. equity market today, but to do so in a broader and more diversified manner,” BlackRock’s Rachel Aguirre told CNBC’s “ETF Edge” on Monday.\n\n> Aguirre, the firm’s head of U.S. iShares product, noted the ETF’s mission is to deliver an easy and accessible way to tap into the innovation of megacaps – “whether that be in the tech-heavy Nasdaq space or, more broadly, within the S&P [500].” The ETF, according to Aguirre, provides a way for investors worried about the concentration of the Magnificent Seven stocks in the S&P 500.\n\n> On Thursday, the Magnificent Seven slid more than 3.5% as a group — losing around $615 billion in market cap. That’s equivalent to the size of JPMorgan Chase. However, the Magnificent Seven is still up about 43% so far year while the S&P 500 is up around 20% “It’s important for clients and investors to remember that there are split views on this topic. There are many investors who believe that the big will get bigger [and] that the winners will continue to win,” Aguirre said. “There’s also another side to this argument. There are many investors who believe that it’s actually a very worrisome time to continue investing in… mega-cap companies because of just their high valuations.”",
        "created_utc": 1730466592.0,
        "subreddit_name": "stocks",
        "comments": 57
    },
    {
        "title": "r/Stocks Daily Discussion & Fundamentals Friday Nov 01, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/stocks/comments/1gh1fyy/rstocks_daily_discussion_fundamentals_friday_nov/",
        "content": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.\n\nExpect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nBut growth stocks don't rely so much on EPS or revenue as long as they beat some other metric like subscriber count:  Going from 1 million to 10 million subscribers means more revenue in the future.\n\nValue stocks do rely on earnings reports, investors look for wall street expectations to be beaten on both EPS & revenue.  You'll also find value stocks pay dividends, but never invest in a company solely for its dividend.\n\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia page](https://www.investopedia.com/fundamental-analysis-4689757/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp) and read [their PDF on the topic.](http://i.investopedia.com/inv/pdf/tutorials/fundamentalanalysis_intro.pdf)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1730453408.0,
        "subreddit_name": "stocks",
        "comments": 226
    },
    {
        "title": "spgi or VOO? how do i know what the best s&p or index fund is to invest in?",
        "score": 1,
        "url": "https://www.reddit.com/r/stocks/comments/1ghep0w/spgi_or_voo_how_do_i_know_what_the_best_sp_or/",
        "content": "hey! i'm new to investing and just wanted advice on what the best stocks to invest in are, i have a roth IRA through merrill. right now im invested in VOO SPGI, amazon, SOXX and a couple others. sold some of my google shares which was stupid. but just wanted to know what i should put my money in. i’m relatively young so i know i have time. but i really want to learn as much as possible. if you have any good advice on general stocks or on these 2 specific ones im referring to please share!!",
        "created_utc": 1730491904.0,
        "subreddit_name": "stocks",
        "comments": 24
    },
    {
        "title": "Set a hard rule of take profits at %25",
        "score": 1911,
        "url": "https://i.redd.it/9b789z5bocyd1.png",
        "content": "Just sold my Amazon calls for a another 10k been a good year thank you guys I got my start with an NVDA yolo because of this sub 🤣",
        "created_utc": 1730493054.0,
        "subreddit_name": "wallstreetbets",
        "comments": 200
    },
    {
        "title": "No clue with how to optimize my portfolio",
        "score": 60,
        "url": "https://www.reddit.com/r/investing/comments/1ggyls9/no_clue_with_how_to_optimize_my_portfolio/",
        "content": "My three fund portfolio is made up of 33% S&P index, 33% tech companies' stock (NVDA and Google), and 33% foreign currency saving. Do you have any advice if I want to go 100% in stocks in the hope to get faster growth? Any sectors except tech is worth investing?",
        "created_utc": 1730439718.0,
        "subreddit_name": "investing",
        "comments": 67
    },
    {
        "title": "What are the best resources for research?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gh2e47/what_are_the_best_resources_for_research/",
        "content": "I'm a few years into investing, and I've mainly invested in ETFs the entire time. I've made money, but would also like to start researching individual stocks. This is usually discouraged, but I would research stocks in industries I know, like tech, web, and pharma. For example, I made almost as much with my 10% of individual stocks as I did with all 90% of my ETFs. I know I got a bit lucky buying into NVDA relatively early, but I've built my own computers for two decades and always considered them a solid company. However, I didn't predict the need for Nvidia cards during the AI boom. \n\nMore recently, I have been watching RDDT since its IPO. When it sank to 40.00 shortly after the IPO, I felt it was undervalued and a bargain at that price. One significant predictor for me was that most of my google searches would autocomplete with “reddit” on the end of it. Those were my two huge winners out of nine stocks total. Now, I want to invest around 20-25% in individual stocks, but besides a company's financials, I'm unsure where to find the best independent research, free or paid. Any suggestions you might have would be greatly appreciated. ",
        "created_utc": 1730457580.0,
        "subreddit_name": "investing",
        "comments": 9
    }
]