[
    {
        "title": "I'm giving away an iPhone 12 Pro/Max/Mini to a commenter at random to celebrate Apollo for Reddit's iOS 14 update, plus the new iPhones, plus some cheer amongst COVID. Simply leave a comment and you're entered! Good luck, winner announced in 24 hours at 11 PM GMT.",
        "score": 29429,
        "url": "https://www.reddit.com/r/apple/comments/juv6tu/im_giving_away_an_iphone_12_promaxmini_to_a/",
        "content": "WINNER HERE: https://www.reddit.com/r/apple/comments/jw40ai/hey_apollo_for_reddit_app_guy_here_back_with_the/\n\n[***GIVEAWAY ENTRY HAS NOW CONCLUDED. I'm in class now but will draw the winner tonight and post the results, stay tuned!***]\n\n***[PART 3 is here, since we hit the comment cap on this thread: https://reddit.com/r/apolloapp/comments/jv6f78/part_3_im_giving_away_an_iphone_12_promaxmini_to/]***\n\nHey,\n\nI'm the guy who builds [Apollo for Reddit](https://itunes.apple.com/app/id979274575), an alternative iPhone app for Reddit that people on r/Apple have been really kind to in loving. I had a lot of fun working on the iOS 14 update with a ton of cool, customizable home screen Widgets, Picture in Picture video, and a bunch of other Reddit meets iOS 14 goodness, and now that all the new iPhones are out I wanted to celebrate it with a giveaway. (Who said those YouTubers get to have all the fun?)\n\nI did this giveaway [last year for iOS 13](https://www.reddit.com/r/apple/comments/d7ejpn/im_giving_away_an_iphone_11_pro_to_a_commenter_at/) if some of you remember and everyone seemed to have a great time, so I figured making it an annual thing could be fun. ([Proof of winner](https://www.reddit.com/r/apolloapp/comments/e085k1/apollo_iphone_giveaway_i_won/)) Plus the people who use Apollo are all super nice and give me awesome suggestions all the time for making it even better so consider it a thank you as well. \n\n# What Do I Win?\n\nThe winner gets their choice of any iPhone 12 model (Pro or non Pro, Max, normal sized or Mini) in any color and 128 GB capacity. Are you a BLUE person? RED? GOLD?! When this post is 24 hours old, at 11 PM GMT ([countdown](https://www.wolframalpha.com/input/?i=time+until+11+pm+gmt)), I'll post in r/ApolloApp who the winner is, I'll also DM you for details and people will probably spam you as well. \n\n# Rules\n\nSimply check out this thread and comment and you're entered! Don't spam jibberish though please, and no multiple comments. If you're looking for an idea for a comment, tell me your favorite iPhone model of all time, or the first third party app you remember downloading. Account must have been created at the time of this post to prevent creating accounts just to enter. You do not have to download Apollo to enter, but it may give you extra luck who knows.\n\n# Apollo? iOS 14 update?\n\nApollo is an alternative Reddit app for iOS with a focus on clean design and feeling right at home on iOS with a native design and adopting all the best, newest features, like Widgets, Picture in Picture video, super fast media viewer, and more. I started building it after finishing working at Apple in 2015 and have been working on it full time since. It's free to download and has over 100,000 five-star reviews, so [you should really check it out](https://itunes.apple.com/app/id979274575)! It's built solely by me, and I built it closely with community input to craft the best Reddit experience out there. \n\nEven if you're used to the official app, I think you'll really like the improvements Apollo offers to your browsing experience, even if it just [prevents you from getting Rick Roll'd](https://www.reddit.com/r/apolloapp/comments/79jjlx/just_realized_that_apollo_has_built_in_rick_roll/). \n\n# Do you have any pets?\n\nYeah I have two cats named [Hugo](https://i.imgur.com/zlbhVQg.jpg) and [Ruby](https://i.imgur.com/uWU4Kfc.jpg). They're great, I also get to pet my neighbor's dog Leonard sometimes who is really cute. Sorry I don't have a picture of him but picture a big black shaggy dog.\n\n# Thank You!\n\nSeriously, have some fun and best of luck! My whole job exists thanks to the kindness of this subreddit and community, so thank you and I'll do my best to continue to impress you with some more sick updates. :) \n\n\\- Christian\n\n***[PART 3 is here, since we hit the comment cap on this thread: https://reddit.com/r/apolloapp/comments/jv6f78/part_3_im_giving_away_an_iphone_12_promaxmini_to/]***",
        "created_utc": 1605480089.0,
        "subreddit_name": "apple",
        "comments": 84753
    }
]