[
    {
        "title": "Apple CEO Tim Cook Sells Over $50 Million Worth of Stock",
        "score": 4933,
        "url": "https://www.macrumors.com/2024/10/02/tim-cook-sells-50-million-in-apple-stock/",
        "content": "",
        "created_utc": 1727904511.0,
        "subreddit_name": "apple",
        "comments": 449
    },
    {
        "title": "Apple rolling out new beta firmware for AirPods Pro 2",
        "score": 1292,
        "url": "https://9to5mac.com/2024/10/01/apple-new-beta-firmware-airpods-pro-2/",
        "content": "",
        "created_utc": 1727833609.0,
        "subreddit_name": "apple",
        "comments": 133
    },
    {
        "title": "iOS 18.0.1 coming soon with iPhone and iPad bug fixes [Update]",
        "score": 829,
        "url": "https://9to5mac.com/2024/10/02/ios-18-0-1-coming-soon/",
        "content": "",
        "created_utc": 1727870464.0,
        "subreddit_name": "apple",
        "comments": 221
    },
    {
        "title": "Nvidia CEO Jensen Huang: “Demand for Blackwell is Insane”",
        "score": 597,
        "url": "https://www.reddit.com/r/stocks/comments/1futbrv/nvidia_ceo_jensen_huang_demand_for_blackwell_is/",
        "content": "Nvidia (NASDAQ:NVDA) CEO Jensen Huang indicated the demand for its latest GPU, Blackwell, remains on track.\n\n\n\"Blackwell is in full production,\" Huang said Wednesday during an interview with CNBC. \"Blackwell is as planned, and the demand for Blackwell is insane. Everybody wants to have the most, and everybody wants to be first.\"\n\n\nThe Blackwell GPUs are already being released to data centers and industrial customers for artificial intelligence applications. They will be available for consumers in 2025.\n\n\n\"The thing that we have done with Blackwell, and what we have announced, is there is new Al infrastructure generation every year,\" Huang said. \"So, we're updating our platform every single year. If we can increase the performance, like we've done for Hopper and Blackwell ... we're effectively increasing the revenue or throughput for our customers on these infrastructures by a couple to three times each year.\"\n\n\nHyperscalers are expected to spend about $160B in 2024 on Al infrastructure. Every frontier large language model requires many times more compute power than the one prior.\n\n\n\"At a time when technology is moving so fast, it gives us an opportunity to triple down and to really drive the innovation cycle so that we can increase capabilities, increase our throughput, decrease our costs, decrease our energy consumption,\" Huang added.",
        "created_utc": 1727909486.0,
        "subreddit_name": "stocks",
        "comments": 142
    },
    {
        "title": "Yes it really really can be done",
        "score": 272,
        "url": "https://www.reddit.com/r/Daytrading/comments/1fuemqr/yes_it_really_really_can_be_done/",
        "content": "Putting out a post for all those who are struggling and think they’re never gonna break through and be successful with daytrading. I have broken through. It is possible. It just had to come together for me after all these years. I’m making really good money daytrading. I daytrade SPY and QQQ options. \n\nThere’s so much negativity about daytrading. So many people say you will fail and it can’t be done. I’ve had plenty of people telling me that personally and these are people close to me. At age 58 I really don’t care. I decided years ago I would stick with us until it worked   ",
        "created_utc": 1727871000.0,
        "subreddit_name": "DayTrading",
        "comments": 75
    },
    {
        "title": "$150,000 account, $339.40 Average profit per day, This is day 11",
        "score": 221,
        "url": "https://www.reddit.com/r/Daytrading/comments/1fuu1h8/150000_account_33940_average_profit_per_day_this/",
        "content": "I can borrow 2.5x for volatile stocks like NVDA, 4x for AAPL, as long as I liquidate the position before the market closes. My money I have on my own is $60,000.\n\nI made a total of $3,733.45, since September 18th. There are 252 trading days in a year on average, I keep this up I will make $85,528.80 by next October 2025. I have already 2 years of experience trading the markets. Am I out of my mind thinking this is possible to keep it up or would you believe I'm just on a winning streak just for now?\n\n11 days doesn't seem like enough data to go off of, but I can almost guarantee myself I can make $50 a day trading no problems. but of course $339.40 is almost 7x that amount, but I do have $30,000 more in my account than I had last year.\n\n\\[UPDATE\\]: DAY 13, my average decreased and is now at $299.86 per day when taking all the gains made from the past 13 trading days and dividing it by 13. As expected the value is decreasing. I'm not getting these lucky win streaks anymore, 13 trading days just makes up for a little over 5% of the trading year, so far I only have 5% of data to rely on compared to a years worth of data.",
        "created_utc": 1727911575.0,
        "subreddit_name": "DayTrading",
        "comments": 176
    },
    {
        "title": "After 25 years trading – here are some common themes",
        "score": 118,
        "url": "https://www.reddit.com/r/Daytrading/comments/1fudebf/after_25_years_trading_here_are_some_common_themes/",
        "content": "Over the years, what has really changed? I'd say the biggest change has been access. When I first started, I would take the pushbike to the bank and use the news paper for stock prices. (I kid you not).\n\nNow we can place a trade from our phone.\n\nThe issue with access, is that really it's a double-edged sword. We have access to data, to brokers and to charts, news and of course social media. This is not always a good thing.\n\nToo often, rookie traders are seeking perfection and tend to over think the situation, this is emphasised by the data they have in front of them - too many indicators, instruments, other people's opinions. All of which lead to poor decisions in the general sense.\n\nOn the side of themes; similar issues with trying to catch bottoms and tops, if you follow crypto at all, you will see everyone catches, every top and buys every bottom. It's AMAZING all these 8 figure traders who are never wrong.\n\nWhich brings me back to seeking perfection. In trading, there is no such thing. No silver bullet, no magic formula or 100% winning strategy. The sooner you realise it's all about the statistics, the easier your trading life will become. If you can stay in the game for 1,000 trades, 10,000 trades you will have a net gain. When you risk it all on a trade or two, you will blow your account more often than you make money.\n\nThe main themes I have seen over the years;\n\nIt will be different this time\n\nWhat is the best strategy\n\nHow to go from demo to real accounts\n\nShould I buy \"x\" at this price\n\n  \nSocial-confirmation and human sentiment have not changed much in the last 100 years, we are driven by both fear and greed.\n\nWork on the statistics, find your edge with a simple 3:1 RR strategy, follow the trend until the end and use proper risk management. This will see you through.",
        "created_utc": 1727866764.0,
        "subreddit_name": "DayTrading",
        "comments": 36
    },
    {
        "title": "I ded it",
        "score": 2940,
        "url": "https://i.redd.it/b10wodbxcfsd1.jpeg",
        "content": "2016-2024\n\nShorted $AMD and $TSLA -40k (queen su bae/tsla private 420 haha)\n$RKLB calls from $3.50-$10 $SPY and $CRSR flips +80k\n\nSpace good. Family no longer calls me autistic but special.\n\nI’m going to uninstall now, see you all tomorrow.\n\nNever give up brother autismos.",
        "created_utc": 1727910456.0,
        "subreddit_name": "wallstreetbets",
        "comments": 196
    }
]