[
    {
        "title": "Which companies’ products do you use so much that you bought their stock?",
        "score": 515,
        "url": "https://www.reddit.com/r/stocks/comments/18ci8h3/which_companies_products_do_you_use_so_much_that/",
        "content": "I feel like this is a forgotten about / under appreciated investment “strategy.”\n\n\nIt’s fun to look for the next big thing like space, crypto, renewable energy, crispr, etc but sometimes the best companies are more obvious \n\n\nI’ve been using Apple, Amazon, costco for 8+ years and I’m loving it, if only I had been invested for just as long. I’m trying to think of examples where it would’ve failed too, perhaps SNAP or nintendo would be companies whose products I used a lot haven’t done great. \n\n\nRecently I’ve been picking up Sony because I love my ps5 and Robinhood bc of the UI, ease of use, and solid apy and IRA match. Anyone else really like a product so you buy the stock?",
        "created_utc": 1701907361.0,
        "subreddit_name": "stocks",
        "comments": 642
    },
    {
        "title": "Alphabet $GOOG(L) shares up 6% following announcement of new Gemini AI model",
        "score": 248,
        "url": "https://www.reddit.com/r/stocks/comments/18d0un4/alphabet_googl_shares_up_6_following_announcement/",
        "content": "The new Gemini AI model has outperformed humans and GPT-4 in several benchmarks, being the first to outperform humans on MMLU (Massive Multitask Language Understanding). Gemini comes in three forms: Nano, Pro, and Ultra. The Ultra model is the most powerful and will be publicly available next year, the Pro model has currently been integrated into Bard, and the Nano model is currently available on the Pixel 8 Pro smartphone.  \n\nRefer to the links below for more information.\n\n[https://deepmind.google/technologies/gemini/#introduction](https://deepmind.google/technologies/gemini/#introduction)\n\n[https://www.barrons.com/articles/google-ai-gemini-alphabet-stock-cfce8432](https://www.barrons.com/articles/google-ai-gemini-alphabet-stock-cfce8432)",
        "created_utc": 1701970553.0,
        "subreddit_name": "stocks",
        "comments": 71
    }
]