[
    {
        "title": "Apple wins bid to pause Apple Watch ban at US appeals court",
        "score": 340,
        "url": "https://www.reddit.com/r/stocks/comments/18s76un/apple_wins_bid_to_pause_apple_watch_ban_at_us/",
        "content": "Apple scored a victory on Wednesday when a U.S. appeals court paused a government commission's import ban on some of the company's popular Apple smartwatches following a patent dispute with medical-technology firm Masimo.\n\nThe tech giant had filed an emergency request asking the U.S. Court of Appeals for the Federal Circuit to halt the order after appealing the U.S. International Trade Commission's (ITC) decision that it had infringed Masimo's patents.\n\nMasimo declined to comment on the court's decision, while Apple did not immediately respond.\n\nA final decision could cost either company millions of dollars and potentially force a settlement or some kind of technological workaround by Apple, analysts said.\n\nMasimo shares were down almost 4% following the decision, and Apple shares were largely flat.\n\n\"This is a big win for Apple that was unexpected by many given the legal issues involved in this patent battle,\" Wedbush Securities analyst Dan Ives said. \"Masimo now has a big fight ahead. We expect an appeals case in January to be a big moment.\"\n\nIn a four-paragraph ruling, the appeals court said it would halt the ban while it considers Apple's motion for a longer-term pause during the appeals process. The court gave the ITC until Jan. 10 to respond to Apple's request.\n\nU.S. President Joe Biden's administration declined to veto the ban on Tuesday, allowing it to take effect. Apple asked for a pause of the ban later that day.\n\nOn Tuesday, Apple told the court that U.S. Customs and Border Protection is considering whether redesigned versions of its watches infringe Masimo's patents and can be imported. The customs agency has set a target date of Jan. 12 for its decision, Apple said.\n\nMasimo has accused Apple of hiring away its employees, stealing its pulse oximetry technology and incorporating it into Apple Watches.\n\nThe ITC barred imports and sales of Apple Watches with technology for reading blood-oxygen levels. Apple has included a pulse oximeter feature in its smartwatches starting with its Series 6 model in 2020.\n\nApple can also now sell the Series 9 and Ultra 2 smartwatches in the U.S., after pausing sales last week due to the ITC decision. The watches had remained available at other retailers including Amazon, Best Buy, Costco and Walmart.\n\nThe ban did not affect the Apple Watch SE, a less-expensive model without a pulse oximeter. Previously sold watches also were not be affected by the ban.\n\nIf the import ban remains in place, it could cost Apple from high hundreds of millions of dollars to very low billions of dollars, Ben Bajarin, CEO of analyst firm Creative Strategies, said before the decision was announced.\n\n\"Going forward, it's absolutely certain they are going to have to take a different approach in future hardware to still enable this feature,\" he said of Apple.\n\nA jury trial on Masimo's allegations against Apple in California federal court ended with a mistrial in May. Apple has separately sued Masimo for patent infringement in federal court in Delaware and called Masimo's legal actions a \"maneuver to clear a path\" for its own competing smartwatch.\n\nApple's wearables, home and accessory business, which includes the Apple Watch, AirPods earbuds and other products, brought in $8.28 billion in revenue during the third quarter of 2023, according to a company report.\n\nhttps://finance.yahoo.com/news/apple-wins-bid-pause-apple-163531965.html",
        "created_utc": 1703701056.0,
        "subreddit_name": "stocks",
        "comments": 47
    },
    {
        "title": "Whats your \"this could be the next tsla or aapl\" in terms of what they returned in the last 10 years",
        "score": 273,
        "url": "https://www.reddit.com/r/stocks/comments/18s30mt/whats_your_this_could_be_the_next_tsla_or_aapl_in/",
        "content": "Just like the title says.... what are people's long term plays that could have the returns the last 10 years tsla or appl had over the next 10 years. I've recently been researching into space companies like RKLB, LUNR, RDW, & LLAP. Thinking of getting into RKLB and LUNR with the latter having a potential catalyst in Feb. Doesn't have to be space industry but thats something I've been thinking about. what are others looking at?",
        "created_utc": 1703690342.0,
        "subreddit_name": "stocks",
        "comments": 546
    },
    {
        "title": "Apple Watch ban temporarily paused",
        "score": 1567,
        "url": "https://www.theverge.com/2023/12/27/24016464/apple-watch-itc-ban-paused",
        "content": "",
        "created_utc": 1703696412.0,
        "subreddit_name": "apple",
        "comments": 290
    },
    {
        "title": "Apple Appeals U.S. Ban That Halted Watch Sales",
        "score": 1401,
        "url": "https://www.wsj.com/tech/apple-appeals-u-s-ban-on-watch-sales-b7ab19c3?st=n23zme2u0sowfx6&reflink=article_copyURL_share",
        "content": "",
        "created_utc": 1703658588.0,
        "subreddit_name": "apple",
        "comments": 263
    },
    {
        "title": "The Late-Night Email to Tim Cook That Set the Apple Watch Saga in Motion",
        "score": 864,
        "url": "https://www.bloomberg.com/news/articles/2023-12-27/what-started-the-apple-watch-ban-saga-a-late-night-email-to-ceo-tim-cook",
        "content": "",
        "created_utc": 1703679721.0,
        "subreddit_name": "apple",
        "comments": 117
    },
    {
        "title": "Japan prepares regulation requiring Apple to allow sideloading",
        "score": 732,
        "url": "https://9to5mac.com/2023/12/26/japan-regulation-apple-sideloading-ios/",
        "content": "",
        "created_utc": 1703661818.0,
        "subreddit_name": "apple",
        "comments": 120
    }
]