[
    {
        "title": "Meta shares plunge 20% as Facebook owner sees slowing growth",
        "score": 2302,
        "url": "https://www.reddit.com/r/investing/comments/sj1pz8/meta_shares_plunge_20_as_facebook_owner_sees/",
        "content": "Article link: https://www.reuters.com/technology/facebook-owner-meta-forecasts-q1-revenue-below-estimates-2022-02-02/\n\nFeb 2 (Reuters) - Facebook owner Meta Platforms Inc (FB.O) shares plunged 20% late on Wednesday as the social media company missed on Wall Street earnings estimates and posted a weaker-than-expected forecast.\n\nMeta said it faced hits from Apple Inc's (AAPL.O) privacy changes to its operating system, which have made it harder for brands to target and measure their ads on Facebook and Instagram, and from macroeconomic issues like supply-chain disruptions. read more\n\nThe after-hours slump in Meta shares vaporized $200 billion worth of its market value, with another $15 billion in value lost from peers Twitter Inc (TWTR.N), Snap Inc (SNAP.N) and Pinterest Inc (PINS.N).\n\nShares of Alphabet Inc (GOOGL.O), which posted record quarterly sales that topped expectations on Tuesday, were down 1.3%. read more\n\nMeta, which has the second-largest digital ad platform in the world after Google, had previously warned its advertising business faced \"significant uncertainty\" in the fourth quarter. read more\n\nThe company forecast first-quarter revenue in the range of $27 billion to $29 billion. Analysts were expecting $30.15 billion, according to IBES data from Refinitiv.\n\nApple's changes to its operating software give users the preference to allow tracking of their activity online, making it harder for advertisers who rely on data to develop new products and know their market.\n\nThe company's total revenue, the bulk of which comes from ad sales, rose to $33.67 billion in the fourth quarter from $28.07 billion a year earlier, beating analysts' estimates of $33.40 billion, according to IBES data from Refinitiv.\n\nNet loss from Meta's Reality Labs, the company's augmented and virtual reality business, was $10.2 billion for the full year 2021, compared with a $6.6 billion loss the previous year. It was the first time the company had broken out this segment in its results.\n\nCEO Mark Zuckerberg had previously warned that the company's investment in this area would reduce 2021 operating profit by $10 billion and would not be profitable \"any time in the near future.\"\n\nThe company said on Wednesday it would this year change its stock ticker to \"META,\" the latest step in its rebrand to focus on the metaverse, a futuristic idea of virtual environments where users can work, socialize and play.\n\nThe tech giant, which changed its name in October to reflect its metaverse aims, is betting the metaverse will be the successor to the mobile internet. It did not comment on the price of a deal with Roundhill Investments, which said in January it would stop using the symbol for its Roundhill Ball Metaverse ETF.\n\nMeta's rebrand comes at a time of increasing scrutiny from lawmakers and regulators over allegations of anticompetitive conduct and over the impacts of how it handles harmful or misleading content across its Facebook and Instagram platforms. read more\n\n\"If you're putting billions up front and not really expecting return for years, shareholders are going to be hesitant,\" ABI Research analyst Eric Abbruzzese said, referring to the metaverse costs.\n\nDisclosure: I have long positions for $FB.",
        "created_utc": 1643840353.0,
        "subreddit_name": "investing",
        "comments": 648
    },
    {
        "title": "Meta/Facebook stock crashes -15% AH after earnings release",
        "score": 7811,
        "url": "https://www.reddit.com/r/stocks/comments/sizyir/metafacebook_stock_crashes_15_ah_after_earnings/",
        "content": "Facebook reported earnings after the bell. Here are the results.\n\nEarnings per share: **$3.67 vs $3.84 expected**, according to a Refinitiv survey of analysts\n\nRevenue: $33.67 billion vs $33.4 billion expected, according to Refinitiv\n\nDaily Active Users (DAUs): **1.93B** vs. 1.95 billion expected by analysts, according to StreetAccount\n\nMore here: https://www.cnbc.com/2022/02/02/facebook-parent-meta-fb-q4-2021-earnings.html",
        "created_utc": 1643836131.0,
        "subreddit_name": "stocks",
        "comments": 1503
    },
    {
        "title": "Why Apple Stock will hit $210 in 2022 - Apple Stock Analysis and Predictions",
        "score": 6,
        "url": "https://youtu.be/Wo5rroMoquE",
        "content": "",
        "created_utc": 1643805613.0,
        "subreddit_name": "AAPL",
        "comments": 2
    }
]