[
    {
        "title": "The ending of Google's monopoly trial has Silicon Valley on edge",
        "score": 470,
        "url": "https://www.reddit.com/r/stocks/comments/1ckv9wx/the_ending_of_googles_monopoly_trial_has_silicon/",
        "content": "https://finance.yahoo.com/news/the-ending-of-googles-monopoly-trial-has-silicon-valley-on-edge-113835464.html\n\n>A landmark antitrust case pitting Google (GOOG, GOOGL) against the Justice Department entered its final stage this past week as prosecutors from the federal government and 14 states said in their closing arguments that Google illegally monopolized the online search and search advertising markets.\n\n>A government win would certainly threaten a giant piece of Google’s $237.8 billion profit engine. But the outcome, which will be decided by US District Judge Amit Mehta in the weeks or months to come, also has giant implications for some of the other big names in the tech world.\n\n>That's because Apple (AAPL), Amazon (AMZN), and Meta (META) are defending themselves against a series of other federal- and state-led antitrust suits, some of which make similar claims, and because all three stand to lose or gain depending on the outcome.\n\n>The government argues Google is violating Section 2 of the Sherman Act by blocking competitors from entering three distinct markets: general online search, search advertising, and search text advertising.\n\n>A government win would put at risk the billions of dollars in mutually lucrative contracts between Google and Apple, as well as deals with other device manufacturers and telecom companies.\n\n> The government alleged in its case that Google pays billions of dollars each year to LG, Motorola (MSI), and Samsung; major US wireless carriers such as AT&T (T), T-Mobile (TMUS), and Verizon (VZ); and browser developers such as Mozilla, Opera, and UCWeb.\n\n>Government prosecutors have alleged that Google had been paying Apple an estimated $8 billion to $12 billion per year — a portion of search ad revenue — in exchange for awarding Google Search default placement on Apple devices.\n\n>The government has yet to say what precise remedy it desires should it prevail against Google. If the government does win on any of its claims, a separate remedies phase of the trial would be held.",
        "created_utc": 1714926877.0,
        "subreddit_name": "stocks",
        "comments": 177
    },
    {
        "title": "Under-screen Face ID allegedly pushed back to 2026 iPhone 18 Pro",
        "score": 1885,
        "url": "https://appleinsider.com/articles/24/05/04/under-screen-face-id-allegedly-pushed-back-to-2026-iphone-17-pro",
        "content": "",
        "created_utc": 1714936030.0,
        "subreddit_name": "apple",
        "comments": 365
    },
    {
        "title": "iPad event video on Tuesday to last about 35 minutes",
        "score": 1098,
        "url": "https://9to5mac.com/2024/05/05/report-ipad-event-video-on-tuesday-to-last-about-35-minutes/",
        "content": "",
        "created_utc": 1714938406.0,
        "subreddit_name": "apple",
        "comments": 211
    }
]