[
    {
        "title": "Broadcom says it will sell $12 billion in AI parts and custom chips this year",
        "score": 347,
        "url": "https://www.reddit.com/r/stocks/comments/1fa2ai9/broadcom_says_it_will_sell_12_billion_in_ai_parts/",
        "content": "Broadcom reported fiscal third-quarter results on Thursday that beat Wall Street expectations for revenue and earnings.\n\nBroadcom shares fell 7% in extended trading after guidance was in-line with expectations.\n\nHere is how the chipmaking conglomerate did versus LSEG consensus estimates for the quarter that ended Aug. 4:\n\nEarnings per share: $1.24 adjusted vs. $1.20 expected\n\nRevenue: $13.07 billion vs. $12.97 billion expected\n\nBroadcom projects current-quarter revenue of $14 billion, versus $1.36 per share on $14.04 billion expected.\n\nBroadcom reported a net loss of $1.88 billion, or a loss of 40 cents per share, versus net income in the year-ago quarter of $6.12 billion, or $1.24 per share.\n\nThe company said the net loss for the third quarter includes a one-time tax provision of $4.5 billion related to trading intellectual property rights from one company segment to another based in the U.S. as part of supply chain management.\n\nBroadcom stock is up 75% in the past year as investors have come to appreciate that the company produces several parts that are required for big data centers or can be used to create infrastructure for artificial intelligence. For example, Broadcom works on Google’s TPU chip, which Apple used to train some of its AI features.\n\nBroadcom CEO Hock Tan said in a statement that the company expects to record $12 billion in sales from AI parts and custom chips in fiscal 2024, up from a previous forecast of $11 billion.\n\n“Broadcom’s third quarter results reflect continued strength in our AI semiconductor solutions and VMware,” Tan said in a statement. The company reported $7.27 billion in semiconductor sales during the quarter, up 5% annually. It is still larger than Broadcom’s infrastructure software segment, which reported $5.8 billion in sales, much of which is from the company’s VMware acquisition.\n\nSource: https://www.cnbc.com/2024/09/05/broadcom-avgo-earnings-report-q3-2024.html",
        "created_utc": 1725583252.0,
        "subreddit_name": "stocks",
        "comments": 67
    },
    {
        "title": "10 years later, Apple Pay is amazing — and about to change",
        "score": 3005,
        "url": "https://www.theverge.com/2024/9/5/24235874/apple-pay-10-years-open-nfc-ios",
        "content": "",
        "created_utc": 1725632403.0,
        "subreddit_name": "apple",
        "comments": 592
    },
    {
        "title": "'Noticeably Thinner' Apple Watch Series 10 to Eventually Get Sleep Apnea Detection",
        "score": 2418,
        "url": "https://www.macrumors.com/2024/09/06/apple-watch-10-sleep-apnea/",
        "content": "",
        "created_utc": 1725624002.0,
        "subreddit_name": "apple",
        "comments": 444
    },
    {
        "title": "TrendForce: Both iPhone 16 Pro Models to Feature 256GB Base Storage",
        "score": 991,
        "url": "https://www.macrumors.com/2024/09/06/both-iphone-16-pro-models-256gb-base-storage/",
        "content": "",
        "created_utc": 1725619303.0,
        "subreddit_name": "apple",
        "comments": 208
    },
    {
        "title": "Everything to Expect From Apple’s iPhone 16 Launch on Sept. 9",
        "score": 952,
        "url": "https://www.bloomberg.com/news/articles/2024-09-06/apple-sept-9-event-preview-iphone-16-apple-intelligence-airpods-and-watches",
        "content": "",
        "created_utc": 1725638085.0,
        "subreddit_name": "apple",
        "comments": 296
    },
    {
        "title": "Gurman: New AirPods Max and Apple TV Unlikely to Be Announced at September Apple Event",
        "score": 865,
        "url": "https://www.macrumors.com/2024/09/06/new-airpods-max-and-apple-tv-unlikely/",
        "content": "",
        "created_utc": 1725649237.0,
        "subreddit_name": "apple",
        "comments": 166
    }
]