[
    {
        "title": "What are the beaten down companies that are still worth buying and holding? ",
        "score": 470,
        "url": "https://www.reddit.com/r/stocks/comments/1dlmms3/what_are_the_beaten_down_companies_that_are_still/",
        "content": "SPY still at ATH carried by magnificent 7. I know “time in the market beats timing the market” but it’s hard to justify buying companies like NVDA, Googl and AMZN at this price knowing that the massive optimism at the moment usually indicates top is near and correction is nearby the corner. Nobody knows when but I would rather buy some still beaten down companies out there. We know Fintech and banks are still kinda low. It’s weekend now so it’s time to throw some ticker symbols out here. I don’t wanna see SMCI NVDA MSFT Googl aapl here. Go \n\nEdit: people have unjustifiable love towards intel. But I just don’t see how ",
        "created_utc": 1719027829.0,
        "subreddit_name": "stocks",
        "comments": 858
    },
    {
        "title": "Apple Intelligence won't launch in EU in 2024 due to antitrust rules, company says ",
        "score": 430,
        "url": "https://www.reddit.com/r/stocks/comments/1dm0h7f/apple_intelligence_wont_launch_in_eu_in_2024_due/",
        "content": "Apple said Friday it won’t release three recently announced features, including its flagship “Apple Intelligence” AI product, in the European Union in 2024 due to “regulatory uncertainties” stemming from the bloc’s Digital Markets Act antitrust regulation.\n\nApple said in a statement that the features — Apple Intelligence, iPhone Mirroring, and enhancements to its SharePlay screen-sharing product — won’t be available to EU customers due to Apple’s belief “that the interoperability requirements of the DMA could force us to compromise the integrity of our products in ways that risk user privacy and data security.”\n\nThe EU passed the DMA in 2023, spurred by concerns that a handful of major technology companies such as Amazon, Apple, Alphabet, Meta, Microsoft and TikTok parent ByteDance were acting as “gatekeepers” in preventing smaller firms from competing. Among other things, DMA requires that basic functionalities work across competing devices and ecosystems.\n\nThe interoperability requirements apply to iPhones and iPads. But Macs are affected by the DMA because iPhone Mirroring allows users to replicate the screen of an iPhone on the screen of a Mac.\n\nThe loss of the company’s AI product could be a disappointment to consumers. Apple Intelligence can proofread writing or even rewrite it in a friendly or professional tone. It can create custom emoji called Genmoji, search through an iPhone for specific messages from someone, summarize and transcribe phone calls and show priority notifications. The company also announced a partnership with OpenAI and a roadmap to other models being added to the platform.\n\nApple shares were largely flat on the news. Apple saw 2023 net sales of $94.3 billion in Europe, just under a quarter of its worldwide net sales. Apple Intelligence also won’t be available in Greater China, which accounted for $72.6 billion of its 2023 sales.\n\nThe company said it will work with the European Union “in an attempt to find a solution that would enable us to deliver these features to our EU customers without compromising their safety.”\n\nSource: https://www.cnbc.com/2024/06/21/apple-ai-europe-dma-macos.html",
        "created_utc": 1719076360.0,
        "subreddit_name": "stocks",
        "comments": 229
    }
]