[
    {
        "title": "Warren Buffett’s Berkshire Hathaway sold ~$14 billion worth of Apple this quarter. Cash pile hits record ~$325 billion.",
        "score": 1040,
        "url": "https://www.reddit.com/r/stocks/comments/1ghv5qo/warren_buffetts_berkshire_hathaway_sold_14/",
        "content": "Berkshires cash on hand hits a record $325 Billion\n\nCurrently owns ~$69.9 Billion worth of Apple $AAPL as of the end of Q3 down from $84.2B worth as of the end of Q2\n\nNo brk.a or brk.b shares repurchase in Q3\n\nPosts Q3 revenue of $92.9B compared to $93.2B YoY\n\nOperating earnings fell 6% from a year earlier to $10.09 billion as insurance underwriting earnings slumped\n\n#\n\n>**It is being widely reported that Berkshire's operating earnings declined 6.2% in the quarter. No. The reported figures include unrealized currency losses in 2024 and gains in 2023 on BRK's debt denominated in foreign currencies, largely yen. Earnings really grew 8.5% in Q3 to $11.2 billion against $10.3 billion and were up 18.0% for the nine months to $33.0 billion from $28.0 billion. Just as short-term movements in equity prices can distort the reporting of operating profits, so to do currency swings on debt outstanding. Both should be excluded from an analysis of operating and economic profit.**\n\nPer Christopher Bloomstran on X ",
        "created_utc": 1730549971.0,
        "subreddit_name": "stocks",
        "comments": 333
    },
    {
        "title": "Tesla and Uber partner to give drivers $2,000 to switch to Tesla",
        "score": 321,
        "url": "https://www.reddit.com/r/stocks/comments/1ghmcyw/tesla_and_uber_partner_to_give_drivers_2000_to/",
        "content": "[https://www.evuniverse.io/p/tesla-and-uber-partner-giving-2000-to-drivers](https://www.evuniverse.io/p/tesla-and-uber-partner-giving-2000-to-drivers)\n\n>Tesla just launched a collaboration with Uber, this time to give eligible Model 3 & Y buyers: $1,000 in Tesla Credits upon taking delivery + $1,000 in cash from Uber after completing 100 trips. The Tesla Credits can be used toward Supercharging, a new Tesla vehicle, service appointments or select Tesla Shop or upgrade purchases. Just for your info, Tesla Tequila is excluded though. The incentive is available after verifying eligibility with Uber through their system, find the button on Tesla’s fresh [tesla.com/uber](http://tesla.com/uber) website.\n\n>The 100 trips need to be completed before February 15, 2025 and the deal is not available for used vehicles. Interestingly the offer is stackable with Tesla Military Purchase Program, but is not stackable with other Tesla promotions, including its Refer and Earn Program.",
        "created_utc": 1730513789.0,
        "subreddit_name": "stocks",
        "comments": 138
    },
    {
        "title": "Etsy's declining gross merchandising sales - from a buyer",
        "score": 74,
        "url": "https://www.reddit.com/r/stocks/comments/1ghl0zv/etsys_declining_gross_merchandising_sales_from_a/",
        "content": "Etsy reported a 6% decline in gross merchandising sales in the third quarter. Active buyers decreased as well as habitual buyers.\n\nI can tell you one of the reasons why (a contributing factor). I have been a buyer on Etsy since 2016. I am also a seller. I cannot purchase multiple items on Etsy say more than 10 items at a time because of Etsy's faulty cart. This has been the case for at least a couple of years. I first started having the problem in my main shop a couple of years ago.\n\nI buy a lot of jewelry supplies so I can easily purchase many items at once and have. I am a habitual buyer who has probably spent approximately $40k maybe more on Etsy all these years.\n\nI started using a second account to purchase because the constant popups in the shop I sell on are too annoying. Many sellers/buyers report the same. Etsy does not care.\n\nAnyway, in my second account I have been trying to add items to my cart (all beads) to purchase from this one shop. I would have bought from them elsewhere if they had their own site but they do not.\n\nLast Sunday I spent a couple of hours looking through the shops over 2000 listings. They have awesome beads and shopping is fun for me. The first time around that is. Thereafter, it is no longer fun and now like work. I added the items on Sunday. I came back on Monday to purchase and I could not access my cart. I contact support who said I would get an email. I did not. I contacted them the next day and asked if they were going to fix my cart. They told me they thought it was a problem with 14 items in the saved for later. I specifically told Etsy support DO NOT remove the 97 items in my cart, but you could the saved for later.\n\nThe next day to my surprise the cart was fixed. But Etsy removed those 97 items in my cart that I wanted to buy! That was time consuming. The problem is that some buyers are not able to add more than 10 items in their cart at a time to purchase, but the cart allows up to 100. I was upset. Support gave me a $20 credit for the inconvenience.\n\nAs it is now like work for me and not fun I go to add the items back in my cart and it is quite time consuming. I did make two purchases earlier today but they were not more than 5 items. I figured I could add up to not more than 40 items and be good. At 38 items my cart glitched out and I cannot access the cart!\n\nI contact support again tonight and told them this. Support was able to get the items down to 20 in my cart to where it works. So it seems I can safely purchase 20 items. But I will have to do a multiple item purchase for all I want to buy. Support gave me another $10 credit. They claim Etsy is trying to fix this problem for buyers.\n\nMost buyers would not persist as I have. Most buyers would move on elsewhere to Amazon, Ebay, etc. And most probably do.\n\nSellers are losing out on sales and so is Etsy because Etsy is incapable of fixing this cart issue. They don't care.\n\nFor 5 days I have tried to purchase a large amount of beads from this one shop and still trying! I have written the COO twice this past week. I probably wrote management a couple of years ago when it happened. They know about it.\n\nI have been buying on Amazon as a prime member for several years. I have been buying on Ebay since 2016. I have NEVER experienced a glitch or malfunction on those marketplaces ever! It is always a seamless experience as a buyer and seller. Etsy has daily glitches and malfunctions. If Amazon and Ebay can do it why can't Etsy?\n\nAnd accessing support as a buyer and seller is quite difficult. I can imagine the average buyer is not going to take the time to try to get through the maze to access support thus they abandon Etsy.\n\nI can imagine how much manpower and $ Etsy has spent fixing buyers cart issues and credits they are issuing. Rather than just fixing the problem once and for all so the cart functions normally and seamlessly.\n\nDon't even get me started on seller's pain points, there are many of them as well.\n\nThe moral of this story is do you want to invest in a company that can't have a functioning cart and treats their buyers and sellers like they do? They don't care obviously that they are losing sales since this has gone on for a long, long time.\n\nEtsy are you listening? No they are not. Elliot management are you listening? Analysts are you listening? Investors are you listening?",
        "created_utc": 1730509574.0,
        "subreddit_name": "stocks",
        "comments": 27
    },
    {
        "title": "Globalstar and Apple expanded partnership ",
        "score": 31,
        "url": "https://www.reddit.com/r/stocks/comments/1gi2s7x/globalstar_and_apple_expanded_partnership/",
        "content": "Does anyone have anymore information on Globalstar GSAT and Apple AAPL expanded partnership? Is GSAT a buy after the 40% rise in share price?.\n\nHere is some information I have , but is there anything I should be aware of ? \n\nThe expanded partnership between Globalstar (GSAT) and Apple (APL) could bring significant long-  term benefits to Globalstar's stock, though some challenges may stil lie ahead.  \nPotential Positive Impacts  I. Revenue Growth: With Apple prepaying up to $1.1 billion and committing to pay additional  service fees, Globalstar can expect substantial revenue growth. The agreement is projected to  more than double Globalstar's annual revenue compared to 2024 levels, primarily driven by the  new satellite network's capacity and performance milestones  2. Market Confidence: Apple's involvement and the substantial upfront payments provide market  validation for Globalstar, boosting investor confidence. A stronger association with Apple, along  with its 20% equity stake in Globalstar's satellite network, reinforces the viability and demand for  satellite-enabled connectivity, especially in remote and underserved areas\n3. Future Expansion Opportunities: The network's design and expanded ground infrastructure  allow Globalstar to potentially explore new revenue streams, including other high-reliability  C  industries (e.g., maritime or government sectors), beyond its arrangement with Apple cOwews  \nPotential Risks  \n1. High Dependency on Apple: The partners. p heavily ties Globalstar's growth trajectory to zero.\n3. Future Expansion Opportunities: The network's design and expanded ground infrastructure  allow Globalstar to potentially explore new revenue streams, including other high-reliability  industries (e.g. maritime or government sectors), beyond its arrangement with Apple.\nPotential Risks  \n1. High Dependency on Apple: The partnership heavily ties Globalstar's growth trajectory to  Apple's needs and future directions. If Apple shifts its strategic focus away from satellite  communication, Globalstar's revenue and stock could be negatively affected,  \n2. Execution Risks: Globalstar must deliver the new MSS network according to Apple's  performance milestones. Failing to meet these milestones could result in reduced or delayed  payments, which would likely impact the stock negatively.\nIn the near term, Globalstar's stock may experience heightened volatility, as its year-to-date  performance has already been variable. However, if Globalstar manages this partnership successfully.  it could see sustained growth, especially as satelite connectivity becomes increasingly relevant to  tech giants like Apple.\n",
        "created_utc": 1730571638.0,
        "subreddit_name": "stocks",
        "comments": 9
    },
    {
        "title": "Brk’s latest portfolio change",
        "score": 4,
        "url": "https://www.reddit.com/r/investing/comments/1gi00xs/brks_latest_portfolio_change/",
        "content": "if i read it right, \n\nsignificantly up in AXP, minimumly up in Ko, cash \n\ndown significantly in aapl.\n\nearnnings down was mostly from insurance loss\n\nearnnings up from energy pipeline transfer , mostly natural gas pipeline.\n\ndoes any one plan to cut Aapl holdings per this? \n\ni did cut my 3 year BAC long term holdings with 1.14% gain. seriously the worst US domestic investment ive ever done. ",
        "created_utc": 1730564165.0,
        "subreddit_name": "investing",
        "comments": 12
    },
    {
        "title": "What are your 'unknown' or 'boring' stocks that consistently outperform the market?",
        "score": 729,
        "url": "https://www.reddit.com/r/stocks/comments/1ghqt7y/what_are_your_unknown_or_boring_stocks_that/",
        "content": "They may not be 'cool' or ai-related, but even in a relatively 'boring' industry you occasionally find a hidden gem. A long-term compounder that consistently delivers string returns and outperforms the market. \n\nWhich companies have you seen like this? ",
        "created_utc": 1730530647.0,
        "subreddit_name": "stocks",
        "comments": 566
    },
    {
        "title": "Why I think TSM/INTC will outpace NVDA/AMD growth in the next decade. ",
        "score": 1163,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1ghyq7o/why_i_think_tsmintc_will_outpace_nvdaamd_growth/",
        "content": "Tech giants like Amazon, Google, Microsoft, and Meta are spending billions of CapEx on AI. Lets just look at their last 2 quarters spending:\n\n* **Amazon**: Increased CapEx from $60 billion in Q2 2024 to $70 billion in Q3 2024.\n* **Google**: Increased CapEx from $44 billion to $49 billion in the same period.\n* **Microsoft**: Increased CapEx from $44 billion to $49 billion.\n* **Meta**: Increased CapEx from $29 billion to $31 billion.\n\nHowever not all that CapEx is going to third party AI solutions like Nvidia/AMD. Each and every company listed above has or is developing it's own custom AI silicon.\n\nLets look how they are transitioning from 3rd party to In-House AI silicon:\n\n**Amazon**: Developed AWS Inferentia and Tranium chips for AI processing (manufactured by TSM & INTC).\n\n**Google**: Developed Tensor Processing Unite (TPU) and Axion chip for AI processing (manufactured by TSM).\n\n**Microsoft**: Developed Azure Maia AI chip and Azure Cobalt for AI processing (manufactured by TSM & INTC).\n\n**Meta**: Developed Meta trading and Inference Accelerator (MTIA) for AI processing (manufactured by TSM).\n\nAll those developments reduce dependence on external GPU suppliers, allow more customized/efficient AI processing and most importantly huge cost savings.\n\nJust to understand the level of savings (and why would they invest huge R&D budget on this):\n\nA **regular Nvidia H100 GPU**, cost approximately **$3,320** to manufacture from TSMC. However it is being sold at **$25,000 to $30,000** each!\n\nThat's almost 800%-900% profit margins that has to be paid by the companies above, when they opt not to choose In-House Silicon.\n\nAs more of the AI CapEx goes to custom silicon (will never be 100%, but expect that percentage only to grow larger over time, driven by cost savings)  TSMC and Intel foundries will benefit directly from this trend (both have EUV capabilities, INTC will mass produce 18A EUV chips next year, with Amazon as first client)\n\nAnd this will position TSMC and INTC for substantial growth, because **the rate limiting factor for AI growth will be how much silicon can TSMC or INTC manufacture** for the entire world's AI demand.  \n  \n\n\n\n\n",
        "created_utc": 1730560665.0,
        "subreddit_name": "wallstreetbets",
        "comments": 251
    },
    {
        "title": "Bill Gates Terrapower with ASP Isotopes",
        "score": 237,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gi41yd/bill_gates_terrapower_with_asp_isotopes/",
        "content": "$ASPI These news took ASP Isotopes above 500 million market cap. I want your opinion and what you say about it all. Will Centrus Energy be able to stay relevant coming years when new technologies enter the scene? \n\nTerm sheet say Terrapower will likely pay for the construction of a HALEU enrichment plant. HALEU is the fuel every small modular reactor needs to operate.\n\nI'm guessing huge gains from nano nuclear, oklo, Nuscale etc gonna come ASPIs way. Small Modular Reactors are like cars and cars don't run without gasoline, SMRs don't run without #HALEU. Who's making the biggest bags of money? The people driving the cars or those who sell the gasoline?\n\nThey also got contracts for their enriched silicon-28 product which is researched to be the next material in semiconductors. Allowing for cooler and therefore faster chips enabling super intelligent AI and quantum computing.\n\nTwo undisclosed contracts with US leading semiconductor companies and in discussions with several others. Any clue on who it could be? I mean Bill Gates grabbing their HALEU, maybe Gates want some si28 as well for Microsoft?\n\nWith the current nuclear theme, this is set up deliciously. From $2.90 to $8 in a month and bears are still stubbornly resisting the bull horde.\n\nIcing on the cake, the planned spinoff gives ASPI shareholders incentive to HODL & gobble. Spinoff is 1 for 1. Get an equal amount of QLE shares as you got ASPI for those who HODL on record date yet to be determined.\n\nTerrapower press release: [https://www.terrapower.com/terraPower-announces-strategic-agreement](https://www.terrapower.com/terraPower-announces-strategic-agreement)\n\n45 things to consider with $ASPI. Cheers to u/pennycheck at X for this delicious slice of ASPIe\n\n1. Proprietary Aerodynamic Separation Process (ASP) and Quantum Enrichment technologies for isotope enrichment.\n2. Contracts for Carbon-14, Molybdenum-100, and Silicon-28 production, with potential revenues of $12-30 million in 2024.\n3. Entering the High-Assay Low-Enriched Uranium (HALEU) market, with estimated demand over 600 MT by 2035.\n4. Quantum Enrichment method for uranium expected to be more cost-effective and scalable than competitors' technologies.\n5. Signed MOUs with two US-based Small Modular Reactor (SMR) companies to supply HALEU.\n6. Received interest from potential customers totaling over $30 billion of HALEU demand at recent market prices.\n7. Technology allows for HALEU production in a single step, potentially more efficient than competitors.\n8. Expects to produce commercial quantities of HALEU by 2027, potentially satisfying all anticipated demand from advanced reactors in development.\n9. Market capitalization significantly lower than main competitors despite potentially superior technology.\n10. Strong management team with extensive experience in isotope enrichment and finance.\n11. 100% employee retention, helping maintain trade secrets and technological advantages.\n12. Exploring enrichment of depleted uranium tails, potentially leading to higher margins and lower HALEU prices.\n13. Building facilities in Iceland to capitalize on lower electricity costs, potentially improving profitability.\n14. Joint venture with PET Labs, allowing entry into the radioisotope market for nuclear medicine.\n15. Technology is modular and scalable, allowing for rapid capacity expansion.\n16. Significant insider ownership, with management continuing to buy shares.\n17. Targeting multiple markets beyond HALEU, including medical isotopes, silicon for quantum computing, and other industrial applications.\n18. Favorable market environment due to global push for nuclear energy, including pledge to triple nuclear capacity by 2050 at COP28.\n19. Technology could potentially address the HALEU supply bottleneck currently delaying some SMR projects.\n20. Potential ability to produce Weapons Grade Uranium (WGU) could lead to additional government contracts.\n21. Isotope production extends beyond HALEU, with applications for semiconductors and AI companies.\n22. Ytterbium plant commissioned 9 months ahead of schedule, demonstrating efficient execution.\n23. Early completion of Ytterbium plant proves Quantum Enrichment technology, applicable to uranium enrichment for HALEU production.\n24. Ability to recycle depleted uranium tails makes it attractive for governments wanting to avoid new uranium mining operations.\n25. Diverse isotope portfolio makes it relevant to multiple industries and companies.\n26. Major tech companies like Amazon and Google investing heavily in nuclear energy projects, likely increasing demand for HALEU fuel.\n27. Amazon signed agreements to support development of nuclear energy projects, including new SMRs.\n28. Google signed world's first corporate agreement to purchase nuclear energy from multiple SMRs.\n29. Tech giants' involvement could accelerate SMR development and adoption, creating larger market for ASPI's HALEU production.\n30. Tech companies cite need for reliable, carbon-free energy to power data centers and AI technologies.\n31. US Department of Energy estimates significant job growth in the nuclear industry.\n32. International Energy Agency's report supports long-term prospects for nuclear energy.\n33. Growing corporate interest in nuclear energy could lead to increased investment in the sector.\n34. Successfully enriched Ytterbium-176 using Quantum Enrichment technology.\n35. Commissioning phase of Ytterbium-176 facility completed in 6 weeks instead of expected 3-6 months.\n36. Expects to achieve 99.75% enrichment for Ytterbium-176 and offer it for commercial sale in 2025.\n37. Plans to construct Nickel-64 and Lithium-6/7 Quantum Enrichment plants with production targeted for 2025.\n38. Potentially the only Western supplier of commercial quantities of Ytterbium-176 and similar isotopes.\n39. Quantum Enrichment process believed to be more efficient, scalable, and environmentally friendly than other technologies.\n40. In discussions with potential customers for HALEU requirements valued at over $37 billion.\n41. MOUs with two US-based SMR companies include potential capital investments into HALEU facilities.\n42. Accelerating plans for Nickel-64 and Lithium-6/7 plants due to urgent demand from Western-based producers.\n43. Positioning to meet emerging demand for Lithium-6 in nuclear fusion power plants.\n44. Recruited Lt. Col. William Eden, MBE to lead nuclear strategy in the United Kingdom.\n45. Bill Gates took the first slice of the pie. Bet there's many more wanting a seat at the table.\n46. 24% shorted 10 million shares since $2.90-$8\n\nI'm suspecting ASPI and Gates been discussing silicon-28 since it's now clear Terrapower aim to lock up their HALEU production for ten years. All makes sense to me. Lock up the HALEU to fuel SMRs and build datacentres with silicon-28 semiconductors. Aaaand they build SMRs to power their superior datacentres.\n\nMicrosoft enters the chip wars: https://www.forrester.com/blogs/welcome-to-the-chip-wars-microsoft/\n\nThey will spin off their Uranium business to Quantum Leap Energy. Those who got shares in ASPI will get equal amount of shares in the new company QLE. Plus ASPI will always get 10% of QLEs revenue.\n\nThe HALEU plant Bill Gates is paying for and is expected to be non dilutive to shareholders. He will also buy all the HALEU produced there for a ten year period. Gates want to be the global top dog in small modular reactors.\n\nFinancially their balance sheet have never been stronger with about $43 million dollar cash.\n\nThis is just my opinions and guesses, I'm not a financial advisor. I share information about the company for the community to discuss. So this is not investment advice to sell, buy or do anything speculative. ASPI is worth keeping on the watchlist in my opinion. I keep it in my portfolio, I like the stock so I own the stock. Do your due diligence.",
        "created_utc": 1730575056.0,
        "subreddit_name": "wallstreetbets",
        "comments": 125
    },
    {
        "title": "NVDA To Join Dow Jones Industrial Average",
        "score": 217,
        "url": "https://www.reddit.com/r/investing/comments/1ghmlfr/nvda_to_join_dow_jones_industrial_average/",
        "content": "\n\nNvidia is replacing rival chipmaker Intel\n in the Dow Jones Industrial Average, a shakeup to the blue-chip index that reflects the boom in artificial intelligence and a major shift in the semiconductor industry.  \n\nThe switch will take place on Nov. 8. Also, Sherwin Williams will replace Dow Inc\nin the index, S&P Dow Jones said in a statement.\n\nNvidia shares have climbed over 170% so far in 2024 after jumping roughly 240% last year, as investors have rushed to get a piece of the AI chipmaker. Nvidia’s market cap has swelled to $3.3 trillion, second only to Apple. \n\nhttps://www.cnbc.com/2024/11/01/nvidia-to-join-dow-jones-industrial-average-replacing-intel.html",
        "created_utc": 1730514541.0,
        "subreddit_name": "investing",
        "comments": 64
    },
    {
        "title": "Critique this hypothesis for an Apparel company wanting to make ESG Investments",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gi5z2x/critique_this_hypothesis_for_an_apparel_company/",
        "content": "X company can build a successful ESG strategy by focusing on three core principles: prioritizing sustainability and social responsibility in the supply chain process; prioritizing sustainable materials in the manufacturing process to reduce waste and minimize environmental harm; and upholding strong governance standards through compliance with regulations and transparency in business practices. By centering these priorities, X can make impactful ESG investments that reflect its commitment to environmental and social responsibility, supporting its long-term goal of achieving carbon neutrality by 2040.",
        "created_utc": 1730580280.0,
        "subreddit_name": "investing",
        "comments": 8
    },
    {
        "title": "Thousands go to fake AI-invented Dublin Halloween parade",
        "score": 3016,
        "url": "https://www.euronews.com/culture/2024/11/01/thousands-go-to-fake-ai-invented-dublin-halloween-parade",
        "content": "",
        "created_utc": 1730513213.0,
        "subreddit_name": "worldnews",
        "comments": 289
    },
    {
        "title": "Warren Buffett continued to sell down his Apple stake, cutting about a quarter in the third period",
        "score": 344,
        "url": "https://www.cnbc.com/2024/11/02/berkshire-hathaway-brk-earnings-q3-2024.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
        "content": "",
        "created_utc": 1730553010.0,
        "subreddit_name": "wallstreetbets",
        "comments": 87
    },
    {
        "title": "Why is Warren Buffet still invested in Sirius XM?",
        "score": 144,
        "url": "https://www.reddit.com/r/investing/comments/1ghnlpl/why_is_warren_buffet_still_invested_in_sirius_xm/",
        "content": "Why is Warren Buffet still heavily invested in Sirius XM?\n\nBerkshire Hathway's latest SEC filing shows that he currently holds 376m shares of Sirius XM, Why? In this age of Spotify, and Apple Music what kind of upside does Sirius have?\n\nSuch big position could indicate something really exciting happening with Sirius XM in the future, but what does Buffet know that we don’t? ",
        "created_utc": 1730517870.0,
        "subreddit_name": "investing",
        "comments": 108
    },
    {
        "title": "Something specific to watch out for when investing in EnergyX",
        "score": 5,
        "url": "https://www.reddit.com/r/investing/comments/1ghvyon/something_specific_to_watch_out_for_when/",
        "content": "Back in late 2020 heard about a startup in the lithium sector that was researching using high tech methods to speed up recovery time, enhance yield AND lowers the production cost$\n\n\n\nAt first I was skeptical because the company was based in Puerto Rico, but then learned that this was done to be \"tax efficient\"  (long story short after doing DD based on the tech, I threw down a bet on EnergyX via a crowdfunding site)\n\n\n\n[https://netcapital.com/companies/energyx](https://netcapital.com/companies/energyx)\n\n\n\nAnyway seem to have something akin to a winning lotto ticket because my basis is $0.81 (with a 3 for 1 AND then a 2 for 1 stock split),...\n\n\n\n[https://www.sec.gov/Archives/edgar/data/1830166/000149315223045075/form253g2.htm](https://www.sec.gov/Archives/edgar/data/1830166/000149315223045075/form253g2.htm)\n\n\n\nand the latest crowdfunding round was $9.50\n\n\n\n[https://techcrunch.com/2024/10/04/why-energyx-raised-75m-from-small-investors-even-after-taking-vc-money-from-gm-and-others/](https://techcrunch.com/2024/10/04/why-energyx-raised-75m-from-small-investors-even-after-taking-vc-money-from-gm-and-others/)\n\n\n\nBecause my original bet on paper grew 10X (in just over 3 years), decided to add to my position in EnergyX when the offering price was at $9.00 per share\n\n\n\nYesterday got an eMail (from DEALMAKER) saying my money was going to be refunded minus a handling fee,... WTF???\n\n\n\n**Hello,**\n\n\n\n**Over the past few months we have reached out to you on several occasions via email and phone in order to assist in completing your investment. At this time your investment is incomplete and we are unable to move forward with your investment approval.**\n\n\n\n**What does this mean for you?**\n\n\n\n**You will be receiving a refund back to your original payment method for your investment, minus the processing fee.**\n\n\n\n[https://energyx.app.dealmaker.tech/invitations/506c-offering/view](https://energyx.app.dealmaker.tech/invitations/506c-offering/view)\n\n\n\nBottom line basically not happy w/ DEALMAKER which takes care of the back office legal paper work for various crowdfunded startups (AND prior to yesterdays eMail, I didn't get any phone calls OR eMails about any problems w/  investment paperwork records in the startup EnergyX)\n\n\n\n[https://www.dealmaker.tech/](https://www.dealmaker.tech/)",
        "created_utc": 1730552667.0,
        "subreddit_name": "investing",
        "comments": 3
    },
    {
        "title": "Earnings notification automater",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1ghu0hm/earnings_notification_automater/",
        "content": "Does anyone know an app I can create a watchlist of stock tickers in, that will\n\nsend upcoming earnings report dates to my mobiel (apple) calendar? I looked at Schwab\n\nand they don't do this as far as I can tell. Schwab TOS mobile app has a calendar\n\nof upcoming earnings but you have to look up the ticker each time. I want this process\n\nautomated. Thanks.",
        "created_utc": 1730545559.0,
        "subreddit_name": "investing",
        "comments": 2
    },
    {
        "title": "Apple's M4 Max is the single-core performance king in Geekbench 6 — M4 Max beats the Core Ultra 9 285K and Ryzen 9 9950X",
        "score": 2586,
        "url": "https://www.tomshardware.com/pc-components/cpus/apples-m4-max-is-the-single-core-performance-king-in-geekbench-6-m4-max-beats-the-core-ultra-9-285k-and-ryzen-9-9950x",
        "content": "",
        "created_utc": 1730571705.0,
        "subreddit_name": "apple",
        "comments": 383
    },
    {
        "title": "iPod fans evade Apple’s DRM to preserve 54 lost clickwheel-era games",
        "score": 1275,
        "url": "https://arstechnica.com/gaming/2024/11/ipod-fans-evade-apples-drm-to-preserve-54-lost-clickwheel-era-games/",
        "content": "",
        "created_utc": 1730553202.0,
        "subreddit_name": "apple",
        "comments": 99
    },
    {
        "title": "Apple has detailed documentation online for IT pros on how to support all its products, part of a 14-hour course, publicly available. Great resource!",
        "score": 718,
        "url": "https://it-training.apple.com/tutorials/apt-support/",
        "content": "",
        "created_utc": 1730557865.0,
        "subreddit_name": "apple",
        "comments": 17
    },
    {
        "title": "Apple's quarterly iPhone sales rise 6% as AI helps end slump ",
        "score": 525,
        "url": "https://apnews.com/article/apple-iphone-quarterly-results-artificial-intelligence-377452ea3345de2981ea75f62b7cc840",
        "content": "",
        "created_utc": 1730553178.0,
        "subreddit_name": "apple",
        "comments": 115
    },
    {
        "title": "Daily Advice Thread - November 02, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/apple/comments/1ght3kh/daily_advice_thread_november_02_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1730541629.0,
        "subreddit_name": "apple",
        "comments": 39
    },
    {
        "title": "Column: These Apple researchers just showed that AI bots can't think, and possibly never will — Apple’s AI researchers gave these AI systems a simple arithmetic problem that schoolkids can solve. The bots flunked.",
        "score": 2828,
        "url": "https://www.latimes.com/business/story/2024-11-01/column-these-apple-researchers-just-proved-that-ai-bots-cant-think-and-possibly-never-will",
        "content": "",
        "created_utc": 1730566855.0,
        "subreddit_name": "technology",
        "comments": 625
    },
    {
        "title": "Apple reports record Q4 2024 earnings with nearly $95 billion in revenue.",
        "score": 389,
        "url": "https://9to5mac.com/2024/10/31/aapl-q4-2024-earnings/",
        "content": "",
        "created_utc": 1730510813.0,
        "subreddit_name": "technology",
        "comments": 84
    },
    {
        "title": "Charger recall spells more bad news for Humane’s maligned AI Pin",
        "score": 109,
        "url": "https://arstechnica.com/gadgets/2024/11/charger-recall-spells-more-bad-news-for-humanes-maligned-ai-pin/#gsc.tab=0",
        "content": "",
        "created_utc": 1730551878.0,
        "subreddit_name": "technology",
        "comments": 26
    },
    {
        "title": "Didn’t know Apple does that.",
        "score": 3554,
        "url": "https://i.redd.it/5z3bfxz55gyd1.jpeg",
        "content": "Just received this email, almost a week after placing my order. I never got that kind of email from Apple before. The new price is $230 cheaper. What could be the reason for lowering the price that much?  ",
        "created_utc": 1730535043.0,
        "subreddit_name": "mac",
        "comments": 88
    },
    {
        "title": "Is the Samsung 27\" ViewFinity S9 a good alternative for the Apple Studio Display?",
        "score": 234,
        "url": "https://i.redd.it/o8qgrpw8khyd1.jpeg",
        "content": "",
        "created_utc": 1730552241.0,
        "subreddit_name": "mac",
        "comments": 107
    },
    {
        "title": "Why are iMacs not so popular?",
        "score": 132,
        "url": "https://www.reddit.com/r/mac/comments/1ghyd1k/why_are_imacs_not_so_popular/",
        "content": "Mac minis are more popular than iMacs. \nMacBook Pros are more popular than iMacs. \nEven Mac studios are more popular than iMacs. \nEven apple doesn’t care enough to update iMacs every year. \nThey don’t generate enough sales.\n\nWhy?",
        "created_utc": 1730559668.0,
        "subreddit_name": "mac",
        "comments": 264
    },
    {
        "title": "I dressed up as an Apple eMac for Halloween 🎃",
        "score": 119,
        "url": "https://i.redd.it/i7c8nkp7reyd1.jpeg",
        "content": "",
        "created_utc": 1730518245.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "M4 MacBook Pro 16 inch has shipped",
        "score": 23,
        "url": "https://i.redd.it/p654guqaiiyd1.jpeg",
        "content": "I have ups my choice and I can see that my m4 MacBook Pro 16 inch m4 max 16 core cpu 40 core gpu 64 GB ram 1 TB ssd has shipped.  It stills show as preparing to ship on apple’s site but ups shows that it has shipped.\n\n",
        "created_utc": 1730563672.0,
        "subreddit_name": "mac",
        "comments": 32
    },
    {
        "title": "MacBook Air M2 wont turn on and charge",
        "score": 24,
        "url": "https://i.redd.it/vh6dl4ksfeyd1.jpeg",
        "content": "Help!\nMacbook Air M2 2022, Model A2681,. My macbook wont turn on and wont charge (No orange or green light on the mag safe cord charger)  I tried to long press the power button but no response , I even tried to plug it in and unplug and long press the power button again but it won’t turn on. I tried the combinations or what they call the SMC but still no progress. The last time I used it was on October 25, I shut it down completely with 60% battery life and I wonder why it was drained. based on my experience, it only gets drained if I let it sleep with tabs or application still On. ",
        "created_utc": 1730514404.0,
        "subreddit_name": "mac",
        "comments": 49
    },
    {
        "title": "MacBook turned on like this after leaving in bootcamp overnight",
        "score": 14,
        "url": "https://i.redd.it/hf3pnhut8hyd1.jpeg",
        "content": "",
        "created_utc": 1730548382.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Apple AI and RAM",
        "score": 12,
        "url": "https://www.reddit.com/r/mac/comments/1gi0251/apple_ai_and_ram/",
        "content": "So we all know Apple bumped up the base configs to 16gb to account for onboard AI. How will this actually affect ram usage? Will it be an “always on” thing where AI is continually using resources, so that your other apps like Photoshop or Final Cut aren’t seeing the benefit of 16gb? If someone isn’t interested in AI is there a way to turn it off so it doesn’t use ram much if at all? I have no interest in writing assistance or image generation.\n\nI love the 16gb bump but not if it’s only being used to run something I won’t utilize intentionally.",
        "created_utc": 1730564259.0,
        "subreddit_name": "mac",
        "comments": 15
    },
    {
        "title": "RAM is never enough",
        "score": 12,
        "url": "https://www.reddit.com/r/mac/comments/1ghryex/ram_is_never_enough/",
        "content": "Do we have any solution for the massive memory usage by Google Drive? MacBook Air M2, 24GB, Sequoia 15.1 \n\nhttps://preview.redd.it/dq8m79o18gyd1.png?width=2106&format=png&auto=webp&s=546786d3e1ffc79e59979b51c31ef5f83a9adfef\n\nhttps://preview.redd.it/nf7viju98gyd1.png?width=784&format=png&auto=webp&s=9be4f4cc8bd47c2c7a5f07bf78aaaf7df0313c14\n\n  \n",
        "created_utc": 1730536127.0,
        "subreddit_name": "mac",
        "comments": 25
    },
    {
        "title": "Mac mini M4 vs Macbook Air",
        "score": 6,
        "url": "https://www.reddit.com/r/mac/comments/1ghv7i2/mac_mini_m4_vs_macbook_air/",
        "content": "I just graduated and I’m looking to upgrade the hardware I’m using.\n\nI currently have an Asus laptop with Ryzen 4500u and 8GB ram.\n\nI can either buy the new Mac Mini M4 or upgrade my laptop to a macbook air m3 but with 8GB of ram as here outside the US the upgrades are very overpriced and out of my budget.\n\nI’m looking for recommendations, Thank you",
        "created_utc": 1730550136.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "Giving serious consideration to the new M4 Mac mini",
        "score": 4,
        "url": "https://www.reddit.com/r/mac/comments/1ghsm72/giving_serious_consideration_to_the_new_m4_mac/",
        "content": "Now that 16Gb RAM comes as standard across all Macs, I'm looking at the M4 Mac mini carefully. £600 is very good value for money, plus with student discount (a relative of mine is at uni) that prices drops to £500. Outrageous value\n\nI have an M2 Air, but I want a dedicated desktop for photo and video editing (most likely I'm gonna purchase Final Cut Pro).\n\nI'm gonna buy it.",
        "created_utc": 1730539319.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "new studio display with thunderbolt 5?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gi9o0z/new_studio_display_with_thunderbolt_5/",
        "content": "with thunderbolt 5 now available, how likely is it that apple will update the studio display to be 120hz? \n\ncould they make a studio display 2 at the same price and drop the old one, or is it more likely they’d make a separate more expensive “pro” version with “promotion”?\n\nall this because i was sure which mac mini to get, until i realized that without thunderbolt 5 i would be limited to the current studio display if they release a new one which needs the new port (which is only on the pro mini).",
        "created_utc": 1730590667.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "Is it possible to have a different version of OS X on a different hard drive and swap them around?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gi5z92/is_it_possible_to_have_a_different_version_of_os/",
        "content": "I’m thinking of upgrading the HDD from my 2008 MacBook to a SSD and I have always wanted to get the MacBook back to OS X Mountain Lion so I wondered can I load Mountain Lion on an SSD and swap my current HDD that has Catalina and still be able to use the one with Catalina normally by swapping the drives",
        "created_utc": 1730580294.0,
        "subreddit_name": "mac",
        "comments": 13
    },
    {
        "title": "Mac Studio logic board wait time?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gi3r45/mac_studio_logic_board_wait_time/",
        "content": "I had an issue with the 10Gbps Ethernet port not working. Took it into the Tulsa Woodland Hills Apple Store. Apple \"genius\" said it needs a new logic board. He also said it's covered under AppleCare, so I left it with the store to order and install the new logic board. That was three weeks ago on October 12th.\n\nI've looked up the status on the repair status page, and it just says \"Our technicians are actively repairing your device.\" A week ago, I happened to be in the Tulsa area, so I stopped in the store to ask the status, they said they still didn't have the part. Today, it took me two hours to get someone at the store to answer the phone. Apple support doesn't have any status on the order, and neither does the store.\n\nWhat should my expectations be for wait times on part delivery, getting an idea of when it will be here, and when it will be repaired? The \"not knowing\" is the worst, and it seems even Apple doesn't know how long it will be.",
        "created_utc": 1730574231.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "accidentally deleted everything from my mac",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1ghxdir/accidentally_deleted_everything_from_my_mac/",
        "content": "I bought a new macbook air so my daughter could have the old one and successfully migrated everything to the new one. To get it ready for her I deleted everything from the old one but to my horror everything has also gone from my new macbook. I didnt use time machine for backups, I thought, clearly, foolishly, there would be copies in icloud, but there are not. I have tried data recovery software like diskdrill but i cant see  my folders and I don't know what to do. any help? it's years worth of stuff and writing and yes I know I'm foolish for not having a backup, i just need some help recovering everything if its possible",
        "created_utc": 1730556853.0,
        "subreddit_name": "mac",
        "comments": 12
    },
    {
        "title": "My Mac's response time is longer than before update, is there any way to improve it?  The cursor even lags",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1ghvqzg/my_macs_response_time_is_longer_than_before/",
        "content": "[It's this model](https://preview.redd.it/np9hvj0yihyd1.png?width=784&format=png&auto=webp&s=85defa23ec7514d1cbbc75d8592c61074bffbcae)\n\nI used OpenCore Legacy Patcher and I know it slows the Mac down, but not until today have I find it a bit annoying..  I do have a MacBook Air M2 but no external display, meaning that if I need big screen I'll turn to this Mac.  I am afraid asking this would lead me downvote to hell as I sound arrogant, but I just want precious response from other Mac fans :(\n\n(sorry for poor grammar)\n\nOR is it worth it to buy a Studio Display? :D",
        "created_utc": 1730551988.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "Anyone ordered Macbook M4pro 48GB Ram pre order date changed to ready for shipping ? Mine says it is ready for pickup by 13th Nov ? ",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1ghrf5n/anyone_ordered_macbook_m4pro_48gb_ram_pre_order/",
        "content": "\nMy status is still processing and i just got charged from credit card(though it is still showing pending) but yesterday it was 0 dollars (pending status as well)\n\nHow long does it take after that to deliver? I ",
        "created_utc": 1730533523.0,
        "subreddit_name": "mac",
        "comments": 8
    },
    {
        "title": "iPad M4 with Mac Mini",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1ghmvvi/ipad_m4_with_mac_mini/",
        "content": "Is it possible to use iPad as a screen for Mac mini m4? It would be done occasionally when away from the desk. Or is it better to get a MacBook?",
        "created_utc": 1730515487.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "If I wanted to do a backup of my Macbook, what size hard drive should I get?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gi8sxp/if_i_wanted_to_do_a_backup_of_my_macbook_what/",
        "content": "let's just say my Mac has 400 GB of its space taken up, and I want to backup all 400GB of it. What size drive would I need to be able to do this? I'm pretty sure you're gonna need a bigger drive size than the space you need to back up, so in this case it would need to be bigger than 400GB right? Is there a \"safe\" number to go by (e.g. at least 100 GB more than the biggest amount of space you want to backup)\n\nBTW, I'll be using Time Machine. I'm a computer noob and never used this before so, yeah, I'm kinda clueless on the size of the drive I need LOL",
        "created_utc": 1730588268.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "any updates about magic accessories compatibility?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gi7et0/any_updates_about_magic_accessories_compatibility/",
        "content": "\n \na couple days ago it was reported the new magic accessories only work well with sequoia. but in the apple specs it says 10.11. did anything actually change? I'd like to use with a late 2014 mac mini specifically, and it's listed as compatible",
        "created_utc": 1730584282.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Mac mini m4 vs Imac2019 i7 16gb vs older Mchip imacs/macmini's",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gi74lx/mac_mini_m4_vs_imac2019_i7_16gb_vs_older_mchip/",
        "content": "Budget is 700 bucks...\n\nare you telling me pound for pound the mac mini 4 can compete with the older intel Imacs? I feel i can get a bang for your buck intel imac decked out with specs, but if something were to happen the intel imacs it is it safe to safe apple wont repair it as they are outdated?\n\nnever had an mac mini and it just doesnt seem possible it can be that powerful. im starting a business and was wondering can it run photoshop & illustrator without it blowing up... are the new m1m2m3m4 chips that dam good...\n\nor could i get away with maybe getting an older m1 m2 imac/mac mini?",
        "created_utc": 1730583494.0,
        "subreddit_name": "mac",
        "comments": 7
    },
    {
        "title": "Outlook on macOS",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gi3f61/outlook_on_macos/",
        "content": "Do you use the '*new*' Outlook on macOS, and if so, do you ever use the \"send later\" feature?\n\n\n\nFrom time to time, I set an email to send later (Outlook, latest edition on Sequoia), but then I need to edit it before sending.\n\n\n\nWhen I choose the cancel send button in the email that is in my Drafts folder, so I can edit it, it will bring up the classic Outlook email window. I then need to close that classic window, and open the email in my Outlook drafts folder, before I can edit it and then schedule it to send again. \n\n\n\nDoes this happen to you?",
        "created_utc": 1730573337.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "I have concerns regarding MBP2016”15” Touchbar",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gi1xvi/i_have_concerns_regarding_mbp201615_touchbar/",
        "content": "Here are some issues im facing:\n\nTrackpad : far left and far right (in the middle not corners) doesn’t click, register or press unless I go from a place thats working to these points..I’m thinking its software issue. To add up, if the MacBook is sleep and i press on these effected areas the MacBook screen opens, or when idle the touchbar sleeps and if press on those areas it lights up.\n\nCharger disconnects and connects : no matter which port I plug the type c charger to it happens. i have resetted The smc and pram(or nvram) and it charges for 10 seconds, disconnects for a second then charges normally. So I’m thinking it has to do something with software.\n\nKeyboard: its working, but sometimes keys don’t register or register twice, and sometimes it register normal. in all cases the keyboard makes clicking noise i tried cleaning 1 key(for testing) with a mini brush the noise decreased and it stopped glitching(I didn’t remove any keys and I won’t attempt to). Can I use a vacuum cleaner from a safe distance ++ the mini brush to clean the keyboard?ofc buying a mini blower or a mini vacuum cleaner would be better, but I have spent alot, so it is not really an option.\n\nLastly, speaker : the left speaker sounds fine, but the right one’s volume is low and sounds muted. I made sure balance is in the middle and tried it on max left and max right to hear each one. I know 90% of the speaker holes are fake and just black dots. im planning to locate the real holes and hide the fake ones then use a brush to clean these holes.\n\nWhat do you think? Do you have any tips? Similar experiences? If yes how did you manage to fix these issues?\n\nSorry for long post and bad language. Thank you 🙏 ",
        "created_utc": 1730569365.0,
        "subreddit_name": "mac",
        "comments": 15
    },
    {
        "title": "Monitor Suggestions with ~4K OLED?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gi1hvt/monitor_suggestions_with_4k_oled/",
        "content": "Reddit, what’s a good or even great desktop monitor for my M-Series Mac? The Apple ones are very expensive and don’t have OLED, so I am looking for something around 4K (to get that retina look) in resolution and ideally even with OLED and a high refresh rate above 60hz. My current monitors are all FHD and it’s time to upgrade. \n\nWhat are great monitors that you can recommend? Thanks in advance. ",
        "created_utc": 1730568145.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "display for mac mini ",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gi19ot/display_for_mac_mini/",
        "content": "i currently have a very old asus VS247H-P (1080p). compared to a recent iphone or ipad, it's blurry and hard to look at.\n\nideally i would get a studio display, but i can't justify it right now. i need something in-between for the time being.\n\nwhat would be a good display with the following requisites for the cheapest price:\n\n\\- 27\"\n\n\\- a good upgrade from what i currently have that doesn't cause eye fatigue (i.e. like retina quality)\n\n\\- turns on as fast as possible when i wake up the mac mini. what i have now takes 5 to 10 seconds (either on hdmi or displayport)",
        "created_utc": 1730567527.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Macbook Pro M3 Display replacement",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ghz2ge/macbook_pro_m3_display_replacement/",
        "content": "Apple will replace my display under warranty. I read online they also replace the top case? I’m curious what does Apple do during a screen replacement? Do they indeed replace the top assembly? I’m asking because my magsafe port has some small chips/dots inside. Curious if this will be replaced/includes. Also curious if then the keyboard is replaced..\n\nThanks!",
        "created_utc": 1730561586.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Geek Squad Refurbished 2021 16\" MacBook Pro",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ghkr7y/geek_squad_refurbished_2021_16_macbook_pro/",
        "content": "Paid $1029. 512GB. 16GB Memory. Model: Macbook18,2.  \nBattery max capacity 97%. Cycle count 132.  \nApplecare coverage until 12/8/24.\n\nI'm replacing a 2013 15\" MacBook Pro Retina and trying to spend less on a reliable machine since I now have a son. Was this worth what I paid? I'm editing photos and videos. I know Geek Squad refurbs are hit or miss. But, there is close to no blemishes on the machine and it came with the Apple 140W charger. Should I keep this or return it to find a better deal? Possibly Black Friday deals?",
        "created_utc": 1730508750.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "iPod fans evade Apple’s DRM to preserve 54 lost clickwheel-era games",
        "score": 939,
        "url": "https://arstechnica.com/gaming/2024/11/ipod-fans-evade-apples-drm-to-preserve-54-lost-clickwheel-era-games/#gsc.tab=0",
        "content": "",
        "created_utc": 1730576262.0,
        "subreddit_name": "technews",
        "comments": 23
    },
    {
        "title": "A satellite services company is up 31% after announcing Apple is taking a stake",
        "score": 390,
        "url": "https://finance.yahoo.com/news/satellite-services-company-31-announcing-210847602.html",
        "content": "",
        "created_utc": 1730525909.0,
        "subreddit_name": "technews",
        "comments": 11
    },
    {
        "title": "/r/Stocks Weekend Discussion Saturday - Nov 02, 2024",
        "score": 11,
        "url": "https://www.reddit.com/r/stocks/comments/1ghspwv/rstocks_weekend_discussion_saturday_nov_02_2024/",
        "content": "This is the weekend edition of our stickied discussion thread.  Discuss your trades / moves from last week and what you're planning on doing for the week ahead.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1730539824.0,
        "subreddit_name": "stocks",
        "comments": 55
    },
    {
        "title": "How the market will go next week",
        "score": 337,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gi8pkg/how_the_market_will_go_next_week/",
        "content": "SPY closed +0.42% and fell slightly after hours by -0.05%. Trading volume was up by 10.6% when compared to the average. \n\nScared money has left the market. Anyone in the market now is bracing for earnings reports and election results, these are risk seeking individuals/institutions. These are the type to double down when a position goes south, rather than cut losses. Otherwise, they would've sold already.\n\nThe market will continue to bounce around and ultimately, dips will be bought. Once election results are final and there is no more uncertainty, lots of cash from the sidelines will flow back into the stock market, causing a rally.",
        "created_utc": 1730587990.0,
        "subreddit_name": "wallstreetbets",
        "comments": 171
    },
    {
        "title": "I don’t even know how this happened ",
        "score": 120,
        "url": "https://i.redd.it/u4aiikc84iyd1.jpeg",
        "content": "basically all from qqq started about 3 months ago but the big jump is from like 2 weeks ago. I think i’m gonna cash out at some point.",
        "created_utc": 1730558942.0,
        "subreddit_name": "wallstreetbets",
        "comments": 60
    }
]