[
    {
        "title": "Apple reportedly negotiating with OpenAI to power iOS 18 features",
        "score": 2802,
        "url": "https://9to5mac.com/2024/04/26/apple-openai-ai-features-ios-18/",
        "content": "",
        "created_utc": 1714173038.0,
        "subreddit_name": "apple",
        "comments": 383
    },
    {
        "title": "Apple's Regular Mac Base RAM Boosts Ended When Tim Cook Took Over",
        "score": 1728,
        "url": "https://www.macrumors.com/2024/04/26/apple-mac-base-ram-boosts-ended-tim-cook/",
        "content": "",
        "created_utc": 1714139484.0,
        "subreddit_name": "apple",
        "comments": 628
    },
    {
        "title": "How I caught yesterday’s market bottom",
        "score": 200,
        "url": "https://www.reddit.com/gallery/1cdc4oi",
        "content": "Hi all, I just want to share my new way of viewing the market via my personal take on support/resistance levels. My algo detects major absorption levels that happened across the previous few months in S&P /ES futures and present it as levels.\n\nAbsorption is whereby heavy buying/ selling could not move the price as their orders are being absorbed by even larger orders on the opposite side of the trade.\n\nThis is purely based on volume and orderflow and not technical analysis.\n\nYesterday, the session low coincided with one of these levels at 5023 for /ES futures. The price rebounded off this level and I took a long. I left a runner and it ended up with 22x return.\n\nBy watching the futures level, one can also trade the SPY. If the SPY was longed at the same time, it would have returned 13x without leverage. With leveraged options, this will go to the moon.\n\nOther ways of employing this includes option straddles if you are unsure of the direction.\n\nI have been sending these levels to trader friends. They are very happy with it and urged me to set up a service to benefit the larger trader community. It is in beta right and free right now. If any of you would like to be part of this community, just PM me.\n\nHave a nice day 😁",
        "created_utc": 1714104838.0,
        "subreddit_name": "DayTrading",
        "comments": 107
    },
    {
        "title": "Tried 0dte on SPY for the Past 3 Weeks and Here is the Result",
        "score": 93,
        "url": "https://www.reddit.com/r/Daytrading/comments/1cdvydw/tried_0dte_on_spy_for_the_past_3_weeks_and_here/",
        "content": "I've been seeing a lot of people talking about 0dtes lately and I thought I would give it a try with a small amount of investment. It's been about 3 weeks now since I started and as you can see it on my weekly & monthly P/L sheet below, I've been profitable for the past 3 weeks (surprisingly).\n\nFor the week of 4/1, I did not trade much as I wanted to study charts and price actions on SPY. After a week of paying close attention on its movement, I've started trading actively from the week of 4/8. (For the days that I had $0, I either had other things to work on or simply wasn't able to to trade.)\n\n[ Weekly and Monthly P\\/L ](https://preview.redd.it/2fulrob5xvwc1.png?width=705&format=png&auto=webp&s=423daff72b8cab3e4286e8cfc2eab7ae8fc8c3a4)\n\nMy strategy was simple. Invest about $1000 - $1500 per trade. Cutting losses at the pre-defined percentage and exiting whenever I was profitable. My RR was 1:1.5 (20%/30%) and I tried to stick to this strategy as much as possible without getting my emotions involved.\n\nBelow is the spreadsheet of trades that I've made along the journey. As you can see it on the Actual Profit/Loss columns (column S and T), there were times where I held onto the losses for little too long but for the majority of the time, I've managed to cut losses whenever I was down \\~20% range.\n\n[ Trades I made for 0dte on SPY ](https://preview.redd.it/cfppvaz7xvwc1.png?width=2055&format=png&auto=webp&s=c35343dd0b7c93a18173c7d64a9c95023215c24c)\n\nFor when to exit, I sold half of the investment whenever I was up around 30%, locking in that profit and let the rest of the half run after adjusting the stop loss at a higher point (so that I would still end up making a little bit of money even if the stock goes down. If it runs higher, even better, I'm not missing out on the runs as I still have half of my investment in it.) I've had countless number of times where I was being greedy and ended up going negative at the end so \"***minimizing the loss and not being too greedy***\" was pretty much what I was aiming for. Nobody goes broke being positive, right?\n\nFor indicators, I've only used VWAP, 20/50/100 MA. Nothing else. (Of course you need to be looking at the volume as well as support and resistance lines.) I've tried many different indicators throughout my years of trading experience but keeping my chart simple has worked the best for me.\n\nI know that 3 weeks is an extremely short amount of time to show & prove anything but let me know your thoughts on 0dtes. Do you think it's a sustainable business? For now, I think I will continue to trade 0dtes as I am profitable and see where I would end up after a few months. I will post an update if anyone's interested. Thank you all!\n\nTLDR: I tried 0dte for about 3 weeks and was profitable!\n\nEdit: Since many of you have asked for a spreadsheet template, I've removed all my personal info. and created this template. You can access & download it HERE (Make sure to read the instruction on the far right side of the sheet!)\n\nEdit2: Removed the spreadsheet template link temporarily as someone DM'ed and pointed out that there could possibly be a privacy concern. I might upload it on a separate account and update the link accordingly.",
        "created_utc": 1714163963.0,
        "subreddit_name": "DayTrading",
        "comments": 61
    }
]