[
    {
        "title": "Arm shares spike 24% after chip designer gives strong forecast, says AI is increasing sales",
        "score": 599,
        "url": "https://www.reddit.com/r/stocks/comments/1alek9u/arm_shares_spike_24_after_chip_designer_gives/",
        "content": "Arm reported fiscal third-quarter earnings that beat estimates and gave a strong profit forecast for the current quarter. The shares soared more than 20% in extended trading.\n\nHere’s how the company did versus LSEG consensus estimates for the quarter ending December:\n\nRevenue: $824 million, vs. $761 million expected\n\nEPS: 29 cents adjusted, vs 25 cents expected.\n\n\nArm, whose chip design technology is in nearly every smartphone and many PCs, said it expects earnings per share for the fiscal fourth quarter of between 28 cents and 32 cents on sales of $850 million to $900 million. Analysts expectations earnings of 21 cents per share on sales of $780 million.\n\nThe company reported net income of $87 million, or 8 cents per share. Total revenue in the quarter increased 14% from a year earlier.\n\nArm makes money through royalties, when companies pay for access to build Arm-compatible chips, usually amounting to a small percentage of the final chip price.\n\nArm said its customers shipped 7.7 billion Arm chips during the September quarter, which is the most recent period which figures are available.\n\nRoyalty revenue increased 11% on an annual basis to $470 million. The company said the jump was partially because of a recovery in the smartphone market, as well as increasing sales to automotive companies and cloud providers. Arm said that it expects growth to be driven by royalty revenue.\n\nIn recent years, Arm has emphasized its licensing business, selling access to more complete designs that semiconductor companies can take and plug into their planned chips. That process saves chipmakers time and effort, and it’s more lucrative for Arm than simply collecting royalties.\n\nArm’s license and other revenue was $354 million, up 18% year-over-year. Arm said more companies were choosing to license its CPU designs to run artificial intelligence, and that the company charges higher licensing fees for advanced designs.\n\nArm, which had been owned by SoftBank, went public in September. The company was founded in 1990 to develop technology for low-power chips, but became more important to the overall technology industry when the Apple\n iPhone and competing Android devices standardized on Arm-based chips.\n\nArm says that companies including Apple, Google, Microsoft, and Nvidia use its technology.\n\nSource: https://www.cnbc.com/2024/02/07/arm-earnings-report-q3-2024-.html",
        "created_utc": 1707342208.0,
        "subreddit_name": "stocks",
        "comments": 193
    }
]