[
    {
        "title": "Gamestop Big Picture: The Short Singularity Pt 3 - WTF edition",
        "score": 7133,
        "url": "https://www.reddit.com/r/investing/comments/l7qlfh/gamestop_big_picture_the_short_singularity_pt_3/",
        "content": " *Disclaimer: I am not a financial advisor. This entire post represents my personal views and opinions, and should not be taken as financial advice (or advice of any kind whatsoever). I encourage you to do your own research, take anything I write with a grain of salt, and hold me accountable for any mistakes you may catch. Also, full disclosure, I hold a net long position in GME, but my cost basis is very low (average \\~$67--I have to admit, the drop today was too tasty so my cost basis went up from yesterday)/share with my later buys averaged in), and I'm using money I can absolutely lose. My capital at risk and tolerance for risk generally is likely substantially different than yours.  In this post I will go a little further and speculate more than I'd normally do in a post due to the questions I've been getting, so fair warning, some of it might be very wrong.  I suspect we'll learn some of the truth years from now when some investigative journalist writes a book about it.*\n\nThank you everyone for the comments and questions on the [first](https://www.reddit.com/r/investing/comments/l5l413/gamestop_big_picture_the_short_singularity/) and [second](https://www.reddit.com/r/investing/comments/l6xc8l/gamestop_big_picture_the_short_singularity_pt_2/) post on this topic.\n\nToday was a study in the power of fear, courage, and the levers you can pull when you wield billions of dollars...\n\nWoops, excuse me. I'm sorry hedge fund guys... I meant trillions of dollars--I just briefly forget you control not just your own but a lot of other peoples' money too for a moment there.\n\nAlso, for people still trading this on market-based rationale (as I am), it was a good day to measure the conviction behind your thesis.  I like to think I have conviction, but in case you are somehow not yet familiar with the legend of DFV, you need to see these posts (fair warning, nsfw, and some may be offended/triggered by the crude language). The last two posts might be impressive, but you should follow it in chronological order and pay attention to the evolution of sentiment in the comments to experience [true enlightenment](https://www.reddit.com/user/DeepFuckingValue/posts/).\n\nAnyway, I apologize, but this post will be very long--there's just a lot to unpack.\n\n# Pre-Market\n\nDisclaimer: given yesterday's pre-market action I didn't even pay attention to the screen until near retail pre-market.  I'm less confident in my ability to read what's going on in a historical chart vs the feel I get watching live, but I'll try.\n\nEarly in the pre-market it looks to me like some momentum traders are taking profit, discounting the probability that the short-side will give them a deep discount later, which you can reasonably assume given the strategy they ran yesterday.  If they're right they can sell some small volume into the pre-market top, wait for the hedge funds try to run the price back down, and then lever up the gains even higher buying the dip.  Buy-side here look to me like people FOMOing and YOLOing in at any price to grab their slice of gainz, or what looks to be market history in the making.  No way are short-side hedge funds trying to cover anything at these prices.\n\n[Mark Cuban](https://www.youtube.com/watch?v=EhZZnVs-KM4)\\--well said!  Free markets baby!\n\nMohamed El-Erian is money in the bank as always.  \"upgrade in quality\" on the pandemic drop was the best, clearest actionable call while most were at peak panic, and boy did it print.  Your identifying the bubble as the excessive short (vs blaming retail activity) is [money yet again](https://youtu.be/Gxan42tXhbo?t=164).  Also, The PAIN TRADE (sorry, later interview segment I only have on DVR, couldn't find on youtube--maybe someone else can)!\n\nThe short attack starts, but I'm hoping no one was panicking this time--we've seen it before.  Looks like the momentum guys are minting money buying the double dip into market open.\n\nCNBC, please get a good market technician to explain the market action.  Buy-side dominance, sell-side share availability evaporating into nothing (look at day-by-day volume last few days), this thing is now at runaway supercritical mass.  There is no changing the trajectory unless you can change the very fabric of the market and the rules behind it (woops, I guess I should have knocked on wood there).\n\nIf you know the mechanics, what's happening in the market with GME is not mysterious AT ALL.  I feel like you guys are trying to scare retail out early \"for their own good\" (with all sincerity, to your credit) rather than explain what's happening.  Possibly you also fear that explaining it would equate to enabling/encouraging people to keep trying to do it inappropriately (possibly fair point, but at least come out and say that if that's the case).  Outside the market, however...wow.\n\n# You Thought Yesterday Was Fear?  THIS is Fear!\n\nOk short-side people, my hat is off to you.  Just when I thought shouting fire in a locked theater was fear mongering poetry in motion, you went and took it to 11.  What's even better?  Yelling fire in a theater with only one exit.  That way people can cause the financial equivalent of stampede casualties.  Absolutely brilliant.\n\nRobin Hood disables buying of GME, AMC, and a few of the other WSB favorites.  Other brokerages do the same.  Even for people on 0% margin.  Man, and here I thought I had seen it all yesterday.\n\n*Side note:  I will give a shout out to TD Ameritrade.  You guys got erroneously lumped together with RH during an early CNBC segment, but you telegraphed the volatility risk management changes and gradually ramped up margin requirements over the past week.  No one on your platform should have been surprised if they were paying attention.  And you didn't stop anyone from trading their own money at any point in time. My account balance thanks you.  I heard others may have had problems, but I'll give you the benefit of the doubt given the DDOS attacks that were flyiing around*\n\nRobin Hood.  Seriously WTF.  I'm sure it was TOTALLY coincidence that your big announcements happen almost precisely when what has to be one of the best and most aggressive short ladder attacks of all time starts painting the tape, what looked like a DDOS attack on Reddit's CDN infrastructure (pretty certain it was the CDN because other stuff got taken out at the same time too), and a flood of bots hit social media (ok, short-side, this last one is getting old).\n\nTaking out a large-scale cloud CDN is real big boy stuff though, so I wouldn't entirely rule out nation state type action--those guys are good at sniffing out opportunities to foment social unrest.\n\nAnyway, at this point, as the market dives, I have to admit I was worried for a moment.  Not that somehow the short-side would win (hah! the long-side whales in the pond know what's up), but that a lot of retail would get hurt in the action.  That concern subsided quite a bit on the third halt on that slide.  But first...\n\n**A side lesson on market orders**\n\nSomeone printed bonus bank big time (and someone lost--I feel your pain, whoever you are).\n\nDuring the face-ripping volatility my play money account briefly ascended to rarified heights of 7 figures.  It took me a second to realize it, then another second to process it.  Then, as soon as it clicked, that one, glorious moment in time was gone.\n\nWhat happened?\n\nDuring the insane chop of the short ladder attack, someone decided to sweep the 29 Jan 21 115 Call contracts, but they couldn't get a grip on the price, which was going coast to coast as IV blew up and the price was being slammed around.  So whoever was trying to buy said \"F it, MARKET ORDER\" (i.e. buy up to $X,XXX,XXX worth of contracts at any price).  This is referred to as a sweep if funded to buy all/most of the contracts on offer (HFT shops snipe every contract at each specific price with a shotgun of limit orders, which is far safer, but something only near-market compute resources can do really well).  For retail, or old-tech pros, if you want all the contracts quickly, you drop a market order loaded with big bucks and see what you get... BUT, some clever shark had contracts available for the reasonable sum of... $4,400, or something around that. I was too stunned to grab a screencap. The buy market order swept the book clean and ran right into that glorious, nigh-obscene backstop limit.  So someone got nearly $440,000 PER CONTRACT that was, at the time theoretically priced at around $15,000.  $425,000 loss... PER CONTRACT.  Maybe I'm not giving the buyer enough credit.. you can get sniped like that even if you try to do a safety check of the order book first, but, especially in low liquidity environments, if a HFT can peak into your order flow (or maybe just observes a high volume of sweeps occurring), they can end up front running your sweep, pick off the reasonable contracts, and slam a ridiculous limit sell order into place before your order makes it to the exchange.  Either way, I hope that sweep wasn't loaded for bear into the millions.  If so... OUCH.  Someone got cleaned out.\n\nSo, the lesson here folks... in a super high volatility, low-liquidity market, a market order will just run up the ladder into the first sell order it can find, and some very brutal people will put limit sells like that out there just in case they hit the jackpot.  And someone did.  If you're on the winning side, great.  It can basically bankrupt you if you're on the losing side.  My recommendation: Just don't try it.  I wouldn't be surprised if really shady shenanigans were involved in this, but no way to know (normally that's crazy-type talk, but after today....peeking at order flow and sniping sweeps is one of the fastest, most financially devastating ways to bleed big long-side players, just sayin').\n\n**edit** *so while I was too busy trying not to spit out my coffee to grab a screenshot, /u/piddlesthethug was faster on the draw and captured this: https://imgur.com/gallery/RI1WOuu\n\nOk, so I guess my in-the-moment mental math was off by about 10%. Man, that hurts just thinking about the guy who lost on that trade.*\n\nBack to the market action..\n\n# A Ray of Light Through the Darkness\n\nSo I was worried watching the crazy downward movement for two different reasons.\n\nOn the one hand, I was worried the momentum pros would get the best discounts on the dip (I'll admit, I FOMO'd in too early, unnecessarily raising my cost basis).\n\nOn the other hand, I was worried for the retail people on Robin Hood who might be bailing out into incredibly steep losses because they had only two options: Watch the slide, or bail.  All while dealing with what looked to me like a broad-based cloud CDN outage as they tried to get info from WSB HQ, and wondering if the insta-flood of bot messages were actually real people this time, and that everyone else was bailing on them to leave them holding the bag.\n\nBut I saw the retail flag flying high on the 3rd market halt (IIRC), and I knew most would be ok.  What did I see, you ask?  Why, the glorious  $211.00 / **$5,000** bid/ask spread.  WSB Reddit is down?  Those crazy mofos give you the finger right on the ticker tape.  I've been asked many times in the last few hours about why I was so sure shorts weren't covering on the down move.  THIS is how I knew.  For sure.  It's in the market data itself.\n\n**edit** *So, there's feedback in the comments that this is likely more of a technical glitch.  Man, at least it was hilarious in the moment.  But also now I know maybe not to trust price updates when the spread between orders being posted is so wide.  Maybe a technical limitation of TOS*\n\nI'll admit, I tried to one-up those bros with a 4206.90 limit sell order, but it never made it through.  I'm impressed that the HFT guys at the hedge fund must have realized really quickly what a morale booster that kind of thing would have been, and kept a lower backstop ask in place almost continuously from then on  I'm sure others tried the same thing.  Occasionally $1,000 and other high-dollar asks would peak through from time to time from then on, which told me the long-side HFTs were probably successfully sniping the backstops regularly.\n\nSo, translating for those of you who found that confusing.  First, such a high ask is basically a FU to the short-side (who, as you remember, need to eventually buy shares to cover their short positions).  More importantly, as an indicator of retail sentiment, it meant that NO ONE ELSE WAS TRYING TO SELL AT ANY PRICE LOWER THAN $5,000.  Absolutely no one was bailing out.\n\nI laughed for a minute, then started getting a little worried.  Holy cow.. NO retail selling into the fear?  How are they resisting that kind of price move??\n\nThe answer, as we all know now... they weren't afraid... they weren't even worried.  They were F\\*CKING PISSED.\n\nMeanwhile the momentum guys and long-side HFTs keep gobbling up the generously donated shares that the short-side are plowing into their ladder attack.  Lots of HFT duels going on as long-side HFTs try to intercept shares meant to travel between short-side HFT accounts for their ladder.  You can tell when you see prices like $227.0001 constantly flying across the tape.  Retail can't even attempt to enter an order like that--those are for the big boys with privileged low-latency access.\n\nThe fact that you can even see that on the tape with human eyes is really bad for the short-side people.\n\nWhy, you ask?  Because it means liquidity is drying up, and fast.\n\n# The Liquidity Tide is Flowing Out Quickly.  Who's Naked (short)?\n\nMarket technicals time.   I still wish this sub would allow pictures so I could throw up a chart, but I guess a table will do fine.\n\n&#x200B;\n\n|Date|Volume|Price at US Market Close|\n|:-|:-|:-|\n|Friday, 1/22/21|197,157,196|$65.01|\n|Monday, 1/25/21|177,874,00|$76.79|\n|Tuesday, 1/26/21|178,587,974|$147.98|\n|Wednesday, 1/27/21|93,396,666|$347.51|\n|Thursday, 1/28/21|58,815,805|$193.60|\n\nWhat do I see?  I see the shares available to trade dropping so fast that all the near-exchange compute power in the world won't let the short-side HFTs maintain order flow volume for their attacks.  Many retail people asking me questions thought today was the heaviest trading.  Nope--it was just the craziest.\n\nWhat about the price dropping on Thursday?  Is that a sign that the short-side pulled a miracle out and pushed price down against a parabolic move on even less volume than Wednesday? Is the long side running out of capital?\n\nNope.  It means the short-side hedge funds are just about finished.\n\nBut wait, I thought the price needed to be higher for them to be taken out?  How is it that price being lower is bad for them?  Won't that allow them to cover at a lower price?\n\nNo, the volume is so low that they can't cover any meaningful fraction of their position without spiking the price parabolic almost instantly.  Just not enough shares on offer at reasonable prices (especially when WSB keeps flashing you 6942.00s).\n\nIt's true, a higher price hurts, but the interest charge for one more day is just noise at this point.  The only tick that will REALLY count is the last tick of trading on Friday.\n\nIn the meantime, the price drop (and watching the sparring in real time) tells me that the long-side whales and their HFT quants are so certain of the squeeze that they're no longer worried AT ALL about whether it will happen, and they aren't even worried at all about retail morale to help carry the water anymore.\n\nInstead, they're now really, really worried about how CHEAPLY they can make it happen.\n\nThey are wondering if they can't edge out just a sliver more alpha out of what will already be a blow-out trade for the history books (probably).  You see, to make it happen they just have to keep hoovering up shares.  It doesn't matter what those shares cost.  If you're certain that the squeeze is now locked in, why push the price up and pay more than you have to?  Just keep pressing hard enough to force short-side to keep sending those tasty shares your way, but not so much you move the price.  Short-side realizes this and doesn't try to drive price down too aggressively.  They can't afford to let price run away, so they have to keep some pressure on at the lowest volume they can manage, but they don't want to push down too hard and give the long-side HFTs too deep of a discount and bleed their ammo out even faster.  That dynamic keeps price within a narrow (for GME today, anyway) trading range for the rest of the day into the close.\n\nGood plan guys, but those after market people are pushing the price up again.  Damnit WSB bros and Euros, you're costing those poor long-side whales their extra 0.0000001% of alpha on this trade just so you can run up your green rockets... See, that's the kind of nonsense that just validates [Lee Cooperman's](https://youtu.be/mI-nItz56Fs?t=279) concerns.\n\nOn a totally unrelated note, I have to say that I appreciate the shift in CNBC's reporting.  Much more thoughtful and informed.  Just please get a good market technician in there who will be willing to talk about what is going on under the hood if possible.  A lot of people watching on the sidelines are far more terrified than they need to be because it all looks random to them.  And they're worried that you guys look confused and worried--and if the experts on the news are worried....??!\n\nYou should be able to find one who has access to the really good data that we retailers can only guess at, who can explain it to us unwashed masses.\n\n# Ok, So.. Questions\n\n**There is no market justification for this.  How can you tell me is this fundamentally sound and not just straight throwing money away irresponsibly??** *(side note: not that that should matter--if you want to throw your money away why shouldn't you be allowed to?)*\n\nWe're not trading in your securities pricing model.  This isn't irrational just because your model says long and short positions are the same thing.  The model is not a real market.  There is asymmetrical counterparty risk here given the shorts are on the hook for all the money they have, and possibly all the money their brokers have, and possibly anyone with exposure to the broker too!  You may want people to trade by the rules you want them to follow.  But the rest of us trade in the real market as it is actually implemented.  Remember?  That's what you tell the retailers who take their accounts to zero.  Remember what you told the KBIO short-squeezed people?  They had fair warning that short positions carry infinite risk, including more than your initial investment.  You guys know this.  It's literally part of your job to know this.\n\nBut-but-the systemic risk!! This is Madness!\n\n...Madness?\n\nTHIS. IS. **THE MARKET!!! \\*Retail kicks the short-side hedge funds down an infinity loss black hole\\***.\n\nOk, seriously though, that is actually a fundamentally sound, and properly profit-driven answer at least as justifiable as the hedge funds' justification for going >100% of float short.  If they can be allowed to gamble INFINITE LOSSES because they expect to make profit on the possibility the company goes bankrupt, can't others do the inverse on the possibility the company I don't know.. doesn't go bankrupt and gets a better strategy from the team that created what is now a $43bn market cap company (CHWY) that does exactly some of the things GME needs to do (digital revenue growth) maybe?  I mean, I first bought in on that fundamental value thesis in the 30s and then upped my cost basis given the asymmetry of risk in the technical analysis as an obvious no-brainer momentum trade.  The squeeze is just, as WSB people might say, tendies raining down from on high as an added bonus.\n\nI get that you disagree on the fundamental viability of GME.  Great.  Isn't that what makes a market?\n\nRegarding the consequences of a squeeze, in practice my expectation was maybe at worst some kind of ex-market settlement after liquidation of the funds with exposure to keep things nice and orderly for the rest of the market.  I mean, they handled the VW thing somehow right?  I see now that I just underestimated elite hedge fund managers though--those guys are so hardcore (I'll explain why I think so a bit lower down).\n\n**If hedge fund people are so hardcore, how did the retail long side ever have a chance of winning this squeeze trade they're talking about?**\n\nBecause it's an asymmetrical battle once you have short interest cornered.  And the risk is also crazily asymmetrical in favor of the long side if short interest is what it is in GME.  In fact, the hedge funds essentially cornered themselves without anyone even doing anything.  They just dug themselves right in there.  Kind of impressive really, in a weird way.\n\nWhat does the short side need to cover?  They need the price to be low, and they need to buy shares.\n\nHow does price move lower?  You have to push share volume such that supply overwhelms demand and price therefore goes down (man, I knew econ 101 would come in handy someday).\n\nBut wait... if you have to sell shares to push the price down.. won't you just undo all your work when you have to buy it back to actually cover?\n\nThe trick is you have to push price down so hard, so fast, so unpredictably, that you SCARE OTHER PEOPLE into selling their shares too, because they're scared of taking losses.  Their sales help push the price down for free! and then you scoop them up at discount price!  Also, there are ways to make people scared other than price movement and fear of losses, when you get right down to it.  So, you know, you just need to get really, really, really good at making people scared.  Remember to add a line item to your budget to make sure you can really do it right.\n\nOn the other hand..\n\nWhat does the long side need to do?  They need to own as much of the shares as they can get their hands on.  And then they need to hold on to them.  They can't be weak hands either.  They need to be hands that will hold even under the most intense heat of battle, and the immense pressure of mind-numbing fear... they need to be as if they were made of... diamond... (oh wow, maybe those WSB people kind of have a point here).\n\nWhy does this matter?  Because at some point the sell side will eventually run out of shares to borrow.  They simply won't be there, because they'll be safely tucked away in the long-side's accounts.  Once you run out of shares to borrow and sell, you have no way to move the price anymore.  You can't just drop a fat stack--excuse me, I mean suitcase (we're talking hedge fund money here after all)--of Benjamins on the ticker tape directly.  Only shares.  No more shares, no way to have any direct effect on the price whatsoever.\n\nOk, doesn't that just mean trading stops?  Can't you just out-wait the long side then?\n\nWell, you could.. until someone on the long side puts 1 share up on a 69420 ask, and an even crazier person actually buys at that price on the last tick on a Friday.  Let's just say it gets really bad at that point.\n\nOk.. but how do the retail people actually get paid?\n\nWell, to be quite honest, it's entirely up to each of them individually.  You've seen the volumes being thrown around the past week+.  I guarantee you every single retailer out there could have printed money multiple times trading that flow. If they choose to, and time it well.  Or they could lose it all--this is the market. Some of them apparently seem to have some plan, or an implicit trust in certain individuals to help them know when to punch out.  Maybe it works out, but maybe not.  There will be financial casualties on the field for sure--this is the bare-knuckled capitalist jungle after all, remember?  But everyone ponied up to the table with their own money somehow, so they all get to play in the big leagues just like everyone else.  In theory, anyway.\n\nAnd now, Probably the #1 question I've been asked on all of these posts has been: **So what happens next?**  Do we get the infinity squeeze?  Do the hedge funds go down?\n\nGreat questions.  I don't know.  No one does.  That's what I've said every time, but I get that's a frustrating answer, so I'll write a bit more and speculate further.  Please again understand these are my opinions with a degree of speculation I wouldn't normally put in a post.\n\n# The Market and the Economy.  Main Street, Wall Street, and Washington\n\nThe pandemic has hurt so many people that it's hard to comprehend.  Honestly, I don't even pretend to be able to.  I have been crazy fortunate enough to almost not be affected at all. Honestly, it is a little unnerving to me how great the disconnect is between people who are doing fine (or better than fine, looking at my IRA) versus the people who are on the opposite side of the ever-widening divide that, let's be honest, has been growing wider since long before the pandemic.\n\nPeople on the other side--who have been told they cannot work even if they want to, who wonder if congress will get it together to at least keep them from getting thrown out of their house if they have to keep taking one for the team for the good of all, are wondering if they're even living in the same reality.\n\nBecause all they see on the news each day is that the stock market is at record highs, or some amazing tech stocks have 10x'd in the last 6 months.  How can that be happening during a pandemic?  Because The Market is not The Economy.  The Market looks forward to that brighter future that Economy types just need to wait for.  Don't worry--it'll be here sometime before the end of the year.  We think.  We're making money on that assumption right now, anyway.  Oh, by the way, if you're in The Market, you get to get richer as a minor, unearned side-effect of the solutions our governments have come up with to fight the pandemic.\n\nWow.  That sounds amazing. How do I get to part of that world?\n\nRetail fintech, baby. Physical assets like real estate might be a bit out of reach at the moment, but stocks will do.  I can even buy fractional shares of BRK/A LOL.  \n\nFinally, I can trade for my own slice of heaven, watching that balance go up (and up--go stonks!!).  Now I too get to dream the dream.  I get to feel connected to that mythical world, The Market, rather than being stuck in the plain old Economy.  Sure, I might blow up my account, but that's because it's the jungle.  Bare-knuckled, big league capitalism going on right here, and at least I get to show up an put my shares on the table with everyone else.  At least I'm playing the same game.  Everyone has to start somewhere--at least now I get to start, even if I have to learn my lesson by zeroing my account a few times.  I've basically had to deal with what felt like my life zeroing out a few times before.  This is number on a screen going to 0 is nothing.\n\nLaugh or cry, right?  I'll post my losses on WSB and at least get some laughs.\n\nGeez, some of the people here are making bank.  I better learn from them and see if they'll let me in on their trades.  Wow... this actually might work.  I don't understand yet, but I trust these guys telling me to hold onto this crazy trade.  I don't understand it, but all the memes say it's going to be big.\n\n...WOW... I can pay off my credit card with this number.  Do I punch out now?  No?  Hold?... Ok, getting nervous watching the number go down but I trust you freaks.  We're still in the jungle, but at least I'm in with with my posse now.  Market open tomorrow--we ride the rocket baby!  And if it goes down, at least I'm going down with my crew.  At least if that happens the memes will be so hilarious I'll forget to cry.\n\nWow.. I can't believe it... we might actually pull this off.  Laugh at us now, \"pros\"!\n\nWe're in The Market now, and Market rules tell us what is going to happen.  We're getting all that hedge fund money Right? Right?\n\nMaybe.\n\nFirst, I say maybe because nothing is ever guaranteed until it clears.  Secondly, because the rules of The Market are not as perfectly enforced as we would like to assume.  We are also finding out they may not be perfectly fair.  The Market most experts are willing to talk about is really more like the ideal The Market is supposed to be.  This is the version of the market I make my trading decisions in.  However, the Real Market gets strange and unpredictable at the edges, when things are taken to extremes, or rules are pushed beyond the breaking point, or some of the mechanics deep in the guts of the Real Market get stretched.  GME ticks basically all of those boxes, which is why so many people are getting nervous (aside from the crazy money they might lose).  It's also important to remember that the sheer amount of money flowing through the market has distorting power unto itself.  Because it's money, and people really, really, really like their money--especially when they're used to having a lot of it, and rules involving that kind of money tend to look more... flexible, shall we say.\n\nOk, back to GME.  If this situation with GME is allowed to play out to its conclusion in The Market, we'll see what happens.  I think all the long-side people get the chance to be paid (what, I'm not sure--and remember, you have to actually sell your position at some point or it's all still just numbers on your screen), but no one knows for certain.\n\nBut this might legitimately get so big that it spills out of The Market and back into The Economy.\n\nGeez, and here I thought the point of all of this was so that we all get to make so much money we wouldn't ever have to think and worry about that thing again.\n\nUnfortunately, while he's kind of a buzzkill, [Thomas Petterfy](https://www.youtube.com/watch?v=7RH4XKP55fM) has a point.  This could be a serious problem.\n\nIt might blow out The Market, which will definitely crap on The Economy, which as we all know from hard experience, will seriously crush Main Street.\n\nIf it's that big a deal, we may even need Washington to be involved.  Once that happens, who knows what to expect.. this kind of scenario being possible is why I've been saying I have no idea how this ends, and no one else does either.\n\nHow did we end up in this ridiculous situation?  From GAMESTOP??  And it's not Retail's fault the situation is what it is.. why is everyone telling US that we need to back down to save The Market?? What about the short-side hedge funds that slammed that risk into the system to begin with??  We're just playing by the rules of The Market!!\n\nWell, here are my thoughts, opinions, and some even further speculation...  This may be total fantasy land stuff here, but since I keep getting asked I'll share anyway.  Just keep that disclaimer in mind.\n\n# A Study in Big Finance Power Moves: If you owe the bank $10,000, it's your problem...\n\nWhat happens when you owe money you have no way to pay back?  It's a scary question to have to face personally.  Still, on balance and on average, if you're fortunate enough to have access to credit the borrowing is a risk that is worth taking (especially if you're reasonably careful).  Lenders can take a risk loaning you money, you take a risk by borrowing in order to do something now that you would otherwise have had to wait a long time or maybe would never have realistically been able to do otherwise.  Sometimes it doesn't work out.  Sometimes it's due to reasons totally beyond your control.  In any case, if you find yourself there you have no choice but to dust yourself off, pick yourself up as best as you can, and try to move on and rebuild. A lot of people had to learn that in 2008.  Man that year really sucked.\n\nWall street learned their lessons too.  Most learned what I think most of us would consider the right lessons--lessons about risk management, and the need to guard vigilantly against systemic risk, concentration of risk through excess concentration of leverage on common assets, etc.  Many suspect that at least a few others may have learned an entirely different set of, shall we say, unhealthy lessons.  Also, to try to be completely fair, maybe managing other peoples' money on 10x+ leverage comes with a kind of pressure that just clouds your judgement.  I could actually, genuinely buy that.  I know I make mistakes under pressure even when I'm trading risk capital I could totally lose with no real consequence. Whatever the motive, here's my read on what's happening:\n\nFirst, remember that as much fun as WSB are making of the short-side hedge fund guys right now, those guys are smart.  Scary smart.  Keep that in mind.\n\nNext, let's put ourselves in their shoes.\n\nIf you're a high-alpha hedge fund manager slinging trades on a $20bn 10x leveraged to 200bn portfolio, get caught in a bad situation, and are down mark-to-market several hundred million.. what do you do?  Do you take your losses and try again next time?  Hell no.\n\nYou're elite.  You don't realize losses--you double down--you can still save this trade no sweat.\n\nBut what if that doesn't work out so well and you're in the hole >$2bn?  Obvious double down.  Need you ask? I'm net up on the rest of my positions (of course), and the momentum when this thing makes its mean reversion move will be so hot you can almost taste the alpha from here.  Speaking of momentum, imagine the move if your friends on TV start hyping the story harder! Genius!\n\nOk, so that still didn't work... this is now a frigging 7 sigma departure from your modeled risk, and you're now locked into a situation that is about as close to mathematically impossible to escape as you can get in the real world, and quickly converging on infinite downside. Holy crap. The fund might be liquidated by your prime broker by tomorrow morning--and man, even the broker is freaking out.  F'in Elon Musk and his twitter!  You're cancelling your advance booking on his rocket ship to Mars first thing tomorrow...  Ok, focus--this might legit impact your total annual return.  You need a plan, and you know the smartest people on the planet, right?  The masters of the universe!  Awesome--they've even seen this kind of thing before and still have the playbook!! Of course! It's obvious now--you borrow a few more billion and double down again first thing in the morning. So simple.  Sticky note that Mars trip cancellation so you don't forget.\n\nOk... so that didn't work?  You even cashed in some pretty heavy chits too.  Ah well, that was a long shot anyway.  So where were you?  Oh yeah.. if shenanigans don't work, skip to page 10...\n\n...Which says, of course, to double down again.  Anyone even keeping track anymore?  Oh, S3 says it's $40bn and we're going parabolic?  Man, that chart gives me goosebumps.  All according to plan...\n\n***So what happens tomorrow? One possible outcome of PURE FANTASTIC SPECULATION...***\n\nEnd of the week--phew.  Never though it'd come.  Where are you at now?... Over $9000^(\\*)!!!  Wow.  You did it boys, and as a bonus the memes will be so sweet.\n\n^(\\*)*side note: add 8 zeros to the end...*\n\nAwesome--your problems have been solved. Because...\n\n&#x200B;\n\n..\n\n&#x200B;\n\n**BOOM**\n\n&#x200B;\n\nNow it's **EVERYONE's** problem.  [Come at me, Chamath](https://twitter.com/chamath/status/1353886305277472768), **THIS** is **REAL** baller shit.\n\nNow all you gotta do is make all the hysterical retirees watching their IRAs hanging in the balance blame those WSB kids. Hahaha.  Boomers, amirite?  hate when those kids step on their law--I mean IRAs.  GG guys, keep you memes. THAT is how it's done.\n\nOk, but seriously, I hope that's not how it ends. I guess we just take it day by day at this point.\n\nApologies for the length.  Good luck in the market!\n\nAlso, apologies in advance for formatting, spelling, and grammatical errors.  I was typing this thing in between doing all kinds of other things for most of the day.\n\n**Edit** getting a bunch of questions on if it's possible the hedge funds are finding ways to cover in spite of my assumptions.  Of course.  I'm a retail guy trying to read the charts and price action.  I don't have any special tools like the pros may have.",
        "created_utc": 1611920767.0,
        "subreddit_name": "investing",
        "comments": 1668
    }
]