[
    {
        "title": "Warren Buffett’s Berkshire Hathaway sold nearly half its stake in Apple. Cash pile hits record $276 billion.",
        "score": 3428,
        "url": "https://www.reddit.com/r/stocks/comments/1ej2a5e/warren_buffetts_berkshire_hathaway_sold_nearly/",
        "content": "\n\nQ2 operating earnings +15.5% Y/Y, cash hits record $276.94B\n\n2Q rev of $93.6B compared to $92.5B Y/Y\n\nWarren Buffett’s Berkshire Hathaway dumped nearly half of its gigantic Apple stake in a surprising move.\n\nThe Omaha-based conglomerate disclosed that its holding in the iPhone maker was valued at $84.2 billion at the end of the second quarter, indicating that the Oracle of Omaha offloaded 49.4% of the tech bet.\n\nShares of Apple jumped nearly 23% in the second quarter.\n\n\n\nhttps://www.cnbc.com/2024/08/03/warren-buffetts-berkshire-hathaway-sold-nearly-half-its-stake-in-apple.html",
        "created_utc": 1722688382.0,
        "subreddit_name": "stocks",
        "comments": 543
    },
    {
        "title": "Warren Buffett’s Berkshire Hathaway sold nearly half its stake in Apple. This is getting ugly day by day, we going to recession 😭",
        "score": 5236,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1ej26lv/warren_buffetts_berkshire_hathaway_sold_nearly/",
        "content": "Warren Buffett's Berkshire Hathaway sold nearly half its stake in Apple https://www.cnbc.com/2024/08/03/warren-buffetts-berkshire-hathaway-sold-nearly-half-its-stake-in-apple.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard\n",
        "created_utc": 1722688074.0,
        "subreddit_name": "wallstreetbets",
        "comments": 761
    },
    {
        "title": "Berkshire Hathaway Slashes Apple Stake by Nearly 50%",
        "score": 3331,
        "url": "https://www.barrons.com/articles/berkshire-hathaway-apple-stake-warren-buffett-9679bfc6",
        "content": "Buffett obviously either sees another better opportunity or trouble on the horizon with this move.  Interested to see how this plays out.",
        "created_utc": 1722688301.0,
        "subreddit_name": "wallstreetbets",
        "comments": 558
    },
    {
        "title": "Warren Buffett’s Berkshire Hathaway cuts stake in Apple by nearly 50%",
        "score": 6429,
        "url": "https://www.cnn.com/2024/08/03/business/berkshire-hathaway-apple-stock/index.html",
        "content": "",
        "created_utc": 1722704796.0,
        "subreddit_name": "technology",
        "comments": 573
    },
    {
        "title": "Delta CEO calls Microsoft 'fragile' and lauds Apple",
        "score": 1908,
        "url": "https://appleinsider.com/articles/24/08/01/delta-ceo-criticizes-microsofts-fragility-praises-apples-stability?fbclid=IwY2xjawEabx5leHRuA2FlbQIxMQABHa0rFjN1fqaneN4IJKf87Db2iAsRbsuj7QPaiJiXPOpwO5-kXuwImO7EXQ_aem_8Sbf2es6HwGix14LIQv2OA",
        "content": "",
        "created_utc": 1722650671.0,
        "subreddit_name": "apple",
        "comments": 478
    },
    {
        "title": "Warren Buffett sells nearly half of Berkshire’s stake in Apple",
        "score": 1645,
        "url": "https://9to5mac.com/2024/08/03/warren-buffet-aapl-sell/",
        "content": "",
        "created_utc": 1722697517.0,
        "subreddit_name": "apple",
        "comments": 315
    },
    {
        "title": "7 months in, month 2 of achieving profitability",
        "score": 312,
        "url": "https://www.reddit.com/gallery/1ej0pa2",
        "content": "Second month of being consistently profitable is in. \n\n\nUnfortunately not as fancy as the previous month but profitable nonetheless.\n\n\nAfter starting the month strong, I reached payout Satus on the 3d of July, it took them 12 days to approve the payout and then another 5 for the money to hit my bank account.\n\n\nPsychology is still a thing, riding high on my payout and feeling high and mighty I promptly blew up my PA by not trading my system and just trying to ride a pump, lessons learned.\n\n\nI got a couple of funded accounts ready for action, but I decided to take a break (and phone trading) until I get back home in September back to my setup and take this seriously again, hitting the payout milestone hits you like a train and I feel like I need to re-calibrate and take this seriously again.\n\n\nSome stats:\n\n\nMonths from knowing nothing to achieving first payout: 7\n\n\nEvals blown: 26\n\n\nPAs blown: 3\n\n\nMoney spent: approximately 1000$\n\n\nMoney made: 3000$\n\n\nMain takeaway: It can be done. \n\n\nGood luck to everyone on this path! My next update will probably be in Octomber.\n",
        "created_utc": 1722683098.0,
        "subreddit_name": "DayTrading",
        "comments": 201
    },
    {
        "title": "After blowing and failing so many fundeds here’s a list of what caused most of it. (Looking for advice)",
        "score": 76,
        "url": "https://www.reddit.com/r/Daytrading/comments/1eivzhv/after_blowing_and_failing_so_many_fundeds_heres_a/",
        "content": "- Not paying attention \n\nI found myself just glancing at the market on my phone marking out some some stuff and calling it a day. I would take a trade off some wonky setup and think I was doing good \n\n- over trading \n\nI would sling trades in Asian session and London session just cause it felt like I was getting ahead for New York . A really bad habit I started \n\n-gambling mindset \n\nMy worse enemy, when I passed my funded account and had live money this wasn’t really an issue and I actually experienced a lot of success in trading. It’s the challenges where I’m loterrly gambling half the time. But in the sense that I would win a trade and immediately think it’s okay to loose it and overl leverage on a trade again to try to make even more \n\n- needing to win back my losses \n\nI feel it’s so hard for me to be content with losses and I have succeeded in just taking a L and moving on but I still really do feel shit and like bad urge to want to get it back immediately \n\nImpatience - \n\nAs you can probably tell there’s a common theme of me wanting something immediately , similarly with my challenge accounts I would just want to be passed already and set and done \n\n",
        "created_utc": 1722664498.0,
        "subreddit_name": "DayTrading",
        "comments": 54
    },
    {
        "title": "Warren Buffett's Berkshire Hathaway sold nearly half its stake in Apple",
        "score": 12,
        "url": "https://www.reddit.com/r/AAPL/comments/1ej3dwl/warren_buffetts_berkshire_hathaway_sold_nearly/",
        "content": "https://www.barrons.com/amp/articles/berkshire-hathaway-apple-stock-buffett-e02830be\n\nGuys, after selling a few million shares two months ago, Berkshire now unloaded 50% more. It’s still no reason to run especially when AAPL reported another phenomenal quarter.\n\nAll Berkshire is doing is capitalizing on the gains and rotating money to short term treasuries as this economy unfolds. To add  INTC had a terrible quarter and will lay off 17.5k workers or 15% of the workforce. This is just the beginning of more layoff’s to come in various industries thanks to our friends at the treasury, or knuckleheads.\n\nRemember it never hurts to unwind some gains.\n\nHang in there as we come to year end and the presidential elections.",
        "created_utc": 1722691784.0,
        "subreddit_name": "AAPL",
        "comments": 23
    }
]