[
    {
        "title": "So... Apollo made $5,087.23 yesterday. Yeah no joke. Just sent it to the local animal shelter. THANK YOU SO MUCH! (Animal pics inside)",
        "score": 15740,
        "url": "https://www.reddit.com/r/apple/comments/95ezsl/so_apollo_made_508723_yesterday_yeah_no_joke_just/",
        "content": "Yeah that was one hell of a way to wake up.\n\nLong story short yesterday [I made a post here](https://www.reddit.com/r/apple/comments/953nqz/i_built_the_apollo_reddit_client_and_im_donating/) saying I'll donate all the proceeds from my [Apollo Reddit app](https://itunes.apple.com/app/id979274575) for the day to our local SPCA animal shelter (an awesome Canadian non-profit, no-kill shelter) because they said they were really low on supplies and well cats and dogs are awesome and need our help. I wanted to make a donation but I figured the awesome Apple/Reddit community might want to get in on that and give them something for it in the process so I made a post about it and sweet mayonnaise did you guys ever.\n\n$5,087.23 is the total amount raised. Yeah seriously I'm not joking, I wanted to raise like a few hundred bucks but 5 freaking grand is just absurdly beyond what I thought. All the amounts below are in Canadian dollars at today's exchange rate because most things came in in US dollars and it's a Canadian charity.\n\n### Breakdown\n\n- $4,038.55 in proceeds from Apollo sales. \n- $500 ($653.16 CAD) approximately from a ton of [direct donations](https://46189.thankyou4caring.org/sslpage.aspx?pid=298), hard to keep track but going off of a general tally from the comments and PMs I received I can honestly say I think that's undershooting the amount donated directly if anything \n- $50 worth of bitcoin donated ($65.31 CAD)\n- $25 from a kind friend\n- Someone awesomely gave me Reddit gold so I'll donate that too ($5.21 CAD)\n\nThat brings the total to approximately $4,787.23 but I really wanted that over $5,000 (plus there's some still some people commenting here and there about donating through Apollo even though the day's over and I want their money to count) I'll throw in another $300 of my own for a clean total of $5,087.23.\n\n### Proof\n\nAs I stated around $500 ($653.16 CAD) of that total was donated directly to the charity (not through Apollo) from some amazing people so they already have those funds awesomely, so the amount remaining is $5,087.23 - $653.16 which is $4,434.07.\n\nI wanted to try to figure out the best way to donate that, so I [posted asking](https://www.reddit.com/r/halifax/comments/95c0cs/if_i_theoretically_had_about_5000_to_donate_to/) and then called their fundraising line to make sure and they said it would be best to donate it directly, which makes a lot of sense.\n\nOf course it would have been cool to throw open the doors of the shelter with $5,000 worth of pet food and music playing but the goal is the animals (and not to be flashy) and fact is they can do a lot more with that money directly than through one of us buying stuff (bulk supply discounts, they can put it exactly where needed, etc.) so I donated it directly per their advice and now they can do the best possible things with it to help out the kitties and puppies and turtles and rabbits and whatnot of Nova Scotia. :)\n\n- Proof 1 from online form: https://i.imgur.com/katRyYv.png\n- Proof 2 from confirmation email: https://i.imgur.com/VWy46Ja.png\n- Proof 3 from bank account: https://i.imgur.com/sa7L7r7.png\n- Proof 4 from thank you email from them (wow!): https://i.imgur.com/WcGmh7Y.png\n\nIf you need more proof and can think of a way to provide it please just say so.\n\n### Pics\n\nA bunch of people were curious to see pics of the animals in need so we stopped over on my girlfriend's lunch break and took some pics for y'all. It's the same shelter [we got both of our cute fuzzballs from too](https://i.imgur.com/IaZqLDm.jpg).\n\nHere's an album of a bunch of the pics (it was really hot out so I couldn't take any of the dogs out for a walk to take some pics they're really cute and I took a pic of the adoption board): \n\nAlbum of cute animals animals at the shelter: https://imgur.com/a/kYEoI5y\n\nVideo of one kitty getting head ~~scratches~~ scritches: https://streamable.com/t3y5t\n\n### Thank You\n\nSeriously everyone thank you so much. It honestly blew me away, I was hoping for a small something but I really think this is going to make a massive difference to a lot of needy animals, y'all are the best. And if anyone missed the chance yesterday and still want to you can donate directly to them here: https://46189.thankyou4caring.org/sslpage.aspx?pid=298 Or even just to your local shelter, they surely need the help as well! My two little furballs thank you too.\n\nDefinitely won't be the last time I do this with Apollo, I'll try to do something like this again someday since it went so well. :D Anyway, back to work (and obligatory if you wanna check out a cool Reddit app check out [Apollo](https://itunes.apple.com/app/id979274575)!)\n\nIf you have any questions or anything too I'm happy to answer. \n\n– Christian\n\n**EDIT**: A lot of people have asked \"What is Apollo\"? So to answer that quickly [Apollo](https://apolloapp.io)'s a Reddit app that is an alternative to the official Reddit app, I built it from scratch with the goal of a more iOS centric design with faster navigation, gestures and a bunch more. You can find more at https://apolloapp.io and if there's any Alien Blue hold outs I think you'll really like it (I loved Alien Blue too).",
        "created_utc": 1533671710.0,
        "subreddit_name": "apple",
        "comments": 619
    }
]