[
    {
        "title": "10 interesting and useful ETFs with less than $1b AUM",
        "score": 4130,
        "url": "https://www.reddit.com/r/investing/comments/lcftzc/10_interesting_and_useful_etfs_with_less_than_1b/",
        "content": "I've been doing a lot of ETF research lately and wanted to share this list because I think that smaller ETFs fly under the radar all too often.  Here are 10 ETFs with less than a billion dollars under management, but that I think are interesting and possibly useful, with reasons why:\n\n1. THNQ: ROBO Global Artificial Intelligence ETF, [https://roboglobaletfs.com/thnq](https://roboglobaletfs.com/thnq) .  The process-based management of THNQ's holdings targets heavy exposure to companies leading development or execution with artificial intelligence and machine learning.  My only issue with it is that for some reason they don't include Facebook in its holdings (and FB is famous with PyTorch and related work).  Competitors in this thematic space include Global X's AIQ and iShares' IRBO.  A newer ETF, THNQ has performed very, very well since inception, easily beating many other growth ETFs.  Certainly a theme to watch for the coming decade.\n2. SFY: SoFi Select 500 ETF, [https://www.sofi.com/invest/etfs/sfy/](https://www.sofi.com/invest/etfs/sfy/) .  This ETF is... highly intriguing.  It has a 0.0% expense ratio, yes, free, waived until at least end of June 2021 (at which point it might go up to 0.19%).  They're waiving the fee to draw in AUM.  Its performance over the past trading year is +20%, so it beats the S&P 500 (easily).  What they do is take the top 500 US stocks by market cap, then weight them according to a set of equations based on net income and sales growth as per the methodology.  Not market-cap weighted, which is very unusual and thus nice to have as a tool in your toolkit.  The ETF ends up with more weighted overlap with the S&P 500 than other large-cap growth ETFs such as VUG, IWZ, JKE, etc., because the \"value\" companies are still in there -- they're just not weighted as highly as they are in SPY or VOO.  The usual suspects are still in the top 10: AAPL, AMZN, MSFT, TSLA, GOOGL, FB.   SQ comes in at #15, which I think is very nice, and SQ is missing from an S&P 500 ETF.  Granted, if the ER wasn't 0.0%, this ETF would be significantly less attractive.  Index methodology here: [https://www.solactive.com/wp-content/uploads/2019/03/Solactive-SoFi-US-500-Growth-Index-Guideline.pdf](https://www.solactive.com/wp-content/uploads/2019/03/Solactive-SoFi-US-500-Growth-Index-Guideline.pdf)\n3. DSTL: Distillate U.S. Fundamental Stability & Value ETF, [https://distillatefunds.com/dstl](https://distillatefunds.com/dstl) .  Its methodology is in the prospectus, [https://distillatefunds.com/dstl/prospectus](https://distillatefunds.com/dstl/prospectus) .  Essentially, they try to combine \"quality\" and \"value\" factor investing. The fund's weighted overlap with SPY is only 20% according to [etfrc.com](https://etfrc.com). So it's not simply the S&P. It's also not the first ETF to use free cash flow as a factor (see also: COWZ, TTAC, neither of which I really like). Its ER is only 0.39%, which is reasonably low for small-ish specialty ETFs. But how does it perform? Well, since inception over 2 years ago it has kept pace with or outperformed the S&P 500 and iShares' US quality and value factor ETFs every step of the way.  Gotta admit, I'm kinda impressed. Their top holdings right now are: JNJ, UNH, INTC, WMT, GOOGL, HD, PG, CSCO, AMGN, and AVGO. Surprisingly, compared to SPY, they're most underweight in financials. I would've thought they scored well on those cash flow metrics but maybe the banks score poorly on their debt metric and they don't compensate for banks having a different business model than, say, JNJ.  Really neat non-market-cap weighted ETF!\n4. SDG: iShares MSCI Global Impact ETF, [https://www.ishares.com/us/products/283378/ishares-msci-global-impact-etf-fund](https://www.ishares.com/us/products/283378/ishares-msci-global-impact-etf-fund) . This fund tracks an index that seeks to \"Obtain exposure to global stocks aiming to advance themes related to the United Nation’s Sustainable Development Goals, such as education or climate change.\"  ARK Investing may also be launching an ETF with this theme in the future (see: [https://www.youtube.com/watch?v=kfhgbZBWgBE&t=30m53s](https://www.youtube.com/watch?v=kfhgbZBWgBE&t=30m53s) ).  Methodology here: [https://www.msci.com/msci-acwi-sustainable-impact-index](https://www.msci.com/msci-acwi-sustainable-impact-index) .  It's nice to have a fund you can feel good about investing in.  It has also easily outperformed the S&P 500 over the past year!\n5. FRDM: Freedom 100 Emerging Markets ETF, [https://freedometfs.com/frdm/](https://freedometfs.com/frdm/) . It's a very new emerging markets ETF that is not market-cap weighted and filters countries based on human and economic freedom scores.  Top holdings include TSMC, Samsung, and CD Projekt Red.  If you're concerned about international tensions and based in North America, this could be something you'd like.  Also a rare way to get very high weight to tech outside China in an emerging markets ETF.  Very unusual and a neat tool to have in your emerging markets investing toolbox!\n6. EMXC: iShares MSCI Emerging Markets ex China ETF, [https://www.ishares.com/us/products/288504/ishares-msci-emerging-markets-ex-china-etf-fund](https://www.ishares.com/us/products/288504/ishares-msci-emerging-markets-ex-china-etf-fund) . Also an ex-China emerging markets fund, but otherwise it follows a broad MSCI mark-cap weighted index.  Very top-heavy in Korea, Taiwan, India, and Brazil.  It's another tool to stay in emerging markets but specifically tailor your China exposure through some other portfolio choice (or have none at all).  Like in FRDM, you get heavy exposure to TSMC and Samsung.\n7. IMTM: iShares MSCI Intl Momentum Factor ETF, [https://www.ishares.com/us/products/271538/ishares-msci-international-developed-momentum-factor-etf](https://www.ishares.com/us/products/271538/ishares-msci-international-developed-momentum-factor-etf) .  One of the few ways to get exposure to trending stocks in developed non-US markets.  Really heavy on tech and luxury.  If you're bored of holding EFA or VEA and want greater returns from non-US developed markets, check this out, it may be something you like.  High exposure to Shopify, Sony, Nintendo, LVMH.\n8. SWAN: AMPLIFY BLACKSWAN GROWTH & TREASURY CORE ETF, [https://amplifyetfs.com/swan.html](https://amplifyetfs.com/swan.html) .  Treasuries plus SPY LEAP options.  Its performance in 2020 was great -- saved you during the crash, and gets you most of the S&P 500 upside during \"normal\" times.  Kind of a barbell strategy; an interesting conservative ETF.  Probably of greater interest to people near or in retirement.  Amplify has a whole set of thematic ETFs, much like Global X.\n9. NTSX: WisdomTree 90/60 U.S. Balanced Fund, [https://www.wisdomtree.com/etfs/asset-allocation/ntsx](https://www.wisdomtree.com/etfs/asset-allocation/ntsx) .  Another fund that deals with both US large caps and treasuries.  But in this case, it uses treasury futures as leveraged exposure to get 90% equities, 60% treasuries total exposure.  Quite a clever package and designed for long-term holding with reduced volatility, while likely outperforming a 60/40 balanced fund.  There's a huge thread on bogleheads.org about it with a lot of people who like its design.\n10. IGBH: iShares Interest Rate Hedged Long-Term Corporate Bond ETF, [https://www.ishares.com/us/products/275397/ishares-interest-rate-hedged-10-year-credit-bond-etf](https://www.ishares.com/us/products/275397/ishares-interest-rate-hedged-10-year-credit-bond-etf) .  This is an interest-rate hedged long-term corporate bond ETF.  You see, when treasury yields rise, as is expected the next year or two, corporate bond yields also rise.  But that means the price of the bonds goes down -- bad for bond ETF values.  Hedging the rates allows you to still collect distributions and have lower volatility than equities, but avoid the interest-rate risk.  A whole lot of money has flowed into this and its sister ETF, LQDH, in the past 6 months because of historically low treasury yields.\n\nok, here's a bonus #11:\n\n11. PPA: Invesco Aerospace & Defense ETF, [https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Investor&ticker=PPA](https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Investor&ticker=PPA) .  This is a broad defense industry ETF, and may have some deep value right now as the industry has lagged for the past year.  But the world is still a dangerous place and if war breaks out these companies will benefit; a good ETF to have watchlisted.  US and allied defense spending keeps chugging along.  Also, many of these companies may be in Cathie Wood's ARKX. ITA is an alternative but lacks $HON, which is an important company in the sector.\n\nDisclaimer: this is not financial advice and I currently have no position in any of those ETFs at time of posting, but that may change at any point in the future.\n\nWhat do you guys think?  Any of those look like something you might invest in?  Anyone else want to comment on a personal favorite small/medium sized fund?\n\n&#x200B;\n\nedit, 6 hours after OP: wow, this post blew up!  I'm so happy many people are finding this discussion informative.  Thanks for the awards and comments.",
        "created_utc": 1612445969.0,
        "subreddit_name": "investing",
        "comments": 499
    }
]