[
    {
        "title": "This is what it looks like when you actually take money out. Protect your profits!",
        "score": 3118,
        "url": "https://i.redd.it/340tcumvjpyc1.jpeg",
        "content": "I take out $10,000 a month to keep me from doing me things… Being too greedy. \n\nI don’t fuck with 0dte. It’s too hard to thread the needle and outpace the theta drain. Right now, I am buying July at the money calls. I pretty much just play the big boys of Mag 7. I just made a killing with Apple and Amazon monthlies, took my $10k withdrawal for May, and now I’m sitting cash waiting for a bloody day to re-enter.\n\nI am a Permabull. The only time I went short is that the beginning of the pandemic. Stonks usually go up.\n\nI’m usually too optimistic and get into early but if your calls still have a couple months until expiration, there is time to recover. \n\nI keep my account close to balanced, 50% shares and 50% calls. That way if there’s a disaster, you’ll still have your shares. I use the margin off the shares to play options.\n\nNow that I’ve taken out $150,000 and spent it on building a bad ass guest house on my ranch there’s no way I could ever end up in the hole. The trick is finding a way to protect yourself from your own greed. It’s easy to make your account go up but most of us stay in too long and get wiped out.  If you move money into a hard asset you can’t go tits up. I learned the hard way.  Got wiped out a few times and recovered.  But now that I stick to the plan it’s been a solid extra 6 figure income for me.\n\nMy main money is in my Fidelity retirement account and RH is my play account where I do riskier plays.  \n\nI’ve been on WSB for over 5 years.  Gained a lot of insight into sentiment so I thank you all for that.  I made this post to thank you guys and share my method for protect myself from my greed.  We’re all greedy as fuck but if you move some chips off the table after a big win you’ll be just fine.\n\nIf you want to see more about my method you can see my earlier posts about printing stoned tendies.  Good luck to us all!\n\nhttps://www.reddit.com/r/wallstreetbets/s/7w1DUkISA4\n\nhttps://www.reddit.com/r/wallstreetbets/s/1IMHzQsZqK",
        "created_utc": 1714958422.0,
        "subreddit_name": "wallstreetbets",
        "comments": 455
    }
]