[
    {
        "title": "A buy and hold approach for 24 years",
        "score": 1691,
        "url": "https://www.reddit.com/r/investing/comments/c5vo2c/a_buy_and_hold_approach_for_24_years/",
        "content": "As a conservative growth dividend growth investor, I wanted to do a short study on what buying and holding 25 well known blue chips would have done for an investor over the course of approximately 24 years. We’re making the following assumptions.\n\n* The Investor is not an expert, but has a basic understanding of how to evaluate a stock.\n* They invested $1000 into each of the 25 companies in their portfolio.\n* They refused to sell any of their holdings. Even when the tech bubble burst and during the housing crisis.\n* We will stick to American blue chips that have been around for at least 15-20 years and pay a dividend. This excludes tech stocks from our portfolio. (You can try replacing one of the companies with IBM if you’d like.)\n* Emphasis will be on companies that the investor has experience dealing with in their day to day lives. So the portfolio will be skewed towards consumer staples and retail a bit.\n* All dividends have been reinvested as soon as they were paid out.\n* Any special dividends and spinoffs were sold and the cash proceeds were reinvested into the parent company.\n* We’ll include 3 famous former blue chips that have gone bankrupt. Any spinoffs and dividends were reinvested into the company that went bankrupt. Feel free to include a company of your choice (Sears, Toys R Us, Eastman Kodak etc).\n* For simplicity’s sake, I haven’t included companies that got acquired or taken private.\n\nI’ll be using this calculator [https://www.dividendchannel.com/drip-returns-calculator/](https://www.dividendchannel.com/drip-returns-calculator/) with a starting date of Aug 1 1995 (as far back as the calculator goes) to the present day. Please feel free to point out any inaccuracies.\n\n&#x200B;\n\n&#x200B;\n\n|**Company**|**CAGR %**|**Present Value $**|\n|:-|:-|:-|\n|3M|10.67|11,297|\n|AT&T|2.92|1,900|\n|Bankrupt Company 1|N/A|0|\n|Bankrupt Company 2|N/A|0|\n|Bankrupt Company 3|N/A|0|\n|Brown Forman|16.03|35,010|\n|Church and Dwight|18.63|59,479|\n|Coca Cola|7.37|5,477|\n|Colgate|11.49|13,478|\n|Kroger|8.31|6,746|\n|Exxon Mobil|9.18|8,169|\n|General Electric|3.15|2,099|\n|General Mills|9.26|8,313|\n|Hershey|12.31|16,060|\n|Home Depot|15.47|31,185|\n|Hormel|13.51|20,708|\n|Johnson and Johnson|11.71|14,129|\n|McCormick|13.87|22,337|\n|McDonalds|12.75|17,634|\n|Pepsi|10.37|10,587|\n|Pfizer|10.27|10,360|\n|Philip Morris|15.22|29,610|\n|Procter & Gamble|10.83|11,600|\n|Walmart|11.14|12,500|\n|Wells Fargo|11.14|12,500|\n\n&#x200B;\n\nSPY has a CAGR of **8.97%**  (with dividend reinvestment) over the last 24 years. A $25,000 in SPY on 08/01/1995 would be worth **$196,475** today.\n\nOur portfolio of 25 stocks has a CAGR of **11.77%** and a present value of **$361,178**.\n\nPicking our 6 biggest winners and assuming the other 19 go bankrupt would be in line with market performance with a present value of **$198,329**.\n\n&#x200B;\n\nSome thoughts for those who would like to build a similar portfolio\n\nLook for companies that\n\n* Have a business model that you understand properly.\n* Consistently generate excess returns on invested capital compared to the market as a whole.\n* Companies that maintain a clean balance sheet. Metrics to look at would be NetDebt/EBITDA, Debt/Equity and Interest Coverage ratio.\n* Many boring consumer staples have historically outperformed the market because they grow earnings reliably and tend not to be overpriced in general.\n\nBuy said companies when\n\n* They are trading at a discount compared to historic levels. Metrics to look at would be EV/EBITDA, dividend yield, FCF yield.\n* However, avoid buying companies that have heavily compromised their balance sheet. If the free cash flow barely covers the dividend, stay away. If the interest coverage ratio is in the low single digits, stay away.\n* Avoid buying overpriced stocks. Even the best companies will offer subpar returns when you overpay. KO has slightly underperformed the market because it was trading at a PE in the 50s during its peak in the late 90s.\n\nYou can get all this information from Morningstar or Value Line that most public libraries provide free access to. Or you can calculate it from the sec filings [https://www.sec.gov/](https://www.sec.gov/).\n\nKeeping this in mind will keep you from panic selling when the market sees a downturn. In fact, it’ll even help you buy excellent companies at a nice discount. **This isn't a guarantee to outperform the market, but it's a fairly straightforward approach that increases your odds of doing so**.\n\n&#x200B;\n\nEDIT: To people who feel like it's easy to pick a winning portfolio in hindsight are missing the point. I'm trying to show you can build a winning portfolio from large cap blue chips without taking on unnecessary risks. The worst a company can do is go to zero. At best, the sky is the limit. You can try replacing the big winners (MO, BF.A, CHD) with a few more bankruptcies or try other names such as TGT, CPB, CLX etc and see how the portfolio performs. You probably won't be able to repeat Lynch or Buffet's performances, but a couple of hundred basis points is realistic in the long run.\n\nFor people asking why I chose the stocks I did, a professor from Wharton picked the top companies from the late 50s to see what types of companies provided the best returns. Over the past 50 years, consumer staples were some of the best performers because\n\n1. They are generally not very capital intensive.\n2. Their earnings are the least cyclical\n3. Consumer staples generally trade at a lower valuations because they have lower earnings growth. This often translates to lower price to earnings growth ratios. MO and PM are two such stocks that fit that criteria today. GIS below $45 a share would also fall into that category.\n\n[https://www.amazon.com/Future-Investors-Tried-True-Triumph/dp/140008198X](https://www.amazon.com/Future-Investors-Tried-True-Triumph/dp/140008198X)\n\n&#x200B;\n\nu/MasterCookSwag posted a comment listing the dow components in 1997 (which includes a bunch of the stocks I've listed). I believe just using the dow components from '97 would've been a better portfolio for this case study.\n\n&#x200B;\n\nAlso, some additional links you might find useful\n\nJoshua Kennon has some awesome articles on investing [https://www.joshuakennon.com/category/investing-articles/](https://www.joshuakennon.com/category/investing-articles/)\n\nEddie Elfenbein's blog [http://www.crossingwallstreet.com/buylist](http://www.crossingwallstreet.com/buylist)\n\n[https://www.youtube.com/watch?v=DFhfVUjk1dE&t=1628s](https://www.youtube.com/watch?v=DFhfVUjk1dE&t=1628s)\n\nu/Fearspect posted a comment that provides other examples of long term buy and hold portfolios.\n\n[https://www.reddit.com/r/investing/comments/c5vo2c/a\\_buy\\_and\\_hold\\_approach\\_for\\_24\\_years/es71c13?utm\\_source=share&utm\\_medium=web2x](https://www.reddit.com/r/investing/comments/c5vo2c/a_buy_and_hold_approach_for_24_years/es71c13?utm_source=share&utm_medium=web2x)\n\nThanks for the gold!\n\n&#x200B;\n\n**TLDR**: Stick with VTSAX.",
        "created_utc": 1561582161.0,
        "subreddit_name": "investing",
        "comments": 297
    }
]