[
    {
        "title": "You know you're doing something you love when you look forward to Monday mornings",
        "score": 291,
        "url": "https://www.reddit.com/r/Daytrading/comments/hlfdl3/you_know_youre_doing_something_you_love_when_you/",
        "content": "I've been day trading the US equities market since \\~early 2017. You want an education in day trading? Put in the god damn screen time and trade. If you're new, go small size. How does your stock move and react to support and resistance? What does the tape do at these levels? Is the stock having an easier time going up or down? What's the MM agenda here? Who's trapped, longs or shorts? \n\nIf you're not a micro-scalper like me then some of these questions might not be too important (aka tape reading). But if you want to profit off short-term volatility at the market open, please don't be trading off your phone on RH and get a real trading platform like DAS Pro, Lightspeed or Sterling. Something that has a real live Level 2. Then download screen recording software like OBS and record your own trading sessions. Review these sessions every night so you can see how you trade and how the Level 2 and tape moves on certain stocks. You will get better at this. It's hard but in my opinion it's the best god damn \"job\" in the world. Why? Because three years later of doing this every day and I still look forward to waking up on Mondays and I sure as hell didn't at my day job. \n\nIf you're in the market with a lottery mindset, where you just want to make a million dollars in a short time frame and then never touch the stock market again, I'm sorry but day trading isn't for you and you're probably not gonna make it. When you have that mindset, you don't manage risk properly and size into the wrong trades too much. Always live to trade another day. Don't get me wrong, you have to lose some money to learn, pain is a great teacher, but I don't trade because I think I'm going to be a millionaire next month or even next year. I'm in this for the long haul, slow and steady wins the race and I'm fine with base hits. Consistent $200 - $500 days still beats the pathetic thing they called a salary back at my day job. \n\nLong weekends are the worst, but at least they give you some time to study up. Trade well this upcoming week traders!",
        "created_utc": 1593916773.0,
        "subreddit_name": "Daytrading",
        "comments": 89
    }
]