[
    {
        "title": "What 'Under The Radar' Stock Have You Been Buying?",
        "score": 3172,
        "url": "https://www.reddit.com/r/stocks/comments/mts4ne/what_under_the_radar_stock_have_you_been_buying/",
        "content": "What's a stock you own that has real upside potential?\n\nEveryone knows about Apple, Amazon, Facebook, etc....\n\nBut, what is that stock you own that little to know one else knows about? Give a brief explanation why you're bullish.....",
        "created_utc": 1618802906.0,
        "subreddit_name": "stocks",
        "comments": 2166
    },
    {
        "title": "Day trading with $350: Week 1",
        "score": 1088,
        "url": "https://www.reddit.com/r/Daytrading/comments/mu1wck/day_trading_with_350_week_1/",
        "content": "Good morning beautiful traders! I'm a high school kid who's been day trading for a few months now, making about $5 a day. Like many newbie in this subreddit, i've always needed something more than a daily watchlist from seasoned traders.\n\nTwo weeks ago, i came across a post here from a new trading requesting seasoned traders to post their entries and exits along with their daily watchlist. \n\nWell, i'm very much learning too, but i thought i'd share my journey of trading with a brand new account at $350 (this should be relatable to many new traders like me). My goal here is to steadily grow the account $5 a day consistently before scaling up. \n\nIf you are new with some TA knowledge and a small account, join me in this learning process! \n\n**Scanning and stock picking**\n\nThe account is small, this limits me to trading mostly penny stocks. My scanner are as follows:\n\n1) Price between $2 and $10. I keep a very small price range so that when i trade, i do not need to worry about adjusting share sizes. I find that stocks in this range tend to have very profitable daily ranges when it's closing on support/resistance, which is advantageous for growing small accounts\n\n2) Pre-market volume more than 50k, 10-day average volume more 750k shares. This is to weed out low volatility stocks. \n\n3) 50-day SMA between $1-$20. This is to weed out hype stocks that goes from single digit to $30++ and crashing back down. Stocks like that are harder to perform TA since key levels are usually muddy.\n\nThat's it! \n\nAt 9:00 am daily, i will use this scanner once. If there are too many stocks (more then 35), i will increase the pre-market volume filter. If there too little, i decrease it. The goal here is to have around 15 stocks in the scanner.\n\n*I only trade key levels*. as i look through the tickers, i ask myself:\n\n1) is this stock approaching some sort of support zone?\n\n2) has this stock been consolidating for the last few days with potential breakout?\n\n3) is this stock breaking the current market structure? \n\nif the answer is yes, i load the chart up \n\ni will first take a look at the greatest dollar-gainer and dollar-loser stock, then sieve through the rest. At the end, i will have around 6-8 charts ready for market open. \n\n\n**Trading plan and rules**\n\nSince i only trade key-levels, i use chart patterns as confirmation. i do not use any indicators other than volume.\n\n1) Enter a trade only when it hits your target price. *Stay out* of a trade if it doesn't, even if the chart pattern suggest bullish movement.\n\n2) Exit a trade with a 2-1 risk-reward ratio. If the stock seems to consolidate for 4-5 minutes, exit immediately. From my experience, penny stocks are quicker to dip than rally. It is a risk i am not willing to take for small account\n\n3) Stay out of trades when the charts have long tailed-candles. Buyers and sellers are still wresting for the upper. It's not worth the risk for small accounts. \n\n4) As a \"standard\", i risk $5 for $10 reward, giving a 2-1 RR ratio. Share sizes ranges from 25-50 shares depending on the price movement.\n\n\n**Monday, 19 April**\n\nToday, i have around 7 tickets after scanning and drawing key levels. As expected, every stocks opened with a red candle. The penny stock market has been in a general down trend for the last few weeks. The key here is fast-in, fast-out. Cut the losers loose fast. \n\nAt 9:31 am, BNGO puts in a red candle that is quickly approaching previous day low at $5.38. Looking at level 2 data, i saw how the price drop suddenly holds at around $5.40. I immediately place a limit order at $5.42 and was filled 50 shares. \n\nMy stop-loss was set at $5.37. The stop-loss was extremely tight because looking at the daily chart, many previous key levels failed to hold. I think that if last friday's low didn't hold, BNGO is get to dip even further. I want out before that.\n\nAt 9:41 am after some wresting and some scary swing, BNGO reached $5.65 (which was already higher than the target of $5.63). I sold have a cool **profit of $11** after commission.\n\n**I have hit my daily profit target, i closed IBKR and i walked away**\n\nFrom my past and disastrous experience of revenge trading, i vow to never, ever get too greedy of revenge trade when i started this new account. $11 is well above by $5 target, i walk away.\n\n----\n\nThat is it for Monday! 11 minutes for 11 dollars.\n\n$350 to $361.\n\nHappy trading!\n\nEDIT: I typed this on my phone so please excuse any auto-correct/formatting issues",
        "created_utc": 1618842782.0,
        "subreddit_name": "Daytrading",
        "comments": 208
    }
]