[
    {
        "title": "What’s a stock you’ve vowed to never touch?",
        "score": 3602,
        "url": "https://www.reddit.com/r/stocks/comments/u59mqo/whats_a_stock_youve_vowed_to_never_touch/",
        "content": "For me it’s Tesla. They were a disruptor in the automotive industry but their QC is getting quite poor and dare I say it, other brands are starting to make superior products. I definitely don’t see their reign lasting forever.\n\n\nEdit: This has been super interesting now that it’s gained a lot of traction so I wanted to clarify a few things about my stance on Tesla.\n\nYes I know Tesla leads the market in self driving, but they may not forever. No single tech company dominates the market for forever, so who knows how long their run might last, could easily go on another decade or two but I sure wont bet on it. I do think they have two huge strengths, however. 1) The ability to keep up with demand better than almost any other automaker and mass produce electric vehicles 2) Brand loyalty, almost like Apple in a sense. With all that being said, their P/E is absurd and I feel like one day the stock may be exposed for what it is. Does that mean I’m willing to short it? Not at all, I’ll just never directly buy any. \n\nSome of these answers have been amazing, and made me realize I’d buy Tesla way before a few other companies. Not sure why it came to mind before HOOD, TWTR, WISH but I wouldn’t touch any of those with a ten foot pole.",
        "created_utc": 1650150397.0,
        "subreddit_name": "stocks",
        "comments": 1975
    },
    {
        "title": "Mark Cuban says Elon Musk is 'f--king with the SEC,' thinks Twitter will 'do everything possible not to sell'",
        "score": 2079,
        "url": "https://www.reddit.com/r/stocks/comments/u4s7hl/mark_cuban_says_elon_musk_is_fking_with_the_sec/",
        "content": " \n\nFROM ARTICLE \n\n[Musk offered to buy Twitter for about $43 billion on Thursday](https://www.foxbusiness.com/economy/mark-cuban-says-musk-is-f-with-the-sec-thinks-twitter-will-do-everything-possible-not-to-sell?cmpid=fb_fbn)  \n  \n\nDallas Mavericks owner Mark Cuban chimed in on Elon Musk's attempt to purchase Twitter for $43 billion, saying that he thinks the Tesla CEO is \"f------ with the SEC\" and that Twitter will do everything in their power not to sell. \n\nMusk, a popular user on the site with more than 81 million followers, announced the offer on Thursday morning to buy all outstanding shares for $54.20 each. \n\n\"I believe free speech is a societal imperative for a functioning democracy,\" Musk said in a Securities and Exchange Commission fling. \"I now realize the company will neither thrive nor serve this societal imperative in its current form. Twitter needs to be transformed as a private company.\"  \n  \n\nThe offer per share, $54.20, is reminiscent of Musk's infamous 2018 tweet in which he said he had the money to take Tesla private at $420 per share, which caused Tesla's stock to jump but never materialized. \n\nMusk frequently cracks \"420\" jokes, as the number is slang for marijuana. \n\nTesla and Musk settled with the SEC for $40 million in civil fines after he said he had the money to take Tesla private. \n\n\"His filing w/the SEC allows him to say he wants to take a company private for $54.20. Vs his ‘Am considering taking Tesla private at $420. Funding secured.’ Price go up. His shares get sold. Profit,\" Cuban tweeted. \"SEC like WTF just happened.\" \n\n \n\nCuban also said he thinks \"every major tech company… is on the phone with their anti trust lawyers asking if they can buy Twitter and get it approved.\" \n\n\"And Twitter is on the phone with their lawyers asking which can be their white knight,\" Cuban tweeted. \"Gonna be interesting.\"\n\n Musk's offer to buy Twitter came 10 days after he announced that he had been buying shares of Twitter since Jan. 31, netting him about a 9% stake in the company.  \n\n \n\nOn Sunday evening, Twitter CEO Parag Agrawal sent a message to all employees notifying them that Musk declined to join the company's board. \n\n \n\nIn the weeks before he announced his 9% stake, Musk criticized Twitter for its moderation policies, saying that \"failing to adhere to free speech principles fundamentally undermines democracy.\" \n\nTwitter has been criticized in recent years for banning high-profile figures, such as former President Donald Trump, Republican Georgia Congresswoman Marjorie Taylor Greene, and former White House chief strategist Steve Bannon. \n\n \n\nMusk said Thursday that it would \"be utterly indefensible not to put this offer to a shareholder vote.\"\n\n\"If the current Twitter board takes actions contrary to shareholder interests, they would be breaching their fiduciary duty,\" Musk tweeted. ",
        "created_utc": 1650092594.0,
        "subreddit_name": "stocks",
        "comments": 361
    },
    {
        "title": "Apple workers at flagship store in NYC take steps to unionize",
        "score": 4792,
        "url": "https://www.axios.com/apple-workers-grand-central-terminal-store-union-8c412000-50e2-4ab9-afcb-85c35c43066c.html",
        "content": "",
        "created_utc": 1650145922.0,
        "subreddit_name": "apple",
        "comments": 532
    }
]