[
    {
        "title": "TSMC beats first-quarter revenue and profit expectations on strong AI chip demand ",
        "score": 400,
        "url": "https://www.reddit.com/r/stocks/comments/1c70ktj/tsmc_beats_firstquarter_revenue_and_profit/",
        "content": "Taiwan Semiconductor Manufacturing Company on Thursday beat revenue and profit expectations in the first quarter, thanks to continued strong demand for advanced chips, particularly those used in AI applications.\n\nHere are TSMC’s first-quarter results versus LSEG consensus estimates:\n\nNet revenue: 592.64 billion New Taiwan dollars ($18.87 billion), vs. NT$582.94 billion expected\n\nNet income: NT$225.49 billion, vs. NT$213.59 billion expected\n\nTSMC reported net revenue rose 16.5% from a year ago to NT$592.64 billion, while net income increased 8.9% from a year ago to NT$225.49 billion. The firm guided first-quarter revenue to be between $18 billion and $18.8 billion.\n\nTSMC is the world’s largest producer of advanced processors and counts companies such as Nvidia and Apple as its clients.\n\n“For the second quarter of 2024, we expect our business to be supported by strong demand for industry-leading 3-nanometer and 5-nanometer technologies, partially offset by a continued smartphone seasonality,” CFO Wendell Huang said during the firm’s earnings call Thursday.\n\nCEO C.C. Wei said TSMC expects 2024 to be a “healthy” growth year, supported by “our technology leadership and broader customer base.”\n\n“Almost all the AI innovators are working with TSMC to address an insatiable AI-related demand for energy efficient computing power,” said Wei, adding that the firm estimates revenue contribution from server AI processors to “more than double this year.”\n\nTSMC expects second-quarter revenue to be between $19.6 billion and $20.4 billion.\n\nTSMC currently produces 3-nanometer chips and plans to commence mass production of 2-nanometer chips in 2025. Typically, a smaller nanometer size yields more powerful and efficient chips. \n\nStrong demand for AI chips led by the proliferation of large language models such as ChatGPT and Chinese clones has caused TSMC’s shares to surge 56% in the past one year.\n\n“TSMC is well-positioned for strong performance based on key industry trends. The continued demand for advanced chips, particularly those used in AI applications, is a positive sign for both the short and long term. The focus on advanced chip development, like the shift towards 3nm technology, is another factor driving long-term growth for TSMC,” Brady Wang, associate director at Counterpoint Research, said on Monday ahead of the results.\n\nTSMC accounted for 61% of global foundry revenue in the fourth quarter, according to Counterpoint Research data. Samsung Foundry came in second with 14% of the market.\n\n“TSMC’s net profit margin continues to be one of the highest in the company’s history at 40%, against an industry average of 14%, demonstrating TSMC’s strong competitive position. The high margin is the result of an increased share of sales of 7nm and smaller chips, which have significantly higher margins,” Grzegorz Drozdz, market analyst at Conotoxia, said last week.\n\nLast year, TSMC’s business was impacted by macroeconomic headwinds and inventory adjustment. Smartphone and PC makers stockpiled chips during the pandemic, leading to surplus inventories as Covid-era demand waned.\n\nEarlier this month, Taiwan was hit by an earthquake – its strongest one in 25 years. A TSMC spokesperson said its construction sites were normal upon initial inspection, though workers from some fabs were briefly evacuated. Those workers subsequently returned to their workplaces.\n\n“There were no power shortages, no structural damage to our fabs and there is no damage to our critical tools, including all of our extreme ultraviolet lithography tools,” CFO Huang told investors and analysts on Thursday.\n\nEUV machines are critical in the production of the most advanced processors.\n\nHowever, some wafers were affected and “had to be scrapped,” said Huang, adding that the firm expects most of the lost production to be recovered in second quarter, with “minimal impact” to revenue.\n\nThe U.S. also recently granted TSMC’s Arizona subsidiary preliminary approval for government funding worth up to $6.6 billion to build the world’s most advanced semiconductors. TSMC is also eligible for about $5 billion in proposed loans.\n\nSource: https://www.cnbc.com/2024/04/18/tsmc-q1-2024-earnings-on-strong-ai-chip-demand.html",
        "created_utc": 1713438380.0,
        "subreddit_name": "stocks",
        "comments": 47
    }
]