[
    {
        "title": "Warren Buffett's Berkshire Hathaway cut Apple investment by about 13%",
        "score": 1178,
        "url": "https://www.reddit.com/r/stocks/comments/1cjze2n/warren_buffetts_berkshire_hathaway_cut_apple/",
        "content": "Warren Buffett’s Berkshire Hathaway cut its gigantic Apple stake in the first quarter as the “Oracle of Omaha” continued to downsize his one-time favorite bet.\n\nIn its first-quarter earnings report, Berkshire Hathaway reported that its Apple bet was worth $135.4 billion, implying around 790 million shares. That would mark a decline of around 13% in the stake. Apple was still Berkshire’s biggest holding by far at the end of the quarter.\n\nThis is the second quarter in a row that the Omaha-based conglomerate has trimmed the stake in the iPhone maker. It sold about 10 million Apple shares (just 1% of its massive stake) in the fourth quarter. This filing, when accounting for the change in Apple’s stock price, would imply Berkshire sold about 116 million shares.\n\nThe Oracle of Omaha became a big fan of Apple after one of his investing managers Ted Weschler or Todd Combs convinced him to buy the stock. Buffett even called the tech giant his second-most important business after Berkshire’s cluster of insurers.\n\nMany has speculated that the 93-year-old investing icon reduced his favorite stake due to valuation concerns. Apple’s stock gained a whopping 48% in 2023 as megacap tech shares led the market rally. At its peak, Apple ballooned in Berkshire’s equity portfolio, taking up 50% of it. The shares are trading at more than 27 times forward earnings.\n\nShares of the iPhone maker got a big boost in the past week after the firm announced that its board had authorized $110 billion in share repurchases, the largest in company history. However, Apple posted a decline in overall sales and in iPhone sales. The shares are down more than 4% so far this year amid concerns about how it will revive growth.\n\nIt’s not without precedent that the Berkshire CEO would adjust the Apple bet. He sold a bit of the stock in the fourth quarter of 2020, but Buffett admitted then that it was “probably a mistake.” Also it’s not usual for Buffett to trim a position that has grown so large.\n\nEven with the sale, Berkshire is still Apple’s largest shareholder outside of exchange-traded fund providers.\n\nSource: https://www.cnbc.com/2024/05/04/warren-buffetts-berkshire-hathaway-cut-apple-investment-by-about-13percent-in-the-first-quarter.html",
        "created_utc": 1714826348.0,
        "subreddit_name": "stocks",
        "comments": 241
    },
    {
        "title": "Money grows on trees",
        "score": 3009,
        "url": "https://i.redd.it/f4eozb2c1byc1.jpeg",
        "content": "Long time looser but having incredible month. Had 200 QQQ ITM calls and 50 ITM apple calls that I closed out today. Gonna take break and enjoy the rewards unless opportunity arises. Good luck degenerates ",
        "created_utc": 1714782689.0,
        "subreddit_name": "wallstreetbets",
        "comments": 486
    }
]