[
    {
        "title": "Britain blocks Microsoft’s $69 billion acquisition of Activision Blizzard",
        "score": 3185,
        "url": "https://www.reddit.com/r/stocks/comments/12zeetm/britain_blocks_microsofts_69_billion_acquisition/",
        "content": "LONDON — Britain’s top competition regulator on Wednesday moved to block[ Microsoft](https://www.cnbc.com/quotes/MSFT/)’s acquisition of video game publisher [Activision Blizzard](https://www.cnbc.com/quotes/ATVI/).\n\nThe  measure marks a major blow for the U.S. tech giant, as it seeks to  convince authorities that the deal will benefit competition.\n\nMicrosoft said it plans to appeal the decision.\n\nThe  U.K. Competition and Markets Authority said that it opposed the deal as  it raises competition concerns in the nascent cloud gaming market.\n\nMicrosoft  could make Activision’s games exclusive to its cloud gaming platform,  Xbox Game Pass, cuting off distribution to other key players in the  space, the CMA said.\n\nCloud gaming is a technology that enables  gamers to access games via companies’ remote servers — effectively  streaming a game like you would a movie on Netflix. The technology is  still in its infancy, but Microsoft is betting big on it becoming a  mainstream way of playing games.\n\nMicrosoft announced its intention to acquire Activision Blizzard in January 2022 for $69 billion, in [one of the biggest deals the video game industry has seen](https://www.cnbc.com/2022/01/18/microsoft-to-buy-activision.html) to date.\n\nExecutives  at the Redmond, Washington-based technology giant believe the  acquisition will boost its efforts in gaming by adding lucrative  franchises like Call of Duty and Candy Crush Saga to its content  offerings.\n\nHowever, some of Microsoft’s competitors contested the  deal, concerned it may give Microsoft a tight grip on the $200 billion  games market. Of particular concern was the prospect that Microsoft [may shut off distribution access to Activision’s popular Call of Duty franchise](https://www.forbes.com/sites/paultassi/2022/09/16/microsoft-is-growing-tired-of-sonys-call-of-duty-complaints/?sh=bd568595ebb9) for certain platforms.\n\n[Sony](https://www.cnbc.com/quotes/6758.T-JP/), in particular, has voiced concern with Microsoft’s Activision purchase.  The Japanese gaming giant fears that Microsoft could make Call of Duty  exclusive to its Xbox consoles in the long run. \n\n Microsoft sought to allay those concerns by offering Sony, [Nintendo](https://www.cnbc.com/quotes/7974.T-JP/), [Nvidia](https://www.cnbc.com/quotes/NVDA/)\n\nand other firms [10-year agreements](https://www.cnbc.com/2022/12/07/microsoft-says-it-will-bring-call-of-duty-to-nintendo-for-10-years.html) to continue bringing Call of Duty to their respective gaming platforms.\n\nMicrosoft  argues it wouldn’t be financially beneficial to withhold Call of Duty  from PlayStation, Nintendo and other rivals given the licensing income  it generates from keeping the game available on their platforms.\n\nMicrosoft  President Brad Smith told CNBC last month that the company is offering  Sony the same agreement as it did Nintendo — to make Call of Duty  available on PlayStation at the same time as on Xbox, with the same  features. Sony still opposes the deal.\n\nThe CMA had raised concerns  with the potential for Microsoft to hinder competition in the nascent  cloud gaming market via its Xbox Game Pass subscription service, which  offers cloud gaming among its perks. Microsoft has committed to bring  new Call of Duty titles to Xbox Game Pass on day one of its release.\n\nCloud  gaming, or the ability to access games via PC or mobile devices over  the internet, is still in its infancy and requires a strong broadband  connection to work well. According to network intelligence firm  Sandvine, cloud gaming made up less than 1% of global internet traffic  in 2022.\n\nEven with the CMA’s blessing, Microsoft will still need to convince other regulators not to block the deal. The EU [continues to probe the merger](https://www.cnbc.com/2023/02/21/microsoft-will-bring-xbox-games-to-nvidias-cloud-gaming-service.html) to assess whether it hurts competition, while the U.S. Federal Trade Commission [sued to block the deal](https://www.cnbc.com/2022/12/08/ftc-sues-to-block-microsofts-acquisition-of-game-giant-activision-blizzard.html) on antitrust grounds. Microsoft sought to allay those concerns by offering Sony, [Nintendo](https://www.cnbc.com/quotes/7974.T-JP/), [Nvidia](https://www.cnbc.com/quotes/NVDA/)\n\nand other firms [10-year agreements](https://www.cnbc.com/2022/12/07/microsoft-says-it-will-bring-call-of-duty-to-nintendo-for-10-years.html) to continue bringing Call of Duty to their respective gaming platforms.\n\nMicrosoft  argues it wouldn’t be financially beneficial to withhold Call of Duty  from PlayStation, Nintendo and other rivals given the licensing income  it generates from keeping the game available on their platforms.\n\nMicrosoft  President Brad Smith told CNBC last month that the company is offering  Sony the same agreement as it did Nintendo — to make Call of Duty  available on PlayStation at the same time as on Xbox, with the same  features. Sony still opposes the deal.\n\nThe CMA had raised concerns  with the potential for Microsoft to hinder competition in the nascent  cloud gaming market via its Xbox Game Pass subscription service, which  offers cloud gaming among its perks. Microsoft has committed to bring  new Call of Duty titles to Xbox Game Pass on day one of its release.\n\nCloud  gaming, or the ability to access games via PC or mobile devices over  the internet, is still in its infancy and requires a strong broadband  connection to work well. According to network intelligence firm  Sandvine, cloud gaming made up less than 1% of global internet traffic  in 2022.\n\nEven with the CMA’s blessing, Microsoft will still need to convince other regulators not to block the deal. The EU [continues to probe the merger](https://www.cnbc.com/2023/02/21/microsoft-will-bring-xbox-games-to-nvidias-cloud-gaming-service.html) to assess whether it hurts competition, while the U.S. Federal Trade Commission [sued to block the deal](https://www.cnbc.com/2022/12/08/ftc-sues-to-block-microsofts-acquisition-of-game-giant-activision-blizzard.html) on antitrust grounds.",
        "created_utc": 1682508059.0,
        "subreddit_name": "stocks",
        "comments": 594
    },
    {
        "title": "Some worrying signs for Apple...",
        "score": 0,
        "url": "https://www.reddit.com/r/AAPL/comments/12zm819/some_worrying_signs_for_apple/",
        "content": "I've done some research into Apple and I think it's going to have some troubles going forward.  It looks to me that it's basically had a massive covid boost which has affected it's iPhone and Macbook sales.  This has allowed it to have large margins over the last couple of years due to economies of scale.  However this boost is already slowing down quarter on quarter and has a much further to go back before it normalises.  It's also going to normalise into a slowing market smartphone market.\n\nIf you want to see a video about it then check out this: [https://youtu.be/J4aBm\\_4t7PA](https://youtu.be/J4aBm_4t7PA)\n\nOr go through the points directly with links to resources at: [https://tickertaco.com/tt/ticker/AAPL/points?roomId=16](https://tickertaco.com/tt/ticker/AAPL/points?roomId=16)",
        "created_utc": 1682524067.0,
        "subreddit_name": "AAPL",
        "comments": 19
    }
]