[
    {
        "title": "After the Bell: Nvidia clobbers earnings expectations as AI demand hits ‘tipping point’; stock up 6%",
        "score": 953,
        "url": "https://www.reddit.com/r/investing/comments/1awpej3/after_the_bell_nvidia_clobbers_earnings/",
        "content": "I haven’t seen this posted yet. So excuse me if it becomes a duplicate. But I figured this would be of interest to people because Nvidia has been the poster child for whether or not this is an AI bubble.\n\nI think everyone was taking wait-and-see on their earnings. And the naysayers would be able to point to missed expectations as a sign that this is a bubble. \n\nFrom MarketWatch :\n\nhttps://www.marketwatch.com/story/nvidias-stock-heads-for-biggest-drop-in-over-a-year-and-biggest-market-cap-loss-ever-6c617e9c?mod=djem_mwnafterbell\n\n> Revenue came in at $22.1 billion, up from $6.05 billion a year before, while analysts had been modeling $20.4 billion.\n\n> Data-center revenue at Nvidia NVDA rocketed more than 400% from a year before to hit $18.4 billion, while the FactSet consensus was for $17.06 billion.\n\n> Nvidia forecasts continued strong growth for the ongoing quarter, well above expectations. The company is calling for $24.0 billion in revenue, up from $7.2 billion a year prior, while analysts were modeling $22.2 billion.\n\n> Accelerated computing and generative AI have hit the tipping point,” Chief Executive Jensen Huang said in a release. “Demand is surging worldwide across companies, industries and nations.”\n\n> Nvidia posted fiscal fourth-quarter net income of $12.3 billion, or $4.93 a share, compared with $1.4 billion, or 57 cents a share, in the year-earlier period. On an adjusted basis, the company earned $5.16 a share, while analysts were projecting $4.59 a share.\n\nI own Nvidia, so I admit, I am biased. But I think anyway you slice those numbers, they’re pretty damn impressive. If it’s a bubble, it’s a bubble that people are buying into. And by people, I mean, giant, multinational companies. It’s amazing growth for a company so large. \n\nI’m hoping this brings some calm back to the markets. We’ve been pivoting between irrational exuberance and panic.\n\n**EDIT**: it is the next day, and the results are in. My personal account earned 27.9% TODAY. That is from 2 NVDA options and 1 SMCI option. My larger retirement account made 11.2% today based on NVDA stock SMCI stock NVDA option and lots of ETFs. Probably no one will see this edit. But as a normal investor, the reason I’m in this space is because of these returns. The reason a lot of people are here are because of these returns. And you can choose to ignore them if they are outside your risk and comfort level. That makes perfect sense. But there are compelling reasons to be here as well.",
        "created_utc": 1708554344.0,
        "subreddit_name": "investing",
        "comments": 357
    }
]