[
    {
        "title": "Why I'm selling GME",
        "score": 47163,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m1cqod/why_im_selling_gme/",
        "content": "Because looking at the price action, it's $14,564 a share now and 2022 was a tough year for me. I had to build this time machine and it wasn't cheap so I have to cover my costs, I'm sorry.\n\nI will take some of the proceeds and and donate it to the WallStreetBets Museum of Autism on 5th Avenue in Manhattan that opened last week; the original piss-drinking martini glass was amazing to see in person as was DFV's headband.\n\nIt's a bit lonely on earth now that the population has dropped by 9.4m but I will hopefully catch you on the next $TSLA moon flight next week. Can go to the MilkBar at Promontorium Archerusia and catchup on good old times when we used to live on earth?\n\n&#x200B;\n\nEDIT: FUCK I ACCIDENTALLY POSTED THIS TOO EARLY - this is a glitch in my faulty time machine and I don't know how to amend, was scheduled to post this for July 2023. FUCK.",
        "created_utc": 1615314281.0,
        "subreddit_name": "wallstreetbets",
        "comments": 1294
    },
    {
        "title": "Spotify (SPOT) DD. Established company on the brink of profitability, trading at a low P/S relative to the industry.",
        "score": 1802,
        "url": "https://www.reddit.com/r/investing/comments/m1dxar/spotify_spot_dd_established_company_on_the_brink/",
        "content": "Let’s get the elephant in Spotify’s room out of the way first, namely Apple Music. While Apple is a formidable competitor, they’re second in the race by a large margin: Spotify sits at 144M subscribers and Apple sits around 60M (likely closer to 70M by now). Despite the services being available in roughly the same number of countries (APM:167, Spotify:170), **Spotify’s been able to capture much more subscriber growth thanks to a few aggressive expansions.**\n\n&#x200B;\n\nYou’ve definitely heard of Spotify’s aggressive podcast expansions, including JRE exclusivity and new originals/exclusives such as Michelle Obama’s podcast. This expansion led Spotify to **surpass Apple’s podcast numbers just barely in 2020, with analysts expecting 41% growth in 2021**. Analysts expect that 53.9% of ‘digital audio listeners’ will be podcast listeners in 2021. Spotify’s continuing to expand in this space to meet upstart competitor Clubhouse, by testing paid podcast subscriptions that allow for interactivity. (side note, I’d be interested to know if they’re trying to compete with twitch here too)\n\n&#x200B;\n\nA newer expansion on Spotify’s part is their recent foray into audiobooks. It appears that they’re sticking to public domain works for now to test the waters, but moving forwards, this could create a real challenge to competitors like Audible, a company with an estimated $2.5B in revenue in 2020 and no real competitors. \n\n&#x200B;\n\n**Spotify’s been aggressively pursuing developing markets**, which has a negative impact on financials in the short term but could lead to greater profitability in the future.  The reason is that they charge lower rates in developing markets in order to build a subscriber base and a presence. \n\n&#x200B;\n\nOnto some quick financial stats. (figures in EUR) \n\n&#x200B;\n\n**Spotify’s 2020 revenue clocks in at 7.3B, and a 47.7B mkt cap, which works out to a P/S ratio of 6.53.** \n\n&#x200B;\n\nPersonally, I like to value companies in the context of competitors … which is sort of hard to do for spotify. I’d argue Netflix is the most comparable (software, digital media, subscriber model), and their P/S ratio sits at 8.96. Twitter’s a bit of a stretch, but their P/S ratio sits at 13.5: Adobe, another stretch but closer imo as it’s subscription-based software, sits at 15.9.\n\n&#x200B;\n\n**Spotify’s debt/equity ratio is on a downward trend, sitting at 1.26. It’s got a forwards CAGR of 22%.** \n\n&#x200B;\n\nThe biggest red flag I see on their balance sheet has to do with their **cost of revenue: it’s been increasing almost in lock-step with revenue. Spotify’s very close to being profitable, and they’ve posted a profit for some quarters (though never a full year).** Spotify’s under good management, however, and I’m confident that once their more aggressive expansions mature, profit will follow, especially as they’ve proved they can stave off competitors like Apple. \n\n&#x200B;\n\nOn a valuation play alone, I’d argue Spotify is better suited to a **P/S of at least NFLX,** which would place it at **$375/sh**. With growth taken into account -- that the firm is estimated to grow at 22%, and is well-positioned globally against competitors -- I’d argue a more accurate P/S would place it **closer to 10 P/S**, putting SPOT at **$418/sh**. ^((these P/S ratios are gargantuan, but that’s true for the tech sector in general; my argument is that spotify’s undervalued in the context of the current market.))\n\n&#x200B;\n\nI don’t really do deep dives into companies this much, so let me know where I might’ve gone wrong in analyzing the company (especially if I missed something in the balance sheet).\n\nVery good point that’s been raised by a few comments: Industry structure, namely big labels, might prevent Spotify from improving their margins enough to post profits. This is absolutely a risk, and one that Spotify could overcome in a variety of ways, all involving increased vertical integration. It’s also possible that this is less of a problem than it seems: I’d argue Spotify’s leverage isn’t insignificant, and that they may be able to keep contracts with major labels at current rates.",
        "created_utc": 1615317536.0,
        "subreddit_name": "investing",
        "comments": 473
    },
    {
        "title": "ACTC (Proterra) DD - The Most Undervalued Stock on the Entire Market",
        "score": 1320,
        "url": "https://www.reddit.com/r/investing/comments/m0wbra/actc_proterra_dd_the_most_undervalued_stock_on/",
        "content": "Topics to be Discussed:\n\n* Overview\n* Leadership\n* Board of Directors\n* Products, Services, and Technology\n* Partnerships and Customers\n* Competition\n* SPAC Transaction Overview\n* Financials and Fundamentals\n* Forward-Looking Statements and Speculation\n* Conclusion\n\n# Overview\n\n\"Proterra is a high-growth commercial electric vehicle technology leader with over a decade of production experience. The Company has designed an end-to-end, flexible technology platform that delivers world-class performance and a low total cost of ownership to original equipment manufacturers (OEMs) and end customers. Proterra has three complementary businesses:\n\n* **Proterra Powered**: Delivering industry-leading battery systems and electrification solutions to commercial vehicle manufacturers;\n* **Proterra Transit:** Leading North America as the market’s #1 electric transit bus OEM; and\n* **Proterra Energy:** Offering end-to-end turnkey charging and energy management solutions.\n\nThe Company’s industry-leading battery systems have been proven in more than 16 million service miles driven by its fleet of transit vehicles and validated through partnerships with world-class commercial vehicle OEMs, such as Freightliner Custom Chassis Corporation (FCCC), Thomas Built Buses, Van Hool, Bustech, and Optimal-EV. To date, Proterra has produced and delivered more than 300 megawatt-hours of battery systems, more than 550 heavy-duty electric transit buses and installed 54 megawatts of charging systems.\n\nProterra operates manufacturing facilities in California and South Carolina, as well as a state-of-the-art R&D lab in Silicon Valley. The Company recently announced the opening of a new battery production line co-located in its electric transit bus manufacturing facility in Los Angeles County. This battery production line was established within a year and demonstrates Proterra’s ability to bring its scalable and capital-efficient battery manufacturing process directly to commercial vehicle OEMs alongside their existing manufacturing.\" Pulled from [investors portal on Proterra's website](https://www.proterra.com/company/investors/).\n\nProterra is going public via a SPAC merger ticker **ACTC.** A [press statement](https://www.proterra.com/wp-content/uploads/2021/01/Proterra-Release.pdf) released on January 12th, 2021 suggests that the merger is \"expected to close in the first half of 2021\". There is some speculation regarding the date; they’ve already filed the S-4, so the timeline for merger vote looks to be around end of March to April first week according to [this post](https://www.reddit.com/r/SPACs/comments/le6yur/proterra_actc_merger/) and [the SEC website.](https://www.sec.gov/cgi-bin/browse-edgar?CIK=1820630&owner=exclude)\n\n**Investors:**\n\nFranklin Templeton, Broadscale, 40 North, G2VP, Chamath Palihapitiya, and Fidelity Management & Research Company LLC\n\n**Funds and Accounts Managed By:**\n\nBlackRock, Neuberger Berman Funds and affiliates of ArcLight.\n\n# Leadership\n\n* Jack Allan, CEO, from Navistar and Valspar\n* Amy Ard, CFO, from AMG, PCC, and PWC\n* Dustin Grace, CTO, from Tesla and Honda\n* John Ensign, COO, from Tesla and Honeywell\n* JoAnn Covington, CLO, from EA and Rocket Fuel\n* Gareth Joyce, President, from Delta and Mercedes-Benz\n* Rick Huibregtse, Sr. VP Engineering, from Remy and Delphi\n* John Walsh, Sr. VP of Sales, from Rev and Davey Coach\n\n# Board of Directors\n\n* Jack Allen, Chairman from Navistar and Valspar\n* Ryan Popple, Co-Founder and Executive Director from Tesla and KPCB\n* Jake Erhard, Direct Nominee from ArcLight and Schroders\n* Jennifer Granholm, Director **Secretary of the DoE** and CNN\n* Constance Skidmore, Director from PWC\n* Mike Smith, Director from Constellation\n* Brook Porter, Director from G2VP and KPCB\n* Jeannine Sargent, Director from Flex and Aerlikon\n\nI can't highlight Jennifer Granholm enough, she is the Secretary of the Department of Energy with a green Biden administration in a company that has 50% of the US Market already. Her CNN ties could prove to be an excellent source for PR as well.\n\n# Products, Services, and Technology\n\nAs mentioned in the overview, the company really operates in 3 capacities: Proterra Powered, Proterra Transit, and Proterra Energy.\n\n**Proterra Powered**: Delivering industry-leading battery systems and electrification solutions to commercial vehicle manufacturers.\n\n* DriveTrain [Technical information here](https://www.proterra.com/company/innovation/)\n* Battery Pack [Technical information here](https://www.proterra.com/proterra-powered/battery-technology/)\n* High Voltage System Components and Integration (Junction Boxes, Thermal Management Systems, Telematics Gateways, Charge Controllers and Integration Controllers).\n\n**Proterra Transit:** Leading North America as the market’s #1 electric transit bus OEM.\n\n* [ZX5](https://www.proterra.com/vehicles/zx5-electric-bus/) \\- Transit Bus\n* [S1LF](https://www.proterra.com/vehicles/proterra-powered-vehicles/shuttle-bus/) \\- Shuttle Bus\n* [ZDi](https://www.proterra.com/vehicles/proterra-powered-vehicles/bustech-transit-bus/) \\- Transit Bus\n\n**Proterra Energy:** Offering end-to-end turnkey charging and energy management solutions.\n\n* [Fleet Planning](https://www.proterra.com/energy-services/fleet-planning/)\n* [Fleet Charging Infrastructure](https://www.proterra.com/energy-services/charging-infrastructure/)\n* [Smart Energy Management](https://www.proterra.com/energy-services/energy-management/)\n* [Pay-As-You-Go](https://www.proterra.com/energy-services/financing-your-charging-infrastructure/)\n* See the full services information [here](https://www.proterra.com/energy-services/).\n\n# Partnerships and Customers\n\n**Partners:** Key strategic partnership with Daimler\n\n**Customers:** Daimler, Alabama University, ART, University of Montana, Atomic City Transit, Capitol Metro, CARTA, Chicago Transit Authority, Charlotte Douglas International Airport, City of Los Angeles Department of Transportation, CitiBus, Detroit DoT, DART, Duke University, JFK International Airport, Zion National Park, +100 more.\n\nTheir customers range from transit authorities, DoT's, airports, schools (high school/college), and cities.\n\nTwo weeks ago they had the [largest EV bus deal in the US struck with Maryland.](https://www.bloomberg.com/news/articles/2021-02-24/biggest-electric-school-bus-deal-in-u-s-approved-in-maryland)\n\n# Competition\n\nArrival, Hyllion, Nikola, Romeo.\n\nProterra has an extremely large lead and has a distinct first mover advantage. The second place competition (Romeo) is still lagging *far* behind Proterra.\n\n**Real World Miles Driven:** Proterra has driven over 16mm real world miles, no other competition has driven any.\n\n**Revenue** (2020E): The only other competitor to generate mentionable revenue was Romeo with $11mm. Proterra generated $193mm\n\n**Production Track Record:** Again, Romeo is the not-so-close second having produced minimal items and being founded in 2016. Proterra has been in production for \\~10 years.\n\n**Manufacturing Capacity (As of 01/01/2021):** Only Proterra and Romeo.\n\n**Full Charging Solution (As of 01/01/2021):** Proterra only\n\n# SPAC Transaction Overview\n\n* Transaction reflects a $1.6Bn value for Proterra\n* Proterra to receive \\~$648mm cash at closing\n* Proterra shareholders to roll 100% of their shares, expected to own \\~69%\n* $2.4Bn pro forma equity value\n* $1.6Bn pro forma enterprise value\n   * 3.6x 2022E revenue of $439MM\n   * 0.6x 2025E revenue of $2,566MM\n* \\~$852MM cash on hand at close\n* The transaction has been unanimously approved by the Boards of Directors of both Proterra and ArcLight Clean Transition Corp.\n* Expected to close \"first half of 2021\", aforementioned above that predictions expect voting to happen in the last week of March/first week of April.\n* [Form 8-K](https://sec.report/Document/0001213900-21-006284/)\n\n# Financials and Fundamentals\n\n**All data derived from SEC forms and the** [investor presentation.](https://www.proterra.com/wp-content/uploads/2021/01/ACTC-Proterra-Investor-Presentation.pdf)\n\n* **2025E EBITDA:** 21%\n* **2025E Free Cash Flow:** $390MM\n* **'20E-'25E CAGR:** 68% (Peer median 37%)\n* **'22E-'25E Scaling Gross Margins:** 13-25% (Peer median 23%)\n* **'21E Valuation:** 6.5x (Peer median 16.2x)\n* **'22E Valuation:** 3.6x (Peer median 10.3x)\n* These are very attractive valuations considering the growth compared to peers.\n* **Trading Median (as of January 2021):** 1.6 transaction value/trading value (Trading median 3.1)\n* **Revenue '21E:** $246MM (Peer median $120MM)\n* **Implied Enterprise Value of Publicly Traded Mobility Tech Leaders:** $4.7Bn\n* **Implied Enterprise Value of Publicly Mobility SPAC Transactions:** $4.3Bn\n* **Implied Enterprise Value of Proterra:** $1.6Bn\n\n**Let's do a little evaluating ourselves:**\n\n**Shares outstanding post-merger:** 240.1MM\n\n**Based on January ACTC prices pre NASDAQ sell-off:** $24/share\n\n* 240.1MM \\* $24/share = 5.76Bn Market Cap\n* Let's find Proterra's value here without the SPAC shenanigans.\n* 5.76Bn - $852MM = 4.91Bn Market Cap without SPAC cash\n* 2022E estimated revenue is 439M\n* 2022E adjusted .7561 for present value is 332M\n* So unadjusted EV/Rev = 11.18\n* And adjusted EV/Rev = 14.78\n* Competitor EV/Rev = 10.3x on average for 2022E\n* Proterra claims an 84% premium\n* 1.84 \\* 10.3 = 18.95\n* So the industry metric is 18.95x.\n\n**UNADJUSTED:**\n\n* 439 unadjusted x 18.9 = 8.3B\n* Add the cash from the SPAC: $852mm\n* $9.162Bn unadjusted market cap\n* 9.162/240.1 = **$38.16 unadjusted**\n* 9.162Bn - 5.76Bn = **3.402Bn undervalued**\n\n**ADJUSTED:**\n\n* 332 \\* 18.9 = 6.274Bn\n* Add the cash from the SPAC: $852mm\n* $7.126Bn adjusted market cap\n* 7.126/240.1 = **$29.58 adjusted**\n* 7.126 - 5.76 = **$1.366Bn undervalued**\n\n**Average between adjusted and unadjusted:**\n\n* Dollar value: $2.384Bn undervalued\n* **Fair share price: $33.87**\n\n[Here is another analyst finding it undervalued in a similar way on Feb 10th.](https://investorplace.com/2021/02/actc-stock-arclight-spac-merger-proterra-undervalued/)\n\n*Let's think about that for a moment...*\n\nAs of this writing ACTC is trading at $15.65, based on purely fundamentals without speculation it is trading **116.42% below it's actual value.**\n\nForward Looking Statements and Speculation\n\n* [Vehicle to grid technology](https://en.wikipedia.org/wiki/Vehicle-to-grid)\n* [EV Construction Equipment with Komatsu](https://www.proterra.com/press-release/komatsu-electric-construction-equipment/)\n* [Delivery Truck](https://www.proterra.com/applications/last-mile-delivery/)\n* [Garbage Trucks, Tractor Trailers, Big EV Vehicles](https://cleantechnica.com/2017/02/02/garbage-trucks-buses-time-start-talking-big-electric-vehicles/)\n* [Bus Market Projected to be 50% Electrified by 2025](https://www.researchandmarkets.com/reports/4733461/global-electric-bus-market-opportunity-analysis)\n* [California Transitioning to All Electric Bus Fleet by 2040](https://ww2.arb.ca.gov/news/california-transitioning-all-electric-public-bus-fleet-2040#:~:text=SACRAMENTO%20%E2%80%93%20The%20California%20Air%20Resources,air%20for%20all%20of%20us), same link 25k of NA buses must be 100% emission free by 2040\n* [Zero Emission Buses Now 26% of Active Bid Universe](https://www.nfigroup.com/2019/04/15/nfi-group-announces-first-quarter-2019-deliveries-orders-and-backlog/)\n* [Proterra’s Customers Operate Over 30% of the N.A. Transit Bus Fleet](https://www.transit.dot.gov/sites/fta.dot.gov/files/Electric_Drive_Bus_Analysis_0.pdf)\n* [TAM $260Bn](https://www.sec.gov/Archives/edgar/data/1820630/000121390021001584/ea133141ex99-2_arclight.htm)\n* [Established Partnerships Serve a Target Segment Market Opportunity of \\~175,000 Annual Vehicles](https://www.freedoniagroup.com/industry-study/global-bus-market-by-product-and-fuel-type-6th-edition-3509.htm)\n* [Proterra CURRENTLY has 50%+ Market Share](https://www.transit.dot.gov/ntd/data-product/2019-annual-database-service-vehicle-inventory)\n* [Current and Future Prospects: Not Just Creating Electric Buses, They Run The Entire Ecosystem for Large Scale EV Fleets](https://www.proterra.com/energy-services/)\n* [Massive Green Initiative from the Biden Administration](https://www.whitehouse.gov/briefing-room/statements-releases/2021/01/27/fact-sheet-president-biden-takes-executive-actions-to-tackle-the-climate-crisis-at-home-and-abroad-create-jobs-and-restore-scientific-integrity-across-federal-government/)\n* [The Biden Climate Plan is a $2T Plan](https://www.nytimes.com/2020/07/14/us/politics/biden-climate-plan.html)\n* [Jennifer Granholm is impatient and wants results, she is the Secretary of the Department of Energy....and a Proterra Board Member](https://msmagazine.com/2021/03/08/table-for-12-jennifer-granholm-biden-cabinet-pat-mitchell-energy-secretary-green-energy/)\n* [Proterra ALREADY has a ton of customers, and is striking new deals almost weekly this year](https://www.proterra.com/company/our-customers/)\n   * [Like the Komatsu deal a month ago to create EV construction equipment on Feb 8th](https://www.worldhighways.com/wh2/news/komatsu-and-proterra-e-excavator-prototype)\n   * [or when Volta selected Proterra to be a battery provider on Feb 17th](https://www.prnewswire.com/news-releases/volta-trucks-selects-proterra-to-supply-the-vehicle-battery-for-the-full-electric-volta-zero-301229560.html)\n   * [or when the Biggest Electric Bus Deal in U.S. was Approved in Maryland on Feb 23rd](https://www.bloomberg.com/news/articles/2021-02-24/biggest-electric-school-bus-deal-in-u-s-approved-in-maryland)\n   * [or when Montgomery County Public Schools approved the nation’s largest procurement of electric school buses on February 25th](https://www.automotiveworld.com/news-releases/proterra-montgomery-county-public-schools-approves-nations-largest-procurement-of-electric-school-buses-with-highland-electric-transportation/)\n\n# Conclusion\n\nProterra is not only the most undervalued stock on the entire market, it's also positioned to be one of the best performing companies over the next several years. With an incredible first-mover advantage (16mm driven/10 years production) and a massive lead on the market (50%+ US market share), there is nothing stopping this stock from absolutely exploding post-merger which is expected to happen end of March-first week in April (although the official statement is \"the first half of this year\"). \n\nThe company is currently undervalued by 116.42% on fundamentals alone, and that's on the \"fair\" end. When people realize what is actually happening here and what this is about to become, I think the hype and excitement has the potential to drive these prices much higher. I see a TSLA situation brewing. No not because it's just another EV company, because it's an established, well-connected, constantly growing *commercial* EV company.\n\n**Bear Case:** I literally can't think of one aside from the merger falling apart. If someone could provide a bear case in the comments for Proterra (assuming the merger is successful) I would love to discuss it, because either I'm missing something glaringly obvious or this might be my greatest pick.\n\n**How to Play?**\n\nI am long on this with my shares. I will be holding all my shares for several years, my calls I will exercise half after the merger and sell the rest for a nice profit. If you want to just play the merger that's an option too. Meaning just hold until the merger date and sell at whatever you think the peak is that very day.\n\n1. Buy shares, ACTC will change to PTRA after the merger. Shares will be 1:1\n2. Warrants, ACTCW, if you're not familiar how warrants work they are essentially call options with a fixed strike price of $11.50\n3. Calls, I think virtually anything listed is going to print (aside from 03/19)\n4. Selling puts, the premiums are hefty so either you'll get a nice premium or you'll own some shares at a really nice discount.\n\n**Positions:**\n\n3,865 shares @ 22.37\n\n10C 04/16 $20.00\n\n12C 05/21 $22.50\n\n17C 05/21 $25.00\n\n6C 08/20 $35\n\n**TL;DR:** Fundamental's alone show this company is already **116.42% undervalued**, factor in hype, forward-thinking, IPO, etc. and I can't even come up with a PT. I would *expect* a PT post-merger to travel upwards to \\~$50-$60 and settle back down no lower than $34. EOY my prediction is \\~$70-$80. 2025 prediction is \\~$300-$500. I recommend you read. I wouldn't want to gloss this one over if I were you. If you prefer you could simply check out [their investor presentation.](https://www.proterra.com/wp-content/uploads/2021/01/ACTC-Proterra-Investor-Presentation.pdf) \n\n**EDIT:** The 10.3 factor is from an EV basket that includes many direct and indirect competitors. The list is in the presentation. \n\n**EDIT 2:** This is a fundamental DD. There are a lot of comments regarding other competitors not mentioned. Most of the companies not mentioned were including in the 10.3 factor for diversity. A lot of these competitors being mentioned are bus manufacturers, Proterra is a fleet level ecosystem infrastructure provider. They don’t just make buses. \n\n**EDIT 3:** Fair warning, even though Proterra is significantly undervalued, there are other market mechanics at play. With the NASDAQ sell off its uncertain how much lower ACTC will go if at all. I think this is an excellent play, now you just need excellent timing.\n\n**EDIT4:** Added “2025E” to EDIBTA\n\n*Disclaimer: I am not a financial advisor, nothing I ever say or do is a financial recommendation. Any words urging someone to do something is only going as far as suggesting they do their own DD, it is in no way an attempt to convince anyone to make any financial decisions. Plus...this thing doesn't need to get pumped. I'm just trying to share the find.*",
        "created_utc": 1615256001.0,
        "subreddit_name": "investing",
        "comments": 580
    }
]