[
    {
        "title": "Today was the day. This has been a long time coming.",
        "score": 2695,
        "url": "https://www.reddit.com/r/investing/comments/7sjdij/today_was_the_day_this_has_been_a_long_time_coming/",
        "content": "https://i.imgur.com/NaBz0ll.jpg\n\nTo give some perspective:\n\n* 50 years old\n\n* Graduated from a no-name college with a business degree (paid my own way, had about $20,000 in student loans when I graduated)\n\n* First year out of college made $21,000.  Was at $58,000 when I was 29.  Highest year was about $125,000, but have averaged around $100,000 for the past 10 years.\n\n* Pretty much all from putting as much as I could manage, or was permitted, into 401K and IRAs.  About 65% of the total is traditional retirement, 30% ROTH, and 5% non-retirement.\n\n* I bought cheap used cars when I was under 25.  But then bought a new car and drove it for 20 years.\n\n* The only \"bonus\" along the way was I had a job that I got 6 months severance (around $35,000) and got another job right away, so I had \"double income\" for that 6 months.\n\n* 100% self-managed, primarily through an E*Trade account.\n\n* I pretty much buy and just let it sit.  Last time I sold anything was about 3 years ago when I last rebalanced.  I held all through the 2009 recession and lost about 60%.  I've always invested pretty aggressively, so I got hit hard when it went down, but I've recovered well as it's gone up.\n\n* I pretty much focus on mutual funds now after getting my ass handed to me on individual stocks a few times.  The few I have left are \"sentimental\".  The SIRI and MSFT I've owned since 2001.  The FB I bought in the IPO.  BABA was bought shortly after the IPO.\n\n* I opened my first brokerage account with $2,000 in Ameritrade in 1997 thinking I was going to jump on the internet bubble.  I bought and sold weekly and rode that baby down.  I basically never made any money, and when the whole thing crashed, my $2,000 literally got down to like $37.  So many internet stocks that just evaporated.\n\n**Also, this post is a guarantee that the DOW is dropping 1800 points tomorrow**",
        "created_utc": 1516755551.0,
        "subreddit_name": "investing",
        "comments": 450
    }
]