[
    {
        "title": "France fines Google $267 million for abusing ‘dominant position’ in online advertising",
        "score": 3973,
        "url": "https://www.reddit.com/r/stocks/comments/nu950n/france_fines_google_267_million_for_abusing/",
        "content": " France’s competition watchdog has fined Google 220 million euros ($267 million) for abusing its market power in the online advertising industry.\n\nThe French Competition Authority said Monday Google had unfairly sent business to its own services, and discriminated against the competition. Google has agreed to pay the fine and end some of its self-preferencing practices, the watchdog said.\n\nThe investigation found that Google gave preferential treatment to its DFP advertising server, which allows publishers of sites and applications to sell their advertising space, and its SSP AdX listing platform, which organizes auction processes and allows publishers to sell their “impressions” or advertising inventory to advertisers. Google’s rivals and publishers suffered as a result, the regulator said.\n\nIsabelle de Silva, president of the French Competition Authority, said in a statement that the decision is the first in the world “to look at the complex algorithmic auction processes by which online advertising ‘display’ operates.”\n\nShe added that the investigation revealed processes by which Google favored itself over its competitors on both advertising servers and supply-side platforms, which are pieces of software used by publishers to manage, sell and optimize ad space on their websites and mobile apps.\n\n“These very serious practices have penalized competition in the emerging online advertising market, and have enabled Google not only to preserve but also to increase its dominant position,” said de Silva.\n\n“This sanction and these commitments will make it possible to re-establish a level playing field for all actors, and the ability of publishers to make the most of their advertising spaces.”\n\nGoogle announced in a blog on Monday that it will be making a series of changes to its advertising technology.\n\n“We recognize the role that ad tech plays in supporting access to content and information and we’re committed to working collaboratively with regulators and investing in new products and technologies that give publishers more choice and better results when using our platforms,” wrote Maria Gomri, legal director of Google France.\n\nThe investigation comes after U.S.-based News Corp, French newspaper Le Figaro and the Belgian press group Rossel filed a complaint against Google.\n\nRegulators across Europe are clamping down on the major U.S. tech giants amid concerns that they wield too much power on the bloc’s 700 million plus citizens.\n\nLast week, Facebook was hit by two antitrust probes from regulators in the U.K. and Europe.\n\nThe European Commission has launched probes into Amazon, Google and Microsoft over the last few years, while the U.K.’s Competition and Markets Authority has also launched probes into Google and Apple since it became an independent regulator in its own right in January following Britain’s exit from the EU.\n\n[https://www.cnbc.com/2021/06/07/google-fined-by-france-for-abusing-online-advertising-position.html](https://www.cnbc.com/2021/06/07/google-fined-by-france-for-abusing-online-advertising-position.html)",
        "created_utc": 1623061843.0,
        "subreddit_name": "stocks",
        "comments": 246
    },
    {
        "title": "Apple certified technicians posted a womans sex tape from her phone online",
        "score": 39518,
        "url": "https://www.telegraph.co.uk/business/2021/06/06/apple-pays-millions-woman-explicit-photos-posted-online",
        "content": "",
        "created_utc": 1623074462.0,
        "subreddit_name": "technology",
        "comments": 1981
    }
]