[
    {
        "title": "Venmo just put crypto access in the palm of everyone's hand",
        "score": 1999,
        "url": "https://www.reddit.com/r/investing/comments/mutq93/venmo_just_put_crypto_access_in_the_palm_of/",
        "content": "New York (CNN Business) Bitcoin and similar cryptocurrencies have gone increasingly mainstream, but Tuesday's announcement that Venmo is adding crypto support just put crypto access in the palm of everyone's hand.\n\nVenmo, which is owned by PayPal (PYPL), said its more than 70 million customers can buy bitcoin [and other coins] for as little as $1.\n\nCryptocurrency can often feel confusing and inaccessible to newbies, so Venmo will offer in-app guides and videos to help answer commonly asked questions and share information about the world of crypto.\n\nThe payment company hopes that this new initiative \"demystifies some of the common questions and misconceptions that consumers may have,\" Darrell Esch, senior vice president and general manager at Venmo, said in a statement.\n\nMore than 30% of Venmo customers have already started purchasing cryptocurrency or equities, according to the payments company. And 20% of those customers started doing so during the pandemic.\n\nLast week, crypto enthusiasm soared as trading platform Coinbase went public at a valuation of $86 billion... Cryptocurrency backers have spent years insisting that bitcoin and other digital coins could revolutionize the world of finance. That hasn't happened yet, but Venmo's announcement is another example of how crypto is creeping ever closer toward mainstream acceptance.\n\nVenmo is joining a list of other companies that recently began recognizing or accepting cryptocurrencies. Tesla has started accepting bitcoin payments for its cars and now holds some of the digital currency on its balance sheet. Payment processors including Mastercard (MA), and Visa (V) are trying to streamline crypto payments on their networks. Goldman Sachs will reportedly soon offer its private wealth management clients avenues to invest in bitcoin and other digital currencies. And Morgan Stanley announced that it will offer its wealthy clients access to bitcoin funds.\n\nhttps://www.cnn.com/2021/04/20/investing/venmo-cryptocurrency/index.html",
        "created_utc": 1618934752.0,
        "subreddit_name": "investing",
        "comments": 267
    },
    {
        "title": "Netflix shares fall 11% after reporting a large miss in subscriber numbers",
        "score": 2063,
        "url": "https://www.reddit.com/r/stocks/comments/mv2e02/netflix_shares_fall_11_after_reporting_a_large/",
        "content": "Netflix shares fell as much as 11% in after-hours trading after reporting a large miss in subscriber numbers in its first-quarter earnings report. The company also said it only expects to add about 1 million subscribers in the current quarter.\n\n* Earnings per share (EPS): $3.75, vs $2.97 expected \n\n* Revenue: $7.16 billion, vs $7.13 billion expected  (up 24% YOY) \n\n* Global paid net subscriber additions: 3.98 million vs 6.2 million expected\n\n“We believe paid membership growth slowed due to the big Covid-19 pull forward in 2020 and a lighter content slate in the first half of this year, due to Covid-19 production delays,” Netflix said in its letter to shareholders.\n\nWhen asked about their view on competition with the likes of Disney+, Netflix responded: “We don’t believe competitive intensity materially changed in the quarter or was a material factor in the variance as the over-forecast was across all of our regions,”\n\n“As we’ve noted previously, the production delays from Covid-19 in 2020 will lead to a 2021 slate that is more heavily second half weighted with a large number of returning franchises,” \n\nNetflix also approved a buyback program to repurchase up to $5 billion in common stock, beginning in 2021 with no fixed expiration date. That’s expected to begin this quarter, the company said.\n\nCNBC: https://www.google.com.au/amp/s/www.cnbc.com/amp/2021/04/20/netflix-nflx-q1-2021-earnings.html",
        "created_utc": 1618958475.0,
        "subreddit_name": "stocks",
        "comments": 663
    },
    {
        "title": "Stock Shorts Collapse as No Hedge Fund Wants ‘Head Ripped Off’",
        "score": 4187,
        "url": "https://www.reddit.com/r/stocks/comments/muq20f/stock_shorts_collapse_as_no_hedge_fund_wants_head/",
        "content": "Wall Street bears battered by the Reddit crowd earlier this year have yet to regain their gumption, even with stocks at records and valuations near two-decade highs. The median short interest in members of the S&P 500 sits at just 1.6% of market value, near a 17-year low, according to Goldman Sachs Group Inc. In Europe, a short-covering frenzy has sent bearish bets collapsing like never before in Morgan Stanley data.\n\nAt the same time, hedge-fund longs are around the highest relative levels in years at JPMorgan Chase & Co.’s prime brokerage. They’re all signs of the bullish mania propelling global equities to fresh records this month, thanks to the economic re-opening and big policy stimulus. The smart money has little appetite to wager against either expensive or deadbeat companies -- especially after being lashed by the day-trader army earlier this year. “There’s just mass euphoria,” said Benn Dunn, president of Alpha Theory Advisors. “No one wants to get their head ripped off by a short anymore.”\n\n[https://www.bloomberg.com/news/articles/2021-04-19/stock-shorts-collapse-as-no-hedge-fund-wants-head-ripped-off](https://www.bloomberg.com/news/articles/2021-04-19/stock-shorts-collapse-as-no-hedge-fund-wants-head-ripped-off)",
        "created_utc": 1618924548.0,
        "subreddit_name": "stocks",
        "comments": 665
    }
]