[
    {
        "title": "$1M gross profit milestone reached",
        "score": 906,
        "url": "https://www.reddit.com/r/Daytrading/comments/uq67e5/1m_gross_profit_milestone_reached/",
        "content": "This is an update to the post I made at the end of last year: [$400k+ profit, 20,000% account growth in 1.5 years daytrading](https://redd.it/ru9gin)\n\nAs of Friday 13/05/22 I reached $1,000,000 in gross PnL (net pnl is lower after commissions/fees, borrows, and ultimately paying tax)\n\n* 458 trading days since starting\n* 294 green\n* 164 red\n\n>^(proof:) [^(https://kinfo.com/portfolio/17188/performance)](https://kinfo.com/portfolio/17188/performance) ^(|) [^(https://kinfo.com/verified-trades/)](https://kinfo.com/verified-trades/)\n\n[PnL all time](https://preview.redd.it/sv8dqfwn4nz81.png?width=499&format=png&auto=webp&s=024ffad099bfea42aee29660a5fe73e1396b751d)\n\nSo what has happened since the start of this year? SPY has pretty much been on a downtrend since the new year and we are now in a full blown bear market, down 15% YTD:\n\n[SPY YTD](https://preview.redd.it/r6lsp5ik4nz81.png?width=716&format=png&auto=webp&s=393d70195681d755f49003b0529dae677064711f)\n\nThe beauty of day trading is that this shouldn't matter at all. There is no reason you cannot profit from intraday movements regardless if the market is going up or down - case in point my YTD PnL is doing the reverse:\n\n&#x200B;\n\n[PnL YTD](https://preview.redd.it/r0b8c08j4nz81.png?width=462&format=png&auto=webp&s=5d9bd78609c0148dd40e19df83a4a0871d891402)\n\n&#x200B;\n\n[Calendar YTD](https://preview.redd.it/1l76yq4i6nz81.png?width=938&format=png&auto=webp&s=a6f050e6233b5aa11080473cdbeb1ede1b11d480)\n\n&#x200B;\n\n[Winrate YTD](https://preview.redd.it/4qgp9twi6nz81.png?width=341&format=png&auto=webp&s=48073e1e0b2b023f662d9e78d5c22bc928b6cd87)\n\nThere are lots of day traders who focus exclusively on small caps and low float gapper kind of trades. There's no question that the activity in that segment/niche of the market is significantly lower than a year ago. I was not personally around in 2019 or earlier but many have said that this particular market has gone back to \"normal\" after the huge spike in interest and overall volume from the 2020/21 retail craze.\n\nI read this article the other day: [https://www.bloomberg.com/news/articles/2022-05-08/day-trader-army-loses-all-the-money-it-made-in-meme-stock-era](https://www.bloomberg.com/news/articles/2022-05-08/day-trader-army-loses-all-the-money-it-made-in-meme-stock-era)\n\nIt wouldn't be a stretch to say that a lot of traders are finding the current market harder than the easy money 2020-21 days.\n\nPart of being a good trader is the ability to adapt to dynamic market environments - no one expected the markets to behave like they did during the Covid 2020 craze. And many new traders who started in the last 2 years including myself have never seen or traded through a bear market.\n\nEven though I started trading during a crazy bull market I wasn't really fazed by this market cycle. You have so much historical data these days that you can study previous bear markets and analyse how they behave. Technical analysis remains the same and the patterns are often the same except to the downside. Moving averages become descending, most charts are making lower highs and lower lows continuing their daily downtrend. Breakdowns and bear flags are commonplace across stocks. Buying breakouts are much harder, the long trades are now in catching the reversals and aggressive bear market rallies.\n\n# Some thoughts on my own performance\n\n* January was great - large caps moved with huge range and VIX peaked at nearly 39. I think there is great opportunity under these conditions and my trades performed well during this time\n* February and March was choppy for me and overall did not make much progress. There was a period of high volatility again, and then an aggressive 2 week bear market rally. There was plenty of opportunity in the market (as there always is) - just I was not ready to capitalise on the moves and made my fair share of mistakes\n* April started off terribly - went into a large drawdown from revenge trading. Part of being a discretionary trader is controlling own emotions and sticking to process, risk management. Didn't respect daily max loss and dug a massive hole\n* May - after every mistake you should try to learn something and prevent it next time. I started a daily execution journal where I grade my rules and mistakes(already had a daily trading setup/journal thing). I made an effort to respect daily max loss if I hit it. Might make a post on the topic of drawdowns at a later point\n\n[Drawdown all time](https://preview.redd.it/mrf5rzwl4nz81.png?width=454&format=png&auto=webp&s=25a3a35cc06d159664ee889a5f54535ce26138b0)\n\n* Coming off last week it felt like I had a great read on the market and reaching new equity highs as well as the 1M milestone. Volatility is increasing again, which probably helps my trading, I'd like to think the execution journal has contributed to improving habits and reducing my own mistakes.\n* What next: continue to respect rules, risk mangement and avoid further big drawdowns. Continue to scale in sizing to reach the next milestone\n\n# Closing thoughts and advice for struggling traders\n\n* If you're long or short only then you should seriously consider learning both sides\n* If you only trade small caps consider learning how to large caps during high volatility periods (have heard a well-known prop firm will get all their traders to trade market names during exceptional volatility)\n* Learn market structure and \"how stocks move\" and you can trade any asset (generalisation)\n* If you have edge but you lack discipline then you need a structured plan to identify and overcome those psychological/mental issues\n\nYou can follow me on twitter [@Valckrie](https://twitter.com/Valckrie) where I share my trades and other trading content\n\nPS. after my last post I got alot of DM's asking if I can mentor people - the answer is no, this is not something I am looking to do, thanks.",
        "created_utc": 1652621524.0,
        "subreddit_name": "Daytrading",
        "comments": 146
    }
]