[
    {
        "title": "Survey shows young people are going to spend around half of the stimulus check on stocks",
        "score": 7017,
        "url": "https://www.reddit.com/r/stocks/comments/m0gnhx/survey_shows_young_people_are_going_to_spend/",
        "content": "[https://www.cnbc.com/2021/03/08/how-the-young-plan-to-spend-stimulus-checks-deutsche-bank.html](https://www.cnbc.com/2021/03/08/how-the-young-plan-to-spend-stimulus-checks-deutsche-bank.html)\n\nSo what do you think the retail investors will be buying this time? \n\nTesla and other meme stocks?\n\nOr they have noticed that there is a possible rotation in value stocks and will put it there?\n\nOr will they think, put it on FANG and other high flying tech/renewable energy stocks that have dipped quite a lot the last two weeks?\n\nIf it was up to me I will tell them to buy ICLN/IQQH, TDOC, CRSR, NET,  and CSIQ because I have been really hurt by these during the past few weeks and need some support! :-). If only I can hack Musk's twitter account for one day and tweet just these tickers....",
        "created_utc": 1615213253.0,
        "subreddit_name": "stocks",
        "comments": 563
    },
    {
        "title": "Morning Update for Monday, 03/08/21",
        "score": 313,
        "url": "https://www.reddit.com/r/Daytrading/comments/m0g610/morning_update_for_monday_030821/",
        "content": "Good morning everyone! Hope it was a nice weekend.\n\n*This list is geared towards day trading. With the small cap stocks especially, I am typically in and out very quickly, only occasionally longer than 5 minutes, usually faster scalps.* I am also constantly watching the candlestick charts and observing price action and volume, and you should be doing the same if you want to trade these stocks. Always have a plan when you enter a trade (for profit taking and for taking a loss), and use proper risk management.\n\n**Main Watchlist (*****over $10*****)**\n\n* Gapping UP: GME, MARA, RIOT, NETE, IMVT, ATH, CUE, AER, FSR, XPEV, \n* Gapping DOWN: NIO, BABA, BILI, OPEN, DMYI, JD, TIGR\n\n**Small Cap Watchlist (*****under $10*****)**\n\n1. ANCN: Leading gapper this morning, but couldn't find a catalyst. Currently showing some weakness in price action in the premarket, but holding above new support of 5.48-5.50. \n2. EYES: Gapping up on momentum from Friday. Saw a huge day on Friday, so be cautious, as it could be overextended. It may provide good opportunities, but be patient and don't chase trades. Premarket resistance around the 8.50 level. \n3. XSPA: Gapping up on COVID-related catalyst. Seeing good volume in premarket, price action looks a bit better than it did earlier this morning. \n4. OPGN: Gapping up on COVID-related catalyst as well. Seeing good volume in premarket. Had great price action earlier this morning, things calmed down a bit but I'll be watching to see if things pick up again. Touched the premarket high of 2.69 twice already. \n5. EARS: Gapping up but couldn't find a catalyst. Seeing good price action, but I'll want to see volume pick up a bit. \n6. AMC: Gapping up on momentum. Reporting earnings this week as well. Seeing good price action and decent volume in the premarket. \n\nThe market is looking to open mixed, maybe slightly in the red to start off the week. SPY is currently trading at just over 383. We are still hovering near a key support point, so we could see more choppiness today. Hopefully the stimulus news helps the market and we see some more strength. I'll be watching UVXY to take advantage of any volatility we see, though. Bitcoin is sitting at just under 51,000, and I'll be watching crypto-related stocks throughout the week. Gold and silver both down at the moment. Marijuana stocks have been quiet recently, but I'll still be keeping an eye on the, GME is trading higher in premarket, and I'll be keeping an eye on it throughout the day. Stay patient and disciplined in your trading, and let's start the week off right :)\n\nRemember to use proper risk management, make sure you size appropriately for your account, and have a plan for every trade you enter. Happy trading everyone :)",
        "created_utc": 1615211734.0,
        "subreddit_name": "Daytrading",
        "comments": 83
    },
    {
        "title": "$5 burp is meaningless for AAPL. Even a $20 burp is healthy. (STC) Stay The Course.",
        "score": 18,
        "url": "https://www.reddit.com/r/AAPL/comments/m0t77h/5_burp_is_meaningless_for_aapl_even_a_20_burp_is/",
        "content": "No better company. No better time.  STC!!",
        "created_utc": 1615246164.0,
        "subreddit_name": "AAPL",
        "comments": 5
    },
    {
        "title": "AAPL hasnt moved since august 2020",
        "score": 7,
        "url": "https://www.reddit.com/r/AAPL/comments/m0s1tg/aapl_hasnt_moved_since_august_2020/",
        "content": "I see everyone here saying AAPL is a must buy in this dip, but it is at levels seen in August 2020. Hasn’t moved since then.\n\nWhat makes you think it will surpass valuations pre-dip? Same thing for the FB stock. Shit hasn’t moved since then, yet people think this dip makes it undervalued?!\n\nDisclaimer:\n\nI am long on AAPL and it comprises of almost 40% of my portfolio.",
        "created_utc": 1615242776.0,
        "subreddit_name": "AAPL",
        "comments": 17
    },
    {
        "title": "Aapl - when will I buy?",
        "score": 3,
        "url": "https://www.reddit.com/r/AAPL/comments/m0hpea/aapl_when_will_i_buy/",
        "content": "I love aapl. The company is the sole reason I might get to retire one day. But for now, I’m out. I’ll start buying again once it returns to its historical P/E range. I suspect their will be a very sharp correction. Time will tell.",
        "created_utc": 1615216278.0,
        "subreddit_name": "AAPL",
        "comments": 12
    }
]