[
    {
        "title": "The SEC Just posted the new numbers for Failure to Deliver. Guess What, GME is failing to deliver every day.",
        "score": 49439,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ll68pc/the_sec_just_posted_the_new_numbers_for_failure/",
        "content": "Hey 'Tards,\n\nThe  New Failure to deliver data is JUST OUT from the SEC.  Here is a simple pivot table.   It's still failing to deliver EVERY DAY.  I'm sure people will analyze this better than me.   But I wanted to get this out to everyone ASAP.\n\nEdit: Failure to deliver is how many shares were not accounted for at the end of the day.  GME has been failing to deliver in some capacity for weeks now.  This data is posted by the SEC Freedom of  Information Act (FOIA).  It is only posted every two weeks, for the previous two weeks.  But this is the most recent data that everyone has been waiting on.\n\nFrom the SEC regarding this data\n\n>\"The   figure is not a daily amount of fails, but a combined figure that  includes both new fails on the reporting day as well as existing fails.    In other words, these numbers reflect aggregate fails as of a specific    point in time, and may have little or no relationship to yesterday's    aggregate fails.\"\n\n&#x200B;\n\nSEC FOIA Site: [https://www.sec.gov/data/foiadocsfailsdatahtm](https://www.sec.gov/data/foiadocsfailsdatahtm)\n\nData File: [https://www.sec.gov/files/data/fails-deliver-data/cnsfails202101b.zip](https://www.sec.gov/files/data/fails-deliver-data/cnsfails202101b.zip)\n\n&#x200B;\n\nGME had 2 million shares failed to deliver one day totaling 300 million $\n\nhttps://preview.redd.it/o2xfxx2gyuh61.png?width=581&format=png&auto=webp&s=67d839f263c89c56f782a52803b11c9e5f4c9c8b\n\nEDIT: Because so many people are bringing up XRT.  Which contains a lot of GME. Here is XRT.  Hmmm.  Notice anything interesting about Jan29th between these two??\n\nhttps://preview.redd.it/kmbry5xzgvh61.png?width=620&format=png&auto=webp&s=5ea1c495f4287932b0c6f9b172a04a03f58d147b\n\n&#x200B;\n\n&#x200B;\n\nThere is also AMC... AMC is still failing to deliver EVERY DAY.  This continues the trend for both of these stocks not being delivered every day.  AMC had 27 million... yes million shares failed to deliver.\n\n&#x200B;\n\nhttps://preview.redd.it/gqgboikxyuh61.png?width=619&format=png&auto=webp&s=2a12b0466767e0eba40dd93ba0a28cc322db1d32\n\n&#x200B;\n\nI'd like to ask everyone to do what they can.  I am not recommending buying any of these stocks.  But there is for sure, something still going on.  We need to try and get this data daily.  Contact your reps, etc.\n\n&#x200B;\n\nThere are links to information about Failed to deliver.[https://www.sec.gov/rules/final/34-50103.htm](https://www.sec.gov/rules/final/34-50103.htm)\n\nIs GME considered a Threshold Security? ✅\n\n>In   order to be deemed a  threshold security, and thus subject to the   restrictions of Rule  203(b)(3), a security must exceed the specified   fail level for a period  of five consecutive settlement days.    Similarly, in order to be removed  from the list of threshold   securities, a security must not exceed the  specified level of fails for   a period of five consecutive settlement  days.\n\nDoes the Firm have to close out the positions? ✅\n\n>As adopted, Rule 203(b)(3) requires any participant of a registered clearing agency (\"participant\")[80](https://www.sec.gov/rules/final/34-50103.htm#P210_72014) to take action on all failures to deliver that exist in such securities ten days after the normal settlement date, *i.e.*, 13 consecutive settlement days.[81](https://www.sec.gov/rules/final/34-50103.htm#P211_72496)Specifically,  the participant is required to close out the fail to   deliver position  by purchasing securities of like kind and quantity.Rule 203(b)(3) is intended to address potential abuses that may occur with large, extended fails to deliver.[89](https://www.sec.gov/rules/final/34-50103.htm#P221_79239)  We believe that the five-day requirement will facilitate the identification of securities with extended fails.\n\n&#x200B;\n\nEdit:  I wrote a quick post about this last report.  I'll copy some stuff here.  AS requested, here are some data snippets for \"normal\" stocks.  note the number of failed to deliver is way lower.\n\n[Alcoa](https://preview.redd.it/iv7pzbh92vh61.png?width=333&format=png&auto=webp&s=9b724af7998ca1bc1b4dd5db3299b45358eac540)\n\n&#x200B;\n\n[MSFT.  Some outstanding shares and a few spikes, but not hundreds of thousands or millions every day. ](https://preview.redd.it/0ricfjkd2vh61.png?width=246&format=png&auto=webp&s=22b6638b1ff5fee09e9434b5d151389624ed7aeb)\n\n&#x200B;\n\nEdit:  Adding some historical counts for GME below.  I'm too lazy to combine the data right now, pulling from an older post of mine.\n\n&#x200B;\n\nhttps://preview.redd.it/9o10fkj2wvh61.png?width=642&format=png&auto=webp&s=17134e3775fba124959db68eb25cda803504d63e\n\nhttps://preview.redd.it/c0i6ixztvvh61.png?width=605&format=png&auto=webp&s=02ab76207deea9f208f54532a75b28761858e106\n\n&#x200B;\n\n&#x200B;\n\nEdit:  I have a super super small position in GME, like 3 shares.  I have been on WSB since like 2014.  Trust me.  I am NOT a bag-holding whiner.  I take my losses like a fucking champ.  (MSFT 240C, USO, PRPL, SLV in 2020, etc) I am also NOT promoting any sort of holding, buying, or selling any of your positions.",
        "created_utc": 1613489522.0,
        "subreddit_name": "wallstreetbets",
        "comments": 3424
    }
]