[
    {
        "title": "U.S. lawmakers traded an estimated $355 million of stock last year. These were the biggest buyers and sellers",
        "score": 3503,
        "url": "https://www.reddit.com/r/stocks/comments/shpngj/us_lawmakers_traded_an_estimated_355_million_of/",
        "content": "Congress resembled a Wall Street trading desk last year, with lawmakers making an estimated total of $355 million worth of stock trades, buying and selling shares of companies based in the U.S. and around the world. At least 113 lawmakers have disclosed stock transactions that were made in 2021 by themselves or family members, according to a Capitol Trades analysis of disclosures and MarketWatch reporting. U.S. lawmakers bought an estimated $180 million worth of stock last year and sold $175 million.\n\nThe trading action taking place in both the House and the Senate comes as some lawmakers push for a ban on congressional buying and selling of individual stocks. Stock trading is a bipartisan activity in Washington, widely conducted by both Democrats and Republicans, the disclosures show. Congress as a whole tended to be slightly bullish last year with more buys than sells as the S&P 500 SPX soared and returned 28.4%. Republicans traded a larger dollar amount overall — an estimated $201 million vs. Democrats’ $154 million. \n\nSo who were the biggest traders? The table below, based on a Capitol Trades analysis, shows the 41 members of Congress who made stock buys or sells in 2021 with an estimated value of at least $500,000 — or had family members who made such trades.\n\nAt the top of the list of the biggest traders on Capitol Hill by dollar volume is Rep. Michael McCaul, a Texas Republican, who disclosed an estimated $31 million in stock buys and $35 million in stock sales. He’s followed by Democratic Rep. Ro Khanna of California with $34 million in estimated purchases and $19 million in sales, GOP Rep. Mark Green of Tennessee with $26 million in estimated buys and $26 million in sells, and Democratic Rep. Suzan DelBene of Washington state with $15 million in estimated buys and $31 million in sells.\n\nCongress’s more than 500 members are required to file disclosures within 45 days for any transactions involving stocks and other securities due to 2012’s STOCK Act, though many lawmakers have been late with their filings. The decade-old law, which aims to help prevent politicians from profiting from nonpublic information, is viewed as insufficient by some watchdog groups, especially given how a divided Washington united to weaken the law in 2013 by removing provisions such as one that required putting the disclosures in a searchable database. Independent analysis firms have ended up offering such databases, with 2iQ Research, for example, launching Capitol Trades last year. For the table above, Capitol Trades estimated the value of buys and sells using the midpoint of the declared range for the transaction. Lawmakers aren’t required to disclose a transaction’s exact value, but rather give ranges such as $1,001 to $15,000, or $15,001 to $50,000. McCaul’s biggest disclosed trades in 2021 include sales by a child and his spouse of shares in Cullen/Frost Bankers CFR, a bank headquartered in McCaul’s state, as well as sales by his spouse of shares of China’s Tencent Holdings TCEHY, according to filings aggregated by Capitol Trades. The Texas congressman’s office didn’t respond to a request for comment. His father-in-law is the founder of media giant Clear Channel, now known as iHeartMedia IHRT, and McCaul has ranked as one of the wealthiest U.S. lawmakers.\n\nKhanna’s biggest trades included purchases by his spouse of shares in Walgreens Boots Alliance WBA and Microsoft MSFT, along with purchases by a child of shares in Apple AAPL, communications company RingCentral RNG and Facebook parent Meta Platforms FB. The California congressman’s spokeswoman said he “does not own any individual stocks and complies fully with the Ban Conflicted Trading Act, which would prohibit lawmakers from buying or selling individual stocks.” That’s a reference to legislation that has attracted 35 co-sponsors in the House and three in the Senate. “These are his wife’s assets prior to marriage and managed by an outside financial advisor. No trading is done through joint accounts,” Khanna’s spokeswoman also said.\n\n[https://www.marketwatch.com/story/u-s-lawmakers-traded-an-estimated-355-million-of-stock-last-year-these-were-the-biggest-buyers-and-sellers-11643639354?mod=home-page](https://www.marketwatch.com/story/u-s-lawmakers-traded-an-estimated-355-million-of-stock-last-year-these-were-the-biggest-buyers-and-sellers-11643639354?mod=home-page)",
        "created_utc": 1643702402.0,
        "subreddit_name": "stocks",
        "comments": 269
    }
]