[
    {
        "title": "1,5 Years Since My Journey Began, $52 591 dollars wealthier & only 18 months left.",
        "score": 1838,
        "url": "https://www.reddit.com/r/stocks/comments/hiwzgo/15_years_since_my_journey_began_52_591_dollars/",
        "content": "*Introduction*\n\nI'm 20 years old and my interest for the stock market began at age 16 which later grew into becoming my lovely addiction and before graduating high school i already had a detailed plan on how i would become financial independent and self employed as quick as possible, the first milestone to reach before continuing my dreams are to reach an entire net worth of $100 000 dollars.\n\nIn the beginning of setting the $100 000 dollar goal i started with $13 953 dollars and today 1,5 years later i have a total net worth of $66 544 dollars which basically means i only have 33,45% left of the goal to complete within 18 months which is entirely possible. It felt so much harder in the beginning but hard work pays off. While creating the plan i expected to have $52 730 dollars this month of the year but from making better decisions, working hard and presumably a little touch of luck i'm 5 months ahead.\n\nI maximized the overtime-limit at my workplace last year which is roughly 200 hours per year, i managed to reach 212h, sadly the overtime is cancelled due to covid-19 but currently i have 24h 36m in overtime. I've driven taxi *(illegally which i stopped doing)*, been cutting lawns an lending out money in order to speed up the process of my journey.\n\nI've cut almost all unnecessary expenses, i don't travel, i rarely drink alcohol, still driving around in my $1 000 dollar car watching others laugh at me but don't get me wrong, i enjoy traveling and eventfully i'm going to buy myself a new car, i don't want to create wealth just to stare at it. This is something i been planning for a very long time and that i'm fully committed to. It's psychologically frustrating but in the end it's definitely going to be worth it.\n\n*Portfolio distribution*\n\n* *Stocks: 35,79% ($23 816)*\n* *Funds: 8,27% ($5 503)*\n* *Ready assets:* 55,93% ($37 218)\n* *Stocks:* ATVI, AAPL, **AZN**, BAC, **CAST**, DAL, MSFT, **HUFV A**, **KIND SDB**, NFLX, NVDA, **SWED A**, UBER\n* *Funds:* **Avanza Auto 6, Avanza USA, Spiltan Aktiefond Investmentbolag**\n\nnote: *The Tickers with bold fonts are swedish stocks/funds which may not be available in your country.*\n\nI sold a majority of my shares in the beginning of 2020 expecting a recession or correction but instead we got covid-19 which was extremely unpredictable so i was really lucky that i already had a pretty high amount in liquidity. So far i've been taking advantage of the pandemic by investing in stocks that i hopefully believe will recover. I also did some Q1 report trading which made me about $3 000 dollars profit, i traded CAST, GOOG, TWTR and I'm constantly looking for opportunities.\n\nI'm expected to be fully invested within 1 year and i'm not stressed by having 55,93% liquidity since the inflation is 0. The *\"fear of missing out\"* is also nothing that's bothering me, everything can happen, especially now.\n\n*Income, expenses & conditions*\n\nMy monthly income varies depending on how much i work but i averaged $3 008 dollars after taxes during 2019, i invest everything except $500 dollars and the reason how i can invest 83,37% of my monthly income is because i still live at home. The only reason why i still live at home is so i can take advantage of the opportunity to invest and build myself a foundation.\n\n*The Missing piece*\n\nWhat i'm missing is friends and connections with this interest in common, i rarely have anyone to talk with when it comes to investments and such so i really hope that i can reach out to some of you. If you're interested just send me a message, thanks for reading and if you have any questions i'll be happy to answer.",
        "created_utc": 1593553376.0,
        "subreddit_name": "stocks",
        "comments": 277
    }
]