[
    {
        "title": "Why do 95% fail? It’s pretty simple.",
        "score": 537,
        "url": "https://www.reddit.com/r/Daytrading/comments/lzx0cc/why_do_95_fail_its_pretty_simple/",
        "content": "“Now that people are going back out again, GRPN will go up!”\n\nStop it.\n\n“Nobody will be watching NFLX anymore, we should short it!”\n\nReally, stop it, you sound like an idiot. \n\nYou only hear this type of armchair analysis from new traders.  It’s not even fundamental analysis, it’s some arrogant mix of believing you figured out something nobody else has, and a twisted belief that predicting the market is easy (or even doable).\n\nLong term investors might choose stocks based off true fundamental research into a company’s overall health and prospects, or they might just pick the names of companies they use everyday (AAPL, AMZN, GM, etc.).  Honestly, I’m not sure which way has a better success rate.  Nor do I care.  And why don’t I care? Because I’m a day trader.\n\nHalf the time I don’t even know what company I’m trading, and I don’t want to know. \n\nAll the matters is what is in front of me, what the market is doing, and am I ok holding overnight if needed.\n\nRoughly 75% of stocks follow the market (SPY is the best proxy), so I want to know how a stock is performing relative to that.  If SPY is dropping, is the stock going up? If SPY is going up is the stock going up at a higher rate?  \n\nIf I pick a stock that has strength vs SPY and the market suddenly turns, I have some protection.  The underlying has strength on its own (or weakness if you’re shorting).\n\nI also need to look at the 1/5/15 min chart, where are the moving averages, support/resistance, is there a continuation on the HA candles? Etc.etc.etc. \n\nAnd I check the daily chart.  Why? Because if I do get stuck in the trade, I want to be comfortable holding for the short-term with some confidence it’s going back up (yes, good day traders are also good swing traders).\n\nNowhere in this process do I care about the fundamentals or even the reasons why the stock is moving (unless it’s a sudden change - then I need to know if it has legs).  \n\nThere is no easy way to do this and anyone telling you different is either selling you something or about to lose a lot of money. \n\nDo 95% lose money? Maybe, I’m not sure where that stat comes from, but I wouldn’t be surprised if it’s true.  I can tell you from my experience that around 95% of new day traders ask the wrong questions and show no desire to put in the time and effort needed to be successful at it.  That doesn’t mean you need to spend years reading books on it before you trade, but you should at least know how to read a chart, have entry/exit strategies, use the best method.  \n\nI constantly get questions from people, who are already in a trade, asking how they can find “support”, or wondering why their call option isn’t going up more.\n\nSo stop trying to outthink the market, drop the “common sense” analysis, treat this like the job that it is, and then maybe you’ll become one of the 5%.",
        "created_utc": 1615143295.0,
        "subreddit_name": "Daytrading",
        "comments": 111
    }
]