[
    {
        "title": "Apple just temporarily closed all 53 stores in California and over a dozen in London",
        "score": 5393,
        "url": "https://www.theverge.com/2020/12/19/22190895/apple-close-retails-stores-covid-19-london-california-pandemic",
        "content": "",
        "created_utc": 1608430224.0,
        "subreddit_name": "apple",
        "comments": 354
    },
    {
        "title": "After a month with the MacBook Air M1, I can't go back to my PCs",
        "score": 4914,
        "url": "https://www.reddit.com/r/apple/comments/kgxuhm/after_a_month_with_the_macbook_air_m1_i_cant_go/",
        "content": "One of my favourite computers of all times was a MacBook Air 2012. While I got a lot of things done on it, at a point it became too slow for all of my workloads. Replacing it with a 2016 MacBook Pro did not bring the performance boost I was hoping for, so I sold that one, too. After that I allowed myself a power hungry HP workstation, and also bought a Thinkpad in order to have a mobile device.\n\nNeither HP nor Thinkpad are bad, but Windows has just a lot more friction. While continuing to work with both PCs, I always hoped Apple would make a capable device that could replace them both.\n\nAfter this year's WWDC I wasn't expecting anything special from Apple Silicon. But with reviewers so excited when the first machines arrived I ordered the base model MacBook Air. Suddenly there was a secret hope that the M1 model would be the laptop I had been looking for since 2016.\n\nTurns out, this is exactly what happened. It is faster than my Thinkpad, but totally silent and has stellar battery life. No more hairdryer under my keyboard that turns on when I do a quick render in Blender, or edit models in ZBrush. Really, the Thinkpad spins up the fans just to do some weird Windows things in the background, no productive work involved. Enough of that.\n\nWhat's really interesting? The HP Z workstation is faster in some, but not all workloads. Since my life does not depend on it, I can very well live with the fact that a machine rated for 1.2 kW (!) is only twice as fast when transcoding video than the M1 MBA. For most other tasks important to me (graphic design, illustration, animation, photo editing), the Air is subjectively equal or faster. Sometimes a lot faster.\n\nThe M1's performance is great. Battery life is great. Portability is great. I love the silence.\n\nThis is the one.",
        "created_utc": 1608484531.0,
        "subreddit_name": "apple",
        "comments": 915
    }
]