[
    {
        "title": "Intel stock jumps on plan to turn foundry unit into subsidiary, allow outside funding",
        "score": 300,
        "url": "https://www.reddit.com/r/stocks/comments/1fierfw/intel_stock_jumps_on_plan_to_turn_foundry_unit/",
        "content": "Intel shares jumped almost 10% in extended trading on Monday after the company said it plans to turn its foundry business into an independent unit with its own board and the potential to raise outside capital.\n\nAs part of CEO Pat Gelsinger’s effort to turn around the struggling chipmaker, Intel said in a memo to employees that it will also sell off part of its stake in Altera.\n\nGelsinger said the restructuring would allow Foundry to “evaluate independent sources of funding,” and comes days after Intel’s board met to assess the direction and future of the company. The foundry business, which Intel plans to use to manufacture chips for other customers, has been a big drag on its bottom line, with the company spending roughly $25 billion on it for the last two years.\n\nBeyond just considering outside funding, Intel is weighing whether to spin off the foundry business, possibly into a separate publicly traded company, according to a person with knowledge of the matter who declined to be named to discuss confidential information.\n\nWith a standalone “operating board” and a cleaner corporate structure, the mechanics of a separation become far easier than trying to turn a fully-integrated unit into a separate company.\n\nIntel has lost almost 60% of its value this year, as the company has lost market share in its core PC and data center market and watched Nvidia run away with the market for chips that power artificial intelligence workloads. Last month, Intel reported disappointing quarterly results, sparking the sharpest selloff in 50 years, and said it would lay off over 15% of its workforce as part of a $10 billion cost-reduction plan.\n\nIntel will also pause its fab efforts in Poland and Germany “by approximately two years based on anticipated market demand,” Gelsinger said. The chipmaker will also pull back on its plans for its Malaysian factory. U.S. manufacturing projects will remain unaffected, the company said.\n\nThe company is also roughly halfway towards the layoffs announced in August, Gelsinger said.\n\nIntel also announced on Monday that it had entered into a deal with Amazon Web Services to produce custom chips for AI.\n\nThe move is a vote of confidence in Intel’s quest to manufacture custom chips for companies in its foundry business, in addition to designing its own products.\n\nIt extends a long-running partnership between the two companies. Amazon is a large end customer of Intel chips to power its AWS servers, and will buy a custom Xeon processor from Intel as well, Intel said.\n\nIt also will allow Intel a new foothold in the growing industry for AI server chips. While Intel has several products that can be used for AI, including one called Gaudi 3, Nvidia has largely taken control of the market.\n\nAmazon has developed its own AI chips, including one called Trainium, for over five years. Companies such as Amazon, Microsoft, and Google have invested heavily in custom chips to run AI in hopes that theirs would be less expensive or offer other advantages over than Nvidia’s general-purpose GPUs.\n\nThe company said that the chips would be made on the company’s 18A process, which is expected to be used in production in 2025. Analysts expect the manufacturing technology to be similar to TSMC’s forthcoming 2nm process. (The first chips using TSMC’s 3nm process are shipping now in Apple’s iPhone.)\n\nIntel said that it would perform its most advanced manufacturing, including the AI chip for AWS, at its plant in Ohio that’s currently under construction.\n\n“All eyes will remain on us. We need to fight for every inch and execute better than ever before. Because that’s the only way to quiet our critics and deliver the results we know we’re capable of achieving,” Gelsinger said.\n\nSource: https://www.cnbc.com/2024/09/16/intel-turns-foundry-business-into-subsidiary-weighs-outside-funding.html",
        "created_utc": 1726517905.0,
        "subreddit_name": "stocks",
        "comments": 147
    },
    {
        "title": "FDA clears Apple’s sleep apnea detection feature for use. Here’s how it works",
        "score": 209,
        "url": "https://www.reddit.com/r/stocks/comments/1fiahss/fda_clears_apples_sleep_apnea_detection_feature/",
        "content": "The U.S. Food and Drug Administration on Monday cleared Apple\n’s new sleep apnea detection feature for use, which means it will come to the Apple Watch Series 9, Series 10, and Ultra 2 later this month. \n\nSleep apnea is a sleep disorder that causes a person’s breathing to repeatedly stop and start throughout the night. The condition affects more than 30 million people in the U.S., but only around 6 million are diagnosed, according to the American Medical Association. If it goes untreated, sleep apnea can cause fatigue and lead to more serious health issues like heart problems, hypertension and Type 2 diabetes. \n\n“We are so excited about the incredible impact this feature can make for the millions of people living with undiagnosed sleep apnea,” Dr. Sumbul Desai, vice president of health at Apple, said in the feature’s launch video.\n\nApple’s sleep apnea detection feature marks the company’s latest attempt to position its wearables as a cheaper, simpler alternative to many existing health-care tests and devices. And the sleep disorder market could prove to be lucrative. \n\nTo get evaluated for sleep apnea, for instance, patients typically participate in an at-home test or an in-lab test where they’re monitored overnight. Prices vary depending on insurance coverage, but the average in-lab test costs $3,000, according to a 2022 study in the Journal of Primary Care & Community Health. \n\nAt-home tests are often less expensive, but they can still cost hundreds of dollars. The at-home sleep apnea test from Sleep Doctor costs $189, for example. Apple’s newest watch, the Series 10, starts at $399. \n\nApple’s sleep apnea detection feature is “potentially a game changer” for patients who have been reluctant to seek out testing, said Dr. David Kuhlmann, a physician who has treated sleep disorders for nearly two decades in Missouri. Kuhlmann also serves on the board of the American Academy of Sleep Medicine, which is a professional society for sleep medicine clinicians.  \n\nKuhlmann said the feature could be especially helpful for patients who sleep alone, and he thinks a lot of people will be surprised to find out they’re showing signs of sleep apnea.  \n\nEven so, Kuhlmann said users should approach Apple’s sleep apnea data with some caution, as readings could be erroneous. He said it is unlikely that insurance companies will begin paying for sleep apnea therapies like CPAP machines based on Apple Watch data alone, which is why it is important for patients to follow up with their healthcare providers to get an official diagnosis. \n\n“People do need to be diagnosed in order to be treated,” Kuhlmann told CNBC in an interview. \n\nKuhlmann said the feature will likely cause an increase in visits to health care providers, which could ultimately reduce costs for U.S. the health-care system overall. Ideally, if patients catch sleep apnea earlier, they can avoid paying for treatments for more serious conditions down the line.\n\n“By finding out that they have these underlying sleep disorders and getting them treated, it could potentially actually help save expenses and help improve quality of life.”\n\nHow it works \n\nApple’s sleep apnea detection feature works by analyzing a new metric that the company calls “breathing disturbances.” The Apple Watch identifies breathing disturbances by using an accelerometer to measure movements at the wrist that indicate disruptions to normal breathing patterns. \n\nUsers can view their nightly metrics in the Health app, where they’ll be classified as either “elevated” or “not elevated,” i.e., normal. Apple will analyze this breathing disturbance data once a month and notify people if they show “consistent signs” of severe or moderate sleep apnea. Users can view their data over a one-month, six-month or one-year period. \n\nThe Apple Watch Series 10 supports an 18-hour battery life, so people who are interested in using this feature will likely need to charge their device during the day.\n\nApple can also generate a report that users can bring to their doctors to discuss next steps. The report includes three months’ worth of breathing disturbance data as well as some additional information, the company said. Users can access educational materials within the Health app as well. \n\nApple said the notification algorithm was developed with “an extensive data set of clinical-grade sleep apnea tests,” and that the feature was validated in a clinical study.\n\n“Now I’m jonesing to get an Apple [Watch] so I can try it out on myself,” Kuhlmann said.\n\nSource: https://www.cnbc.com/2024/09/16/fda-clears-apples-sleep-apnea-detection-feature-for-use-heres-how-it-works.html",
        "created_utc": 1726507525.0,
        "subreddit_name": "stocks",
        "comments": 66
    },
    {
        "title": "Intel scraps coffee stations and phone benefits as financial pressures mount",
        "score": 3928,
        "url": "https://www.calcalistech.com/ctechnews/article/hk0ekgva0",
        "content": "",
        "created_utc": 1726459298.0,
        "subreddit_name": "wallstreetbets",
        "comments": 506
    },
    {
        "title": "iOS 18 is here, and it's Apple's most personal iPhone update yet",
        "score": 4668,
        "url": "https://9to5mac.com/2024/09/16/ios-18-new-features-now-available/",
        "content": "",
        "created_utc": 1726506367.0,
        "subreddit_name": "apple",
        "comments": 1390
    },
    {
        "title": "Apple Watch Sleep Apnea Detection Gets FDA Approval",
        "score": 3250,
        "url": "https://techcrunch.com/2024/09/16/apple-watch-sleep-apnea-detection-gets-fda-approval/",
        "content": "",
        "created_utc": 1726492415.0,
        "subreddit_name": "apple",
        "comments": 303
    },
    {
        "title": "Messages via satellite free for two years after iPhone activation",
        "score": 1568,
        "url": "https://support.apple.com/en-us/120930",
        "content": "",
        "created_utc": 1726522757.0,
        "subreddit_name": "apple",
        "comments": 185
    },
    {
        "title": "Apple Leaks New Mac Mini With 5 USB-C Ports",
        "score": 922,
        "url": "https://www.macrumors.com/2024/09/16/mac-mini-5-usb-c-ports-leak/",
        "content": "",
        "created_utc": 1726520318.0,
        "subreddit_name": "apple",
        "comments": 202
    },
    {
        "title": "Apple releases watchOS 11 with these new features",
        "score": 787,
        "url": "https://9to5mac.com/2024/09/16/apple-releases-watchos-11-new-features/",
        "content": "",
        "created_utc": 1726506513.0,
        "subreddit_name": "apple",
        "comments": 108
    },
    {
        "title": "Here's When iOS 18 Rolls Out Today in Every Time Zone",
        "score": 653,
        "url": "https://www.macrumors.com/2024/09/16/ios-18-release-date-every-time-zone/",
        "content": "",
        "created_utc": 1726497413.0,
        "subreddit_name": "apple",
        "comments": 237
    },
    {
        "title": "Why Would Someone Teach You How To Trade?",
        "score": 89,
        "url": "https://www.reddit.com/r/Daytrading/comments/1fiejxs/why_would_someone_teach_you_how_to_trade/",
        "content": "**While the market is a goose egg today, I've decided to write about the reality of trading.**\n\n\n\nI've traded for a while now as my main source of income. It's not to brag. It's just what I do. The journey has been rough, to say the least. Trading is never going to be easy. If some of you think this is going to be a job where you just pull out the chart, and look at some price points to put on a trade to make 1k in minutes - you have been mistaken.\n\n\n\nOn the other hand, this is the best job you can have. That's why most of us get into trading. I probably don't need to count all the benefits because you already know them. \n\n\n\nI trade stocks. Why? Because it gives me the best edge. \n\nI've traded Forex and futures, but nothing compares to the consistency of stocks. In the end, as traders, we work from the opening to the close every day to be able to pay ourselves every month. That's why consistency is so important. \n\nBefore I tell you how I trade, I want you to be skeptical about anything you read or learn when it comes to trading. This industry is like a magnet for influencers to leverage your dreams. 20-year-old Youtubers with Lambos selling you the ''Magic strategy to make 10k a day'' are there to fleece you. It's incredibly sad. \n\n\n\n**Why would someone teach you how to trade?**\n\n\n\nMaybe there is a strategy that makes 10k from trading 5 -min a day. Maybe these gurus are just smarter than the rest. I don't know but I highly doubt it. \n\nReal traders are focusing on their business, which is trading. At least those  I know. Hiring a trader to teach you would cost thousands of dollars per hour. \n\n*''What are you doing here then?''*\n\nI've also gone the path of binge-watching trading videos on Youtube and trying all kinds of sh\\*t. Being sold courses and whatnot. I've been lucky to learn trading from, well, real traders. From old veterans (sorry 50-year-olds) with almost no social media that have been in the game for centuries. \n\n\n\nFirst off, I'm not going to post edited videos or sell any courses. I don't need your money and I'm running my trading business like traders tend to do. Writing articles here and there is the most I can do.\n\nI know how it feels to be misled, learning hours of trading a strategy made by a guru who has never seen a profitable week. In the end, most of you just want a better life. And dream sellers will take advantage of that for their own benefit.\n\nSo if I can help one person on the right path, then I have succeeded. \n\n\n\n**How I Trade**\n\n\n\nYou probably think I'm going to talk about some magic indicators. Well, I'm not. In fact, in this approach, you can use different kinds of indicators as long as they make sense. The most important being the 50,100, and 200-day simple moving average on the daily timeframe. VWAP intraday.\n\nThere is no way I can fit everything I have to say in one post, but I've planned to post more regularly in the future. This is just a small intro.\n\nI trade stocks, both for swing and day trades. \n\nEvery analysis I do starts with the ''heart'' of the market, known as SPY.\n\nI only trade liquid stocks, no stocks under 5$, and all have a minimum of 1M traded shares per day on average. \n\nSPY has a gravitational pull to itself. This means most stocks are drawn to it, even those that are not in the SP-500. This is a bit more complex than that when taking in account different sectors, news, etc. But let's stick to the basics here.\n\nThis means I analyze SPY as I would trade it directly, but I'm not. I'm trading stocks that are dominating either positively or negatively relative to SPY. If I'm bullish on SPY, I scan for stocks to go long and vice versa if I'm bearish. \n\n\n\n*Let's put this in a real scenario.*\n\n\n\nSPY has been in rally mode lately, and I'm expecting it to continue today. I wait 30-1 hour from the open to see the price action forming for SPY, at the same time I scan for stocks that are over their major levels on the daily chart (SMA's for example), I draw the latest support and resistance levels and I watch how it's behaving in the first hour, as I do with SPY.\n\nNow let's say SPY is looking great intraday on the 5-minute timeframe (stacked green bars with no nearby resistance). I want to see the stock outperforming SPY. But I won't enter yet. \n\nI want to see a pullback on SPY. \n\nSPY is now starting to pull back, the stock is starting to go sideways or it also pulls back but not as much as SPY. GREAT This means the stock is stronger than the market.\n\nSPY finds support and start grinding higher again. The stock also starts accelerating with volume and I can enter. I can ride the stock as long as SPY continues grinding up, or until the stock loses it's dominance to the market. \n\n\n\nNow let's imagine SPY suddenly crashes, my stock which has been stronger than SPY, is not going to crash as hard. And I can either wait for SPY to find support or take profits. \n\n\n\n*What does this dominating strength actually mean when stocks are outperforming SPY?*\n\n\n\nInstitutions. They are buying the stock for reasons you and I have no clue. But you want to follow in their footsteps and this is the way to see where they are putting their money into. \n\nThere also needs to be great volume to make sure the stock is being pushed and that it's not just algos testing liquidity levels.\n\nThis is no hocus pocus trading, this still needs a great amount of technical knowledge to master. It is not as simple as it sounds, but hopefully, you get the foundational idea behind this method. \n\n\n\nSPY first, then a stock that is dominating positively relative to SPY, and even better if it's also the strongest one in its sector.  \n\nThis is almost impossible to put everything in one post, so I will continue posting about this in the near future with real examples of some trades. \n\n\n\nHopefully, FOMC will bring action into SPY. Today has been painfully dull.\n\n\n\nFeel free to ask me if you have any questions.\n\n\n\nTrade well.\n\n\n\n-NK",
        "created_utc": 1726517402.0,
        "subreddit_name": "DayTrading",
        "comments": 60
    },
    {
        "title": "Apple's iPhone 16 Pre-Order Struggles: A Buying Opportunity? for NASDAQ:AAPL by DEXWireNews",
        "score": 4,
        "url": "https://www.tradingview.com/chart/AAPL/nazdf8lB-Apple-s-iPhone-16-Pre-Order-Struggles-A-Buying-Opportunity/",
        "content": "",
        "created_utc": 1726509321.0,
        "subreddit_name": "AAPL",
        "comments": 0
    },
    {
        "title": "iPhone 16 Demand 'Lower Than Expected,' AAPL Drops",
        "score": 1,
        "url": "https://i.redd.it/fyqp0aq2o6pd1.png",
        "content": "",
        "created_utc": 1726498518.0,
        "subreddit_name": "AAPL",
        "comments": 0
    },
    {
        "title": "Who the hell is running to buy an IPHONE 16?",
        "score": 0,
        "url": "https://www.reddit.com/r/AAPL/comments/1fi491f/who_the_hell_is_running_to_buy_an_iphone_16/",
        "content": "Not me! I still have IPHONE X and since the X there is no wow factor for me to spend $1,100-$1,600 for some new colors or a better camera, or faster chip. Whoaaaaaaaaaa, wait a minute! AI with SIRI which I never used because it sucked. Anyway. Let this stock tank and I’ll be back way below $200.00",
        "created_utc": 1726492286.0,
        "subreddit_name": "AAPL",
        "comments": 7
    }
]