[
    {
        "title": "Intel stock jumps on plan to turn foundry unit into subsidiary, allow outside funding",
        "score": 300,
        "url": "https://www.reddit.com/r/stocks/comments/1fierfw/intel_stock_jumps_on_plan_to_turn_foundry_unit/",
        "content": "Intel shares jumped almost 10% in extended trading on Monday after the company said it plans to turn its foundry business into an independent unit with its own board and the potential to raise outside capital.\n\nAs part of CEO Pat Gelsinger’s effort to turn around the struggling chipmaker, Intel said in a memo to employees that it will also sell off part of its stake in Altera.\n\nGelsinger said the restructuring would allow Foundry to “evaluate independent sources of funding,” and comes days after Intel’s board met to assess the direction and future of the company. The foundry business, which Intel plans to use to manufacture chips for other customers, has been a big drag on its bottom line, with the company spending roughly $25 billion on it for the last two years.\n\nBeyond just considering outside funding, Intel is weighing whether to spin off the foundry business, possibly into a separate publicly traded company, according to a person with knowledge of the matter who declined to be named to discuss confidential information.\n\nWith a standalone “operating board” and a cleaner corporate structure, the mechanics of a separation become far easier than trying to turn a fully-integrated unit into a separate company.\n\nIntel has lost almost 60% of its value this year, as the company has lost market share in its core PC and data center market and watched Nvidia run away with the market for chips that power artificial intelligence workloads. Last month, Intel reported disappointing quarterly results, sparking the sharpest selloff in 50 years, and said it would lay off over 15% of its workforce as part of a $10 billion cost-reduction plan.\n\nIntel will also pause its fab efforts in Poland and Germany “by approximately two years based on anticipated market demand,” Gelsinger said. The chipmaker will also pull back on its plans for its Malaysian factory. U.S. manufacturing projects will remain unaffected, the company said.\n\nThe company is also roughly halfway towards the layoffs announced in August, Gelsinger said.\n\nIntel also announced on Monday that it had entered into a deal with Amazon Web Services to produce custom chips for AI.\n\nThe move is a vote of confidence in Intel’s quest to manufacture custom chips for companies in its foundry business, in addition to designing its own products.\n\nIt extends a long-running partnership between the two companies. Amazon is a large end customer of Intel chips to power its AWS servers, and will buy a custom Xeon processor from Intel as well, Intel said.\n\nIt also will allow Intel a new foothold in the growing industry for AI server chips. While Intel has several products that can be used for AI, including one called Gaudi 3, Nvidia has largely taken control of the market.\n\nAmazon has developed its own AI chips, including one called Trainium, for over five years. Companies such as Amazon, Microsoft, and Google have invested heavily in custom chips to run AI in hopes that theirs would be less expensive or offer other advantages over than Nvidia’s general-purpose GPUs.\n\nThe company said that the chips would be made on the company’s 18A process, which is expected to be used in production in 2025. Analysts expect the manufacturing technology to be similar to TSMC’s forthcoming 2nm process. (The first chips using TSMC’s 3nm process are shipping now in Apple’s iPhone.)\n\nIntel said that it would perform its most advanced manufacturing, including the AI chip for AWS, at its plant in Ohio that’s currently under construction.\n\n“All eyes will remain on us. We need to fight for every inch and execute better than ever before. Because that’s the only way to quiet our critics and deliver the results we know we’re capable of achieving,” Gelsinger said.\n\nSource: https://www.cnbc.com/2024/09/16/intel-turns-foundry-business-into-subsidiary-weighs-outside-funding.html",
        "created_utc": 1726517905.0,
        "subreddit_name": "stocks",
        "comments": 147
    },
    {
        "title": "FDA clears Apple’s sleep apnea detection feature for use. Here’s how it works",
        "score": 209,
        "url": "https://www.reddit.com/r/stocks/comments/1fiahss/fda_clears_apples_sleep_apnea_detection_feature/",
        "content": "The U.S. Food and Drug Administration on Monday cleared Apple\n’s new sleep apnea detection feature for use, which means it will come to the Apple Watch Series 9, Series 10, and Ultra 2 later this month. \n\nSleep apnea is a sleep disorder that causes a person’s breathing to repeatedly stop and start throughout the night. The condition affects more than 30 million people in the U.S., but only around 6 million are diagnosed, according to the American Medical Association. If it goes untreated, sleep apnea can cause fatigue and lead to more serious health issues like heart problems, hypertension and Type 2 diabetes. \n\n“We are so excited about the incredible impact this feature can make for the millions of people living with undiagnosed sleep apnea,” Dr. Sumbul Desai, vice president of health at Apple, said in the feature’s launch video.\n\nApple’s sleep apnea detection feature marks the company’s latest attempt to position its wearables as a cheaper, simpler alternative to many existing health-care tests and devices. And the sleep disorder market could prove to be lucrative. \n\nTo get evaluated for sleep apnea, for instance, patients typically participate in an at-home test or an in-lab test where they’re monitored overnight. Prices vary depending on insurance coverage, but the average in-lab test costs $3,000, according to a 2022 study in the Journal of Primary Care & Community Health. \n\nAt-home tests are often less expensive, but they can still cost hundreds of dollars. The at-home sleep apnea test from Sleep Doctor costs $189, for example. Apple’s newest watch, the Series 10, starts at $399. \n\nApple’s sleep apnea detection feature is “potentially a game changer” for patients who have been reluctant to seek out testing, said Dr. David Kuhlmann, a physician who has treated sleep disorders for nearly two decades in Missouri. Kuhlmann also serves on the board of the American Academy of Sleep Medicine, which is a professional society for sleep medicine clinicians.  \n\nKuhlmann said the feature could be especially helpful for patients who sleep alone, and he thinks a lot of people will be surprised to find out they’re showing signs of sleep apnea.  \n\nEven so, Kuhlmann said users should approach Apple’s sleep apnea data with some caution, as readings could be erroneous. He said it is unlikely that insurance companies will begin paying for sleep apnea therapies like CPAP machines based on Apple Watch data alone, which is why it is important for patients to follow up with their healthcare providers to get an official diagnosis. \n\n“People do need to be diagnosed in order to be treated,” Kuhlmann told CNBC in an interview. \n\nKuhlmann said the feature will likely cause an increase in visits to health care providers, which could ultimately reduce costs for U.S. the health-care system overall. Ideally, if patients catch sleep apnea earlier, they can avoid paying for treatments for more serious conditions down the line.\n\n“By finding out that they have these underlying sleep disorders and getting them treated, it could potentially actually help save expenses and help improve quality of life.”\n\nHow it works \n\nApple’s sleep apnea detection feature works by analyzing a new metric that the company calls “breathing disturbances.” The Apple Watch identifies breathing disturbances by using an accelerometer to measure movements at the wrist that indicate disruptions to normal breathing patterns. \n\nUsers can view their nightly metrics in the Health app, where they’ll be classified as either “elevated” or “not elevated,” i.e., normal. Apple will analyze this breathing disturbance data once a month and notify people if they show “consistent signs” of severe or moderate sleep apnea. Users can view their data over a one-month, six-month or one-year period. \n\nThe Apple Watch Series 10 supports an 18-hour battery life, so people who are interested in using this feature will likely need to charge their device during the day.\n\nApple can also generate a report that users can bring to their doctors to discuss next steps. The report includes three months’ worth of breathing disturbance data as well as some additional information, the company said. Users can access educational materials within the Health app as well. \n\nApple said the notification algorithm was developed with “an extensive data set of clinical-grade sleep apnea tests,” and that the feature was validated in a clinical study.\n\n“Now I’m jonesing to get an Apple [Watch] so I can try it out on myself,” Kuhlmann said.\n\nSource: https://www.cnbc.com/2024/09/16/fda-clears-apples-sleep-apnea-detection-feature-for-use-heres-how-it-works.html",
        "created_utc": 1726507525.0,
        "subreddit_name": "stocks",
        "comments": 66
    },
    {
        "title": "Intel scraps coffee stations and phone benefits as financial pressures mount",
        "score": 3928,
        "url": "https://www.calcalistech.com/ctechnews/article/hk0ekgva0",
        "content": "",
        "created_utc": 1726459298.0,
        "subreddit_name": "wallstreetbets",
        "comments": 506
    },
    {
        "title": "iOS 18 is here, and it's Apple's most personal iPhone update yet",
        "score": 4668,
        "url": "https://9to5mac.com/2024/09/16/ios-18-new-features-now-available/",
        "content": "",
        "created_utc": 1726506367.0,
        "subreddit_name": "apple",
        "comments": 1390
    }
]