[
    {
        "title": "Apple becomes first U.S. company to reach a $2 trillion market cap",
        "score": 2879,
        "url": "https://www.reddit.com/r/investing/comments/icp5cv/apple_becomes_first_us_company_to_reach_a_2/",
        "content": ">Apple hit a market cap of $2 trillion, doubling in valuation in just over two years. It’s the first publicly traded U.S. company to reach the $2 trillion milestone. \n\n>Apple first reached a $1 trillion market cap on Aug. 2, 2018. Wall Street has largely expected Apple to be the first to surpass the $2 trillion mark. On July 31, Apple surpassed the state oil giant Saudi Aramco to become the world’s most valuable publicly traded company. \n\n[CNBC full article](https://www.cnbc.com/2020/08/19/apple-reaches-2-trillion-market-cap.html), [AAPL stock price](https://www.cnbc.com/quotes/?symbol=AAPL)",
        "created_utc": 1597848859.0,
        "subreddit_name": "investing",
        "comments": 500
    },
    {
        "title": "Apple is now worth $2 trillion",
        "score": 2499,
        "url": "https://www.reddit.com/r/stocks/comments/icpgzu/apple_is_now_worth_2_trillion/",
        "content": "Apple (AAPL) has become the first US company to reach a $2 trillion market cap.\n\n[Source](https://www.cnn.com/2020/08/19/tech/apple-stock-two-trillion-market-value/index.html)",
        "created_utc": 1597849860.0,
        "subreddit_name": "stocks",
        "comments": 357
    },
    {
        "title": "A guide for those looking to invest in Renewable Energy. (My Renewable portfolio with DD)",
        "score": 1953,
        "url": "https://www.reddit.com/r/stocks/comments/ice312/a_guide_for_those_looking_to_invest_in_renewable/",
        "content": "I've dedicated a large percentage of my portfolio to renewable energy companies and have obtained some knowledge on the sector and specific companies in doing so. I've noticed a trend of people inquiring about these companies so I hope that this post can provide some information. \n\n---------------------------\n\nI'll provide a brief bullish thesis and some information about my investments in renewables. These are in order of weight in my portfolio. \n\n------------------------------\n\nTesla (TSLA)     (511% gain) \n\nMost of us know what Tesla is about. They are the global leader in electric vehicles and will eventually come out with autonomous driving but I'll focus on their energy business. They sell solar panels with the lowest cost/watt of U.S. manufacturers, but this isn't the exciting part of their energy business. They are a leader in battery storage, which is an integral part of a renewable future. Energy storage systems store energy produced from solar panels and when the sun isn't shining, energy is consumed from the batteries instead. Also their autobidder software, which is out in trial in Massachusetts and Australia I believe, eventually will turn energy into a market place for Tesla customers. Read more about autobidder here: https://www.tesla.com/support/autobidder \n\nMy bull case for Tesla (specifically the energy side of the business) is that they will continue to innovate with their low cost panels, and be a leader in battery storage, plus leverage their autobidder software to bring added value to residential customers.\n\n--------------------------------------\n\nVestas Wind Systems (VWDRY)         (91.4% gain)\n\nhttps://www.vestas.com/~/media/vestas/investor/investor%20pdf/financial%20reports/2020/q2/2020%20q2_pres.pdf\n\nVestas is the leading manufacturer and installer of wind turbines. They have a global footprint and are expected to grow in line with the growth of the wind industry as a whole. A major growth engine in their business is going to be their expanding service and maintenance business, which has very high margins. My bull case for Vestas is that they are a unique pure play wind turbine company with years of experience in the growing industry. \n\n--------------------------------\n\nFirst Solar (FSLR).    (24% gain)\n\nFirst Solar is an American based solar module manufacturing and solar project operating company. Most of their business comes from corporate and grid level solar projects. Notably, they have Next Era Energy, Microsoft and Apple as customers. The real bullish case behind First Solar is around their differentiated Cadmium Telluride solar modules. Compared to the standard Crystalline silicon technology, First Solar's modules last longer and produce energy at higher efficiencies in hotter climates. \n\nMy bull case for First Solar is around their differentiated technology, strong balance sheet, and position as an American company, which typically warrants a higher P/E ratio than foreign companies. \n\n----------------------------------\n\nJinko Solar (JKS)         (22% gain)\n\nhttps://ir.jinkosolar.com/static-files/5a6d9266-d288-4ece-a0ea-f8e49ff60119\n\nJinko Solar is a leader is a Chinese based solar panel manufacturer. They produce low cost modules and also manage solar projects. Their business model is similar to First Solar's, however they trade at a cheaper valuation, due to being a Chinese company. You can read more about their technology on their investor relations page, but my main bull case for this company is around their position in South East Asia as a leading manufacturer, as this is undoubtably the biggest potential market for solar energy. \n\n--------------------------\n\nCanadian Solar (CSIQ)           (27.5% gain)\n\nhttp://investors.canadiansolar.com/events\n\nCanadian Solar is also a leader in the module manufacturing & project development business. They have a similar business model with Jinko and First Solar. Canadian Solar owns equity stakes in several of their solar projects, which gives them a source of recurring revenue. They also have a large footprint in American grid/commercial systems and are a market leader in North America. \nThey trade at an absurdly low 5 P/E ratio despite significant growth expectations in the coming years. \n\nMy bull case for CSIQ is around their ability to dominate the current market and potential to capitalize off of further market growth and consolidation towards the biggest solar companies. Also their current valuation is very intriguing. \n\n--------------------------\n\nSolarEdge (SEDG)           (126% gain)\n\nhttps://investors.solaredge.com/\n\nSolarEdge is the global leader in the Inverter space, with a 60% U.S. market share. For those who don't know, Inverter's turn the D.C. electrical current from the sun into an A.C. current, which is used by households. The inverter business is also much higher margin than the module (panel) business, due to there being fewer players in the industry. They are also expanding into energy storage and electric vehicle manufacturing. \n\nMy bull case around SolarEdge is around their market dominance in the Solar Inverter business, which will grow exponentially in the coming years plus future expansion in storage & EVs. They have a very strong management team as well. \n\n--------------------------\n\nTPI composites (TPIC).            (70.55% gain)\n  \nhttps://ir.tpicomposites.com/download/companies/tpicomposites/Supplements/TPI%20Earnings%20Deck%202Q20.pdf\n\nTPI composites manufacturers wind blades and sells them to wind turbine companies. They have long term contracts with the top 5 non Chinese wind turbine companies (Vestas, GE, Siemens, Nordex & Enercon.) 63% of total wind blade manufacturing is outsourced to companies like TPI and they are the market leader in this space with about 20% market share globally. The business currently has low margins, but they target a 12% EBITDA margin for the future, and they trade at a measly 0.74 P/S ratio currently. They are also expanding into EV composite manufacturing and have a contract with a certain EV company that I can't mention on this subreddit apparently (DM if you want more info) to manufacture vehicle parts for them.\n\n-------------------\n\nEnphase Energy (ENPH)        (46% gain)\n\nhttps://investor.enphase.com/static-files/81902e59-7d61-4693-aa86-8d54e63975b9\n\nEnphase is the sole producer of Microinverters, which are smaller inverters that go on individual panels and provide a safer, more efficient, but more expensive solution than the standard string inverters. Microinverters are used in smaller solar systems, mostly residential. They also have an energy storage business that is just starting to scale. Enphase and SolarEdge are competitors in both of these spaces, and are expected to be major players in the future. Like SolarEdge, Enphases' inverter business is high margin and expects rapid future growth, as the residential solar market grows. \n\nMy bullish case around Enphase is around their Microinverter technology, potential for expansion into storage and unique Ensamble home energy management system (read about Ensamble on the Investor relations page). \n\n-----------------------\n\nBrookfield Renewables (BEPC).          (12% gain)\n\nhttps://bep.brookfield.com/~/media/Files/B/Brookfield-BEP-IR-V2/events-and-presentations/bep-investor-brochure-q1-2020-vf.pdf\n\nBrookfield Renewables owns and operates renewable energy systems and projects. They sell energy produced from such systems to utility companies and have a recurring revenue stream. They also pay a 3.73% dividend yield. Their investments are split between Hydroelectric, solar and wind. \n\nMy bullish thesis around BEPC is the consistent cash flow positive revenue stream and relative safety in the business model. Also, they provide me with exposure to hydroelectric energy. \n\n--------------------------------\n\nLet me know if you have any comments, hold, or plan to buy any of these companies!\n\nNOTE: I'm 19 years old and have a 5-10 year+ timeline for holding/buying into all of these companies\n\nPS: These are not all of my holdings, just the renewable energy portion of my portfolio. (which including Tesla makes up more than half, exluding Tesla about 1/4)",
        "created_utc": 1597799799.0,
        "subreddit_name": "stocks",
        "comments": 316
    },
    {
        "title": "Apple becomes first public company to reach a $2 trillion market cap",
        "score": 5448,
        "url": "https://9to5mac.com/2020/08/19/apple-2-trillion-market-cap-2/",
        "content": "",
        "created_utc": 1597848696.0,
        "subreddit_name": "apple",
        "comments": 460
    }
]