[
    {
        "title": "7 Repairs, 1 Macbook Pro, Apple sent back a broken Macbook",
        "score": 5775,
        "url": "https://www.reddit.com/r/apple/comments/b421nv/7_repairs_1_macbook_pro_apple_sent_back_a_broken/",
        "content": "Friends, I am having to get my Macbook Pro serviced again.\n\nMy Macbook has needed repair 7 times so far. On this most recent repair, I told my representative, I wanted either a loaner or a replacement. I was told I couldn't have either.\n\nThere are 4 parts of the Macbook Pro. The screen. The top case. The bottom case. The logic board.\n\nI sent it in for repair number 6, with a note included with the Macbook, with a list of problems that need to be fixed. One of those problems on the list was GPU death. The GPU is dying. It is causing problems in my day to day use of the computer. Apple sent it back, and replaced the screen, the top case, and the bottom case, but not the logic board.\n\n&#x200B;\n\nI'd like to point out that after this upcoming repair, i wont have a single original part from before the last repair. I was told \"no replacement\". So Apple will replace all 4 parts, and waste 2 weeks of my time, but Apple won't give me a replacement.\n\n&#x200B;\n\nUnfortunately, the Apple representative on my case, called me back after my Macbook returned, and instead of giving me a resolution, she told me I had to prove it. I had to prove the GPU death. She had another advisor call me and had me run a diagnostic tool on the computer. I very very easily captured these logs with Apple's tool, and we proved GPU death. Well, now she's on vacation. For a whole week. Nobody else able to take over my case. I feel like she called me a liar, then left on vacation. My Macbook is crashing. Videos won't finish playing without the GPU restarting itself/crashing.\n\n&#x200B;\n\nThis is Apple top tier customer service. I'm ready for the downvotes. 7 repairs, 1 student, I just want a working computer. I don't mistreat my device. It dies every 3-6 months.\n\n&#x200B;\n\nEdit: a lot of people here seem to really like Rossmann Repair Group. I'm going to link their YouTube [https://www.youtube.com/channel/UCl2mFZoRqjw\\_ELax4Yisf6w](https://www.youtube.com/channel/UCl2mFZoRqjw_ELax4Yisf6w)\n\nHe exposes a lot of the anti consumer practices Apple is guilty of. He also educates people on component level repair. I highly recommend. He also does Twitch streams, and he has an active Discord community.\n\n&#x200B;\n\nEdit 2: I decided to call Apple and ask to speak with Customer Relations. The senior advisor on the phone refused to transfer me to customer relations because my rep \"owns my case\" and told me that this is out of the scope of customer relations. I was hung up on.\n\nEdit 3: I've decided to leave a voicemail for Tara Bunch\n\nEdit 4: I'm still trying to get to customer relations or executive relations. I got hung up on once again already, and I'm calling for a 3rd time.\n\nEdit 5: One of my senior advisors I got on the phone read this thread\n\nEdit 6: The senior advisor called me back. He tried to call the apple stores to ask if I could have a loaner. They told him no, and that there was no way to track it or something. They keep suggesting I buy a 2nd one, to return after a few weeks.\n\nEdit 7: The senior advisor was the nicest person I've gotten on the phone all day. They told me they emailed executive relations, and that they have acknowledged the email and said they would \"handle it appropriately\"\n\nEdit 8: I received a call back from Executive Relations, and they told me that I have to wait until Monday for the other agent to return from vacation. They told me that there will be no loaner device provided to me. They told me that there is no way to get around having to wait 9 days while my agent was on vacation. I asked the executive relations agent to let me talk to their boss, or talk to another agent, and they told me no. I asked for her to send me an email summarizing the conversation we had over the phone. She told me no. She refused to document this in any form of writing. I asked her if I was free to call back and record the conversation, and her response was that they do not consent to call recordings. A bunch of thieves if you ask me.\n\n&#x200B;\n\nEdit 9: It's Sunday now, and the J key on my keyboard has started to not go down all the way, it's mushy now. These keyboards are junk.\n\n&#x200B;\n\nEdit 10: It's the next week now, and we're sending it in for repair number 7. No loaner device. \n\n&#x200B;\n\nFor some reason a lot of you guys seem to think my computer is out of warranty, or that it has ever been out of warranty during any of these repairs, and that is not true. My computer has been in warranty the entire time.\n\n&#x200B;\n\nSome of you guys seem to think that Apple has no legal obligations to make sure I have a working computer after I purchased one, with a warranty attached. My replacement I got after the 4th repair is also still defective and therefore is not a resolution to my problem. I'd like to link this here for you guys to read up on. It's called the Magnusson Moss Warranty Act, and is one of the consumer protection laws regarding warranties and repairs [http://uscode.house.gov/view.xhtml?req=granuleid%3AUSC-prelim-title15-chapter50&edition=prelim](http://uscode.house.gov/view.xhtml?req=granuleid%3AUSC-prelim-title15-chapter50&edition=prelim)\n\n&#x200B;\n\nAnother law I'd like to put here applies to citizens of California. I was residing in California when I received my computer, and still have a residence in California. I'm not sure if I would have much luck pursuing anything with California laws, but for those who are unaware; a computer like this, should have 7 years of warranty and repairs according to the state of California. It states everything with a wholesale price of $100 or higher is required to have 7 years of service, repair, and availability of working parts. I learned about this law when I worked for AppleCare.\n\n[https://leginfo.legislature.ca.gov/faces/codes\\_displaySection.xhtml?lawCode=CIV&sectionNum=1793.03](https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1793.03).",
        "created_utc": 1553239552.0,
        "subreddit_name": "apple",
        "comments": 1102
    }
]