[
    {
        "title": "Tech leaders are calling for an A.I. pause because they have no product ready, Palantir CEO says",
        "score": 2195,
        "url": "https://www.reddit.com/r/stocks/comments/1453tou/tech_leaders_are_calling_for_an_ai_pause_because/",
        "content": "https://www.cnbc.com/2023/06/09/tech-leaders-ai-pause-no-product-ready-palantir.html\n\nPalantir’s boss Alex Karp opposes the idea of a pause in artificial intelligence research, in contrast to an open letter from the Future of Life Institute signed by some of the biggest names in the tech industry. The letter, which has garnered over 31,000 signatures including names like Tesla CEO Elon Musk and Apple co-founder Steve Wozniak, called for a pause on AI research on models larger than GPT-4, which powers tools such as ChatGPT. The letter also said that if “such a pause cannot be enacted quickly, governments should step in and institute a moratorium.” Speaking to BBC Radio in an interview broadcast Thursday, Karp said he is of the view that “many of the people asking for a pause, are asking for a pause because they have no product.”\n\nHe added, without naming anyone, that this is because “people who have nothing to offer want to study AI,” but by taking a pause, this could lead to adversaries stealing a lead in not only commercial applications, but also military applications. To him, “studying this and allowing other people to win both on commercial areas and on the battlefield” is a really bad strategy. When asked if what he wanted was an “A.I. race” akin to the arms race of the Cold War, Karp simply stated that “there is already an A.I. arms race, it’s just we’re ahead, [and] it’s not like if we slow down, the AI race will stop.”\n\nHe pointed out that the “single most important event” in this race is not large language models like GPT-4, but instead how AI has been utilized in military applications. Karp points out that Ukrainian forces have used Palantir technologies to gain a technological edge over invading Russian forces. A report from The Times in December 2022 revealed that Palantir’s AI has allowed Ukraine to increase the accuracy, speed and deadliness of its artillery strikes despite having comparatively smaller artillery forces. Palantir sells software to governments and private sector organizations which help them analyze large quantities of data. The advent of this AI-powered software on the battlefield “just throws down a gauntlet to every single country in the world,” Karp said. He added, “especially [to] our adversaries, they cannot afford for us to have this advantage. And so, the race is on. There’s only a question of do we stay ahead or do we cede the lead.”",
        "created_utc": 1686313481.0,
        "subreddit_name": "stocks",
        "comments": 324
    }
]