[
    {
        "title": "I'm giving away an iPhone 11 Pro to a commenter at random to celebrate Apollo for Reddit's new iOS 13 update and as a thank you to the community! Just leave a comment on this post and the winner will be selected randomly and announced tomorrow at 8 PM GMT. Details inside, and good luck!",
        "score": 28710,
        "url": "https://www.reddit.com/r/apple/comments/d7ejpn/im_giving_away_an_iphone_11_pro_to_a_commenter_at/",
        "content": "24 hours is up and the winner is announced! https://www.reddit.com/r/apolloapp/comments/d7vsh0/and_the_winner_of_the_iphone_11_pro_is/\n\nHey!\n\nI build a Reddit client for iOS called [Apollo for Reddit](https://itunes.apple.com/app/id979274575). In a sentence, it's an iOS-focused Reddit app (not crossplatform, iOS only) that's an alternative to the official app with the goal of being speedy, comfortable to use, great media browsing, and just the best iOS has to offer in general. I loved Alien Blue, and wanted to build something as powerful and awesome as it, but with the goal of feeling even more like an iOS-first experience. [Here's a link](https://itunes.apple.com/app/id979274575)\n\nI started working on Apollo right after I finished working at Apple in the summer of 2015, worked on it through 2017 when it finally got released, and it's been my full time job since.\n\nI love that I can build such a fun and exciting app every day, and no bullshit, it's only because of the support of the Reddit Apple community that I've been able to. There's no ads, no investors, only optional support from you guys to sustain the app. It's built solely with the goal of making Redditors happy and I do my absolute best to be active in the community and base the app around its feedback.\n\nSo as a thank you, and to celebrate many sleepless nights working on the iOS 13 update that's now live, I wanted to do a lil giveaway open to anyone in the community. I'm not Unbox Therapy so it's not a pick up truck full of iPhones, but I thought giving away an iPhone 11 Pro (or Pro Max) could be a fun way to say thanks (or a regular iPhone 11 if that's what you want).\n\n### How do I enter?\n\nJust comment and you're entered. If you want something to comment about, uhh, help me name [the Apollo mascot](https://apolloapp.io). You have [24 hours](https://www.wolframalpha.com/input/?i=how+long+until+4+pm+september+22+2019+halifax%2C+nova+scotia+time).\n\n### What do I win?\n\nAn iPhone 11 Pro or Pro Max or regular 11 (maybe you want that nice red). 256GB. Color of your choice.\n\n### Any rules?\n\nYour Reddit account has to have been created before this thread was posted to prevent a bunch of duplicate accounts posting. Also I'll PM you if you win, you have 48 hours to respond to the PM (will go out Monday) or it'll go to the next person. All countries accepted so long as it's not impossible to get it to you.\n\n### What's in Apollo's iOS 13 update?\n\nLike I said Apollo's really focused on being the best iOS has to offer and really feeling at home on the platform. iOS 13 brought a bunch of really cool stuff, so I wanted to support as much of it as I could on day 1. So Apollo has support the (finally) system dark mode, the new haptic touch context menus, super fast launch times, there's Siri Shortcuts support so you can say [\"normie garbage\" and have it open r/dankmemes](https://www.reddit.com/r/apolloapp/comments/90b66h/yo_is_apollo_gonna_support_siri_shortcuts/) or just build cool systems in the Shortcuts app in general. There's also multi-window support on iPad which is super cool. Hell, iOS 13 even supports PS4 and Xbox One controllers now so I added support for those. I really wanted to build something that didn't feel like a cross-platform, half Android /Material Design mixture, but instead feels like it was built from the ground up for iOS.\n\n### Should I give Apollo a try? I don't mind the official app tbh\n\nThe official app's really cool, built by some super smart people, I even got to meet some of the engineers at WWDC this year. Utmost respect. It's kinda like a car though, you might use your car, it might get you from point A to point B fine, it's a solid enough car, why switch? Well, you might sit in a friend's car, find it just a bit more comfortable, maybe a bit speedier, sportier, appreciate some of the design choices better, and overall just find it a more enjoyable experience. Apollo Car has a really awesome media viewer, fast swipe gestures, speed, GIF scrubbing, a subreddit Jump Bar, really great comments view, and much more that you really have to see first hand. On top of this, in this analogy the competing car is free, [so why not try it](https://itunes.apple.com/app/id979274575). :P \n\nOh here's a quick album of screenshots I put together: https://imgur.com/a/UO2J10s (There's light mode too if you're into that!)\n\n### I have an idea for your app!\n\nSick, that would make for a great comment, please do. :D I genuinely build the app solely planned around community feedback, so I'd greatly appreciate it!\n\n\\- Christian\n\n24 hours is up and the winner is announced! https://www.reddit.com/r/apolloapp/comments/d7vsh0/and_the_winner_of_the_iphone_11_pro_is/",
        "created_utc": 1569092008.0,
        "subreddit_name": "apple",
        "comments": 82927
    }
]