[
    {
        "title": "China’s growing property crisis: a look onto a few spill over scenarios",
        "score": 1316,
        "url": "https://www.reddit.com/r/investing/comments/prw7it/chinas_growing_property_crisis_a_look_onto_a_few/",
        "content": "**Further conclusions (ADDED sep 22)..**\n\n* Chinese indexes opened on Wednesday and didn't show panic. Media coverage in China shows that Evergrande news are secondary or even tertiary (possibly sidelined) to avoid stark main streets reactions \n\n* Onshore (local) bond payments of Evergrande have been resolved through negotiations off the clearing house, which a implies delayed payment schedule. (this is saying bond is paid on Sep 23, without payment actually happening on Sep 23)\n \n* According to bond covenants (bond agreement terms) Evergrande may have 30 days to pay its unpaid or partially paid bond interests/coupons if not completely paid on the agreed date without facing penalties ... hence the unfolding of the crisis due to unpaid onshore and offshore bond obligations may take months, which provides the Chinese gov with ample time to inject liquidity, trim & restructure the Evergrande empire as well as externalise toxic assets. Thus containment is likely, bits and pieces may resurface in 202 when more data about China based land and property sales is available, steering further market sentiment in positive or negative direction.\n\n* Possibly most of the upcoming gov & authorities' involvement will happen behind curtains, so we won't learn much about the evolution of this drama in the news.\n\n* markets in US, EU and Asia will likely calm down short-term until big quarterly data dumps show the impact on China market sentiment, incl. Caixin Manuf. PMI, Services PMI and Commodity Index\n\n\nAssumptions…\n\n* 70% of wealth in China is held in property (elsewhere average is btw. 20 to 35%)\n\n* Evergrande’s international payment obligations are due on Thursday\n\n* 1/3 of current China GDP is created by construction and property related activity (builders, materials/commodities, industrials/machines, services, etc) \n\n* China property market (sales) has been lagging for some months already\n\n* a lot of Chinese investors have been harmed by the gov's regulatory actions in respect to Chinese tech companies (declining tech stocks), hence sentiment sensibility is heightened\n\n* holidays in China until wednesday .. markets are closed... thus delayed reaction of Chinese main street\n\n* Evergrande's total assets approx. 2trillion RMB (2% of China’s GDP) and complex structure (+200 offshore & almost 2000 onshore wholly and non-wholly owned subsidiaries). Accounts for roughly 4% of China’s total property sales. Its over 123,000 employees and 3.8 million contractors make up a fraction of China’s over 400 million urban labor force.\n\n* 40% of mainland China based bank loans are backed by properties\n\n\nFurther Information\n\n* Insightful article (English) from China's leading business magazine Caixin (China's version of WSJ/FT) about the internal dealings (various schemes & crowdsourcing debts)  of Evergrande    https://archive.is/8QjU6  \n* based on the article there could be a large volume of hidden debts and other obligations off their balance sheet\n* it will likely take years longer to complete the portfolio of 800 building projects under construction, because of unpaid contractors and due to Evergrande having to pay other obligations first\n* in respect to the complexity of Evergrande's assets, holdings, financial products and corporate constructs, it may take the Chinese gov months to accomplish at least the minimum of insight into the breadth of the longterm financial obligations\n* UBS estimates that $19 billion of Evergrande’s liabilities are made up of outstanding offshore bonds.\n* in the case of bankrupt developer Yinyi Group (approx. July 2019) the process from application to restructuring kickoff took 2 years (Dec 11, 2020 signed reorganization Investment Agreement), yet it seems to have partially failed because investors didn't come up with the required funds (Link Bloomberg Law: https://news.bloomberglaw.com/bankruptcy-law/yinyis-investor-fails-to-wire-required-funds-for-restructuring) (2nd payment up until July apparently was also much lower than agreed by courts).... these things take long in China and are very intransparent, yet they may suffice as means of containment\n\n\n\nMarket impact\n\n* after digging into surrounding circumstances many analysts (jeffries, JPM, MS, citi, UBS, Barclay, Fidelity) believe that systemic distress is not evident, risks are priced in and that contagion can be avoided  ([Bloomberg!] (https://www.bloomberg.com/news/articles/2021-09-21/wall-street-s-message-on-evergrande-china-has-it-under-control)\n\n* we may see more market tremors once Chinese markets are open (wednesday), so Tuesday may be green in US and Europe in the verge of slight rebounds\n\n* a large net injection may signal Beijing’s intent to reduce systemic stress. If the Peoples Bank of China withdraws funds, that could mean it’s prepared to tolerate higher market volatility as the developer moves closer to a default.\n\n\n\nOutlines of 3x spill over scenarios \n----------------------------\n**1.) Unorderly containment + large spill over**\n\nEvergrande default spills over to other property and real estate firms in China.. with unorderly containment, leading to a considerable decline in many related industries (incl. services) due to panic and liquidity-squeeze-related market actions. Property prices in China would collapse and lead to a moderately sized property sell-off -> the rather significant negative GDP impact would hit Chinese wallets directly, leading to severe repercussions for China-focused firms (global) and China’s future growth in general\n\n-> large impact on international markets (most sectors), global crisis potential, quicker decline of China’s GDP, FED would have to delay tapering \n\n\n**2.) Orderly containment - moderate spill over**\n\nEvergrande default spills over to other property firms in China.. with orderly containment, resulting in a moderate decline in a few related industries (construction, concrete/steel, machines, real-estate) -> the GDP decline would impact China’s domestic spending/consumption power moderately and lead to a medium-long term cooling of the China property market with rather big slow down of international commodity markets (spec. looking at Australia, New Zealand, South Africa)\n\n-> moderate impact on international markets (few sectors only), less long-term effects, slow-paced decline of China’s core GDP\n\n\n**3.) Orderly containment - small spill over**\n\nEvergrande default spills over to a few selected property firms in China (with extra large debts). China’s gov steps in quickly and aggressively to ensure an orderly containment with a direct relief to calm down markets, resulting in a small decline in a few related industries (construction, concrete/steel, machines, real-estate) -> the slight GDP decline would result in rather short-term consequences for China’s domestic spending/consumption power. The CCP would at least manage to keep China's property prices stable thus not affecting savings/wealth of the main street too significantly; the spill over effects would be barely visible.\n\n-> only short-term / slight impact on international markets (selected sectors only)\n\nEDITED: added 2 assumption bullets\nEDITED #2 (21.9.21): added info article\nEDITED #3 (22.9.21): added further conclusion",
        "created_utc": 1632148733.0,
        "subreddit_name": "investing",
        "comments": 450
    }
]