[
    {
        "title": "Amazon drops 137 billion in marketcap - a record.",
        "score": 3163,
        "url": "https://www.reddit.com/r/stocks/comments/out55s/amazon_drops_137_billion_in_marketcap_a_record/",
        "content": "Amazon drops 7.5% today after earnings, losing 137.25 billion in one day. This is the biggest marketcap drop in one day. To put in perspective, if markets were flat, amazon alone would contribute 0.3% in sp500, 0.63% in QQQ, 1.65% for consumer disc sector. The drop is enough, in theory, to send 1100 dollars to every us household.\n\n Only 98 companies worldwide (of which 59 is us) have a marketcap of 137 billion+. In terms of marketcap leaders, apple is 2.4 trillion, microsoft is 2.15 trillion, google is 1.8 trillion, amazon is 1.67 trillion. google surpasses amazon in marketcap due to strong surge as earnings beat expectations by more than 40%. amazon missed revenue and guidance was below expectations. this is one of the few times amazon misses earnings, previous miss was in October 2018, and one of the worst % drops for amazon not including 2000,2008 crash. Also jeff bezos fell to 2nd richest after today's drop.\n\nIn my opinion, this drop is exaggerated. most of the drop is because of sales dropping and bad guidance, but most of revenue comes from retail. But most of the profit comes from aws and ads, and both of the business has accelerated this year. Retail is low margin business, usually 2-3% whereas 20-30% for ads and aws. so aws and ads revenue is 10 times more valuable. People pay attention to revenue as a whole instead of the segments making the profits. If i would break down segments by importance it would be: 40% aws, 25% ads/other, 35% store. I think the aws/ads accelerating would increase stock price so if store was its own company, it would be a 22.5% drop. this drop is unjustified. I would consider to buy this stock but im more of an etf guy, so i dont have a position.\n\nsources: companiesmarketcap, vanguard/nasdaq site.",
        "created_utc": 1627676561.0,
        "subreddit_name": "stocks",
        "comments": 485
    }
]