[
    {
        "title": "Technology stocks are crashing – what now",
        "score": 4052,
        "url": "https://www.reddit.com/r/investing/comments/lqfhuz/technology_stocks_are_crashing_what_now/",
        "content": "A friend just messaged me saying that his portfolio lost 10% of its value recently and that this was complete doomsday. Judging by the futures, the NQ is down 6.8% from its highs (a 1.8% gap down this morning alone). I get that, it's frustrating.\n\nIt is also noteworthy that the sell-off hurts technology stocks in particular. But mind that they were also the largest beneficiary in recent months:\n\n* Nasdaq 100 is 53% above its weekly 200 EMA.\n* S&P 500 is 31% above its weekly 200 EMA.\n* DJIA is 19% above its weekly 200 EMA.\n\nWhich one is going to be hurt first and foremost once a correction is underway? Of course it's going to be the most stretched industry sector. Information technology is 28% of the S&P 500, and 20% of the DJIA.\n\nIf you buy stocks, you've got to have conviction in them. You've got to know what you are buying. Am I going to dump all my holdings just because they're \"overvalued\". Of course not. I'm going to hang in there with stocks going down 30% and then come back up 80%. Even if that takes another 3 years. It's the nature of the market and it is great at weeding out the less convinced.\n\nVolatility is the price you pay for your returns.\n\nIf you held Apple all these years, you are sitting on a fortune now. Same goes for Amazon and many other megabrands of today. Amazon went top to bottom 60% several times in its history. You've got to have conviction in what you're buying to hold onto such kind of volatility. I also go to the grocery store to pick my favorite marmalade brand. If there's a 30% discount I'll pile up. But you cannot ever pile up if you don't have conviction in your holdings in the first place.\n\nSo here's what I would do. Go through your portfolio name by name. Ask yourself why it's there in the first place. Start with \"I own XYZ because...\". Warren Buffett had also advised it in one of his interviews. If you can't tell that story, sell it off. It doesn't belong in your portfolio. Free up that cash so you can pile in when spectacular opportunities arise in future.",
        "created_utc": 1614076976.0,
        "subreddit_name": "investing",
        "comments": 1587
    },
    {
        "title": "Morning Update for Tuesday, 02/23/21",
        "score": 246,
        "url": "https://www.reddit.com/r/Daytrading/comments/lqiy9k/morning_update_for_tuesday_022321/",
        "content": "Good morning everyone! Hope your Tuesday is a good one.\n\nI want to make a quick clarification and say that this post and list is geared towards day trading, and I am not advocating to blindly buy and hold these at all, in fact I advise strongly against that. \n\n*With the small cap stocks especially, I am typically in and out very quickly, only occasionally longer than 5-10 minutes, usually faster scalps.* I am also constantly watching the candlestick charts and observing price action and volume, and you should be doing the same if you want to trade these stocks. Always have a plan when you enter a trade (for profit taking and for taking a loss), and use proper risk management.\n\n**Large Cap Watchlist (*****over $10*****)**\n\n* Gapping UP: TCOM, ZNH, SM, ZI, UVXY\n* Gapping DOWN: CCIV, MARA, RIOT, CAN, FUBO, CPSH, NCTY, NLS, BTBT, QFIN, BNGO, API, SUNW\n\n**Small Cap Watchlist (*****under $10*****)**\n\n1. CTIB: Leading gapper, but couldn't find a catalyst. Seeing good volume and decent price action in the premarket. Premarket resistance around 4.25-4.27, with possible support near 3.53. \n2. BBIG: Gapping up after acquiring Lomotif. Seeing decent volume and price action in the premarket, with a premarket high of 6.76. \n3. DWSN: Gapping up following the seismic survey market analysis and forecast. Seeing good volume in premarket, but currently showing some weakness in price action.  \n4. CSCW: Gapping up on news of upgrade for AI and VR technologies. Seeing good volume and price action in the premarket. Currently has a premarket high of 1.12. \n5. PLX: Gapping up on positive update for drug candidate. Seeing decent volume in the premarket, but I'll want to see some more smooth price action either later in premarket or after market opens. \n6. ONCY: Gapping up on release of data for anti-cancer drug. Seeing decent volume, but I'll want to see some more price action. Premarket support around 3.40. \n\nAnother red open for the market today. Some stocks are getting hit harder than others, but it's not looking great. SPY is currently sitting just below 385, and we should prepare to see additional downwards movement. TSLA is down over 5% in premarket after dropping over 8% in yesterday's trading. Bitcoin is seeing some more selling off, and is currently sitting at around 48,700. Bitcoin-related stocks are getting hit hard. Marijuana stocks are also getting hit this morning. Not much green in the market this morning. I'll be watching UVXY and SOXS to try to take advantage of volatility and any downward movement. As I said in the recap last night, I'm a bit unsure of the market at the moment, and I will be cautious in my trading.\n\nRemember to use proper risk management, and make sure you size appropriately for your account. Happy trading everyone :)",
        "created_utc": 1614088558.0,
        "subreddit_name": "Daytrading",
        "comments": 69
    },
    {
        "title": "AAPL future short term price",
        "score": 14,
        "url": "https://www.reddit.com/r/AAPL/comments/lqiblv/aapl_future_short_term_price/",
        "content": "Some three weeks ago I wrote in a post here that AAPL is heading for 120 before it stabilises and goes up again. \n\nI invest in AAPL since 1996. My today suggestion is you HOLD.  It can go even at 115 but it’s hard to fall below 105. \n\nThis quarter will test the limits of the stock. It’s nothing unexpected. The bears will try and make you sell. Don’t ! \n\nEven if we roll this way and reach pre split figures, rest assured that there will be a bounce. A good sign will be an above or an at least 10% increase on dividends. And don’t forget that we have 100$ billion in buybacks and APPLE loves to buy on the downsides. And remember to check on the daily volumes. All this drag favours the long timers and the hedge funds. \n\nDon’t panic. It’s silly. The stock needs to wait for the 200 Moving Average to break even with the 50 days. \n\nWait. The stock and Tim have a lot to give.",
        "created_utc": 1614086612.0,
        "subreddit_name": "AAPL",
        "comments": 9
    },
    {
        "title": "Apple has got to release a new product ASAP",
        "score": 8,
        "url": "https://www.reddit.com/r/AAPL/comments/lqo9qb/apple_has_got_to_release_a_new_product_asap/",
        "content": "If apple doesn’t release any new product ASAP, the downward trend will continue. Already lost 20k on my options with apple. Otherwise the next resistance I see is 110.",
        "created_utc": 1614102279.0,
        "subreddit_name": "AAPL",
        "comments": 45
    },
    {
        "title": "Apple is in the ‘penalty box’ but should resume uptrend at this key level, Oppenheimer says",
        "score": 3,
        "url": "https://www.cnbc.com/2021/02/23/apple-is-in-the-penalty-box-but-should-resume-uptrend-oppenheimer.html",
        "content": "",
        "created_utc": 1614089728.0,
        "subreddit_name": "AAPL",
        "comments": 2
    },
    {
        "title": "Ugh",
        "score": 3,
        "url": "https://www.reddit.com/r/AAPL/comments/lq9au1/ugh/",
        "content": "What’s with all the stories coming out essentially saying Apple isn’t going anywhere? Seeking Alpha had one today by some guy short on Apple. Berkshire Hathaway has sold a bunch of Apple recently. What the heck? Apple is killing it right now. Is this just stupid market manipulation crap?\n\nHalf my portfolio is Apple and obviously I don’t like hearing this stuff.",
        "created_utc": 1614054917.0,
        "subreddit_name": "AAPL",
        "comments": 5
    },
    {
        "title": "Let's not panic here - This selloff is a healthy market reaction to rising treasury yields",
        "score": 4895,
        "url": "https://www.reddit.com/r/stocks/comments/lqhbv5/lets_not_panic_here_this_selloff_is_a_healthy/",
        "content": "**Disclaimer:** I'm heavily simplifying a very complex topic for the sake of keeping this post brief.\n\nFolks, close your trading app. Take a deep breath. Relax.  This is not the apocalypse. This is not the armageddon.\n\nBefore I get into what's happening, here is a bit of perspective: Even with yesterday's selloff, NASDAQ ended at 13,533. I can't see what the index is like pre-market, but QQQ is down 1.35% as I write this. So let's assume it opens 13,350.\n\nThat's still 280 points higher than the post-January selloff (low of 13,070). That's also still 462 points higher than December 31st (we closed at 12,888). In %, that's 2.14% and 3.58% higher, respectively.\n\nNow I know that a lot of you are trading on highly volatile stocks (looking at you, CRSR and PLTR), so obviously they are hit much harder than NASDAQ. That's the nature of the beast. Volatile stocks = large swings, both up and down. Welcome to the flip side. I have some of those in my portfolio, and also some defensive and cyclical stocks. It sucks those volatile positions deep in the red. I know how you all feel.\n\n&#x200B;\n\nNow, what's happening?\n\n**Treasury yields are rising.** That's what's happening. There's obviously more to it (I.e.: vaccination seems to be going relatively well, Biden's stimulus, etc.), but that seems to be the catalyst. In fact, the 10-year yield rose to its highest level in the last year, at 1.37%. **That's a good thing:** Rising yields are a sign of economic recovery and increasing economic activity. It's a good thing.\n\nWhy are yields rising if interest rates remain low? Because of one of the fundamentals of yields: As bond prices rise, everything else being equal, yields will drop. And the inverse is also true. As bond prices drop, yields will rise. And right now, bond prices are dropping. People are becoming more and more optimistic about the prospect of recovery, with Biden's stimulus and with the vaccination that is (once again, relatively) going well. So they are exiting \"safe\" investments with lower yields in favor of riskier investments with higher yields: junkier bonds, stock market and alternative investments.\n\nWait, if rising yields are a sign of people exiting the bond markets to go towards the stock markets, why are prices dropping????? Great question, and my answer is twofold: (1) NASDAQ is not even in market correction territory, Chill. It closed roughly down 5% from all time highs yesterday. (2) Look at S&P500 and DIJA. DIJA is a winner in this, and S&P is barely phased.\n\nSo back to my explanation, people are leaving bond markets for markets with higher potential returns, and the stock markets is one of them. Now, the reality is that rising yields are not always immediately good for markets, especially overheated markets like NASDAQ: This can spook a lot of investors and cause a selloff, which is essentially what's happening right now. This doesn't mean, however, that the apocalypse is upon us. Remember one of the reasons why the markets have skyrocketed so much in the last year: Actual interest rates, not yields, are near zero, and will remain near zero for the foreseeable future. This is crucial. New bond issuance will still have shit for yields, this isn't changing.\n\n&#x200B;\n\n**What should we do?** That's entirely up to you. I'm no financial advisor. I'm no expert. Take everything I say with a massive grain of salt. I'm no expert. But really, I'm barely doing anything. I'll be taking a page from Cathy's book: keeping a close eye on when this new craze slows down, sell some of my \"safer, less impacted stocks\" to raise cash and buy the ones that were hit hardest.\n\n&#x200B;\n\n**FEBRUARY 24th EDIT:**  Currently happening live: Powell addresses the House Financial Committee, you can watch it [here](https://www.bnnbloomberg.ca/watch-live-powell-addresses-house-financial-committee-1.1490838)... pardon the Canadian website. Key word to calm inflation fears: Their inflation goal is an **average** of 2%. Given that inflation has been under 2% for a prolonged period of time now, I imagine this means they would be comfortable with higher inflation (above 2%) for a prolonged period. This is good",
        "created_utc": 1614083421.0,
        "subreddit_name": "stocks",
        "comments": 910
    }
]