[
    {
        "title": "Goldman says Apple will have to cut 2019 numbers even further, compares iPhone maker to Nokia",
        "score": 1503,
        "url": "https://www.reddit.com/r/investing/comments/ac5aw5/goldman_says_apple_will_have_to_cut_2019_numbers/",
        "content": "https://www.cnbc.com/2019/01/03/goldman-sachs-says-apple-will-have-to-cut-2019-numbers.html\n\n* * *\n\nShortly after Apple slashed its revenue guidance for the first quarter, Goldman Sachs said the iPhone maker will likely have to bring down numbers for the full year. As those results drop further, so will the company's shares, the firm said.\n\n\"We see the potential for further downside to FY19 numbers depending on the trajectory of Chinese demand in early 2019,\" wrote Goldman's Rod Hall in a note to clients late Wednesday.\n\nThe company sees first-quarter revenue of $84 billion vs. a previous guidance of a range of $89 billion and $93 billion. Analysts expected revenue of $91.3 billion for the period, according to the consensus estimate from FactSet. Apple blamed most of the revenue shortfall on a slowing economy in China in the second half.\n\nApple shares dropped more than 9 percent to $143.70 in premarket trading after ending the first day of 2019 at $157.92. And Goldman's Hall slashed his 12-month forecast to $140 from $182. He also lowered his full-year 2019 revenue estimate by 6 percent to $253 billion and his full-year EPS estimate by 10 percent to $11.66.\n\nNokia comparison\n\"We have been flagging China demand issues since late September and Apple's guidance cut confirms our view,\" wrote Hall. \"We do not expect the situation to get better in March and would remain cautious on the region.\"\n\nBut the analyst went further, comparing Apple to the fallen phone maker Nokia, which became reliant on customer upgrades in the face of a saturated market more than a decade ago. Customers delayed replacing their phones for longer and longer as economy slowed, Goldman notes.\n\n\"Nokia saw rapid nexpansion of replacement rates in late 2007 that was well beyond what any linear forecast would have implied,\" wrote Hall. \"Beyond China, we don't see strong evidence of a consumer slowdown heading into 2019 but we just flag to investors that we believe Apple's replacement rates are likely much more sensitive to the macro now that the company is approaching maximum market penetration for the iPhone.\"\n\nGoldman got to its new price target by applying just a 12 multiple to the firm's new earnings estimate. Its previous price-earnings ratio was 13.6.",
        "created_utc": 1546518788.0,
        "subreddit_name": "investing",
        "comments": 505
    },
    {
        "title": "Tim Cook will host meeting for all Apple employees to talk iPhone; specifically about the revelations regarding stalling iPhone sales.",
        "score": 11723,
        "url": "https://www.cultofmac.com/598744/tim-cook-will-host-meeting-for-all-apple-employees-to-talk-iphone/",
        "content": "",
        "created_utc": 1546516047.0,
        "subreddit_name": "apple",
        "comments": 2708
    }
]