[
    {
        "title": "TSLA: Get ready to cash out from the largest ongoing pump and dump in history",
        "score": 2136,
        "url": "https://www.reddit.com/r/investing/comments/k3unr7/tsla_get_ready_to_cash_out_from_the_largest/",
        "content": "Ok, so TSLA will be included in S&P 500 in Dec 21. Old news. Around $100B(almost 1/5th of its market cap) of TSLA would need to be purchased(some active funds may have already purchased) based on current stock price.\n\nThe only reason I have been holding TSLA after it split is the whole S&P 500 inclusion thingy. After that, I don't know what will even move this stock. They freakin surpassed Berkshire and could surpass Facebook(for a short time)!!!\n\nToday they will announce whether to include TSLA in two sessions or in one session.\n\n[This is what happened when Yahoo was included(which is comparable to TSLA's inclusion as they have had relatively comparable size in comparison to S&P 500's size). Although I believe TSLA will rise again after some time, unlike Yahoo.](https://imgur.com/a/1qj22eR)\n\nAfter the trading sessions, expect a big dip. As a lot of speculators this year have bought into TSLA precisely to front-run the index investors.\n\nAlso, the trade date Dec. 18, coincides with a once-quarterly event known as quadruple witching, the Friday near the end of each calendar quarter on which options and futures on both indexes and stocks expire simultaneously. Volume is usually heavy on those days and would help boost liquidity on the day of Tesla’s inclusion, investors said. (this paragraph copied straight from wsj)\n\nSo, I guess don't be a fool(unless there are some tax implications, which I don't have); buy the rumour, sell the news. TSLA will completely tank after the inclusion.\n\nAlso, remember NIO etc kind of benefit from the TSLA hype, so be very careful you all about them.\n\nI don't think if you don't have any immediate tax implications, there wouldn't be much value holding TSLA for the longer term as there are better long term plays. And when or if TSLA reaches $700 or higher(I know I am very bullish, but that's why I am still holding it) there would be almost no point in holding it any longer.\n\nSome special points to remember:\n\n* TSLA already jumped 40% after its inclusion news broke out and had been steadily climbing before it due to rumour that it will be included in the index and Softbank's trade earlier this year.\n* TSLA can issue more shares, especially in this valuation. I mean why wouldn't they, lol.\n\nI know posts that say anything negative about TSLA gets downvoted but be careful about your TSLA shares or options!\n\nDisclaimer: I am long TSLA shares and call options. I am also long PLTR(long leaps too) and some other meme stocks which I am not mentioning cause my post gets removed somehow and I am not sure why(so you know I don't give a damn about valuations, although I am kind of an early mover, so all of them are at a very profitable position).",
        "created_utc": 1606738256.0,
        "subreddit_name": "investing",
        "comments": 775
    },
    {
        "title": "Pros and cons of investing in 5 upcoming tech IPOs from Airbnb to Roblox",
        "score": 1808,
        "url": "https://www.reddit.com/r/stocks/comments/k3okkw/pros_and_cons_of_investing_in_5_upcoming_tech/",
        "content": "December and January aren't typically busy months for initial public stock offerings, but this time around, they'll be an exception. Almost a half dozen well-known tech startups, each already valued privately at over $1 billion, have recently filed for IPOs, including Airbnb, DoorDash, and Roblox.\n\nThey're hoping to take advantage of strong investor appetite for tech stocks, despite the pandemic, and to catch the coat tails of other tech companies that have recently made [successful debuts](https://fortune.com/2020/08/29/2020-ipos-palantir-tech-ipo-asana-snowflake-predictions/). Shares in cloud database company Snowflake are up 129% since its September IPO and those of data mining company Palantir are up 215% since its September listing.\n\nHere are key details to consider in weighing whether to invest in the latest batch of would-be public tech companies. Financial data is from the first nine months of 2020 unless otherwise indicated.\n\n## Affirm\n\nSymbol: AFRM  \nFiscal 2020 revenue: $510 million (fiscal year ended June 30)  \nRevenue growth: 93%  \nGross margin: n/a  \nNet loss: $113 million\n\n[Affirm’s S-1 filing](https://www.sec.gov/Archives/edgar/data/1820953/000110465920126927/tm2026663-4_s1.htm)\n\nFounded in 2012 by PayPal co-founder Max Levchin, Affirm aims to [bring credit and lending to customers of all kinds of online retailers](https://fortune.com/2020/02/05/credit-cards-levchin-affirm-ceo-daily/). Those hard-to-miss layaway offers for a pair of shoes from Cole Haan or that cute coffee table on West Elm’s website? Affirm works behind the scenes to process the loans and often covers the cost of the item (in some cases, partner banks fund the loans). So far, Affirm has signed up over 6,500 retailer and helped consumers pay for almost $11 billion worth of products over the past three years.\n\n**Pros**: Affirm says its “buy now, pay later” system is superior to credit cards, with no hidden fees or high interest rates (most Affirm offers are zero interest rate). Like other hot consumer companies, Affirm also touts its net promoter score of 78, suggesting more than three-quarters of customers would recommend the company.  As e-commerce grows, there’s plenty of room for growth in the market—less than 1% of e-commerce transactions in North America relied on “buy now pay later” deals. And Affirm says its data analysis of consumers’ ability to pay lets it avoid major losses.\n\n**Cons**: The largest e-commerce sites, like [Amazon](https://fortune.com/company/amazon-com/) and [Walmart](https://fortune.com/company/walmart/), have no need for Affirm and could even launch their own lending services. So could big banks or other financial institutions that can borrow money more cheaply than Affirm can. And more than one-quarter of all of Affirm’s lending has so far come from customers of a single retail partner: Peloton.\n\n## Airbnb\n\nSymbol: ABNB  \nFirst nine months of 2020 revenue: $2.52 billion  \nRevenue growth: -32%  \nGross margin: 74%  \nNet loss: $697 million\n\n[Airbnb’s S-1 filing](https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm)\n\nAs the now-famous story goes, Airbnb co-founders Brian Chesky and Joe Gebbia decided to rent some airbeds in their San Francisco apartment after a big design conference caused local hotels to be fully booked. Their little web site, AirBedandBreakfast.com, eventually grew into the titan that has rented space to 825 million customers cumulatively across 220 countries.\n\n**Pros**: The fast-growing startup took a huge hit when COVID-19 curbed travel, but has since [almost bounced back](https://fortune.com/2020/06/30/airbnbceo-brian-chesky-bookings-rentals-recovery-2020-ipo-coronavirus-pandemic/). Bookings were down 72% in April compared to the same month in 2019, but for June through September, the declined narrowed to 19% to 23%. The company also brags in its regulatory filing that pandemic-related spending cuts, including slashing headcount by 25%, make it more efficient going forward.\n\n**Cons**: The pandemic showed that the travel industry is subject to sharp downturns that cut into Airbnb’s sales, and infections are on the rise again worldwide. The company has also battled restrictive rules in many cities and countries seeking to ban short-term rentals. Airbnb's filing disclosed it’s also in a battle with the Internal Revenue Service that could cost it $1.4 billion if it loses. And even after being in business for more than a decade, Airbnb is still on pace to lose around $1 billion this year.\n\n## DoorDash\n\nSymbol: DASH  \nFirst nine months of 2020 revenue: $1.92 billion  \nRevenue growth: 226%  \nGross margin: 53%  \nNet loss: $149 million\n\n[DoorDash S-1 filing](https://www.sec.gov/Archives/edgar/data/1792789/000119312520292381/d752207ds1.htm)\n\nAfter moving to the U.S. as a child, DoorDash co-founder and CEO Tony Xu worked as a dishwasher in a Chinese restaurant to help make ends meet. The point of DoorDash, he says, is to help strivers and small businesses thrive. Now in business for seven years, DoorDash “dashers” deliver food and other items from almost 400,000 businesses to 18 million consumers per month as of September.\n\n**Pros**: DoorDash is the leading provider of delivery with over twice the market share of runner up Uber Eats as of October 2020. The pandemic has [ignited much faster growth](https://fortune.com/2020/05/25/coronavirus-jobs-food-delivery-doordash/) in food delivery as people avoid going out to eat. Some smaller players have already sold out (DoorDash bought Square’s Caviar service for $410 million last year), but further consolidation could let DoorDash charge more for its services.\n\n**Cons**: Once the pandemic passes, many DoorDash customers [may return to eating](https://fortune.com/2020/11/16/can-doordash-maintain-its-pandemic-boost/) in restaurants. Although California voters approved a measure to continue to classify gig workers like DoorDash’s dashers as independent contractors, other governments still are trying to classify gig workers as employees, which could wreck DoorDash’s business model.\n\n## Roblox\n\nSymbol: RBLX  \nFirst nine months of 2020 revenue: $589 million  \nRevenue growth: 68%  \nGross margin: 74%  \nNet loss: $206 million\n\n[Roblox S-1 filing](https://www.sec.gov/Archives/edgar/data/1315098/000119312520298230/d87104ds1.htm)\n\nMuch more than a video game, Roblox has become a virtual environment for millions of people and companies [to create their own games](https://fortune.com/2019/07/16/roblox-100-million-monthly-active-users/). Co-founders David Baszucki and Erik Cassel went from making software simulations for physics labs to creating Roblox in 2004. Now some 31 million people play daily, including three-quarters of all U.S. kids age 9 to 12, the company says (Research firm Dubit put the figure at [half of kids 9 to 12 this summer)](https://www.nytimes.com/2020/08/16/technology/roblox-tweens-videogame-coronavirus.html).\n\n**Pros**: Roblox has plenty of reasons for developers to stick around, including its large devoted customer base and the Lua scripting language that makes it easier to make new games. About two-thirds of current users are from the U.S. and Canada, so there is room for considerable overseas expansion.\n\n**Cons**: The pandemic super-charged Roblox growth rate, but kids may decide to put their screens down and play more outside after the crisis ends. Many users play on devices running [Apple](https://fortune.com/company/apple/) or [Google](https://fortune.com/company/alphabet/) software, putting Roblox somewhat at the mercy of the twin tech titans’ app policies. Other games have been banned and the app stores decide how much of each sale they are entitled to. A joint venture with Tencent to bring Roblox to China could be impacted by increasing trade tensions or new restrictions. And gaming and social media platforms come and go depending on the latest fads. Roblox could be the MySpace of gaming.\n\n## Wish (ContextLogic)\n\nSymbol: WISH  \nFirst nine months of 2020 revenue: $1.75 billion  \nRevenue growth: 32%  \nGross margin: 65%  \nNet loss: $176 million\n\n[Wish S-1 filing](https://www.sec.gov/Archives/edgar/data/1822250/000119312520298630/d82777ds1.htm)\n\nOvershadowed by better known rivals like Amazon, [Alibaba](https://fortune.com/company/alibaba-group-holding/), and [eBay](https://fortune.com/company/ebay/), Wish [focuses its e-commerce services](https://fortune.com/2020/11/20/online-marketplace-wish-files-for-ipo/) on the “affordable” segment of consumers. Founded in 2010, Wish now helps more then 500,000 online sellers hawk goods to 100 million monthly active shoppers. Parent company ContextLogic has its name on the IPO registration filing.\n\n**Pros**: Shopping online isn’t just for the wealthy. Wish says it's targeting the 44% of U.S. consumers and 85% of Europeans who have household incomes of $75,000 or less, plus shoppers in developing countries. Wish’s platform is mobile first, and 90% of purchases happen via its mobile app. Although Wish doesn't make a profit, it generated free cash flow (or cash from operating activities minus purchases of property and equipment) of $23 million in the first nine months of 2020.\n\n**Cons**: Wish faces off against many larger rivals, such as Amazon, Alibaba and eBay, plus Shopify and Walmart. To compete against the giants, Wish spends vast sums, over $1 billion so far in 2020, on marketing. With deep connections in China, U.S.-based Wish could be hurt by worsening trade tensions. And as with other startups dependent on mobile apps, Google and Apple could undermine Wish’s business with new rules or requirements.\n\n[Source](https://fortune.com/2020/11/25/2020-ipos-airbnb-roblox-affirm-wish-doordash-predictions-going-public/)",
        "created_utc": 1606709769.0,
        "subreddit_name": "stocks",
        "comments": 381
    },
    {
        "title": "Italy Fines Apple $12 Million for Misleading iPhone Water Resistance Claims",
        "score": 9349,
        "url": "https://www.macrumors.com/2020/11/30/italy-fines-apple-12m-iphone-water-resistance/?utm_source=osx&utm_medium=push&utm_campaign=",
        "content": "",
        "created_utc": 1606734692.0,
        "subreddit_name": "apple",
        "comments": 972
    }
]