[
    {
        "title": "Google smashes earnings - Q3 2024 GAAP EPS $2.12 Beats $1.84 Estimate, Sales $88.268B Beat $86.312B Estimate",
        "score": 1291,
        "url": "https://www.reddit.com/r/stocks/comments/1gf4974/google_smashes_earnings_q3_2024_gaap_eps_212/",
        "content": "- **Quarterly Results**: Alphabet Inc. announced Q3 2024 financial results.\n\n- **Total Revenue**: $88.3 billion, a 15% year-over-year increase.\n\n- **Google Services**: Revenue increased 13% to $76.5 billion, driven by:\n  - Growth in Google Search and other services.\n  - Increased subscriptions and device sales.\n  - Strong YouTube ad performance.\n\n- **Google Cloud**: Revenue up 35% to $11.4 billion, fueled by:\n  - Growth in AI Infrastructure and Generative AI Solutions.\n  - Increased adoption of core GCP products.\n\n\n- **Operating Income**: Increased by 34%; operating margin expanded by 4.5 percentage points to 32%.\n\n- **Net Income**: Increased by 34%; earnings per share rose 37% to $2.12.\n\n- **CEO Statement**: Sundar Pichai emphasized the impact of innovation and AI on revenue growth and operational efficiency.\n\n- **YouTube Milestone**: Total ads and subscription revenue surpassed $50 billion over the past four quarters for the first time.\n\n\n\n------------------------------------------------------------------------------------------------------------------\n\n### Q3 2024 Financial Highlights (Unaudited)\n\n- **Overall Revenues**: \n  - 2023: $76,693 million \n  - 2024: $88,268 million \n  - Year-over-year change: 15% (16% in constant currency)\n\n- **Operating Income**:\n  - 2023: $21,343 million \n  - 2024: $28,521 million \n  - Operating margin: \n    - 2023: 28% \n    - 2024: 32% (increase of 4.5 percentage points)\n\n- **Other Income (Expense)**: \n  - 2023: $(146) million \n  - 2024: $3,185 million\n\n- **Net Income**:\n  - 2023: $19,689 million \n  - 2024: $26,301 million \n\n- **Diluted Earnings Per Share (EPS)**:\n  - 2023: $1.55 \n  - 2024: $2.12 \n\n### Supplemental Information\n\n- **Revenue Breakdown**:\n  - Google Search & Other: \n    - 2023: $44,026 million \n    - 2024: $49,385 million\n  - YouTube Ads: \n    - 2023: $7,952 million \n    - 2024: $8,921 million\n  - Google Network: \n    - 2023: $7,669 million \n    - 2024: $7,548 million\n  - Google Advertising Total: \n    - 2023: $59,647 million \n    - 2024: $65,854 million\n  - Google Subscriptions, Platforms, and Devices: \n    - 2023: $8,339 million \n    - 2024: $10,656 million\n  - Google Cloud: \n    - 2023: $8,411 million \n    - 2024: $11,353 million\n  - Other Bets: \n    - 2023: $297 million \n    - 2024: $388 million\n  - Total Revenues: \n    - 2023: $76,693 million \n    - 2024: $88,268 million \n\n- **Traffic Acquisition Costs (TAC)**:\n  - 2023: $12,642 million \n  - 2024: $13,719 million\n\n- **Number of Employees**:\n  - 2023: 182,381 \n  - 2024: 181,269\n\n### Segment Operating Results\n\n- **Operating Income (Loss)**:\n  - Google Services: \n    - 2023: $23,937 million \n    - 2024: $30,856 million\n  - Google Cloud: \n    - 2023: $266 million \n    - 2024: $1,947 million\n  - Other Bets: \n    - 2023: $(1,194) million \n    - 2024: $(1,116) million\n  - Alphabet-Level Activities: \n    - 2023: $(1,666) million \n    - 2024: $(3,166) million\n- **Total Income from Operations**:\n  - 2023: $21,343 million \n  - 2024: $28,521 million\n\n- **Reorganization Note**: The Gemini app team within Google Services will join Google DeepMind, with potential effects on segment operating results under evaluation.",
        "created_utc": 1730232813.0,
        "subreddit_name": "stocks",
        "comments": 330
    },
    {
        "title": "Prediction: Apple is grossly priced compared to Microsoft",
        "score": 358,
        "url": "https://www.reddit.com/r/stocks/comments/1gf523l/prediction_apple_is_grossly_priced_compared_to/",
        "content": "Congrats to those that followed my last Costco post. I don’t believe anyone can really predict the ups and downs of the market, and with the current market climbing past ATH’s, the safest bets are going to be balanced long-short positions in specific equities or spread bets. \n\n**Apple**\n\n* Market cap: 3.6T\n* Current P/E: \\~36\n* Average P/E last 5 years: 28.6\n* Historical revenue growth: Flat to single digits\n* Earnings growth: Low double digits\n* Net Margin: 25%\n\n **Microsoft**\n\n* Market cap: 3.2T\n* Microsoft P/E: \\~36\n* Average P/E last 5 years: 32.8\n* Historical revenue growth: 15%\n* Earnings growth: 15-20%\n* Net margin: 35%\n\nLast week, Apple had a higher P/E than MSFT, before this narrowed in the last few days Relative to Microsoft. Apple is still at historically high valuations relative to MSFT, despite Microsoft having better margins and growth. And the reasons are silly. Apple is getting a massive boost due to a \"potential supercycle\" with no proof that it’s actually happening (even the most optimistic projections are just slightly better than last year) and mediocre software releases, while Microsoft took a large hit last quarter because it forecasted larger capex and delays in direct GenAI revenue realization.\n\nIn my view, the market is pricing in a divergent and fundamental misunderstanding of GenAI and how it makes money. The Apple bull case hypothesis is correct, it’s just applied to the wrong company. The Microsoft supercycle isn’t going to be from direct GenAI subscriptions like Co-pilot, it’s going to be share shift towards Azure and increased utilization.\n\nTo me it is hopium to believe that retail consumers will be rushing aggressively to switch or upgrade their phones over a nascent GenAI capability that is inferior to its peers (other than privacy) and unlocks nominal value, while mid-large corporates won’t be doing the exact same for Microsoft for what is widely considered a top-notch set of capabilities and proven effectiveness in several emerging use cases.\n\nHere’s my prediction – regardless of where the market goes, I believe there is going to be a strong and continued divergence between Microsoft & Apple performance in the next few months, with at least another 5% gap between the winner and loser, with Microsoft’s P/E once against comfortably retaking the lead from Apple. Good luck and we'll see!\n\nTl;dr: Short Apple / Long Microsoft\n\nP.S. Seeing a lot of people triggered by the tl;dr recommendation not having a basic understanding of what long-short position is. A balanced long-short position doesn't mean I believe Apple will go down on nominal terms, just that it will go down relative to Microsoft. Using options or a long-short position is the way to extract value when you see the spread in two equities increase.  ",
        "created_utc": 1730234844.0,
        "subreddit_name": "stocks",
        "comments": 175
    },
    {
        "title": "Softbank’s Son Says Nvidia Is Undervalued as Super AI Looms",
        "score": 217,
        "url": "https://www.reddit.com/r/stocks/comments/1gezw7h/softbanks_son_says_nvidia_is_undervalued_as_super/",
        "content": "[https://www.bloomberg.com/news/articles/2024-10-29/softbank-s-son-says-nvidia-is-undervalued-as-super-ai-looms](https://www.bloomberg.com/news/articles/2024-10-29/softbank-s-son-says-nvidia-is-undervalued-as-super-ai-looms)\n\n[By Marissa NewmanOctober 29, 2024 at 9:49 AM EDT](https://www.bloomberg.com/quote/9984:JP) founder Masayoshi Son said [Nvidia Corp.](https://www.bloomberg.com/quote/NVDA:US) — the chipmaker that’s seen its market value skyrocket to over $3 trillion amid the artificial intelligence boom — is still undervalued, pushing back against the idea of an AI bubble.\n\n“The future is much bigger,” Son said at the Future Investment Initiative conference in Riyadh on Tuesday. “Nvidia is just one example.”\n\nSon said artificial superintelligence that’s 10,000 times more advanced than human intelligence will be developed by 2035. But he said hundreds of billions of dollars in investment will be needed to make this a reality. Softbank itself has already made some big bets on AI-powered services, contributing $500 million to an OpenAI funding round that [valued](https://www.bloomberg.com/news/articles/2024-10-02/openai-has-closed-new-funding-round-raising-over-6-5-billion) the ChatGPT maker at $157 billion.\n\nRead More: [SoftBank’s Son Sees AI Running Households in a Few Years](https://www.bloomberg.com/news/articles/2024-10-03/softbank-s-son-envisions-ai-running-households-in-next-few-years)\n\n“I’m only focused on that,” he said. “That will change mankind’s future forever.”",
        "created_utc": 1730222012.0,
        "subreddit_name": "stocks",
        "comments": 119
    },
    {
        "title": "Visa earnings: $9.6B revenue, $5.3 GAAP net income, 13% dividend hike",
        "score": 105,
        "url": "https://www.reddit.com/r/stocks/comments/1gf6zpa/visa_earnings_96b_revenue_53_gaap_net_income_13/",
        "content": "Visa (NYSE:V)reported fourth-quarter earnings that surpassed analyst estimates, driven by robust revenue growth across its business segments. The company's shares rose 2% in after-hours trading following the announcement.\n\nThe global payments technology company reported adjusted earnings per share (EPS) of $2.71 for the quarter ended September 30, 2024, beating the analyst consensus of $2.58. Revenue for the quarter came in at $9.6 billion, exceeding the expected $9.49 billion and representing a 12% increase YoY on both a nominal and constant-dollar basis.\n\nVisa's strong performance was underpinned by stable growth in key metrics. Payments volume for the three months ended September 30, 2024, increased 8% YoY on a constant-dollar basis. Cross-border volume, excluding transactions within Europe, rose 13% on a constant-dollar basis. Total processed transactions reached 61.5 billion, a 10% increase over the prior year.\n\nRyan McInerney, Chief Executive Officer of Visa, commented on the results: \"Visa had a robust fourth quarter to finish a very strong fiscal year. In the fourth quarter, net revenue and GAAP EPS grew by 12% and 17%, respectively, driven by relatively stable growth in payments volume, cross-border volume and processed transactions plus strong momentum across new flows and value added services.\"\n\nThe company's board of directors approved a 13% increase in Visa's quarterly cash dividend to $0.590 per share, reflecting confidence in the company's financial position and future prospects.\n\nFor the full fiscal year 2024, Visa reported net revenue of $35.9 billion, a 10% increase on both a nominal and constant-dollar basis. The company's GAAP net income for the year was $19.7 billion, or $9.73 per share, while non-GAAP net income reached $20.4 billion, or $10.05 per share.\n\nhttps://www.investing.com/news/stock-market-news/visa-beats-q4-expectations-shares-rise-on-strong-revenue-growth-3689289",
        "created_utc": 1730239810.0,
        "subreddit_name": "stocks",
        "comments": 2
    },
    {
        "title": "Microsoft's GitHub goes beyond OpenAI, welcomes AI models from Anthropic, Google",
        "score": 85,
        "url": "https://www.reddit.com/r/stocks/comments/1gf1bg5/microsofts_github_goes_beyond_openai_welcomes_ai/",
        "content": "Microsoft has a very expensive and very public relationship with artificial intelligence startup OpenAI. But one of Microsoft’s most successful AI products, GitHub Copilot, is now going beyond OpenAI to give developers more choice in what models they want to use.\n\nGitHub, which Microsoft acquired in 2018, said in a blog post on Tuesday that developers will be able to power the GitHub Copilot Chat feature with Anthropic’s Claude 3.5 Sonnet model or Google’s Gemini 1.5 Pro model, as alternatives to OpenAI’s GPT-4o, if they choose.\n\n“There is no one model to rule every scenario, and developers expect the agency to build with the models that work best for them,” GitHub CEO Thomas Dohmke said in the post. “It is clear the next phase of AI code generation will not only be defined by multi-model functionality, but by multi-model choice. Today, we deliver just that.”\n\nMicrosoft introduced GitHub Copilot in 2021, offering source code suggestions to software developers. Copilot relies on models from OpenAI, which has received billions of dollars in funding from Microsoft and has exploded in popularity since releasing ChatGPT in late 2022.\n\nOpenAI’s o1-preview and o1-mini, which are meant to reason over difficult problems, will also be available in the Copilot Chat on GitHub’s website and in the open-source Visual Studio Code text editor. They’re currently available in a public preview. Google’s model will be released in public preview in the next few weeks, a spokesperson said.\n\nThe arrival of the o1 models from OpenAI in September led GitHub to look at adding a dropdown menu for Copilot to provide more options, Dohmke said in an interview with CNBC last week. At that point, it felt like “the right time” to add models from Anthropic and Google, Dohmke said.\n\nDevelopers will be able to see which model works best for a given programming language or employ the one that adheres to corporate requirements, he added.\n\nMany other Microsoft products, including Teams and Windows, use OpenAI models. And Microsoft continues to provide computing power to OpenAI, which is now valued at $157 billion. But the relationship between the two companies has frayed in the past year, following the sudden ouster and reinstatement of OpenAI CEO Sam Altman in November. The dramatic incident reportedly angered Microsoft CEO Satya Nadella.\n\nIn February, Microsoft announced a partnership with early-stage AI model developer Mistral. The following month, Microsoft said it was hiring former DeepMind co-founder Mustafa Suleyman and employees of his startup, Inflection, whose Pi assistant competed with OpenAI’s popular ChatGPT. Over the summer, Microsoft named OpenAI as a competitor in a regulatory filing.\n\nIn the past month, GitHub has collaborated with engineering teams from Anthropic and Google on the safety, security and scalability of their models, Dohmke said.\n\n“We are planning on extending that list in the future but have no partnerships to announce at this point,” he said, adding that GitHub wouldn’t want to overwhelm developers with too many choices.\n\nAlso on Tuesday, GitHub announced that its Copilot will gain the ability to perform speedy automated reviews of code updates through a public preview.\n\nAnd GitHub showed a technical preview of a feature named Spark that can compose app prototypes based on text input and refine the designs with a few clicks. Developers will be able to modify the underlying code for the prototypes. Those interested in trying Spark can join a waiting list.\n\nOnce they receive access, people using Spark will be able to choose between GPT-4o and Anthropic’s Claude 3.5 Sonnet model, a GitHub spokesperson said.\n\nSource: https://www.cnbc.com/2024/10/29/microsoft-github-copilot-goes-past-openai-opens-to-anthropic-google.html",
        "created_utc": 1730225541.0,
        "subreddit_name": "stocks",
        "comments": 5
    },
    {
        "title": "Apple announces new and smaller Mac Mini with first redesign since 2010",
        "score": 78,
        "url": "https://www.reddit.com/r/stocks/comments/1gf1aat/apple_announces_new_and_smaller_mac_mini_with/",
        "content": "Apple announced on Tuesday new Mac Mini models, featuring the first major redesign since 2010 that makes the desktop computer significantly smaller.\n\nAside from a redesign that shrunk the case and reduced the computer’s volume in half, the main upgrade on these new computers is that they include Apple’s latest chip, either the M4, or a more powerful version called the M4 Pro.\n\nThe Mac Mini is Apple’s least-expensive Mac, starting at $599, and does not include a display, which is sold separately. When the product line was first introduced in 2008, it was marketed as a computer for people switching from Microsoft Windows who could simply plug their existing keyboard, mouse and monitor into their new silver box.\n\nThe Mac Mini is not one of Apple’s highest-volume computers in terms of sales, but it is an important slot in Apple’s lineup, especially for people who make apps for iPhones and other Apple platforms. Many iPhone developers like to run a Mac Mini as a personal development server for coordinating uploads and code.\n\nOne improvement in the new design is that all of the ports are USB-C ports, the same more modern offering found on Apple’s laptops. There are three USB-C ports on the rear and two on the front, a new addition that will make it easier to plug or unplug accessories while the computer rests on a desk.\n\nApple said in a press release that the M4 is a significant improvement over the M2 chip in the previous version released in 2022. Graphics and games are more than twice as fast, and the M4 can support up to 14 CPU cores and 20 GPU cores, an increase over the past generation. Apple first introduced the M4 in May in Apple’s iPad Pro.\n\nApple is framing the new Mac Minis, like all of its new products announced this year, as built for Apple Intelligence, the company’s artificial intelligence system released this week. Apple has said a forthcoming integration of ChatGPT into writing fields inside apps such as Word will allow users to generate and rewrite text and emails using the system.\n\nHowever, unlike on the iPhone, where only phones released in the past two years will support Apple Intelligence, all of Apple’s computers with the M1 chip and newer since 2020 can run the company’s AI. \n\nApple’s Mac family remains a large business segment even though it is less important to the company than the iPhone. In the June quarter, Apple reported $7 billion in Mac sales, up about 2% on an annual basis.\n\nApple’s chief marketer previously teased a “week of announcements.” The company unveiled new iMac computers on Monday, so it seems plausible more is coming. This week’s new Macs are likely Apple’s last major hardware announcements for the year.\n\nSource: https://www.cnbc.com/2024/10/29/apple-mac-mini-2024-price-release-specs.html",
        "created_utc": 1730225462.0,
        "subreddit_name": "stocks",
        "comments": 15
    },
    {
        "title": "PayPal Q3 2024 Earnings",
        "score": 54,
        "url": "https://www.reddit.com/r/stocks/comments/1getrh3/paypal_q3_2024_earnings/",
        "content": "[CNBC: PayPal shares fall premarket on revenue miss](https://www.cnbc.com/amp/2024/10/29/paypal-pypl-q3-2024-earnings.html)\n\n* PayPal reported better-than-expected third-quarter earnings on Tuesday, but revenue came in slightly below expectations.\n* It's the first earnings report for CEO Alex Chriss since he hit his one-year anniversary at the company last month.\n* PayPal shares have gained 36% this year\n\n\n**Earnings per share**: \n* 1.20, adjusted vs. $1.07 expected\n\n**Revenue**: \n* $7.85 billion vs. $7.89 billion expected.\n* Revenue increased about 6% in the quarter from $7.42 billion in the same period a year ago. \n\n**Net Income**:\n* PayPal reported net income of $1.01 billion, or 99 cents per share, compared to $1.02 billion, or 93 cents per share, a year earlier.\n\n**Total payment volume**\n* rose 9% from a year earlier to $422.6 billion for the quarter ended Sept. 30, and came in just above the average analyst estimate of $422.5 billion\n\n**Operating margin** \n* came in at 18.8%, beating the StreetAccount estimate of 17.4%. \n\n**Active Accounts**\n* PayPal reported total active accounts of 432 million, up 1% from a year earlier, and beating the average estimate of 430.5 million.\n\n**Transaction Margin**\n* PayPal's take rate slipped to 1.86% from 1.91% a year earlier\n* transaction margin, which is how the company gauges the profitability of its core business, rose to 46.6% from 45.4%.\n* Venmo's total payment volume rose 8% in the quarter from a year earlier. DoorDash, Starbucks and Ticketmaster are among businesses now accepting Venmo as one way that consumers can pay.\n\n**Guidance**\n* For the fourth quarter, PayPal is calling for \"low single-digit growth.\" Analysts were expecting growth of 5.4% to $8.46 billion. The investor deck says guidance reflects a \"price-to-value strategy and prioritization of profitable growth.\" \n* The company expects adjusted earnings per share of $1.07 to $1.11, versus the average analyst estimate of $1.10",
        "created_utc": 1730206080.0,
        "subreddit_name": "stocks",
        "comments": 35
    },
    {
        "title": "Is it worth it to just buy small stocks with the little money I have or partials of big stocks?",
        "score": 20,
        "url": "https://www.reddit.com/r/stocks/comments/1gf26se/is_it_worth_it_to_just_buy_small_stocks_with_the/",
        "content": "I just opened an investing account on Sofi this month with the plan of buying $50 worth of stock a month to just sit on for a few years and see what happens. Should I buy whole small stock like ACHR or TVGN and hope it blows up or partials in big ones like NVIDA or MSFT that are more established? I know I don't have the type of money to get rich but turning a few hundred into a few thousand eventually would still help the cause trying to save. All that I do know for sure is not to mess with options or any of that stuff and leave it to wallstreet. Is there any other tips you wish you were told when starting out? Thanks in advance",
        "created_utc": 1730227691.0,
        "subreddit_name": "stocks",
        "comments": 68
    },
    {
        "title": "Clean energy",
        "score": 21,
        "url": "https://www.reddit.com/r/stocks/comments/1gf1tdp/clean_energy/",
        "content": "Do we think it’s overvalued or undervalued or somewhere in between? There’s lots of variance in clean energy stocks for example, TSLA could be considered clean energy but so can NEE. \n\nI sold some lame duck clean energy stocks in 2021 in order to tax loss harvest but i’ve been interested in NEE as of late but not sure how long i’d end up holding to see profit. Is this a 10 year endeavor? 20+? I feel like we’ve all been talking about clean energy for the last 15 years but still hardly any movement on it. ",
        "created_utc": 1730226769.0,
        "subreddit_name": "stocks",
        "comments": 29
    },
    {
        "title": "Snap reports better-than-expected third-quarter results, issues light forecast",
        "score": 13,
        "url": "https://www.reddit.com/r/stocks/comments/1gf4da2/snap_reports_betterthanexpected_thirdquarter/",
        "content": "Snap reported better-than-expected third-quarter results on Tuesday, but issued light fourth-quarter guidance. The stock slipped in extended trading.\n\nHere is how the company did:\n\n* **Earnings per share:** 8 cents adjusted vs. 5 cents expected, according to LSEG\n* **Revenue:** $1.37 billion vs. $1.36 billion expected, according to LSEG \n* **Global daily active users:** 443 million vs. 441 million expected, according to StreetAccount\n* **Global average revenue per user:** $3.10 vs. $3.09 expected, according to StreetAccount\n\nSnap said fourth-quarter sales will be between $1.51 billion and $1.56 billion. The midpoint of its guidance is $1.54 billion, which is below the average analyst estimate of $1.56 billion.\n\nSnap said its adjusted earnings for the fourth quarter will be between $210 million and $260 million. The middle of the range is higher than analysts’ estimates of $230.7 million.\n\nThe company’s sales jumped 15% year over year in the third quarter while its net loss narrowed by 58% year over year in the third quarter to $153 million, compared to a net loss of $368 million a year prior.\n\nThe number of Snapchat+ paying subscribers is now at 12 million, the company said. That is up from the 11 million it reported in August. The company debuted its subscription service in 2022, pitching it as a way for users to experience exclusive and prerelease features for $3.99 a month.\n\nSnap also announced a $500 million stock repurchase program on Tuesday.\n\n“Our investments in AI and AR are powering new creative experiences for our community and driving innovation across our advertising platform, underpinning our long term growth opportunity,” Snap CEO Evan Spiegel said in a statement.\n\nIn September, Snap debuted the fifth generation of its Spectacles augmented reality glasses that people can wear to see digital imagery spliced into the physical world. The new Spectacles are only available to developers who must pay $99 a month for one year if they want to build AR apps for the glasses.\n\nShortly after Snap announced the new Spectacles, Meta CEO Mark Zuckerberg revealed the social networking giant’s experimental AR glasses called Orion. Meta’s Orion AR glasses have generated enthusiasm from employees and the company plans to attract developers next year in prelude for an eventual consumer launch.\n\nIn a letter to investors, Snap discussed the importance that developers play for the company’s Spectacles and AR initiatives.\n\n“We aspire to be the most developer-friendly platform in the world, and we are excited to offer our new generation of Spectacles to developers as an invitation and inspiration to create new experiences,” Snap said in the letter.\n\nSource: [https://www.cnbc.com/2024/10/29/snap-q3-2024.html](https://www.cnbc.com/2024/10/29/snap-q3-2024.html)",
        "created_utc": 1730233101.0,
        "subreddit_name": "stocks",
        "comments": 6
    },
    {
        "title": "When Skynet Takes Over, I Want a Piece of the Action ($100K Investment Thesis)",
        "score": 36,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gehmif/when_skynet_takes_over_i_want_a_piece_of_the/",
        "content": "[Positions as of 10\\/28\\/2024](https://preview.redd.it/rztd2a5l6lxd1.png?width=2408&format=png&auto=webp&s=d8fa595bef1b6cb133af2398456283122db2f8c3)\n\nTL;DR: We're entering an unprecedented technological acceleration where AI capabilities are advancing exponentially. Companies see this, and will spend whatever it takes to build AGI. This creates a generational investment opportunity, particularly in two key areas: foundation model companies and datacenter infrastructure plays. I'm deploying \\~$100K with this thesis. I'd love your thoughts on this, and am looking to incorporate feedback.\n\n**The Thesis:**\n\nWe are witnessing the early stages of perhaps the most significant technological revolution in human history. The evidence suggests we're approaching an inflection point in artificial intelligence that will reshape the entire economy. Here's why this matters for investors:\n\n**Key Technical Developments:**\n\n* Transformer architecture has fundamentally solved previous algorithmic and data constraints\n* Larger models consistently demonstrate superior capabilities\n* Critical breakthrough in reasoning capabilities (building on techniques from game theory/poker)\n* Major capability jumps expected with upcoming models (GPT-5, Gemini-2)\n\nBusiness Implications:\n\n1. The Prize: Human intelligence and agency have historically been the greatest constraints on economic growth. AGI would effectively remove these constraints.\n2. Follow the Money:\n   * Current AI capex spending at big tech companies is >$150B annually\n   * For comparison: The tech bubble peak saw $250B/year in broadband infrastructure in today’s dollars\n   * Unlike the tech bubble, today's AI investments are being made by cash-rich tech giants with fortress balance sheets\n   * Training next-gen models will require hundreds of billions in compute investment\n3. The Economics Are Compelling:\n   * Leading tech companies each generate $100B+ in annual revenue\n   * They can invest off their balance sheet with extremely low cost of debt\n   * Early evidence shows strong ROI on AI investments (e.g., Microsoft/OpenAI revenue growth)\n\n  \n**Investment Strategy:** I'm deploying $100K across foundation model companies and datacenter infrastructure, with a small allocation to energy. Here's the detailed breakdown:\n\n[Overall Portfolio](https://preview.redd.it/9atytvnu6lxd1.png?width=1900&format=png&auto=webp&s=9da96520090f2e014f5f1bd82af30eb67c1a8fca)\n\n* Foundation Model Companies (50%): Based on comprehensive benchmarking data from [LiveBench.ai](http://LiveBench.ai), weighted by demonstrated capabilities across reasoning, coding, mathematics, data analysis, language, and instruction following:\n\n[Foundation Model Weighting](https://preview.redd.it/qs43dkgc7lxd1.png?width=2900&format=png&auto=webp&s=04ed97a4b7e9f0111f944633fbf12f3ea9995ea7)\n\n   1. Google (Gemini-1.5-Pro): 11.77% \n   2. Microsoft (OpenAI Partnership): 10.66% \n   3. Amazon/Google (Anthropic Investment): 9.79%\n   4. Meta (LLaMA): 9.49% \n   5. Tesla (xAI): 8.30% \n* Datacenter Infrastructure (42%): Weighted according to typical datacenter capital expenditure breakdown:\n\nhttps://preview.redd.it/u14rf0vi7lxd1.jpg?width=1126&format=pjpg&auto=webp&s=de34b7cdd3d81b7e017b0a06eed7a6102f8c2ddf\n\n   1. Servers/Compute: 31.47% Primary exposure through NVDA\n   2. Networking: 4.53% Split across CSCO, ANET, JNPR\n   3. Construction & Components: 5.99% Including:\n      * XLI ETF: Exposure to industrials that will be involved in building these datacenters\n* Energy Infrastructure (7.33%):\n   1. XLU ETF: Exposure to utilities that will power this buildout\n   2. This is based off datacenter variable (energy + colo) costs being approx 15% of the monthly cost of the datacenter, with the remaining being the capital costs of standing up the datacenter.\n\n  \n\n\n **An interesting catalyst for why I think now is the time to buy into this:**\n\nThere's going to be some foundation models that will be released over the next few months that will reconfirm the returns to scale for these models. [\\[1\\]](https://www.theverge.com/2024/10/24/24278999/openai-plans-orion-ai-model-release-december)[\\[2\\] ](https://www.theverge.com/2024/10/25/24279600/google-next-gemini-ai-model-openai-december) The truly exciting thing is that these models will be able to take actions to do tasks on your computer. The main issue in the current iteration of models is that they are not reliably able to do long running goal oriented tasks, but the release of o1 changed my perspective on this problem. That model has been trained to go through chain-of-thought steps to get to the right answer, and its data will be used to train larger models on the entire reasoning sequence. This unlocks a whole bunch of learnable training data. Things are going to get even more exciting.   \nI've been working on language models since GPT-1/BERT/etc, and the main thing is that every time a model comes out, we're all surprised at how much better it gets. I've learned to not be as skeptical of the returns to scale, and I'm finally putting (more) of my money where my mouth is. ",
        "created_utc": 1730161157.0,
        "subreddit_name": "wallstreetbets",
        "comments": 20
    }
]