[
    {
        "title": "Apple could charge up to $20 for some Apple Intelligence AI features, analysts say",
        "score": 321,
        "url": "https://www.reddit.com/r/stocks/comments/1entpkw/apple_could_charge_up_to_20_for_some_apple/",
        "content": "There are estimated 1.334 billion active iPhone users worldwide. Apple also announced that it now has 1 billion paying subscribers to its services and that revenue from these sales has reached an all-time high. \n\nDo the math.\n\n[https://www.cnbc.com/2024/08/08/apple-could-charge-20-for-some-apple-intelligence-features-analysts.html](https://www.cnbc.com/2024/08/08/apple-could-charge-20-for-some-apple-intelligence-features-analysts.html)",
        "created_utc": 1723188830.0,
        "subreddit_name": "stocks",
        "comments": 209
    },
    {
        "title": "TSMC sales grow 45% in July on strong AI chip demand",
        "score": 272,
        "url": "https://www.reddit.com/r/stocks/comments/1enwzdc/tsmc_sales_grow_45_in_july_on_strong_ai_chip/",
        "content": "(Bloomberg) -- Taiwan Semiconductor Manufacturing Co.’s revenue rose 45% in July, accelerating its pace of growth from the June quarter and bolstering hopes for sustained strong demand for artificial intelligence chips from the likes of Nvidia Corp.\n\nSales for the month reached NT$256.95 billion ($7.9 billion). For the third quarter, analysts project TSMC revenue should grow 37% to NT$747.4 billion, with the July result suggesting TSMC may surpass those expectations.\n\nTaiwan’s biggest company is one of the key bellwethers for AI demand, as the go-to chipmaker for leading accelerator makers Nvidia and Advanced Micro Devices Inc. It’s also the sole supplier of processors for Apple Inc.’s iPhones, at a time the mobile device market is showing signs of bouncing off post-Covid era lows. Last month, the world’s largest contract chipmaker raised its full-year growth outlook to beyond the maximum mid-20% it had guided toward previously.\n\nTSMC offered an upbeat assessment of its business and prospects when it last reported earnings, with Chief Executive Officer C.C. Wei signaling the company may have room to raise prices as more of its customers transition to its most advanced technology and have to compete for limited capacity. High-performance computing, led by AI, contributed 52% of TSMC’s revenue last quarter, the first time it has accounted for more than half.\n\nStill, investors have started to question whether the billions of dollars Big Tech firms have invested in the infrastructure to support the AI boom will result in substantial returns, while a potential delay in Nvidia’s development of a new generation of AI chips is spurring concerns over the progress of the emerging technology.\n\nWhat Bloomberg Intelligence Says\n\nTSMC’s 44.7% year-over-year sales surge, marking its second-highest sales gain in the past 20 months, aligned with our expectations for robust 3Q performance. This surge could indicate sustained, strong AI chip demand and significant 3-nanometer production orders from Apple, Qualcomm, and MediaTek. TSMC is well positioned to beat the top end of its $23.2 billion 3Q sales guidance.\n\n- Charles Shum, analyst\n\nClick here for the research.\n\nWorries about the global economic outlook over the past week interrupted the AI rally that had seen key players like TSMC gains billions in market value. Investors opted to cash out of some of the year’s biggest gainers, pushing TSMC’s shares down 10% in a day, though the company recovered much of that in subsequent days as money managers saw a good buying opportunity.\n\n--With assistance from Vlad Savov.\n\n(Updates with analyst’s comment from the fifth paragraph)\n\nMost Read from Bloomberg Businessweek\n\n\n\nhttps://finance.yahoo.com/news/tsmc-sales-grow-45-july-054146804.html",
        "created_utc": 1723201885.0,
        "subreddit_name": "stocks",
        "comments": 52
    },
    {
        "title": "Apple Maps on Web Now Supports Firefox Browser",
        "score": 878,
        "url": "https://www.macrumors.com/2024/08/09/apple-maps-on-web-firefox-support/",
        "content": "",
        "created_utc": 1723230469.0,
        "subreddit_name": "apple",
        "comments": 73
    }
]