[
    {
        "title": "Apple's iPhone is not a monopoly like Windows was a monopoly | TechCrunch",
        "score": 1345,
        "url": "https://techcrunch.com/2024/03/21/apples-iphone-is-not-a-monopoly-like-windows-was-a-monopoly/",
        "content": "",
        "created_utc": 1711072541.0,
        "subreddit_name": "apple",
        "comments": 1173
    },
    {
        "title": "DOJ lawsuit says failure of Amazon Fire Phone, end of Windows Phone, and HTC's demise all Apple's fault",
        "score": 1014,
        "url": "https://www.imore.com/apple/doj-lawsuit-says-failure-of-amazon-fire-phone-end-of-windows-phone-and-htcs-demise-all-apples-fault",
        "content": "",
        "created_utc": 1711115871.0,
        "subreddit_name": "apple",
        "comments": 593
    },
    {
        "title": "Breaking down the DOJ's claim that Apple killed the Amazon Fire Phone (and others)",
        "score": 742,
        "url": "https://9to5mac.com/2024/03/22/apple-doj-fire-phone-htc-lg/",
        "content": "",
        "created_utc": 1711135679.0,
        "subreddit_name": "apple",
        "comments": 470
    },
    {
        "title": "Started trading 5 years ago with 36k after saving up from my first job out of college. These are the lessons I learned along the way (in no particular order) that I hope can benefit other aspiring traders.",
        "score": 1598,
        "url": "https://i.redd.it/auzr1vre3spc1.jpeg",
        "content": "Preface: I only funded this account with the starting capital of 36k and had never added to it. This was supposed to be my go ham with real money live trading account so I can feel the real emotions involved instead of a painless simulated trading experience/practice (probably not recommended). Perhaps I got lucky but I am surprised it survived as well and grew so steadily. This account has evolved from buying and holding to day trading stocks and options, and is currently in the premium selling phase for the last 3.5 years. Methods changed and evolved but the below is true and should remain consistent as you still need to analyze the chart before jumping in.\n\nI decided to do a write up in hopes of helping others because I asked a question the other day since I started using my broker's mobile app and was perplexed about the way it displayed it's margin balance and boy did I get chewed up 😄. To be fair there were some helpful comments but it was extremely rare. I don't want others to be discouraged and think this sub is unhelpful to hopefully someone finds these suggestions helpful. Here were my list two posts and the comments I received if you are curious: [Why is my margin balance showing -46k?](https://www.reddit.com/r/Daytrading/comments/1bj0cf3/am_i_overleveraged_my_options_margin_available_is/) / [Positions](https://www.reddit.com/r/Daytrading/comments/1bjtarx/i_was_told_to_post_my_positions_here_after_asking/)\n\n1. Psychology plays a big role.\n2. Don't trade with money you can't afford to lose.\n3. Trade with the trend.\n4. Pick stocks with relative strength or relative weakness.\n5. You can measure a stock's RSRW against SPY and/or it's sector.\n6. There is a STEEP learning curve.\n7. Journal and review your trades.\n8. Although Indicators are subjective, if there are enough people watching or using it, it becomes a self fulfilling prophecy so always be mindful of where buyers and sellers are eyeing.\n9. If a stock is strongly supported or sold off at one area or price point, it will most likely create a temporary top or bottom as buyers/sellers were rewarded there once before so you can expect them to react the same way. \n10. Unless you're yolo'ing or gambling, don't trade around earnings or any major news event as these can create a catalyst and are very unpredictable.\n11. Gaps tend to be filled.\n12. Day 2 and plus continuation is a real thing if there is a strong enough catalyst (e.g. gap and go)\n13. Institutions move markets.\n14. Volume is important.\n15. Don't chase loses.\n16. IV is high for a reason.\n17. Know your greeks if are going to trade options.\n18. Use a top down approach such as multi time frame analysis  and start with the higher time frames.\n19. Buy and hold trumps all (unpopular opinion for day traders but it's true).\n20. Try not to trade during the first and last 30 to 60 mins of market open/close. \n21. There are opportunities throughout the day \n22. Know and develop your own trading style and do what works best for you.\n23. Risk management is important but I do not follow the regurgitated 1% rule (it's regarded if you have enough buying power and margin at your disposal).\n24. Use margin wisely.\n25. Learn to adapt to different market conditions.\n26. What has worked in the past might now work in the future if macro economics changed.\n27. Never stop learning. \n28. Past performance is not indicative of future results.\n\nThat's it for now mainly because I'm tired and don't want to type anymore, I'm sure there's more. Will come back later and add to the list perhaps. Good luck everyone!",
        "created_utc": 1711066572.0,
        "subreddit_name": "DayTrading",
        "comments": 253
    },
    {
        "title": "100% win rate for past 2 weeks",
        "score": 157,
        "url": "https://www.reddit.com/r/Daytrading/comments/1bkn7km/100_win_rate_for_past_2_weeks/",
        "content": "Switched to cash account two weeks back. Started trading 1-2 tickers with 3-4 trades a day making 400 average  a day. Daily 8-10% of gains everyday for past two weeks. Trading on 1 min chart using VWAP and working well so far. Of course I keep an eye where large cap big stocks heading and then I decide on SPY or QQQ options if I need to buy puts or calls.\nI am hoping this will keep me going for a while. 100% win rate for 10 trading days straight.",
        "created_utc": 1711070160.0,
        "subreddit_name": "DayTrading",
        "comments": 133
    }
]