[
    {
        "title": "To everyone new, worried about dips and market corrections - I am tired of you",
        "score": 10950,
        "url": "https://www.reddit.com/r/stocks/comments/lniutl/to_everyone_new_worried_about_dips_and_market/",
        "content": "People bought a lot of risky stuff. ICLNs, ARKKs etc.\n\nThese  people never held anything longer than 2-3 months, never went through a  market correction, never witnessed a scandal that wipes out 15% of  their position in a day.\n\nI am not  saying that asking about market condition is wrong but there are stocks  that don't and won't dip on days like these, less risky, more stable but  less sexy also. It's your choice to buy a risky investment and please  be prepared to see some losses along the way.\n\nGME  created a huge inflow of people to stock market subreddits and I am  tired of scrolling through thousands of posts asking about market  bubble, market correction. Yes some stocks are overvalued but we are in  totally uncharted waters given so much money printing, covid but also  investor beliefs in certain markets.\n\nYou  are buying stocks like AAPL and MSFT at high valuations, you are not  that person that bought apple in 2003 and has 120000% gains. Please be  weary about the other side of your trades - there are people taking huge  profits - if we will have a lot of them in a span of 10-15-30-120 days  we might see a market correction.\n\nIf  you are new to investing buying a stock feels like a very intimate  moment, sadly, a lot of people already own/owned that stock.\n\nIf  you want safety sell your positions and buy ETFs (stable all world,  maybe S&P), maybe go for a dividend stock like T. If you can't  handle your emotions make your portfolio all cash and trade on a paper  account.\n\nAnd for the love of god  don't call yourself a \"long term investor\" because you are bag holding a  20% loss. It might never come back, may come back tommorow, maybe in 7  years? You never know. We might see a bunch of people soon using that  term more often to offset that psychological game of chess with the  market but in reality you are simply not realizing that losses. I am  100% sure these LTIs are going to sell their position once breaking  even.\n\nStock market is a game of  psychological chess and if you are weak - you will be wiped out by  people with time, money and huge balls.\n\nPlease create daily/monthly/yearly threads designed for a discussion about bubble/correction or market conditions. There is so much noise it's crazy. \n\n\\#bringbackmaturity\n\nNot a financial advice.",
        "created_utc": 1613749365.0,
        "subreddit_name": "stocks",
        "comments": 1733
    },
    {
        "title": "Apple cracks down on apps with ‘irrationally high prices’ as App Store scams are exposed",
        "score": 6033,
        "url": "https://9to5mac.com/2021/02/19/apple-cracks-down-on-apps-with-irrationally-high-prices-as-app-store-scams-are-exposed/",
        "content": "",
        "created_utc": 1613739921.0,
        "subreddit_name": "apple",
        "comments": 490
    },
    {
        "title": "Morning Update for Friday, 02/19/21",
        "score": 348,
        "url": "https://www.reddit.com/r/Daytrading/comments/lng2hq/morning_update_for_friday_021921/",
        "content": "Good morning everyone! Happy Friday :)\n\nI want to make a quick clarification and say that this post and list is geared towards day trading, and I am not advocating to blindly buy and hold these at all, in fact I advise strongly against that. *With the small cap stocks especially, I am typically in and out very quickly, only occasionally longer than 5-10 minutes, usually faster.* I am also constantly watching the candlestick charts and observing price action and volume, and you should be doing the same if you want to trade these stocks. Always have a plan when you enter a trade (for profit taking and for taking a loss), and use proper risk management.\n\n**Large Cap Watchlist (*****over $10*****)**\n\n* Gapping UP: RIOT, MARA, TLRY, APHA, NIO, WKHS, SPCE, FOXA, IPA, FRX, TIGR, GEVO, FUTU, CAN\n* Gapping DOWN: UVXY, DBX, RXT, PBR, TWLO, CAPA, ASPN\n\n**Small Cap Watchlist (*****under $10*****)**\n\n1. UAVS: Gapping up after responding to the false short seller claims. Seeing good price action and volume in the premarket. Premarket support near 9.63-9.65.\n2. JMP: Gapping up, but couldn't find a catalyst. Seeing good volume and price action in the premarket. Premarket resistance around 11.45, I'll want to see some strength from this stock before market open. \n3. VCNX: Gapping up on news catalyst. Currently seeing good price action and volume. Just make sure you don't go chasing trades. \n4. WATT: Gapping up, but couldn't find a catalyst. Showing some weakness in the premarket, so I'll want to see some strength before market open. Potential resistance around 6.50. \n5. MTC: Gapping up, but couldn't find a catalyst.  Like WATT, it's seeing some weakness in the premarket, so I'll want to see some strength before market open. Potential resistance around 5.50. \n6. JFU: Gapping up, despite a class-action against them. Just be careful with this one, given the news. \n7. TAOP: Gapping up on a blockchain-related news catalyst.  Saw a spike of volume earlier in the premarket, but I'll be watching to see volume and price action pick up more before market open. \n8. MDGS: Gapping up on an EV-related news catalyst. Saw a spike in volume as well, but I'd like to see some better price action before market open. \n\nDespite the choppiness in the past few days, the market looks like it is going to open in the green. SPY is currently sitting just over 392, with a lot of stocks up in premarket. I will be watching UVXY for volatility plays, as I think the choppiness could continue. If SPY doesn't see choppiness today, we could see a push back up to ATH levels. Bitcoin hit another ATH earlier today, and I'll be watching crypto-related plays closely today. Marijuana stocks are also up in premarket, despite the choppiness in the past few days. \n\n*If you had a good trading day yesterday, make sure to not chase that high today. Stay disciplined. Your long-term goal should be consistency. Remember to have an exit plan for every trade you enter.*\n\nRemember to use proper risk management, and make sure you size appropriately for your account. Happy trading everyone :)",
        "created_utc": 1613741955.0,
        "subreddit_name": "Daytrading",
        "comments": 112
    },
    {
        "title": "For the wallstreetbet...stop effing holding the line on GME! It ain't going to the moon $1,000 like you blindeded hopes and dreams. The pro short the $hit out of it at $300_$400 ranges already! Get in aapl quality lines!",
        "score": 3,
        "url": "https://www.reddit.com/r/AAPL/comments/lngvex/for_the_wallstreetbetstop_effing_holding_the_line/",
        "content": "For eff sake 🙄 get into the smart $ aapl.\nThere ain't  enough % shorts left to squeeze GME to the moon $1,000. It's game over!",
        "created_utc": 1613744182.0,
        "subreddit_name": "AAPL",
        "comments": 1
    }
]