[
    {
        "title": "A message to all of you who earned less than 30% this year",
        "score": 2705,
        "url": "https://www.reddit.com/r/stocks/comments/rt12le/a_message_to_all_of_you_who_earned_less_than_30/",
        "content": "Over the past couple weeks, there have been a number high-horse posts on this sub directed at people who underperformed the S&P 500 index this year. \n\nI am here to tell you this: You might have done everything right and still fallen short of the S&P. That isn't inherently bad nor is it inherently a sign of failure. Lots of great companies' stocks had a bum year (AMZN, V, WMT, DIS, BA, MRK) and some got clobbered (PYPL, telecos, etc.) \n\nDespite popular opinion, investing in individual stocks is not about beating the indexes over an arbitrary short-term period of time. It's about owning shares of strong companies regardless of what the market is doing. Stocks like V and DIS could very feasibly beat the market significantly next year, and may be better positioned to do so if they're seen as a good value. \n\nMeanwhile, many posts and comments on here suggest getting out of every stock immediately (and worse, selling while they're down), and that you're foolish for even trying. This is not helpful advice. This advice is only helpful if you're the kind of person whose portfolio is 100% meme stocks with no earnings and you have no desire to learn anything new or improve your understanding of stocks or companies whatsoever. If this is you, then yes, you should listen to VTI or VT gang. \n\nBut, I suspect this is not most people here. I suspect this is a tired stereotype, and that a large number of people reading this understand the fundamentals of their holdings quite well but still underperformed this year. Big deal. If you're a buy and hold investor, this isn't a problem unless there's really something wrong with the companies. We all know stocks are more volatile than index funds. \n\nThere are lots of other reasons why someone might not be enjoying this 28% ride: Maybe they didn't have much invested at the beginning of the year. Maybe they're actively learning and making adjustments along the way. Maybe their net worth *is* mostly in index funds and they just want to play jazz with their stock portfolio. Maybe they're in VT and bonds, which is arguably more responsible, and had a far lower return than the S&P. \n\nI have learned an incredible amount about stocks this year thanks to this sub and websites like Investopedia, FinViz, OpenInsider, and others, and it has given me much enjoyment to participate in the markets in this way. Posts and comments that demean underperforming stock pickers essentially discourage learning. \n\nOne last point: There is an ever increasing interest in socially responsible investing, and rightly so in my view. However, the S&P is not very ESG. Everybody \"buying the haystack\" is profitting off the fossil fuel industry, war planes, guns, major polluters, animal testing, alcoholism, lung disease, the list goes on. The best performing sector this year was energy, specifically oil and gas companies, the main culprits of climate change. Of course, many people don't care and flout such concerns. But I bet many people in VTI or VT gang don't fully appreciate this relationship and would choose not to invest this way if they knew of a better option. Stock picking allows you to invest in companies you actually support without enriching the insiders of companies you don't. \n\nIn summary, this is r/stocks. We should be encouraging informative and intellectual discussion about stocks, and not ridiculing fellow redditors like they're a bunch of idiots.",
        "created_utc": 1640978164.0,
        "subreddit_name": "stocks",
        "comments": 520
    }
]