[
    {
        "title": "Guide to bitcoin mining stocks",
        "score": 1156,
        "url": "https://www.reddit.com/r/investing/comments/mq3sz8/guide_to_bitcoin_mining_stocks/",
        "content": "With Coinbase bringing tons of attention and looking like it will have a sky high valuation many are going to be looking for cheaper c****o stocks. \n\nMining stocks produce leveraged returns over the underlying asset, whether it's gold, silver, or bitcoin. \n\n* You are buying the profit (variable) minus costs (fixed). \n\n* Say it costs $10 to mine $11 worth of bitcoin/gold. That's $1 (10%) profit. \n\n* The asset doubles in price to $22 (+100%). Profit is $11 (+1100%).\n\nEvaluating miners can be daunting at first but they're actually very simple [quantifiable](https://static.seekingalpha.com/uploads/2021/3/12/49782598-16155711719714544_origin.png) operations with very little guesswork. By looking at [current](https://static.seekingalpha.com/uploads/2021/4/5/49782598-16176481499887147_origin.png) and [future](https://imgur.com/a/FS884xP) hashrate, electricity costs, and saved bitcoin we can value these companies with high precision at specific bitcoin price points. \n\nThere are two ways to value these stocks. Based on [current hashrate](https://static.seekingalpha.com/uploads/2021/4/5/49782598-16176654693896902_origin.png) or [projected hashrate](https://static.seekingalpha.com/uploads/2021/4/5/49782598-16176645878387735_origin.png). Their proper value probably lies somewhere in between. \n\nWith a very very modest 25PE (miners and hot tech stocks often go into the 100's) and bitcoin $100k (lower than most institutional estimates) we can calculate a [3.5-5.1x potential](https://imgur.com/w7uvlo5). \n\nMiners are a leveraged play on bitcoin like gold miners on gold. Their profit is the difference between the price floor to mine and price of bitcoin. Profitability data can be tracked [here](https://bitinfocharts.com/comparison/bitcoin-mining_profitability.html#1y). \n\nUnlike leveraged bitcoin you can't be washed out. Unlike altc*ins you don't risk picking the wrong blockchain. They combine the upside of altc*ins with the inevitability of bitcoin but somehow get the least attention. This of course also means they are more volatile than bitcoin so you need an iron stomach. \n\nThe public miners are in a race to secure hashrate and cheap power. With announced purchases we can calculate their [income](https://imgur.com/W2gRL0K).\n\nMiners are incentivized to [h*dl bitcoin](https://imgur.com/61rSlV9) and in some cases outright buy bitcoin for their balance sheets. This further increases price appreciation when bitcoin moves for the stocks with a high h*dl. \n\nMara and Riot have the highest market caps being on Nasdaq. However, the pre-Nasdaq stocks' [market caps](https://imgur.com/aKzj0PG) are far behind what their hashrate should be valued. There are some massive [price dislocations](https://imgur.com/P9qxdCx) going on because of the Nasdaq barrier. \n\n[Blonity](https://www.youtube.com/channel/UCPJvLknI9JEwW_p4m8xaAow) is a great analyst in the sector and has created an all in one [BMXI indicator](https://imgur.com/V3wWOtS) which calculates the degree of undervalue of each stock based on these hashrate-to-marketcap discrepancies. This [playlist](https://www.youtube.com/playlist?list=PLuzv_eMtviCHnWJ9Irn-nqslzD1XV5xsY) explains in more detail how the indicators work. Note: DGHI & DMGI are new smallcap miners that were recently added and have less history than the rest and I wouldn't recommend making them a main position. \n\nA Nasdaq uplisting could be explosive for the OTC miners. However, Mara and Riot may outperform in the short term due to better accessibility. In the long term Mara has the most future hashrate secured and will dominate the scene. My strategy is to hold mostly OTC miners now then roll into the Nasdaq miners after the value gaps close. \n\nThe biggest concern about miners (and what previous DDs here got wrong) is that mining is intensely competitive with little moat and they will lose marketshare as global hashpower ramps up. This is unfounded for multiple reasons. \n\n1. Asics and cheap megawatt energy & facilities are in short supply and they have bought up large shares for months to years into the future. Backlogs are huge.  \n1. Bitcoin's price and mining profitability has always appreciated [faster](https://imgur.com/0E73cNv) than the hashrate & difficulty so it's not an issue in the next year \n1. Public money should give them a growth advantage and I asked Blonity to test this hypothesis and indeed they are gobbling up [marketshare](https://imgur.com/rj0yW27).\n\nThese companies are also branching out. Argo has purchased a staking company, Hive & Hut8 do some GPU mining which can be used for AI/Rendering computation, some are buying bitcoin like Microstrategy, etc. They will evolve into general blockchain and data companies. \n\nWe can [calculate](https://imgur.com/poG6ZP3) how many times their share price could multiply at $200k bitcoin at various PE ratios. Hot tech companies can have PE's in the 100's. They're currently trading around 3-4.\n\nThis is the most asymmetric trade I've ever seen if you are bullish on bitcoin. With Coinbase around the corner I think these companies are going to get a lot of attention soon and the quiet pre-Nasdaq miners could have quite a run.\n\nAnother great way to hold these is the [BLOK ETF](https://amplifyetfs.com/blok.html). It has surprisingly good holdings with all the pre-Nasdaq miners represented in the top 10 and I highly recommend it. It has some good exchanges and straight bitcoin funds as well and they will be [adding](https://www.youtube.com/watch?v=xKE1tAyCSyo) COIN.\n\nSome other resources [1](https://seekingalpha.com/article/4417795-sizing-up-12-bitcoin-mining-stocks) [2](https://www.youtube.com/channel/UCPJvLknI9JEwW_p4m8xaAow) [3](https://www.youtube.com/channel/UCmnlt28-isf3okeyjUVHVhQ) [4](https://www.realvision.com/shows/the-interview-crypto/videos/blockstream-the-benefits-of-investing-in-bitcoin-mining).",
        "created_utc": 1618325413.0,
        "subreddit_name": "investing",
        "comments": 366
    },
    {
        "title": "Apple Event Officially Announced for Tuesday, April 20",
        "score": 7599,
        "url": "https://www.macrumors.com/2021/04/13/apple-event-april-23-announcement/",
        "content": "",
        "created_utc": 1618329866.0,
        "subreddit_name": "apple",
        "comments": 1196
    }
]