[
    {
        "title": "Apple officially stopped selling new Apple watchs",
        "score": 2645,
        "url": "https://finance.yahoo.com/news/apple-halts-online-sales-of-its-apple-watch-series-9-and-apple-watch-ultra-2-200021325.html",
        "content": "Things about to get ugly, big amount of put and high volume bid going on.",
        "created_utc": 1703190671.0,
        "subreddit_name": "wallstreetbets",
        "comments": 272
    },
    {
        "title": "Apple officially stops selling its latest Apple Watches online",
        "score": 1865,
        "url": "https://www.theverge.com/2023/12/21/24010965/apple-watch-series-9-ultra-2-removed-from-online-sale-store",
        "content": "",
        "created_utc": 1703190264.0,
        "subreddit_name": "apple",
        "comments": 322
    },
    {
        "title": "Apple Savings Account Interest Rate Increased to 4.25%",
        "score": 1183,
        "url": "https://www.macrumors.com/2023/12/20/apple-savings-4-25-interest-rate/",
        "content": "",
        "created_utc": 1703128876.0,
        "subreddit_name": "apple",
        "comments": 187
    },
    {
        "title": "Apple loses attempt to halt Apple Watch sales ban | The ITC denied Apple’s motion to stay the ban.",
        "score": 938,
        "url": "https://www.theverge.com/2023/12/20/24010011/apple-loses-attempt-halt-apple-watch-sales-ban-itc",
        "content": "",
        "created_utc": 1703120981.0,
        "subreddit_name": "apple",
        "comments": 408
    },
    {
        "title": "iMessage for Android app \"Beeper\" open sources their platform bridge following shutdown attempts by Apple.",
        "score": 668,
        "url": "https://blog.beeper.com/p/beeper-moving-forward",
        "content": "",
        "created_utc": 1703175586.0,
        "subreddit_name": "apple",
        "comments": 219
    },
    {
        "title": "I'm a professional (news driven) trader and these are some of my notes from premarket",
        "score": 146,
        "url": "https://www.reddit.com/r/Daytrading/comments/18nm84w/im_a_professional_news_driven_trader_and_these/",
        "content": "  \n**What happened yesterday, and my thoughts:**  \n\n\n* Yesterday, we saw the market start to do a little correction. There wasn’t much news behind the move, except for the fact that VIX options expired, and QQQ failed to break the Call resistance 0DTE at 410. This may have contributed as VIX options had been suppressing VIX till now, and the expiration reset the options positioning a little. As such, VIX moved higher rapidly from 12.5 to 14. For the most part though, this was just normal mean reversion.   \n\n* Markets have been at all time highs, up 16% on SPX since October lows, with 90% of stocks above their 50 day moving average. The market had just become a little too stretched, and needed to breathe. \n* Note that this is of course a very small correction in the scale of the move the market has just done, and is very healthy. Moving indefinitely higher is what’s not healthy. The market has to absorb and digest that move, before moving higher again. In premarket already, we can see the market already start to pare the drop. Over the next few days we will see volume dry up a little going into the Xmas break, and there isn’t much on the economic calendar in the way of major catalysts. With lower volume, we may see markets trade flat, or we can see exacerbated moves in either direction. With little on the economic calendar, it’s hard to guess exactly which way markets will move on a day to day basis. E..g markets are up in premarket, but this can easily fade to retest 4700 at least. On the whole, markets are still stretched despite the 500 point drop on the Dow, but this isn’t to say that today will be red. I caution against making day to day predictions because people call me up if they are in any way wrong. Look, we as investors aren’t fortune tellers, especially when there’s little on the economic calendar to guide us. We can only assess the overall state of the market, to determine risk reward. As readers had noted, I had left my passive positions running (trimmed a bit) and had sold all my active/swing trades, to build cash, because I suspected a near term small correction. I didn’t put the cash into the market yesterday. The dip happened so close to the close that why would I put it in just before, when I have no idea how markets will open tomorrow, especially with little particularly in premarket in way of economic news? The correction, whilst sudden, was still small. So personally, I am waiting to see more before I put the money I had trimmed, back into the market. If it moves higher form here, which premarket points to (although premarket movement means little), I will still be happy as my passive positions make money.   \n\n\n**My Trades:**\n\n* (Explaining trades I made in my personal portfolio. People have mentioned rightly not to share too much details about company work, so I have shared trades I was executing in my personal port instead)  \n\n* In terms of what I did yesterday, I explained in yesterday’s post that oil was trading at the top of the downward channel that had been forming. I thought it could easily get rejected there, so I trimmed half my oil positions, and left half running. My price target on oil is 80, so I left some going to meet that, but knew that this could easily get rejected at the top of that channel, so took some out. Technical analysis suggests it can even move lower to 67 now, although you’d have to see a move higher in dollar for that to happen.   \n\n* I also trimmed my enphase position because I was off the desk the day before. Note: I still have some running. I also have positions in FSLR and ARRY. I am bullish on solar still for next year. The reason why I sold some was because I was holding form 80. It was up a lot, and whilst interest rate cuts will help them a lot next year, it doesnt immediately change their near term earnings, which were guided last quarter to be terrible. A 62% move higher in quick time was good enough for me to take some profits here. \n\n————  \n**TODAY’S DATA LEDE/MACRO EVENTS:**  \n\n\n* **UK CBI Trades data:**\n* One of the less important metrics for the Uk, but does give some telling insight, especially because it was such a miss to the downside. Came out -32 vs forecast of -14. It’s a leading indicator of retail performance, so signals a weakening retail sector in UK. (Little impact in GBPUSD because it is a small indicator)  \n\n* **US GDP Final Revision (Q3) - Expected to remain above 5%**  \nPCE revisions too\n* note: these are both revisions, and barring a big surprise, won’t move markets too much as should be confirming previous readings.   \n\n* **US Jobless Claims**  \n————\n\n**INSTITUTIONAL RESEARCH**  \n\n\n* Evercore says that they see a big pullback in first half of 2024, as recession “materialises”.   \n\n* Goldman put out a piece where they compared the performance of small caps vs large caps in various markets over the last 12 months. There, they concluded that smalls have only outperformed large in emerging markets. Other than it, in Japan, Europe, US and others, they have underperformed large caps. This is something we all mostly knew anyway, since Mag7 led the rally most of the year. I suppose for those that don’t follow other markets, it’s interesting to know this was the case in other markets too.   \n\n* Goldman put out another piece looking at average inflation across G10 economies. They estimated that across them, core inflation ran at just 2.2% over past 3 months and 1.3% in November alone.   \n\n* Hedge funds net long positions on crude hit record low going back to 2011.   \n\n* Fitch says they expect their next moves from the Fed, ECB and BOE to be cuts - no sh\\*t Sherlock. No more hikes from here.   \n\n* Interesting fact: Statista shows that international tourism finally reaches pre pandemic level.   \n———\n\n**FOREX**  \n\n\n* GBP was lower yesterday after soft CPI print and continued slightly lower today. Trading 1.265. Note: I hold position in GBPUSD  \n\n* USDJPY continues doing correction as yen moves higher. This is correction after Yen sell off following BOJ dovishness. Note, can bounce off of 142.59. Then again, can not. Depends on initial jobless claims numbers as they can move the dollar.    \n\n* AUD moving higher again.   \n————— \n\n**MARKETS**   \n\n\n* SPX: Sold off yesterday a bit back to 4700. Held that level in aftermarket, and pared losses to 4722. ( up 0.5% from lows of yesterday)  \n\n* Nasdaq: Fell to 16,550 yesterday, pared some of those losses in premarket, up 0.7% in premarket from the lows.    \n\n* GER40 tracked the sell off in US overnight. Was relatively flat since.   \n\n* HKG: Opened much lower, after US sell off. Recovered 1.6% from there. Basically pushed up right from the open. Partly due to China economic stimulus measure announcements e.g. cutting deposit rate  \n\n* OIL: Failed to break out of downward channel yesterday. Still testing it in premarket. Needs to close above 75 on daily to break out.   \n\n* VIX: pushed up after expiration. Now at 13 handle.   \n\n* Bond yields slightly higher today, probably as sellers take from bonds into equities.   \n——————   \n\n\n**OTHER NEWS HEADLINES:**  \n\n\n* BIDEN IS CONSIDERING SOME TRUMP STYLE TARIFFS ON CHINESE GOODS. These are particularly form the Chinese EV market.   \n\n* SUGGESTION FROM LOCAL CHINESE NEWSPAPER THAT CHINA LARGE BANKS WILL CUT DEPOSIT RATES ON FRIDAY by 10 BPS and 20 BPS respectively on 1 and 2 year.   \nThat will encourage less saving and more spending. Its a stimulating measure. Has been done before and in reality won’t change that much but its a step in right direction.   \n\n* PBOC COMMITS TO KEEP LIQUIDITY AMPLE. This comes as their FDI came out weak, down 10% YOY for 2023.   \n\n* CHINA WILL REDUCE IMPORT TARIFFS ON SCARCE RESOURCES IN 2024 and WILL LOWER EXPORT TAX FOR HIGH PURITY ALUMINIUM. More measures to try to stimulate domestic economy from an inward and outward perspective.   \n\n* ECB’S DE GUINDOS follows other ECB officials over last couple of days in walking back rate cut talks. In reality, they are just trying to stop financial conditions easing too much. Rate cuts will come H1 2024.   \nHe said current rates are required to bring inflation down.   \n\n* US, JAPAN AND SK ALL CONDEMN North Korea BALLISTIC MISSILE LAUNCHES.  \n\n* IKEA says that they will face delayed problems too, due to Red Sea diversions  \n\n\n**————— MAG 7 NEWS ————**  \n\n\n* AAPL - Yesterday, during market news broke that Apple is trying o ramp up their Vision pro production, aiming for a February launch. \n* AAPL - Yesterday, also lost their bid to delay the Apple Watch Ban.   \n\n* AMZN - Wedbush raises price target to 210 from 180.   \n\n* TSLA - potential import tariff on Chinese EV is bullish for Tesla.   \n\n* TSLA - Is being probed by the Norweigian Roads Agency over suspension failures, relating to Model S and Model X.   \n\n* NVDA - up on Micron earnings   \n\n\n**——— EARNINGS ————**  \n\n\n* MICRON earnings were out - I won’t have time in premarket to read this one thoroughly due to being off the desk for part of today due to family bereavement.   \n\n* Here are the analyst price targets after the Earnings though:  \n\n   * Wolfe: Raised to 100 from 80  \nUBS: raised to 95 from 90  \nStifel: Raised to 80 from 76  \nDeutsche: Raised to 90 from 85  \nCiti: Raised to 95 from 88  \nGoldman: Raise from 97 to 85  \nJPM raised to 105 from 90  \nMizuho raised to 95 from 86  \n\n* Note Q2 forecast for MU was better than expected   \n\n\n**———— COMPANY SPECIFIC ————**  \n\n\n* Mining stocks like RIOT MARA are up following Bit at the 44k resistance again  \n\n* Chipmakers generally are higher following Micron earnings, where they forecasted their Q2 revenue to eb above expectations.   \n\n* Automakers can be up due to discussion of potential import tariff on Chinese EV. Note, this won’t affect others as much as Tesla as GM, Ford and others have all started scaling back thier Ev launch.   \n\n* UBER - will raise minimum wage it pays drivers in France. Drivers will make a minimum of 9 euros per trip, up 18% from before.   \n\n* LUV - Southwest Airlines pilots   \n\n* SPOT - raised to buy form hOld at Needham, price target is 40% above spot  \n\n* BA - up after reporting China cleared their 737 Max deliveries  \n\n* PAYX - down ahead of eanrings   \n\n* LTHM - Allkem to merge with Livent, combined name to be Arcadium Lithium on Jan 4. ",
        "created_utc": 1703162730.0,
        "subreddit_name": "DayTrading",
        "comments": 29
    },
    {
        "title": "I need a mentor. I'm willing to come to an agreement.",
        "score": 68,
        "url": "https://www.reddit.com/r/Daytrading/comments/18nt6j9/i_need_a_mentor_im_willing_to_come_to_an_agreement/",
        "content": "I started trading in March / April. Bought a course and coaching that was dramatically overpriced for very little guidance, but I didn't know what I didn't know. The system had a lot of problems, lots of false entries, sold as a pretty black and white strategy... I find it requires a ton of discretion to trade well. It was a strategy that relied on poor RR and high win rates (70%+). The only good thing I can say is that it onboarded me to brokerages, charting, and day trading in general.\n\nSince then, I've dabbled in everything under the sun strategy wise. Read a few of the important trading books out there. I mostly try to build my own setups using the elements of other strategies that I like or that I think would fit my personality. My goal is generally to boil anything I can down to a hard set of rules as much as possible, but that's obviously difficult.\n\nWhen I initially saw the potential in trading, I quit my job of 8 years (I know I should've waited for consistency, but it was killing me and I couldn't un-see the potential in trading). Sold my 401K, cashed out whatever little pension I had, and sold an extra car. These are not things I would have thought to do based on what you learn in investing 101, but I was determined to make it somehow - and I think I wanted to burn the boats. I didn't take that money out to trade with, just to live off of... although I did make the mistake of adding some of it to my trading account as I moved into more drawdown.\n\nI was coached in my program to start scaling up before I was at all ready in hindsight (basically I just had a good week of high win-rate poor R-based returns which they didn't even care about, but it was profitable), so I lost a lot during that period before I scaled back down myself. I'm trying to keep living expenses low and I don't live in a super expensive area, but at this point I'm down to several grand and the 60K equity in my house, which I can't get a loan against. I could sell, it would be a huge pain in the ass but maybe it's a sacrifice I need to make.\n\nI don't know what it is but I absolutely feel like I cannot go back to work - the thought at this point is like utter spiritual despair (I'm sure that sounds very entitled, but I worked crap jobs for a long time with zero financial education, I'm 34 now and I have to find a way out at all costs - I have no kids yet). I just want to achieve consistency in trading. Freedom first, and then after that there are a lot of good people in my life who I want to help.\n\nI trade SPY intraday. I began on 0DTEs but now I use 1DTE and primarily trying to stick to the 5 minute. I could get on a video call and share what I'm doing. I either need an experienced and profitable trader to help me iron out my system and tell me what to look for, what variables to focus on while back-testing, or honestly I'm willing to try to learn a strategy you think would get me profitable in short-order assuming I have the discipline and everything worked out. It would be helpful if I could copy your trades in the very short-term, just to bring a little cash cushion in first, but I understand if you're not comfortable with that - it's not a requirement.\n\nIf we talk and you think you can genuinely help me, I'm 100% happy to come to an agreement (in writing if need be) to completely pay you back for the time and effort once I'm profitable and scaled up to a decent size - within the first 6-12 months of consistent profitability, but I can't pay you upfront. I can only put in the work. I will say that heavily discretion-based strategies I think will be harder for me, but we can talk about where I'm at and do some kind of share screen of my charts before you commit to anything of course.\n\nI'll make a trading career one way or another, feel free to DM.",
        "created_utc": 1703182018.0,
        "subreddit_name": "DayTrading",
        "comments": 196
    }
]