[
    {
        "title": "TikTok crackdown bill unanimously approved by US House panel",
        "score": 2647,
        "url": "https://www.reddit.com/r/stocks/comments/1b96sjx/tiktok_crackdown_bill_unanimously_approved_by_us/",
        "content": "The U.S. House Energy and Commerce committee on Thursday unanimously approved legislation giving China's ByteDance six months to divest from short video app TikTok or face a U.S. ban.\n\nThe 50-0 vote represents the most significant momentum for a U.S. crackdown on TikTok, which has about 170 million U.S. users, which had stalled over the last year amid heavy lobbying by the company.\n\nLawmakers hope to move quickly on the measure and said the U.S. House of Representatives could take up the bill in the coming weeks.\n\n\"This legislation has a predetermined outcome: a total ban of TikTok in the United States,\" the company said after the vote. \"The government is attempting to strip 170 million Americans of their Constitutional right to free expression. This will damage millions of businesses, deny artists an audience, and destroy the livelihoods of countless creators across the country.\"\nBefore the vote, lawmakers got a closed-door classified briefing on national security concerns about TikTok's Chinese ownership.\n\n....\n\nThe bill would give ByteDance 165 days to divest TikTok; if it did not, app stores operated by Apple, Google, and others could not legally offer TikTok or provide web hosting services to ByteDance-controlled applications.\n\nSource: https://www.reuters.com/technology/new-push-congress-ban-tiktok-or-force-chinese-divestiture-gains-steam-2024-03-07/",
        "created_utc": 1709848865.0,
        "subreddit_name": "stocks",
        "comments": 637
    },
    {
        "title": "1 month. $3k -> $300k -> $480k",
        "score": 7004,
        "url": "https://www.reddit.com/gallery/1b8wf45",
        "content": "Sending thanks to the well-wishers that said get it and LFG. To all the rest of you regards that said I’d lose it, here’s the proof I learned my $700k stop-loss lesson from 3 years ago.\n\nI posted the last two days about my plays so don’t say I didn’t tell you about calls on Kroger. Discretionary spending was better than expected last quarter when interest rates dropped. Small businesses picked up biz and people got looser on spending from just necessities to some pricier substitutes. That was my thesis on Square with small businesses coming back, similar thesis on Dell with access to NVidia chips and hitting their laptop cycle this year. Same with Kroger. \n\nIf you’ve read this far, you’ll notice my gains don’t match my balance because I’m only half-regard and have been transferring out $50k every day this week. Image for proof. I just keep making more so 🤷‍♂️ \n\nHAVE A NICE DAY. STAY THICK",
        "created_utc": 1709822806.0,
        "subreddit_name": "wallstreetbets",
        "comments": 763
    },
    {
        "title": "NVIDIA (NVDA) Stock - Wait? or Sell?",
        "score": 159,
        "url": "https://www.reddit.com/r/investing/comments/1b93ybd/nvidia_nvda_stock_wait_or_sell/",
        "content": "I don't invest much. but bought NVDA 2 years ago ..and well, it grew from 200ish USD to 900ish USD.\n\nIn the last year, I've been mostly investing in ETFs like VOO just because I don't follow business/investing news too much and ETFs seem easy. Anyway, I'm wondering if I should just sell all my NVDA  (15 stocks) and purchase VOO or SMH. Or do people think that this upward trend with NVDA will continue?\n\nI have a few other stocks like Apple, Microsoft, etc that I bought years ago and haven't touched since.\n\n**Update**: Thank you all for sharing your views. I'm a beginner and this really helps my learning. I decided to hold for a longer time, since I don't really need the cash for anything now and I don't have plans for the $ that I have in NVDA. However, I will continue to focus on the tech trends and the stock price changes and change my plans if I see it dip more than what I'm comfortable. Thanks again!",
        "created_utc": 1709842135.0,
        "subreddit_name": "investing",
        "comments": 279
    },
    {
        "title": "Apple is working to make it easier to switch from iPhone to Android because of the EU",
        "score": 1043,
        "url": "https://www.theverge.com/2024/3/7/24093355/apple-digital-markets-act-compliance-android-switch-eu",
        "content": "",
        "created_utc": 1709833158.0,
        "subreddit_name": "apple",
        "comments": 383
    },
    {
        "title": "Apple Set to Be Quizzed by EU Over ‘Fortnite’ Maker Shutout",
        "score": 815,
        "url": "https://www.bloomberg.com/news/articles/2024-03-07/apple-set-to-be-quizzed-by-eu-over-fortnite-maker-shutout",
        "content": "",
        "created_utc": 1709806381.0,
        "subreddit_name": "apple",
        "comments": 480
    },
    {
        "title": "EU investigating Apple's block of Epic developer account",
        "score": 646,
        "url": "https://www.eurogamer.net/eu-investigating-apples-block-of-epic-developer-account",
        "content": "",
        "created_utc": 1709845593.0,
        "subreddit_name": "apple",
        "comments": 366
    },
    {
        "title": "Apple releases macOS Sonoma 14.4, watchOS 10.4, and more",
        "score": 617,
        "url": "https://9to5mac.com/2024/03/07/macos-14-4-watchos-10-4-tvos-17-4/",
        "content": "",
        "created_utc": 1709839608.0,
        "subreddit_name": "apple",
        "comments": 81
    },
    {
        "title": "First Month of Daytrading",
        "score": 215,
        "url": "https://i.redd.it/sw1s5n8m5ymc1.jpeg",
        "content": "Definitely had my fair share of moments of luck, overtrading, revenge trading, and trading too emotionally, but I am beginning to really push myself to trade more methodically and manage my emotions.\n\nI would really appreciate any tips from experienced traders!\n\nAlso, before the Robinhood comments, I just recently opened an account at Webull. I much prefer to trade on my phone and Webull seems to be the best fit, a key reason being they allow take profit and stop loss orders, unlike RH.",
        "created_utc": 1709832411.0,
        "subreddit_name": "DayTrading",
        "comments": 105
    },
    {
        "title": "Benefits of trading directly through TradeIdeas or TradingView?",
        "score": 104,
        "url": "https://i.redd.it/74cihfy2sxmc1.jpeg",
        "content": "This is only my second year trading as full time income, and I thought I had my system figured out and was doing pretty well… until I joined Reddit and realized I’m doing things totally different than everyone else. So now I’m questioning my setup. \n\nI trade directly through IBKR. I just use my laptop and a couple monitors for my TradeIdeas scanner, but I don’t do my trades through the TradeIdeas brokerage. I have a TradingView subscription but I don’t really use it; I like my IBKR indicators. \n\nSo can someone explain the benefit of trading through TradeIdeas or TradingView? Is it faster? Are the indicators better? \n\nI guess I’m just second guessing myself. I’m a mom of a bunch of kids and trading lets me finish “work” by 8:30/9:00 and get on with homeschooling and having fun. I love what it’s done for my family, and if there’s a way I could be doing it better or more efficiently, I really want to figure it out.\n\nPhoto for interest. Today my kids had an early morning extracurricular so I missed market open. Got to do a good dusting and desk cleanup instead. Please ignore the ugly cables; I’m just a mom trying to do her best with zero tech skills. ",
        "created_utc": 1709827861.0,
        "subreddit_name": "DayTrading",
        "comments": 69
    },
    {
        "title": "🚨📉 $AAPL is about to set a new record for the most consecutive red days in the last year!",
        "score": 2,
        "url": "https://www.reddit.com/r/AAPL/comments/1b8i3o3/aapl_is_about_to_set_a_new_record_for_the_most/",
        "content": "&#x200B;\n\nhttps://preview.redd.it/dmsbqhtvitmc1.png?width=1080&format=png&auto=webp&s=d02be99467895cbb8dd345fdf73465b7194296a4\n\nhow long will this streak continue?!",
        "created_utc": 1709776346.0,
        "subreddit_name": "AAPL",
        "comments": 9
    }
]