[
    {
        "title": "TikTok crackdown bill unanimously approved by US House panel",
        "score": 2647,
        "url": "https://www.reddit.com/r/stocks/comments/1b96sjx/tiktok_crackdown_bill_unanimously_approved_by_us/",
        "content": "The U.S. House Energy and Commerce committee on Thursday unanimously approved legislation giving China's ByteDance six months to divest from short video app TikTok or face a U.S. ban.\n\nThe 50-0 vote represents the most significant momentum for a U.S. crackdown on TikTok, which has about 170 million U.S. users, which had stalled over the last year amid heavy lobbying by the company.\n\nLawmakers hope to move quickly on the measure and said the U.S. House of Representatives could take up the bill in the coming weeks.\n\n\"This legislation has a predetermined outcome: a total ban of TikTok in the United States,\" the company said after the vote. \"The government is attempting to strip 170 million Americans of their Constitutional right to free expression. This will damage millions of businesses, deny artists an audience, and destroy the livelihoods of countless creators across the country.\"\nBefore the vote, lawmakers got a closed-door classified briefing on national security concerns about TikTok's Chinese ownership.\n\n....\n\nThe bill would give ByteDance 165 days to divest TikTok; if it did not, app stores operated by Apple, Google, and others could not legally offer TikTok or provide web hosting services to ByteDance-controlled applications.\n\nSource: https://www.reuters.com/technology/new-push-congress-ban-tiktok-or-force-chinese-divestiture-gains-steam-2024-03-07/",
        "created_utc": 1709848865.0,
        "subreddit_name": "stocks",
        "comments": 637
    },
    {
        "title": "1 month. $3k -> $300k -> $480k",
        "score": 7004,
        "url": "https://www.reddit.com/gallery/1b8wf45",
        "content": "Sending thanks to the well-wishers that said get it and LFG. To all the rest of you regards that said I’d lose it, here’s the proof I learned my $700k stop-loss lesson from 3 years ago.\n\nI posted the last two days about my plays so don’t say I didn’t tell you about calls on Kroger. Discretionary spending was better than expected last quarter when interest rates dropped. Small businesses picked up biz and people got looser on spending from just necessities to some pricier substitutes. That was my thesis on Square with small businesses coming back, similar thesis on Dell with access to NVidia chips and hitting their laptop cycle this year. Same with Kroger. \n\nIf you’ve read this far, you’ll notice my gains don’t match my balance because I’m only half-regard and have been transferring out $50k every day this week. Image for proof. I just keep making more so 🤷‍♂️ \n\nHAVE A NICE DAY. STAY THICK",
        "created_utc": 1709822806.0,
        "subreddit_name": "wallstreetbets",
        "comments": 763
    },
    {
        "title": "NVIDIA (NVDA) Stock - Wait? or Sell?",
        "score": 159,
        "url": "https://www.reddit.com/r/investing/comments/1b93ybd/nvidia_nvda_stock_wait_or_sell/",
        "content": "I don't invest much. but bought NVDA 2 years ago ..and well, it grew from 200ish USD to 900ish USD.\n\nIn the last year, I've been mostly investing in ETFs like VOO just because I don't follow business/investing news too much and ETFs seem easy. Anyway, I'm wondering if I should just sell all my NVDA  (15 stocks) and purchase VOO or SMH. Or do people think that this upward trend with NVDA will continue?\n\nI have a few other stocks like Apple, Microsoft, etc that I bought years ago and haven't touched since.\n\n**Update**: Thank you all for sharing your views. I'm a beginner and this really helps my learning. I decided to hold for a longer time, since I don't really need the cash for anything now and I don't have plans for the $ that I have in NVDA. However, I will continue to focus on the tech trends and the stock price changes and change my plans if I see it dip more than what I'm comfortable. Thanks again!",
        "created_utc": 1709842135.0,
        "subreddit_name": "investing",
        "comments": 279
    }
]