[
    {
        "title": "Apple advertises the iPad as being a computer replacement, and yet, if I forget my passcode, it requires a computer to reset.",
        "score": 7797,
        "url": "https://www.reddit.com/r/apple/comments/8v94a3/apple_advertises_the_ipad_as_being_a_computer/",
        "content": "Per Apple, if you have forgotten the passcode necessary to log in to your iPad, you must connect the device to a computer running iTunes.\n\nhttps://support.apple.com/en-us/ht204306\n\n>Connect your iOS device to your computer and open iTunes. If you don't have a computer, borrow one from a friend, or go to an Apple Retail Store or Apple Authorized Service Provider. \n\nThis seems like a rather significant oversight on Apple's part, particularly when the company has recommended the iPad as a replacement for a computer.\n\nFor example:\n\nAssume you are on a business trip, and bring your iPad with you. You stay in a hotel that has Wi-Fi, but you've never connected to it before. You recently changed your passcode to log in on your iPad, but have forgotten it. Without access to a computer, there is nothing you can do. \n\nWorking in an environment where I work with iPads daily, imagine how ridiculous it must seem to have to explain to someone that they have to have access to a computer to reset a forgotten passcode. It's insane to me that this capability isn't available without the need for a computer.\n\n-----\n\n**EDIT:** I know erasing via Find My iPad exists, but for it to work, you have to have a Wi-Fi connection, which may not be an option if you can't unlock the iPad to connect. Additionally, this is not what Apple recommends.\n\n**EDIT 2:** I think the best solution would be the ability for the iPad to remotely boot to an Internet-based version of iOS, [like macOS Internet Recovery](https://support.apple.com/en-us/ht201314) mode. This would enable the ability to restore an iPad without access to a computer. [See this screenshot](http://media.idownloadblog.com/wp-content/uploads/2016/02/OS-X-Internet-Recovery-Mode-Mac-screenshot-002.jpg) for an example of what this looks like on macOS.\n\n**EDIT 3:** It doesn't have to be limited to passcode issues. For instance, on the Mac, if macOS is experiencing an issue, you can reinstall macOS from the recovery partition OR via Apple's Internet Recovery servers. On iOS, however, if you need to reinstall the software, you have to connect to a computer and do so via iTunes. Wouldn't it be nice if iOS had the same Internet Recovery functionality as macOS so you could troubleshoot your device without the need to have to use a computer? Particularly when Apple is positioning the iPad as a device to replace computers?",
        "created_utc": 1530441841.0,
        "subreddit_name": "apple",
        "comments": 761
    }
]