[
    {
        "title": "Nvidia’s stock plunge leads Magnificent Seven to record weekly market-cap loss",
        "score": 724,
        "url": "https://www.reddit.com/r/stocks/comments/1c86tnn/nvidias_stock_plunge_leads_magnificent_seven_to/",
        "content": "https://www.marketwatch.com/story/nvidias-stock-plunge-leads-magnificent-seven-to-record-weekly-market-cap-loss-8e0a55f7\n\n> The decline in Magnificent Seven stocks has erased a collective $934 billion from their market capitalizations so far this week, which would make for the group’s worst-ever weekly loss of market value if it holds through the close.\n\n> While Tesla Inc.’s stock TSLA, -1.92% is the biggest weekly percentage decliner of the gang from a stock perspective, Apple Inc. AAPL, -1.22%, Microsoft Corp. MSFT, -1.27%  and Nvidia Corp. NVDA, -10.00% are bigger contributors to the market-cap losses as they are all worth substantially more than the car maker.\n\n> Nvidia is tracking toward being the biggest market-cap loser of the week, shedding $258 billion with about one hour left in Friday’s trading day. That’s more than the total market capitalization of rival Advanced Micro Devices Inc. AMD, -5.44%, at $236 billion.\n\n> Shares of Nvidia are down 10.3% so far this week as the semiconductor sector has been under pressure. Nvidia’s stock is suffering its worst weekly performance since Sept. 2, 2022 on a percentage basis. It’s also down 8.1% in Friday action, putting it on track for its worst single-day percentage drop since it fell 9.5% on Sept. 13, 2022. With the stock down more than $68, it’s heading for its largest one-day price decline on record.",
        "created_utc": 1713558016.0,
        "subreddit_name": "stocks",
        "comments": 252
    },
    {
        "title": "Elizabeth Warren on green texts: Apple is ruining relationships",
        "score": 5624,
        "url": "https://9to5mac.com/2024/04/19/elizabeth-warren-on-green-texts/",
        "content": "",
        "created_utc": 1713538378.0,
        "subreddit_name": "technology",
        "comments": 2629
    },
    {
        "title": "Apple Removes WhatsApp, Threads From China App Store on Government Orders",
        "score": 928,
        "url": "https://www.wsj.com/articles/WP-WSJ-0001716697?mod=article_recs_pos1_sb_hp&next_redirect=true",
        "content": "",
        "created_utc": 1713490501.0,
        "subreddit_name": "apple",
        "comments": 307
    },
    {
        "title": "HomePod with LCD display again corroborated by leaked part",
        "score": 639,
        "url": "https://9to5mac.com/2024/04/18/homepod-lcd-display/",
        "content": "",
        "created_utc": 1713544650.0,
        "subreddit_name": "apple",
        "comments": 250
    }
]