[
    {
        "title": "Nvidia’s stock plunge leads Magnificent Seven to record weekly market-cap loss",
        "score": 724,
        "url": "https://www.reddit.com/r/stocks/comments/1c86tnn/nvidias_stock_plunge_leads_magnificent_seven_to/",
        "content": "https://www.marketwatch.com/story/nvidias-stock-plunge-leads-magnificent-seven-to-record-weekly-market-cap-loss-8e0a55f7\n\n> The decline in Magnificent Seven stocks has erased a collective $934 billion from their market capitalizations so far this week, which would make for the group’s worst-ever weekly loss of market value if it holds through the close.\n\n> While Tesla Inc.’s stock TSLA, -1.92% is the biggest weekly percentage decliner of the gang from a stock perspective, Apple Inc. AAPL, -1.22%, Microsoft Corp. MSFT, -1.27%  and Nvidia Corp. NVDA, -10.00% are bigger contributors to the market-cap losses as they are all worth substantially more than the car maker.\n\n> Nvidia is tracking toward being the biggest market-cap loser of the week, shedding $258 billion with about one hour left in Friday’s trading day. That’s more than the total market capitalization of rival Advanced Micro Devices Inc. AMD, -5.44%, at $236 billion.\n\n> Shares of Nvidia are down 10.3% so far this week as the semiconductor sector has been under pressure. Nvidia’s stock is suffering its worst weekly performance since Sept. 2, 2022 on a percentage basis. It’s also down 8.1% in Friday action, putting it on track for its worst single-day percentage drop since it fell 9.5% on Sept. 13, 2022. With the stock down more than $68, it’s heading for its largest one-day price decline on record.",
        "created_utc": 1713558016.0,
        "subreddit_name": "stocks",
        "comments": 252
    },
    {
        "title": "Elizabeth Warren on green texts: Apple is ruining relationships",
        "score": 5624,
        "url": "https://9to5mac.com/2024/04/19/elizabeth-warren-on-green-texts/",
        "content": "",
        "created_utc": 1713538378.0,
        "subreddit_name": "technology",
        "comments": 2629
    },
    {
        "title": "Apple Removes WhatsApp, Threads From China App Store on Government Orders",
        "score": 928,
        "url": "https://www.wsj.com/articles/WP-WSJ-0001716697?mod=article_recs_pos1_sb_hp&next_redirect=true",
        "content": "",
        "created_utc": 1713490501.0,
        "subreddit_name": "apple",
        "comments": 307
    },
    {
        "title": "HomePod with LCD display again corroborated by leaked part",
        "score": 639,
        "url": "https://9to5mac.com/2024/04/18/homepod-lcd-display/",
        "content": "",
        "created_utc": 1713544650.0,
        "subreddit_name": "apple",
        "comments": 250
    },
    {
        "title": "I'm a full time trader and this is everything you need to know in premarket 19/04 after Israel retaliates against Iran.",
        "score": 366,
        "url": "https://www.reddit.com/r/Daytrading/comments/1c7us8g/im_a_full_time_trader_and_this_is_everything_you/",
        "content": "**OVERNIGHT GEOPOLITICS:**\n\n* Israel launched 3 drones on Iran with a military base in the city of Isfahan the target. Nuclear site was near there. \n* No damage to nuclear site.\n* Iran says they were able to destroy the 3 drones over Isfahan. \n* Israel apparently gave pre warning to the US that they would do this. \n* Senior Iranian official says no plans or immediate retaliation, Israel has already seen our reaction. That’s calming things down a bit. \n* Iran are signalling they will not retaliate. \n* IAEA criticises nuclear facility as ever being a target. \n* Shipping firms jump after Israel attack, on expected shipping supply problems which will boost freight rates\n\nANALYSIS: \n\n* Big reaction in after hours after Israel attacked in retaliation to Iran. In truth, there esponse was quite measured, and Iran is saying they aren’t planning a big retaliation. \n* Initially, we saw JPY and CHF get bid, along with Gold and oil. These are safe haven assets, thats why. Meanwhile, AUD, NZD, BTC and Equities all sold off as risk on assets. \n* The drop triggered CTA selling on futures, which led to a more exaggerated impact. Furthermore, we are in a scenario of Market illiquidity, buyback blackout, market depth very low. This makes the after hours response more exaggerated. \n* VIX jumped. \n* Now, we see the initial reaction almost entirely pared. Futures have recovered, but will be weighed by Netflix earnings. \n* Vix is selling off, and currency movement has normalised.\n* Remember OPEX today on top which will drive volatility, particularly at open and at closing. \n* On oil, expect more choppiness as skew continues to point lower despite the geopolitics news overnight\n* Skew on SPX is lower. Look, yes, SPX is selling off, but it still appears to be hedging. Institutions are buying dips, whilst hedging for downside with weekly vix calls. \n* Mag7 skew still points higher, and credit spreads are very low. \n* Institutions, from money flows, we can see, are not selling just because of the pullback. They are actually going more long.\n* It’s just because of the lack of liquidity and VIX being elevated, market makers aren’t supporting the full recovery in SPX yet. \n* THis is still a bullish environment, just being rocked by persistent geopolitical news which is spiking vix, forcing market makers to remove liquidity. \n* Once geopolitical situation normalises, we will see vix lower and more likely a squeeze higher.\n* Main risks to this thesis are earnings surprises by big firms, and also more geopolitical unrest. If Iran is right that they won’t retaliate big time to this attack, then probably we see the 2nd point not really materialise. \n* TSLA looks a bit dicey to me though. Semis can struggle a bit too if TSM continues lower as it doesnt yet look like traders are looking to jump in. Continued call selling. Maybe see drop to 125. \n* If we look at GOOGl, Skew points lower as we see so downward presusre persists into opex. \n\nDATA LEDE:\n\n* Japanese Inflation ate, came in at 2.7%, in line with expectations. Slightly down from last months reading of 2.8%   \n Core came in at 2.6%, slightly down from last months 2.8%\n* Overall, still maintaining BOJ’s target above 2%\n* UK retail sales:\n* YOY came in at 0.8% missing expectation of 1%. Better than -0.4% last month\n* MOM was 0%, vs forecast of 0.3%\n* Core retail sales came -0.3% MOM vs forecast of 0.3%\n* Core retails ales YOY was 0.4% missing exp of 1%\n* So slightly soft Retail sales , particularly on core retail sales. \n* Retail stocks in Europe then underperformed as Retail numbers came in soft. \n\nMARKETS:\n\n* Futures slumped initially after Israel launched airstrikes on Iran in response to attack last week.\n* This led SPX to be down 2% to 4930 initially, before initial impact was pared, and now SPX trades back at 5000. \n* NDX dropped more than 2% to the 17k level, before bouncing off and recovering back to 17399. \n* Dow Jones was down to below 37,300, before increasing again back to 37,665. \n* HKG50: Sold off to the 16k level, before recovering with the US markets. \n* Ger40: was lower overnight but push higher this morning means Ger40 nearly turns green. \n* Oil jumped initially back to 85, before paring the gains back to 82.5. SO now just marginally up. \n* Similar on Gold\n* VIX - after the attack overnight, VIX jumped to 21 as markets sold off, but VIX has sold off the gain and is back at 19, which has fuelled the recovery in markets as market makers add liquidity back. \n\nFX:\n\n* After Israel airstrikes on Iran in response to attack last week, we initially saw Yen and CHF jump as safe haven assets, whilst AUD and NZD dropped initially as they are risk on assets. \n* Now we see the initial impact pared, as both come back to being neutral \n* This coincides with the paring of losses on indices. \n* YEN - 76% of economists expect BOJ intervention to stop further weakening from 155. \n\nEARNINGS:\n\nNETFLIX \n\n* Revenue was 9.37B, beating estimate of 9.26B\n* EPS was 5.28, beating estimate of 4.52\n* Netflix streaming subscriber count was +9.33M, beating estimates of +4.84M\n* Operating income was a beat by 8.1%\n* Operating margin was 28.1%, better than the 25.7% expected\n* Free Cash Flow was a beat by 14%\n* Net subscriber change:\n* Massive beat in all regions\n* US and Canada beat by 170%\n* GUIDANCE:\n* Q2 2024 - revenue growth expected to be 16% vs 16.2% expected\n* FULL YEAR - revenue growth expected to be 25% slightly better than the 24% expected. \n* Said they will end reporting quarterly membership numbers next year. Its because of this that they are down in premarket. \n\nISRG earnings:\n\n* Beat revenue estimates by 1.1%\n* Beat EBIT estimate by 75%\n* EPS beat by 6%\n* Beat GPM by 20 bps \n* results benefited from backlog, strong demand and no covid headwinds. They said they are seeing installed base up 14%, strong demand and therefore said they are seeing more procedures\n\nMAG 7:\n\n* NFLX down on earnigns \n* TSLA - Lower again today after close below 150. \n* This on News that they will recall 3,878 cyber trucks over faulty accelerator pedal. \n* AAPL & META - just removed WhatsApp and Threads from its App Store in China saying that the Chinese Government ordered them to. \n* META & MVDA - Nada announced optimisations across its platforms to accelerate FB’s Llama 3, the latest generation of large language model.\n* MSFT - their OPenAI partnership could face EU antitrust investigation. \n* AAPL - lowest close since May 2023. \n* GOOGL - Uk regulator says Google’s changes to cookies for ad privacy fall short. \n* COMPANY SPECIFIC:  \n PARA - pops as Sony in talks to join a bid to buy Paramount, along with Apollo Global\n* Chinese EV is lower generally . This comes as hang seng tech index drops significantly overnight after Israel airstrikes. Most of those losses are now pared though. \n* LI - Deutsche Bank says that Li’s L6 will be their sales growth driver, but will face stiff competition. Li also were assigned a high risk rating by Citigroup\n* ON - maintained at hold by Stifel, price target 72\n* Crypto stocks are all higher as BTC up 4.5%. MARA, COIN, RIOT etc all higher - This comes ahead of halving\n* COin up despite some users reporting delays in sending and receiving on their platform for NEAR and ARB \n* TSM lower again after 5% drop yesterday, after strong earnings reported. TSMC were down almost 7% in Taipei market\n* This despite news that TSM will sign up with SK Hynix on next gen HBM4 technology\n* Semis generally ar e a bit lower. This includes, ARM, MU, COHR, AMD etc\n* HXL - price target cut to 86 from 90\n* RIVN - Needham slashed price target on stock\n* ISRG up on earnigns as their results benefited from backlog, strong demand and no covid headwinds. They said they are seeing installed base up 14%, strong demand and therefore said they are seeing more procedures. A number of analysis including Jefferies, BTIG, Piper Sandler etc raised their price targets. \n* HOOD - their 24 hour trading platform went down overnight \n* BA - plan to start selling flying cars by 2030\n* JWN - Nortdstrom family is considering taking the retailer private amid market challenges. \n* Nissan cuts annual operating profit estimate by 15% due to lower sales. \n* GM and Ford - Reuters report that they are now moving to relying on gas powered trucks as EV growth slowing. \n* MU - seeks federal funding to modernise DRAM production in Virginia. \n* ULTA - down as Jefferies pulls away from bull rating\n* PG earnings - revenue growth ate continues to slow across all segments in Q3. \n* PLCE - down after warning on late 10K filing\n* INFY - cut to hold from buy at HSBC\n* ON Price target announced 55 by BNP Paribas. Cut to underperform\n\nOTHER NEWS:\n\n* Fed’s Kashkari says they could potentially wait until 2025 to lwoer rates. \n* Bostic’ - says that the Fed won’t be able to reduce rates until towards end of year. Pth to 2% inflation will be slower than people expect, and bumpy. \n* US is reportedly considering $1B in arms sale to Israel. Deal includes tank ammunition, military vehicles and mortar rounds\n* CIA director says that Ukraine will lose the war this year without aid. \n* Cocoa hits new record high as factory processing rises despite global shortage\n* G7 foreign ministers reiterate opposition to full scale Israeli military operation in Rafah\n* Call for immediate ceasefire in Gaza\n* Said they will hold Iran accountable for malicious actions in Middle East\n* ECB - 3 or 4 rate cuts are possible this year. Will decide on cuts based on quarterly projections\n* YEN - 76% of economists expect BOJ intervention to stop further weakening from 155. \n* BoA raises Euro area GDP growth forecast to 0.5% from 0.4%\n* S&P downgrades Israel to A+ from AA- due to geopolitical risk\n* 8 Killed in major Russian attack in Ukraine. \n* S&P Global says that China’s fiscal stimulus is losing its effectiveness. They said it is more of a strategy just to buy time for industrial and consumption policies. ",
        "created_utc": 1713527002.0,
        "subreddit_name": "DayTrading",
        "comments": 52
    },
    {
        "title": "QQQ just erased 100% of the gains made this year in a single week.",
        "score": 3512,
        "url": "https://i.redd.it/ig17drp2khvc1.png",
        "content": "",
        "created_utc": 1713554121.0,
        "subreddit_name": "wallstreetbets",
        "comments": 585
    }
]