[
    {
        "title": "Why is Intel lagging for so long? Where did they go wrong",
        "score": 677,
        "url": "https://www.reddit.com/r/stocks/comments/1c4c199/why_is_intel_lagging_for_so_long_where_did_they/",
        "content": "Honestly Intel's profits are so low, they are literally trading at a 89P/E and that's after the government helped them so much through the CHIPS act...\n\nMeanwhile TSMC manufactures all the cutting edge chips - be it Nvidia's GPUs, or even Apple's M1/M2, and still trades at an incredible P/E 11.9. Apart from invasion risks from China, TSMC seems like an incredible business, meanwhile this all-american chip manufacturer is failing hard at pretty much everything.\n\nI just don't get it. After Apple cut the contract with intel, everything went so downhill for them, seems like theres no bottom....",
        "created_utc": 1713150698.0,
        "subreddit_name": "stocks",
        "comments": 364
    },
    {
        "title": "Apple's First AI Features in iOS 18 Reportedly Won't Use Cloud Servers",
        "score": 1576,
        "url": "https://www.macrumors.com/2024/04/14/apples-first-ios-18-ai-features-no-cloud/",
        "content": "",
        "created_utc": 1713143082.0,
        "subreddit_name": "apple",
        "comments": 398
    },
    {
        "title": "Apple Further Explains Why Game Boy Emulator iGBA Was Removed From App Store",
        "score": 1170,
        "url": "https://www.macrumors.com/2024/04/15/apple-further-explains-igba-removal/",
        "content": "",
        "created_utc": 1713199882.0,
        "subreddit_name": "apple",
        "comments": 327
    },
    {
        "title": "Apple Removes Game Boy Emulator iGBA From App Store Due to Spam and Copyright Violations",
        "score": 1162,
        "url": "https://www.macrumors.com/2024/04/15/apple-removes-igba-from-app-store/",
        "content": "",
        "created_utc": 1713164756.0,
        "subreddit_name": "apple",
        "comments": 281
    },
    {
        "title": "Japan turns up heat on Apple, Google with threat of fines",
        "score": 620,
        "url": "https://www.theregister.com/2024/04/15/japan_app_store_monopolies/",
        "content": "",
        "created_utc": 1713215970.0,
        "subreddit_name": "apple",
        "comments": 265
    },
    {
        "title": "Anyone buying calls for after WWDC?",
        "score": 11,
        "url": "https://www.reddit.com/r/AAPL/comments/1c4td3v/anyone_buying_calls_for_after_wwdc/",
        "content": "With just a Gurman report of M4 chips being AI focused driving up the stock 4%, there's clearly a lot of desire in the market to see Apple's AI play. I expect this WWDC is going to be all about AI in all of their major OS's and might get a repricing. Apple is trading at 27x price to earnings compared to Microsoft's 37, so there's quite a ways up to go if the market starts to believe they're hitched onto AI. \n\nAnyone playing with calls for a bit after WWDC?",
        "created_utc": 1713205248.0,
        "subreddit_name": "AAPL",
        "comments": 10
    }
]