[
    {
        "title": "MacBook Pro Keyboard Failures: Why Apples dust excuse is bullshit! [Teardown + Explanations]",
        "score": 11298,
        "url": "https://www.reddit.com/r/apple/comments/bjtyaw/macbook_pro_keyboard_failures_why_apples_dust/",
        "content": "Today we will be tearing down a MacBook Pro keyboard to try and see if we can rule out dust as a possible cause.  Settle down, because this will be a bit of a long post. Hopefully you'll at least learn something from this.\n\n***Disclaimer: This post is not meant to answer why keyboards fail. That is beyond me and I can only offer theories. My goal is only to disprove the idea that dust causes no-input and multi-input style failures.***\n\n***My Background:***\n\n* I've worked as an Apple Authorized Service Provider (AASP) Technician for the last 3 years.\n* Before that, I use to work as a 3rd party Technician at an Apple-focused repair shop.\n\nBecause of this experience, I stand in an interesting position where I use to see all the shit Apple pulls in order to make 3rd party and DIY repair difficult, and now I sit in a position where I can see exactly how Apple deals with these issues and get a more-representative ideas of how the machine fails, how many fail, and exactly what the most common failures are. \n\n***History:*** \n\nApple originally released the Butterfly-style keyboard back in 2015 with the release of the 12\" Macbook. Afterwards in 2016, this keyboard design was expanded to all Macbook Pros. The butterfly keyboard is different from a conventional rubber-dome keyboard that was used for 20+ years before that. It uses a metal dome that buckles under enough stress and makes contact between 2 metal terminals, and the keycap itself is held up with a butterfly-style henge rather than a traditional scissor hinge. Both are pictured further down.\n\n***This entire experiment began with a thought: How could something as simple as dust kill the keyboard switch?***\n\nMy old 3rd party tech instincts say that this should not be possible, since there are billions of smartphones that use metal-dome style buttons that do not experience failures like this.\n\nApples official stance is that dust manages to somehow enter the keyboard and cause the issues. This can cause things like: \n\n* Keyboard keys feel sticky, crunchy, or are physically jammed.\n* Keyboard does not input even though you pressed the key.\n* Keyboard inputs the same character 2+ times even though you only pressed the button once.   [https://www.apple.com/support/keyboard-service-program-for-macbook-and-macbook-pro/](https://www.apple.com/support/keyboard-service-program-for-macbook-and-macbook-pro/)\n\nTheir official documentation also states that you can \"fix\" the issue by using compressed air to blow out the keys.     [https://support.apple.com/en-ca/HT205662](https://support.apple.com/en-ca/HT205662)\n\nWhen it comes to failures, there's 3 schools of thought about how the switches fail:\n\n* \"Dust\" Theory. This generally takes apples words at face value and don't go deep into it.\n* \"Heat\" Theory. This assumes that Dust Theory is bullshit and assumes that overheating causes the material to expand and warp enough to render the buttons inoperable (2018 TouchBar models in particular).\n* \"Shit Design\" Theory. This assumes and accepts that it's just awful design.      \n\nYou may have also seen articles like [https://www.digitaltrends.com/computing/macbook-pro-keyboard-failure-rate-double-older-models/](https://www.digitaltrends.com/computing/macbook-pro-keyboard-failure-rate-double-older-models/) that , relative to all repairs done in 2016/2017, the keyboard failure rate is in the low 10% range, but these should not be accepted at all since they do not take into account a number of things that critically invalidate these statistics as a whole:\n\n* **They come from the words of AASP and Apple employees, which is a huge conflict of interest considering they have to sell these machines to make money.**\n* **They do not take into account the number of repairs that were turned down due to the cost of the repair itself, which is around 500USD before the keyboard replacement program came into effect.**\n* **They do not take into account the number of people that don't want to go to apple or cannot go to apple due to time constraints, especially since most countries do not offer over-the-phone mail-in repairs on Macs.**\n* **They do not take into account the number of people who just avoid apple stores and AASP in general and instead go to local 3rd party repair stores.**\n* **The keyboard program was introduced June 22, 2018, meaning that anyone before that date who does not have warranty was forced to pay 500USD for the replacement part, and most likely falls into the above. Notice how conveniently these statistics don't include numbers for 2018?**\n\nFrom my experience as an Apple Technician, here are the most commonly reported problems at my store, in order of most to least common:\n\n1. No-input, particularly from all vowel keys, most commonly used consonants, spacebar, enter, and shift.\n2. Multi-input, particularly from all vowel keys, most commonly used consonants, spacebar, enter, and shift.\n3. Sticky/Crunchy/Stuck keys.\n\nAs for demographic, the most common folks we see with these issues are:\n\n* Writers or any kind (blog, scripts, office workers, etc).\n* Students of all kinds.\n* Programmers. \n\nWith that said, here are a few things that were floating around in my head:\n\n1. The first red flag about the dust hypothesis should be the failure types. Only 1/3 are related to physical objects actually preventing the keys from working. The other 2/3 are related to electricity, specifically whether the circuit in the switch itself is \"closed\" or \"open\". Open circuit means that the positive and negative terminals are not connected, which is the equivalent of a keyboard button that is not pressed. Closed circuit is the opposite. \n2. Second red flag is that human dust and household dust is classified as non-conductive. By itself, it does not have enough conductivity to meaningfully carry electricity, so the multi-input style failure should not be possible at all. The No-input failure can somewhat be explained with dust, since it can at as an insulator between 2 metal terminals, but keep reading and you'll see why this isn't the case. \n3. Third red flag should be specifically which keys fail. Spacebar, enter, shift, vowels, and the most common consonants are the most commonly pressed buttons whenever anyone types on their keyboard. Coincidentally, these buttons are the ones that are reported to fail the most.\n4. Finally, the last red flag is the demographic. All of these are people who type a lot on the machines. While this one is highly anecdotal, most of my customers fall within this demographic.     \n\n&#x200B;\n\nEnough rambling, on with the teardown!    \n\n&#x200B;\n\n[https://i.imgur.com/5MRswJ6.jpg](https://i.imgur.com/5MRswJ6.jpg)\n\nIn front of me, I have what's referred to as a Top Case assembly. Its essentially the metal frame, battery, keyboard and trackpad, all shipped and prepared as one piece for Apple techs to swap out. This particular one came from a 2017 model MacBook Pro 13\", which rocks the 2nd generation of the Butterfly keyboard. This specific top case came from a machine that was \"liquid damaged by my drunk roommate\" so I have no issues tearing it apart for the greater good.\n\n[https://i.imgur.com/dnwTzDO.jpg](https://i.imgur.com/dnwTzDO.jpg)\n\nAfter removing the keycaps, here's what the keys actually look like underneath. Theres a few main parts here:\n\n* The silver metal dome. Thats what actually teams the machine that a key is pressed. It makes contact between metal pads when it is pressed.\n* Clear Plastic Housing around metal done. Its there to make sure the dome doesn't go anywhere and keeps it safe.\n* Butterfly Mechanism. This is the white part all around the perimeter of the clear plastic body.\n\nI included both larger and smaller sized keys just for demonstration purposes.\n\n[https://i.imgur.com/VoRDuhG.mp4](https://i.imgur.com/VoRDuhG.mp4)\n\nButterfly Mechanism in action. This is actually a genius idea, since it eliminates individual moving parts in favour of a single Large one. Youtube creator Veritasium made a video talking about how flexible moving pieces have a lot more advantages over multi-piece hinges ([https://www.youtube.com/watch?v=97t7Xj\\_iBv0](https://www.youtube.com/watch?v=97t7Xj_iBv0)).\n\n[https://i.imgur.com/8zsuDFg.mp4](https://i.imgur.com/8zsuDFg.mp4)\n\nMetal dome in action. This is what happens to the dome and butterfly mechanism when the key is pressed.\n\n[https://i.imgur.com/SROBJRq.jpg](https://i.imgur.com/SROBJRq.jpg)\n\nHere's an example of something that can cause the \"Sticky, Crunchy, or Stuck Keys\" problem. Having crumbs, or sticky liquids, or other gunk will cause your keys to feel weird, or to stop working. These are genuinely caused by crap getting stuck between the mechanism. Enough of these can definitely jam a key. The 3rd generation keyboards help negate this problem by adding a rubber piece around the perimeter of the butterfly mechanism in order to reduce ingress of larger bits into the mechanism.\n\n[https://i.imgur.com/fauw47h.mp4](https://i.imgur.com/fauw47h.mp4)\n\nExample of how a key can get jammed. That single large piece prevents the mechanism and switch from pressing down al the way.\n\n[https://i.imgur.com/SogaaLg.mp4](https://i.imgur.com/SogaaLg.mp4)\n\nUpon further inspection, we run into another blockade in the Dust theory, a see-through plastic barrier that encloses the entire switch.\n\nThe purpose of this barrier is both ingress-protection and to make sure the metal dome stays in its proper place, as you'll see later.\n\n[https://i.imgur.com/N2YxJhs.mp4](https://i.imgur.com/N2YxJhs.mp4)\n\nThere is also this black tape-like material covering the top portion. After peeling it off, I discovered that this is where there is a little lip that overhangs the plastic housing. Most likely this is so that the domes can be replaced by the companies that refurbish all the old parts/devices apple sends to them.\n\n[https://i.imgur.com/1KDJK2n.mp4](https://i.imgur.com/1KDJK2n.mp4)\n\nIt wasn't very hard to peel it off, but the plastic film was adhered to the plastic frame. Again, a huge dead-end forest theory since it physically cannot get in through this area.\n\n[https://i.imgur.com/GqsUHrz.jpg](https://i.imgur.com/GqsUHrz.jpg)\n\nA close-up of the film and the metal dome itself.\n\n[https://i.imgur.com/6zVVFuY.mp4](https://i.imgur.com/6zVVFuY.mp4)\n\nAfter examining the dome, I discovered that it is not at all soldered down into place, but rather it is free-floating within the plastic housing. Whether it makes a connection or not depends on how well its legs are contacting those gold pads in the corners.\n\n[https://i.imgur.com/LAM75Lz.jpg](https://i.imgur.com/LAM75Lz.jpg)\n\nTop side of the dome itself. The 4 outer legs are what make contact with the gold pads that are used to carry electrical signals. The dome itself appears to be Steel. It is also incredibly light, it's no wonder the film has to keep it down.\n\n[https://i.imgur.com/ZBi4jau.jpg](https://i.imgur.com/ZBi4jau.jpg)\n\nBottom side. That brown part is not corrosion, that's just laser-cutting left-overs from when the dome is manufactured. I checked, all the metal dome have these marks.\n\n[https://i.imgur.com/JmWD4DD.jpg](https://i.imgur.com/JmWD4DD.jpg)\n\nClose-up of the plastic body around the metal dome. Here we see 6 gold pads. All 6 of those are for carrying electrical signals. There is also a large hole close to the oval-shaped gold pad. This is a ventilation hole.\n\nNow, I know what you're thinking. Ventilation hole? Aha! That's where the dust gets in!\n\nHold your horses, we are far from done.\n\n[https://i.imgur.com/o70lCgg.jpg](https://i.imgur.com/o70lCgg.jpg)\n\nThe plastic body takes a bit of effort to remove, thanks to the fact that it uses 4 plastic legs that are riveted to the underside of the board.\n\n[https://i.imgur.com/tqLXY1c.jpg](https://i.imgur.com/tqLXY1c.jpg)\n\nOnce removed, we see that the entire plastic body is surrounded by an adhesive film with no obvious gaps in its seal. This is another dead-end for the dust-ingress theory, since the entire plastic body is sealed around the perimeter. For the sake of thoroughness, I tested the conductivity of all the gold pads; the 4 outer pads along with the oval-shaped one in the middle are all connected and act as a single end of the terminal, while the round central pad is a second terminal. Once these 2 are bridged by a conductive object, like a metal dome, they will register as a keypress.\n\n[https://i.imgur.com/EHIkSsn.mp4](https://i.imgur.com/EHIkSsn.mp4)\n\nJust to give you an idea, You can see my trying to fit my sharpest set of tweezers under the plastic body. At most it budged a bit to the side, but that's because adhesive is fairly flexible. It takes a fair bit of pressure to puncture that plastic film on top.\n\n[https://i.imgur.com/WDD2C8b.jpg](https://i.imgur.com/WDD2C8b.jpg)\n\nOut of curiosity, I also tore apart the thinner small keys to see what the mechanism looked like. It's the same thing, just a smaller version.\n\n[https://i.imgur.com/tkg6RMH.jpg](https://i.imgur.com/tkg6RMH.jpg)\n\nI attempted to test the \"Heat Failure\" theory with my heat-gun set to 300C and pointed directly at the metal dome. This was a beyond-extreme-case test to see if the key would warp and possibly make contact. \n\nSince MacBooks have god-awful cooling and will heat up to very hot temperatures in order to ensure that the machine stays as quiet as possible (which is a questionable method overall, [https://www.youtube.com/watch?v=947op8yKJRY](https://www.youtube.com/watch?v=947op8yKJRY) talks about it more), some people suspected that the expansion and contraction of material can cause these keys to stop working.\n\nAfter leaving it under heat for 2 minutes, it did not move a millimetre. This theory is very unlikely since there are keys that fail that do not sit in the same area as the Processor cooler (which can reach 70-100C pretty easily on these models).\n\nAt this point, I finished tearing up the entire top-side of the keyboard, so I turned my attention to the underside.\n\n[https://i.imgur.com/IZsaOvE.jpg](https://i.imgur.com/IZsaOvE.jpg)\n\nThe keyboard is covered by a large, layered film material. Based on its thickness, it is likely meant to serve several purposes:\n\n1. As a heat insulator for the keyboard area.\n2. As an insulator for electrical signals between the Motherboard and the metal frame/keyboard itself.\n3. As a barrier to prevent dust and crumbs from interfering with operation.\n\n&#x200B;\n\n[https://i.imgur.com/iEdRuZs.jpg](https://i.imgur.com/iEdRuZs.jpg)\n\nAfter removing it, I found a small surprise. The keyboard itself sits on one giant PCB (Printed Circuit Board) and even has a fair bit of componentry on it! Quick google search showed that the 4 large chips on the right are for controlling the LED backlight, the pair of smaller chips in the middle are some sort of micro controllers (probably for the keyboard itself), and the components on the left are a mystery; I suspect they're the fan control/PWM (pulse width modulation) circuit for the fan, since the fan connects directly into the keyboard on all new models\n\n[https://i.imgur.com/6Pm0Uqd.jpg](https://i.imgur.com/6Pm0Uqd.jpg)\n\nWhats this? A dust filter? In *my* friendly christian teardown? Dust filter indeed. This is one of the finest filters I've seen in years! (pun intended).\n\nAfter looking at it, it turns out that this dust filter is used for the breathing hole that was pictured in the Switch teardown further up the post.\n\nAnother dead-end for the Dust Theory, since the breather hole itself is covered by a *very* fine mesh.\n\n[https://i.imgur.com/hycxJcR.jpg](https://i.imgur.com/hycxJcR.jpg)\n\nHere's the tip of a 0.5mm ballot pen for size reference. Most dust and all hairs will not be able to fit between this mesh, which only further solidifies the dismissal of the Dust Theory.\n\n[https://i.imgur.com/rVfLEkF.jpg](https://i.imgur.com/rVfLEkF.jpg)\n\nThis is the closest shot of the mesh that I can get. This is with 10x Macro lens + iPhone camera at full zoom. Pen marks for size reference.\n\n[https://i.imgur.com/hjIboNB.mp4](https://i.imgur.com/hjIboNB.mp4)\n\nHere's a short clip of the alignment of the dust filter with the breather hole along with visible movement from the underside of the metal dome and butterfly mechanism.\n\n[https://i.imgur.com/4rtoCUP.jpg](https://i.imgur.com/4rtoCUP.jpg)\n\nAfter looking closer at the protective keyboard insulator bit, I noticed that the entire mesh portion is surrounded by an adhesive-material, with absolutely 0 gaps around the hole. This basically puts a dead-end to the last possible entry point for dust, since this entire breather hole is not only sealed by adhesives on both top and bottom, but also a clear film on top side and an extremely fine mesh on the bottom of the switch.\n\nAt this point, there should be little reason to believe that dust can get in there, since every possible vector of attack is throughly sealed and/or protected.\n\nContrary to popular belief, Apple actually took *a lot* of effort sealing these switches from the elements.\n\n[https://i.imgur.com/9pmrI0A.jpg](https://i.imgur.com/9pmrI0A.jpg)\n\nI found some household dust and threw it on the mesh. As you can see, the mesh is not having trouble stopping these tiny bits.\n\n[https://i.imgur.com/j32hfyl.mp4](https://i.imgur.com/j32hfyl.mp4)\n\nAnd finally, here is a demonstration of what happens when the key is assembled and pressed under the most extreme of dusty conditions. I threw literally an entire pile of dust on that breather hole.\n\nSince these switches are pretty much sealed from all angles other than this breather hole, this is where all the air can freely move in the switch. Once assembled, the design of the switch actually very closely resembles that of a conventional speaker, which deals with air pressure inside its sealed chamber by allowing the air to freely enter and exit its port hole.           Once the key is pressed, there is a higher air pressure created between the PCB and metal dome. Since this pressure needs to go somewhere to prevent rupturing the plastic film, all of it immediately gets pushed out of this single vent.       Any dust that has accumulated on this opening will immediately be ejected from the mesh filter. Bear in mind that the laptop would technically be upside-down if you viewed it from this angle. In reality, the dust would actually fall to the underside of the Logic board, which sits in very close proximity to this breather hole.\n\nExcuse the shit quality, I had to heavily compress and alter the vids quality to make it fit into an upload able GIF.\n\n[https://i.imgur.com/i6a1KWK.jpg](https://i.imgur.com/i6a1KWK.jpg)\n\nSee that rivet? There are close to 70 of these holding the keyboard into place, along with a battery that's glued in on-top of the bottom portion. You want DIY repairs? Good luck with that. This is why Apple ships these as a \"Top Case Assembly\" rather than \"Keyboard\".At this point, there is no evidence left at all that dust is the cause of failures for this switch, especially not for the Double-Input issue since that entirely relies on how long and how many electrical signals are detected by the keyboard controller. There is absolutely no reason why dust or humidity can cause this, especially with no easy entry points and the general lack of electrical conductivity of both dust and water.\n\nThe No-Input issue can still somewhat be explained by a few other theories (Humidity, or oxidation of the underside of the dome), but both these theories still have a lot of holes (breather hole pushes humidity out when key is pressed, gold contacts do not oxidize on their own, corroded material will get slightly worn off when one and pads make repeated contact with dome, the amount of dust and water needed to cause these situations is fairly high, etc).\n\n \n\n***Why is this teardown so important***\\*\\*\\*?\\*\\*\\*\n\n&#x200B;\n\nIt proves that Apple themselves have no idea how to deal with the issue and that dust was either just an excuse to satisfy their customer bases demand for an answer, or their engineers are genuinely nowhere near as smart as everyone thinks they are. I'm not sure which of these two is worse. Considering they've had *4 years to deal with it*, i'm leaning more towards the latter.\n\nThe way Apple is handling this problem is actually far from good. People think that its nice of them to have a repair program for the issue, but this is actually just a shitty half-assed bandaid fix for the problem. As it stands, the current situation is as follows:\n\n* **All** 12\" MacBooks + 2018 Air + all 2016-2018 Pro models **most likely** **will eventually develop keyboard issues, its a matter of time.**\n* **All 2016/2017 pros (and 12\" 2015-2017) have the extended keyboard warranty program.** *This program covers these units for 4 years from original purchase date*, meaning that 2016 models coverage ends around 2020/2021, depending on exact purchase date, and 2017 models coverage ends around 2021/2022. **2015 12\" Macbook coverage is ending between this year and next year, so 2015 12\" owners be prepared!**\n* ***2018 models are not covered by this program!*** Currently, they rely entirely on their warranty or consumer protection laws, meaning that if you didn't purchase AppleCare or live on a country where Consumer Protection laws suck, you'll only get support for 1 year out of the box.          \n\nFor any of the above, once your warranty or keyboard program coverage ends, it's **$500 USD per failure** to replace the entire top case. There is no \"cheaper\" aftermarket solution, the keyboards themselves are a nightmare to replace and the aftermarket parts are even more likely to fail. **Replacing the part will not permanently fix the issue either since Apple only replaces it with identical parts**, meaning they're bound to fail again. On top of that, **all machines will be classified as vintage 5 years after their original purchase date**. Once that happens, spare parts from apple go bye bye for good and you'll be left only with the cheaper aftermarket parts that are usually more prone to failure, or be stuck buying used parts which are also failure-prone. While the possibility of a Vintage Repair Program is high, the stock for that item will run out quickly, since most 2012/2013 Retinas already are running low on LCD stock to cover Anti-glare issue.\n\n*Ownership beyond 3-4 years fo these models is pretty much a gamble at best, and ownership for 2018 models without AppleCare is even more of a gamble since there's no repair program support for them and there is 0 guarantee that these models will be added to that keyboard replacement program at all.*\n\nAs for what the actual cause is, honestly I don't know. My suspicion is that the metal dome experiences metal fatigue and slowly begin to lose connection, or that that little U-shaped cutout in the centre of the dome weakens and starts to easily bounce when pressed, making contact 2+ times. I honestly cannot test this at home, my equipment is woefully inadequate to go that deep.\n\nMacbook owners, please beware. Always have AppleCare, even if paying extra to cover a flaw that should be properly dealt with is morally questionable and a shitty thing to do. Right now is not a good time to be a Macbook owner or buyer, and please consider whether or not you wish to financially support a company that pulls stunts like these.\n\n&#x200B;\n\nThis law firm is setting up a class action if anybody wants to join: [https://www.research.net/r/MacKeyboard](https://www.research.net/r/MacKeyboard)\n\n&#x200B;\n\nEdit:After reading through a lot of comments, stories, criticisms, and other possible brain-storming ideas, I an definitely considering making a part 2 with different tests. If i am in a position where i can gather testing equipment for relatively cheap, i will probably start work on it then.",
        "created_utc": 1556797376.0,
        "subreddit_name": "apple",
        "comments": 993
    }
]