[
    {
        "title": "Tech Rally Lifts S&P 500 Above 5,000 Mark",
        "score": 226,
        "url": "https://www.reddit.com/r/stocks/comments/1an0j7u/tech_rally_lifts_sp_500_above_5000_mark/",
        "content": "The S&P 500 climbed 0.6 percent on Friday to close at 5,026.61. It is now up more than 5 percent since the start of the year, and up nearly 40 percent since its October 2022 low.\n\n\n....\nTechnology stocks have played a big role in the recent run.\n\nTech giants, including Apple, Microsoft, Meta, Amazon and Alphabet, have enormous sway over the index because of their size, and after they reported earnings last week, several of these stocks have soared.\n\n....\n\nThe rally hasn’t been limited to tech stocks: Disney, Ford and Chipotle, for instance, also reported earnings in the past week that beat analyst estimates and pushed their shares higher. Nearly 70 percent of the companies in the S&P 500 had reported earnings as of Friday, with three-quarters of those reports better than expected, according to FactSet.\n\nSource:https://www.nytimes.com/2024/02/09/business/stock-market-today.html?smid=nytcore-android-share\n\nHow is it that the tech stocks are leading the rally yet most of them are announcing major layoffs in the recent past?",
        "created_utc": 1707517677.0,
        "subreddit_name": "stocks",
        "comments": 37
    },
    {
        "title": "…Is everyone really maxing out all their retirement accounts before allocating to their taxable brokerage?",
        "score": 137,
        "url": "https://www.reddit.com/r/investing/comments/1amfvg3/is_everyone_really_maxing_out_all_their/",
        "content": "Hello everyone,\nImma be honest, i dont know a lot about investing/finance so idek if the question makes sense to most.\n\nBut basically, i see it encouraged everywhere to always max out tax advantaged accounts (if applicable) first before contributing to a taxable brokerage, is everyone really doing that?\n\nI get that the salaries of ppl here are probably way bigger than mine, but i ask this question because I see individual stocks like aapl, nvda, tsla, etc. and i think ‘oh it would be interesting/fun to invest in stuff like that’ but ..i know I should like max out my 401k first yknow. So like …wow everyone really has leftover money to just fck around huh ?",
        "created_utc": 1707453536.0,
        "subreddit_name": "investing",
        "comments": 243
    },
    {
        "title": "Apple is back to lobbying against right-to-repair bills",
        "score": 909,
        "url": "https://appleinsider.com/articles/24/02/09/apple-is-back-to-lobbying-against-right-to-repair-bills",
        "content": "",
        "created_utc": 1707514820.0,
        "subreddit_name": "apple",
        "comments": 152
    },
    {
        "title": "Sketchy Rumor Says iOS 18 Will Have visionOS-Inspired Design Changes",
        "score": 878,
        "url": "https://www.macrumors.com/2024/02/09/ios-18-visionos-design-elements-rumor/",
        "content": "",
        "created_utc": 1707498129.0,
        "subreddit_name": "apple",
        "comments": 136
    },
    {
        "title": "iOS 17.4 Nerfs Web Apps in the EU",
        "score": 817,
        "url": "https://www.macrumors.com/2024/02/08/ios-17-4-nerfs-web-apps-in-the-eu/",
        "content": "",
        "created_utc": 1707469379.0,
        "subreddit_name": "apple",
        "comments": 264
    }
]