[
    {
        "title": "Tech Rally Lifts S&P 500 Above 5,000 Mark",
        "score": 226,
        "url": "https://www.reddit.com/r/stocks/comments/1an0j7u/tech_rally_lifts_sp_500_above_5000_mark/",
        "content": "The S&P 500 climbed 0.6 percent on Friday to close at 5,026.61. It is now up more than 5 percent since the start of the year, and up nearly 40 percent since its October 2022 low.\n\n\n....\nTechnology stocks have played a big role in the recent run.\n\nTech giants, including Apple, Microsoft, Meta, Amazon and Alphabet, have enormous sway over the index because of their size, and after they reported earnings last week, several of these stocks have soared.\n\n....\n\nThe rally hasn’t been limited to tech stocks: Disney, Ford and Chipotle, for instance, also reported earnings in the past week that beat analyst estimates and pushed their shares higher. Nearly 70 percent of the companies in the S&P 500 had reported earnings as of Friday, with three-quarters of those reports better than expected, according to FactSet.\n\nSource:https://www.nytimes.com/2024/02/09/business/stock-market-today.html?smid=nytcore-android-share\n\nHow is it that the tech stocks are leading the rally yet most of them are announcing major layoffs in the recent past?",
        "created_utc": 1707517677.0,
        "subreddit_name": "stocks",
        "comments": 37
    },
    {
        "title": "…Is everyone really maxing out all their retirement accounts before allocating to their taxable brokerage?",
        "score": 137,
        "url": "https://www.reddit.com/r/investing/comments/1amfvg3/is_everyone_really_maxing_out_all_their/",
        "content": "Hello everyone,\nImma be honest, i dont know a lot about investing/finance so idek if the question makes sense to most.\n\nBut basically, i see it encouraged everywhere to always max out tax advantaged accounts (if applicable) first before contributing to a taxable brokerage, is everyone really doing that?\n\nI get that the salaries of ppl here are probably way bigger than mine, but i ask this question because I see individual stocks like aapl, nvda, tsla, etc. and i think ‘oh it would be interesting/fun to invest in stuff like that’ but ..i know I should like max out my 401k first yknow. So like …wow everyone really has leftover money to just fck around huh ?",
        "created_utc": 1707453536.0,
        "subreddit_name": "investing",
        "comments": 243
    },
    {
        "title": "Apple is back to lobbying against right-to-repair bills",
        "score": 909,
        "url": "https://appleinsider.com/articles/24/02/09/apple-is-back-to-lobbying-against-right-to-repair-bills",
        "content": "",
        "created_utc": 1707514820.0,
        "subreddit_name": "apple",
        "comments": 152
    },
    {
        "title": "Sketchy Rumor Says iOS 18 Will Have visionOS-Inspired Design Changes",
        "score": 878,
        "url": "https://www.macrumors.com/2024/02/09/ios-18-visionos-design-elements-rumor/",
        "content": "",
        "created_utc": 1707498129.0,
        "subreddit_name": "apple",
        "comments": 136
    },
    {
        "title": "iOS 17.4 Nerfs Web Apps in the EU",
        "score": 817,
        "url": "https://www.macrumors.com/2024/02/08/ios-17-4-nerfs-web-apps-in-the-eu/",
        "content": "",
        "created_utc": 1707469379.0,
        "subreddit_name": "apple",
        "comments": 264
    },
    {
        "title": "Exclusive: Nvidia pursues $30 billion custom chip opportunity with new unit -sources",
        "score": 576,
        "url": "https://www.reddit.com/r/stocks/comments/1an1m8t/exclusive_nvidia_pursues_30_billion_custom_chip/",
        "content": "https://www.reuters.com/technology/nvidia-chases-30-billion-custom-chip-market-with-new-unit-sources-2024-02-09/\n\n\n\n\n\n\nSAN FRANCISCO, Feb 9 (Reuters) - Nvidia (NVDA.O), opens new tab is building a new business unit focused on designing bespoke chips for cloud computing firms and others, including advanced artificial intelligence (AI) processors, nine sources familiar with its plans told Reuters.\n\nThe dominant global designer and supplier of AI chips aims to capture a portion of an exploding market for custom AI chips and shield itself from the growing number of companies pursuing alternatives to its products.\n\nThe Santa Clara, California-based company controls about 80% of high-end AI chip market, a position that has sent its stock market value up 40% so far this year to $1.73 trillion after it more than tripled in 2023.\n\nNvidia's customers, which include ChatGPT creator OpenAI, Microsoft (MSFT.O), opens new tab, Alphabet (GOOGL.O), opens new tab and Meta Platforms (META.O), opens new tab, have raced to snap up the dwindling supply of its chips to compete in the fast-emerging generative AI sector.\n\nIts H100 and A100 chips serve as a generalized, all-purpose AI processor for many of those major customers. But the tech companies have started to develop their own internal chips for specific needs. Doing so helps reduce energy consumption, and potentially can shrink the cost and time to design.\n\nNvidia is now attempting to play a role in helping these companies develop custom AI chips that have flowed to rival firms such as Broadcom (AVGO.O), opens new tab and Marvell Technology (MRVL.O), opens new tab, said the sources, who declined to be identified because they were not authorized to speak publicly.\n\n\"If you're really trying to optimize on things like power, or optimize on cost for your application, you can't afford to go drop an H100 or A100 in there,\" Greg Reichow, general partner at venture capital firm Eclipse Ventures said in an interview. \"You want to have the exact right mixture of compute and just the kind of compute that you need.\"\n\nNvidia does not disclose H100 prices, which are higher than for the prior-generation A100, but each chip can sell for $16,000 to $100,000 depending on volume and other factors. Meta plans to bring its total stock to 350,000 H100s this year.\nNvidia officials have met with representatives from Amazon.com (AMZN.O), opens new tab, Meta, Microsoft, Google and OpenAI to discuss making custom chips for them, two sources familiar with the meetings said. Beyond data center chips, Nvidia has pursued telecom, automotive and video game customers.\n\nNvidia shares rose 2.75% after the Reuters report, helping lift chip stocks overall. Marvell shares dropped 2.78%.\n\nIn 2022, Nvidia said it would let third-party customers integrate some of its proprietary networking technology with their own chips. It has said nothing about the program since, and Reuters is reporting its wider ambitions for the first time.\nA Nvidia spokesperson declined to comment beyond the company's 2022 announcement.\n\nDina McKinney, a former Advanced Micro Devices (AMD.O), opens new tab and Marvell executive, heads Nvidia's custom unit and her team's goal is to make its technology available for customers in cloud, 5G wireless, video games and automotives, a LinkedIn profile said. Those mentions were scrubbed and her title changed after Reuters sought comment from Nvidia.\n\nAmazon, Google, Microsoft, Meta and OpenAI declined to comment.\n\n\n\n\n**$30 BILLION MARKET**\n\nAccording to estimates from research firm 650 Group’s Alan Weckel, the data center custom chip market will grow to as much as $10 billion this year, and double that in 2025.\n\nThe broader custom chip market was worth roughly $30 billion in 2023, which amounts to roughly 5% of annual global chip sales, according to Needham analyst Charles Shi.\n\nCurrently, custom silicon design for data centers is dominated by Broadcom and Marvell.\n\nIn a typical arrangement, a design partner such as Nvidia would offer intellectual property and technology, but leave the chip fabrication, packaging and additional steps to Taiwan Semiconductor Manufacturing Co. (2330.TW), opens new tab or another contract chip manufacturer.\n\nNvidia moving into this territory has the potential to eat into Broadcom and Marvell sales.  \"With Broadcom's custom silicon business touching $10 billion, and Marvell’s around $2 billion, this is a real threat,\" said Dylan Patel, founder of silicon research group SemiAnalysis. \"It's a real big negative - there's more competition entering the fray.\"\n\n**BEYOND AI**\n\nNvidia is in talks with telecom infrastructure builder Ericsson (ERICb.ST), opens new tab for a wireless chip that includes the chip designer's graphics processing unit (GPU) technology, two sources familiar with the discussions said.\nEricsson declined to comment.\n\n650 Group's Weckle expects the telecom custom chip market to remain flat at roughly $4 billion to $5 billion a year. Nvidia also plans to target the automotive and video game markets, according to sources and public social media postings.\n\nWeckel expects the custom auto market to grow consistently from its current $6 billion to $8 billion range at 20% a year, and the $7 billion to $8 billion video game custom chip market could increase with the next-generation consoles from Xbox and Sony (6857.T), opens new tab.\n\nNintendo's current Switch handheld console already includes Nvidia's Tegra X1 chip. A new version of the Switch console expected this year is likely to include a Nvidia custom design, one source said.\n\nNintendo declined to comment.",
        "created_utc": 1707520502.0,
        "subreddit_name": "stocks",
        "comments": 64
    },
    {
        "title": "NVDA has to pull back right?",
        "score": 5928,
        "url": "https://i.redd.it/1iqfq048qkhc1.jpeg",
        "content": "",
        "created_utc": 1707490642.0,
        "subreddit_name": "wallstreetbets",
        "comments": 521
    },
    {
        "title": "my forgotten nvda bought with birthday card money a while ago",
        "score": 4570,
        "url": "https://i.redd.it/gcejxggyrmhc1.jpeg",
        "content": "",
        "created_utc": 1707515401.0,
        "subreddit_name": "wallstreetbets",
        "comments": 391
    }
]