[
    {
        "title": "AirPods Max 2 coming soon: Here’s what to expect - 9to5Mac",
        "score": 1611,
        "url": "https://9to5mac.com/2024/08/21/airpods-max-2-coming-soon-heres-what-to-expect/",
        "content": "H2 Chip and case speculation. \n\nStill no mention of Lossless Audio. \n\nMy guess is it’ll be like the Beats Studio Pro: Lossless just over USB-C. ",
        "created_utc": 1724266273.0,
        "subreddit_name": "apple",
        "comments": 471
    },
    {
        "title": "iCloud Storage Remains Apple’s Most Popular Service",
        "score": 785,
        "url": "https://cirpapple.substack.com/p/icloud-storage-remains-apples-most",
        "content": "",
        "created_utc": 1724258888.0,
        "subreddit_name": "apple",
        "comments": 255
    },
    {
        "title": "Updated News For Getting Payment in Apple $490M Investor Settlement",
        "score": 2,
        "url": "https://www.reddit.com/r/AAPL/comments/1exy0gj/updated_news_for_getting_payment_in_apple_490m/",
        "content": "Hey guys, maybe you know about this, but Siri is getting a glow up. Apple just launched an update (only for developers tho) and soon some of us will see a new “Apple Intelligence” in our devices. If everything goes well, this will be available this fall.\n\n\n\nIn other Apple news, Apple is paying almost half a billion to investors. If you were paying attention back in 2018, Tim Cook, our famous CEO, said that though Apple had sales problems in a few countries with high inflation rates like Brazil and Russia, there were no such problems for China. But then, just a few days later, Apple decided to cut production and requested it from the suppliers, so I think it was obviously otherwise.\n\n\n\nAnd just two months later, Apple shocked everyone with its first announcement about the revenue cut since the iPhone establishment in 2007, causing AAPL to drop by 10% and resulting in 70B losses.\n\n\n\nThis led to several big scandals and lawsuits based on Cook's comments, but Apple denied that they had any wrongdoing in this case (and they continue to deny it to this day).\n\n\n\nSo, at this point, this whole story is going to an end because recently, Apple decided to pay $490M to investors due to the situation, even before the court hearing, so if you were one of those damaged investors, you can [check it out](https://11thestate.com/cases/apple-investor-settlement).\n\n\n\nHowever, does that half a billion even come close to covering the $70 billion loss? Especially with all the drama Apple's dealing with in China?\n\n",
        "created_utc": 1724267055.0,
        "subreddit_name": "AAPL",
        "comments": 7
    },
    {
        "title": "When I Found Out How Bad The Fed Fucked Up Today",
        "score": 2969,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1ey2z0n/when_i_found_out_how_bad_the_fed_fucked_up_today/",
        "content": "I was blowing heaters outside Moon’s Deli in Chicago double fisting two large coffees waiting for the first homeless man to run me down for a handoff and a 5 minute conversation.\n\nHe didn’t know anything about the stock market or what the Fed does and I said me neither.\n\nHe then pointed at a bunch of WH interns dressed like the cast from Glee and said they probably know what it is.\n\nSo we went and got 4 more large farvas and went to talk to these clowns.\n\nThey didn’t really understand what confidentiality means or non disclose agreements apparently.\n\nI said if what you are telling me is true only a little bit this everything assets bubble bullshit everyone’s talking about is gearing up for another launch.\n\nAnd it’s going to be biblical.\n\nIf you don’t have any assets currently you gotta go acquire some quickly is all I’m saying.\n\nIt’s a hedge fund feeding frenzy in commercial real estate right now. Everything is literally half off and getting worse. They are starting to force foreclosures like assholes on all the properties they want in the top cities around the country. \n\nIf the Fed doesn’t lower rates now they are heading into residential housing next and it’s gonna be a blood bath.\n\nFutures are already jacked to the tits.\n\nSPY could easily run another 20% by EOY.\n\nI’m getting the crayons out right now.",
        "created_utc": 1724279234.0,
        "subreddit_name": "wallstreetbets",
        "comments": 474
    }
]