[
    {
        "title": "AirPods Max 2 coming soon: Here’s what to expect - 9to5Mac",
        "score": 1611,
        "url": "https://9to5mac.com/2024/08/21/airpods-max-2-coming-soon-heres-what-to-expect/",
        "content": "H2 Chip and case speculation. \n\nStill no mention of Lossless Audio. \n\nMy guess is it’ll be like the Beats Studio Pro: Lossless just over USB-C. ",
        "created_utc": 1724266273.0,
        "subreddit_name": "apple",
        "comments": 471
    },
    {
        "title": "iCloud Storage Remains Apple’s Most Popular Service",
        "score": 785,
        "url": "https://cirpapple.substack.com/p/icloud-storage-remains-apples-most",
        "content": "",
        "created_utc": 1724258888.0,
        "subreddit_name": "apple",
        "comments": 255
    },
    {
        "title": "Updated News For Getting Payment in Apple $490M Investor Settlement",
        "score": 2,
        "url": "https://www.reddit.com/r/AAPL/comments/1exy0gj/updated_news_for_getting_payment_in_apple_490m/",
        "content": "Hey guys, maybe you know about this, but Siri is getting a glow up. Apple just launched an update (only for developers tho) and soon some of us will see a new “Apple Intelligence” in our devices. If everything goes well, this will be available this fall.\n\n\n\nIn other Apple news, Apple is paying almost half a billion to investors. If you were paying attention back in 2018, Tim Cook, our famous CEO, said that though Apple had sales problems in a few countries with high inflation rates like Brazil and Russia, there were no such problems for China. But then, just a few days later, Apple decided to cut production and requested it from the suppliers, so I think it was obviously otherwise.\n\n\n\nAnd just two months later, Apple shocked everyone with its first announcement about the revenue cut since the iPhone establishment in 2007, causing AAPL to drop by 10% and resulting in 70B losses.\n\n\n\nThis led to several big scandals and lawsuits based on Cook's comments, but Apple denied that they had any wrongdoing in this case (and they continue to deny it to this day).\n\n\n\nSo, at this point, this whole story is going to an end because recently, Apple decided to pay $490M to investors due to the situation, even before the court hearing, so if you were one of those damaged investors, you can [check it out](https://11thestate.com/cases/apple-investor-settlement).\n\n\n\nHowever, does that half a billion even come close to covering the $70 billion loss? Especially with all the drama Apple's dealing with in China?\n\n",
        "created_utc": 1724267055.0,
        "subreddit_name": "AAPL",
        "comments": 7
    }
]