[
    {
        "title": "Microsoft CEO Would 'Welcome' Apple to Bring iMessage to Windows",
        "score": 4293,
        "url": "https://www.macrumors.com/2021/06/24/microsoft-ceo-would-welcome-imessage-on-windows/?fbclid=IwAR0XSkXeQCErNKdzsK0VrxDjif2slGpZVHXJ4_pPUmPbaaJqLJX5idc9oGM",
        "content": "",
        "created_utc": 1624555205.0,
        "subreddit_name": "apple",
        "comments": 748
    },
    {
        "title": "Morgan Stanley Ups Apple to $162 From $161, Sees Concerns as Overblown, Maintains Overweight",
        "score": 10,
        "url": "https://www.reddit.com/r/AAPL/comments/o7bzpm/morgan_stanley_ups_apple_to_162_from_161_sees/",
        "content": "Morgan Stanley Ups Apple to $162 From $161, Sees Concerns as Overblown, Maintains Overweight\t\n\nJune 24, 2021\n\n\nApple received a slight boost to its price target from Morgan Stanley as the firm said investors' concerns about the consumer technology company's fiscal 2022 growth prospects are \"overblown\" and create a long-term buying opportunity.\n\nMorgan Stanley's new price target on Apple's stock is $162 per share, up from $161. In comparison, the shares closed Wednesday's session at $133.70. Morgan Stanley kept its investment rating on the shares at overweight.\n\n\"Investors are concerned about AAPL's FY22 growth prospects given the expectation for an iPhone super-cycle and waning cyclical [work-from-home] tailwinds\", Morgan Stanley analysts said in a note to clients. However, they added, \"we're not as concerned and see a good long-term buying opportunity.\"\n\nThe firm pointed to four main factors making investors cautious about Apple. First, \"we are at a seasonally low period in the iPhone cycle, which creates a demand information vacuum and elevates the relative impact of supply chain noise,\" Morgan Stanley said. \"Second, Apple is increasingly in the eyes of regulators, and while we believe their model is defensible... regulatory risk is likely to remain a stock overhang.\"\n\nThird, the firm said, \"as the world slowly returns to normal, there are concerns that cyclical work-and-learn-from-home demand will decelerate at the same time Apple faces increasingly difficult\" comparisons. Finally, \"investors fear that a more evolutionary (rather than revolutionary) iPhone super-cycle will lead to extending iPhone replacement cycles and [year-over-year] revenue declines next year.\"\n\nThe Morgan Stanley analysts said they recognize these risks but have a more positive outlook on Apple. For the near term, the firm is calling for the June-ended quarter to be stronger than originally expected, which prompted it to increase estimates for the quarter's revenue and earnings per share.",
        "created_utc": 1624578653.0,
        "subreddit_name": "AAPL",
        "comments": 4
    },
    {
        "title": "What happened with Apple today?",
        "score": 2,
        "url": "https://www.reddit.com/r/AAPL/comments/o7akke/what_happened_with_apple_today/",
        "content": "",
        "created_utc": 1624574191.0,
        "subreddit_name": "AAPL",
        "comments": 6
    }
]