[
    {
        "title": "New Nvidia AI chips overheating in servers, the Information reports",
        "score": 310,
        "url": "https://www.reddit.com/r/stocks/comments/1gtlzww/new_nvidia_ai_chips_overheating_in_servers_the/",
        "content": "Nov 17 (Reuters) - Nvidia's new Blackwell AI Chips, which have already faced delays, have encountered problems with accompanying servers that overheat, causing some customers to worry they will not have enough time to get new data centers up and running, the Information reported on Sunday.The Blackwell graphics processing units overheat when connected together in server racks designed to hold up to 72 chips, the report said, citing sources familiar with the issue.\n\n  \nThe chipmaker has asked its suppliers to change the design of the racks several times to resolve overheating problems, according to Nvidia employees who have been working on the issue, as well as customers and suppliers with knowledge of the issue, the report said without naming the suppliers.\"Nvidia is working with leading cloud service providers as an integral part of our engineering team and process. The engineering iterations are normal and expected,\" a company spokesperson said in a statement to Reuters.\n\n  \nIn March, Nvidia unveiled Blackwell chips and had earlier said they would ship in the second quarter before encountering delays, potentially affecting customers such as Meta Platforms , Alphabet's Google and Microsoft .Nvidia's Blackwell chip takes two squares of silicon the size of the company's previous offering and binds them into a single component that is 30 times speedier at tasks like providing responses from chatbots.",
        "created_utc": 1731873142.0,
        "subreddit_name": "stocks",
        "comments": 140
    },
    {
        "title": "Is PLTR in bubble territory?",
        "score": 286,
        "url": "https://www.reddit.com/r/stocks/comments/1gtdoq4/is_pltr_in_bubble_territory/",
        "content": "I don’t own any so this question just stems from curiosity. \n\nIts market cap was ~$15bn two years ago and is $150bn today. There’s nothing inherently concerning about that (NVDA was similar, as we all know), but its P/E ratio is 329 - is the rise unsustainable?\n\nI understand Palantir has a lot of positive momentum from AI hype, expected defense spending under Trump, and general recovery of growth stocks as interest rates fall from their highs. These are all valid reasons to expect continued success from Palantir, but are investors irrationally exuberant?\n\nDo you see a pullback on the horizon?",
        "created_utc": 1731850525.0,
        "subreddit_name": "stocks",
        "comments": 347
    },
    {
        "title": "New Nvidia AI chips face issue with overheating servers",
        "score": 383,
        "url": "https://www.reuters.com/technology/artificial-intelligence/new-nvidia-ai-chips-face-issue-with-overheating-servers-information-reports-2024-11-17/",
        "content": "Doesn’t sound the best considering they already had delays. Rip Monday and Tuesday ",
        "created_utc": 1731853979.0,
        "subreddit_name": "wallstreetbets",
        "comments": 147
    },
    {
        "title": "I’ve got around $200k in an Inherited IRA (account must be closed and taxes paid within 10 years) Looking to put about half in a Trump-Friendly portfolio. Companies that will likely do very well under his administration. Is anybody doing the same?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gtiief/ive_got_around_200k_in_an_inherited_ira_account/",
        "content": "More context:  $100k is currently in S&P , the other $100k I would like to invest very aggressively with companies ran by trumps friends/ businesses that align with his economic policies.\n\nI’m 31 years old and inherited this money 6 months ago. It had been earning 5% up until the election, now I’m looking to ride the Trump train and with an aggressive portfolio I believe a fair expectation/hope is to get this 200k to 500k by the end of trumps 4 years.\n\nThese are some companies I’m thinking so far, I appreciate any insight or suggestions for other sectors/stocks \n\n-Tesla and other Battery/mining related companies Tesla uses?\n-UFC/Endeavor/WWE/ZUFA (Dana white companies) (don’t remember the exact parent company ticker) \n-US Automotive (Stellantis for expample I think could make a nice comeback) \n-US Oil / Fracking companies?\n-Nvidia \n-AI\n-Netflix, Spotify\n\nThese are just some off the top of my head, I appreciate any and all constructive criticism and recommendations.\n\nI am by no means an expert, but I do have a well paying salary (about 6 figures)   BTC, 100k in S&P ,  so I’m not putting all my eggs in one basket here. \n\nThanks in advance. ",
        "created_utc": 1731864000.0,
        "subreddit_name": "investing",
        "comments": 34
    },
    {
        "title": "Putin's Phone Call With Germany Sparks NATO Anger",
        "score": 3369,
        "url": "https://www.newsweek.com/vladimir-putin-olaf-scholz-phone-call-germany-ukraine-nato-anger-backlash-1987054",
        "content": "",
        "created_utc": 1731860670.0,
        "subreddit_name": "worldnews",
        "comments": 249
    },
    {
        "title": "Apple reportedly releasing AirTag 2 next year with these 3 improvements",
        "score": 1832,
        "url": "https://9to5mac.com/2024/11/17/airtag-2-next-year-three-improvements/",
        "content": "",
        "created_utc": 1731857271.0,
        "subreddit_name": "apple",
        "comments": 420
    },
    {
        "title": "Apple Seemingly Discontinuing Lightning to Headphone Jack Adapter Introduced Alongside iPhone 7",
        "score": 595,
        "url": "https://www.macrumors.com/2024/11/17/lightning-to-headphone-jack-adapter-sold-out/",
        "content": "",
        "created_utc": 1731875897.0,
        "subreddit_name": "apple",
        "comments": 87
    },
    {
        "title": "Gurman: Apple 'evaluating' idea of releasing a TV set again",
        "score": 564,
        "url": "https://9to5mac.com/2024/11/17/report-apple-branded-tv-set/",
        "content": "",
        "created_utc": 1731852518.0,
        "subreddit_name": "apple",
        "comments": 239
    },
    {
        "title": "I'm building Sink It, a free browser extension, to make Reddit more usable. I'm giving away 20 licenses of Sink It Max, a premium upgrade for old reddit.",
        "score": 210,
        "url": "https://www.reddit.com/r/apple/comments/1gte7n0/im_building_sink_it_a_free_browser_extension_to/",
        "content": "Hey /r/Apple,\n\nA little over a year ago, I launched Sink It [here] (https://www.reddit.com/r/apple/comments/14inaut/sink_it_for_reddit_a_totally_free_ios_safari/) on this subreddit as a free, minimal Safari extension to make reddit more usable. Over the months, it has grown into a lite client of sorts if you're just looking for a clean, usable, and nag free way to use reddit on your browser.\n\nYou can get it on the [App Store](https://apps.apple.com/us/app/sink-it-for-reddit/id6449873635) for iOS, iPadOS and MacOS. You can also find Chrome and Firefox versions on our [site](https://gosinkit.com/). \n\nAlong the way, it has gotten covered by Lifehacker, Wired, and Ars Technica.\n\n&nbsp;\n\n**What is Sink It?**\n\nSink It channels the spirits of RES (for users of yore) and is used in the same manner -- you simply load the reddit website on Safari after which the app jumps in, adding, yanking, and finessing elements and features to make it more usable. It also works with all of the different reddit UIs floating around. There are [four unique ones](https://gosinkit.com/reddit-designs) that I know of, all of which Sink It supports. \n\nSink It ships with a ton of features but my favorite has to be the extensive content muting. You can mute sensitive words, subs, websites, or users from your feed, which helps a ton specially during election periods. Another favorite is a built-in anti-procrastination tool which blocks your feeds but still allows access to individual posts you might stumble into from search results.\n\nThe app ships with (what I think are) sensible defaults but every single feature can be turned off completely. For example, if you want Sink It to only redirect every page to old reddit and collapse automod comments and all second level comments, that's easily doable. iCloud sync comes as standard too.\n\nThe app is being actively developed and updates are pushed out at least once a week, mostly twice. Because the app relies on the reddit website which changes all the time, it's been a challenging but fun process. Changes to reddit or new banners/nags get reported in our [sub](https://www.reddit.com/r/SinkIt/) or on discord, often within hours, so updates usually go out rapidly to handle these changes.\n\nSink It is free and has no subscriptions. If you're nostalgic and want the Sink It features for old reddit, I have a one-time $5 upgrade called Max which helps me maintain the app.\n\n&nbsp;\n\n**Giveaway**\n\nI'll freely admit that 90% of features originate from our users as feature requests which is why I'm here. If you use the web version of reddit and have any ideas of how to make it better, or annoy you less, leave a comment below. I'll be picking ten random ideas and sending them codes for Sink It Max, the premium upgrade. If you don't have any, post your favorite Apple launch event or photos of any pets you have to enter the giveaway.",
        "created_utc": 1731852212.0,
        "subreddit_name": "apple",
        "comments": 283
    },
    {
        "title": "We Built a Fast, Privacy Focused Photo Cleaner for iPhone users. No ads, no subscriptions, zero data collected. Onetime purchase $4.99 or $2.99, own forever. ",
        "score": 143,
        "url": "https://www.reddit.com/r/apple/comments/1gtbw0b/we_built_a_fast_privacy_focused_photo_cleaner_for/",
        "content": "Hey everyone,\n\n  \n[App Store Link](https://apps.apple.com/us/app/gallery-tap-clean-storage/id6737475869)\n\nSo 256 GB was enough for me since I first got the iPhone 7, before the iPhone 16 came out I knew the 512 GB is the next tier for me. \n\nI’ve apparently accumulated more than 30k Photos. Knowing that a lot of that is junk;  I wanted an app to help me clean the gallery. \n\nSearched for a photo cleaning app, was disappointed to find options filled with ads, absolutely bonkers and invasive data collection practices, expensive subscription fees—hundreds of dollars per year? \n\nFrustrated with the options we decided to build a minimal photo cleaning app that only focuses on what matters. \n\n* **Optimized for Speed**:  Delete unwanted photos blazing fast and go on about your day.\n* **Ergonomic Design**: We tested tens of ways and optimized for quick thumb taps. (Swiping through hundreds or thousands of photos is not all that practical, we left that for Tinder) \n* **Zero Ads & Zero Data Collection**: We don't collect **any** data, not even anonymized stats, you can use it offline.\n* **Storage Tracking**: Easily see how much space you're freeing up with each delete.\n* **One-Time Purchase**: We priced it just enough to maybe cover some dev costs, $4.99, and it's yours forever—if shared with someone it becomes $2.99. \n\nIt's not a revolutionary app, quite the contrary actually, but we felt compelled to create a straightforward tool without the bloat and downsides that seemed absurd. And since it’s a onetime purchase It should serve you on your next iPhones as well.\n\nTrying to acquire new customers with this pricing structure is nearly impossible, if someone else needs it share it with them, because I’m sure when they’ll search Photo cleaner the behemoths with millions of downloads fueled by the subscriptions and ads will pop up way before this.\n\nWe will integrate more features that users request rather than fill with bloat, for us cleaning the photos was the main goal.\n\n[App Store Link](https://apps.apple.com/us/app/gallery-tap-clean-storage/id6737475869)",
        "created_utc": 1731844084.0,
        "subreddit_name": "apple",
        "comments": 111
    },
    {
        "title": "Apple’s Tim Cook Has Ways to Cope With the Looming Trump Tariffs",
        "score": 97,
        "url": "https://www.bloomberg.com/news/newsletters/2024-11-17/how-will-president-donald-trump-s-new-tariffs-affect-apple-products-and-prices-m3lnfx64",
        "content": "",
        "created_utc": 1731859138.0,
        "subreddit_name": "apple",
        "comments": 1
    },
    {
        "title": "From Sugar-Free to iOS App Developer (Lifetime Promo Codes Giveaway!)",
        "score": 64,
        "url": "https://www.reddit.com/r/apple/comments/1gtdr5b/from_sugarfree_to_ios_app_developer_lifetime/",
        "content": "Hi Apple Community!\n\nI would love to share a personal journey that led me to create my own iOS/iPadOS app as a side project! I’d love to hear your thoughts and feedback.\n\n# My Story\n\nI’m a 29-year-old who was addicted to sugar, (sweets, candies, cakes, you name it). I couldn’t resist my cravings for sweet snacks and knew I needed to make a change. One day, I decided to try a week without sugar. Well, it wasn’t easy. The first three weeks were brutal. I felt angry, nervous, upset, and unfocused. I failed several times, lasting only 1, 2, 3, or 5 days before giving up.\n\nBut with each attempt, my streaks got longer. After several tries, I finally made it past one month and haven’t looked back. I’ve been sugar-free for over two years now! Cutting out sugar transformed my life. I lost over 16kg just by changing my diet. Fun fact: I even skipped desserts at my own wedding!\n\n# The App\n\nThis journey inspired me to create something to help others on their own paths. I’d always dreamed of building an iOS app ever since owning my first iPhone 3G. So, I embarked on a self-taught journey in iOS development during my free time.\n\nAfter three years of learning and coding, I created Quitly, a clean and simple app to track sober streaks and count days since any event. It’s not just for sugar, but for anything, like alcohol, vaping, or any event you'd like to track the days since.\n\nMy goal was to build something simple, customizable, and motivating, with a clean and smooth UI.\n\nQuitly helps you track streaks, log slip-ups, and see patterns over time, like how your streaks are improving. You can also reset your counter and calculate your average streak length.\n\n# App Details\n\n**My App - Quitly -  is free to download:** [https://apps.apple.com/app/quitly/id6615060703](https://apps.apple.com/app/quitly/id6615060703)\n\n* The app is **completely private**. All user data is **stored securely on the device**, using **iCloud for backup and syncing across devices**. There are no third-party servers or accounts involved. Everything is built natively for Apple.\n* The app is available on iPhone and iPad, with all your data accessible across both devices. I also have Apple Watch and Mac support on the roadmap!\n* I don’t track any data. The app is completely anonymous and private. However, you can see on the App Store that email information may be collected (but not linked to you). This is only required for email support, as you can contact me directly through the app, and I would see your email address. That's it. No email or account is necessary to use the app. it’s only for support purposes.\n* I developed the app entirely with Swift & SwiftUI, using CoreData and CloudKit\n* The app is free to download, with a single lifetime purchase option for creating unlimited amount of counters.\n\n# Lifetime Codes Giveaway\n\nAs a solo developer, your feedback means the world to me. To thank you, **~~I’m giving away free lifetime promo codes! Drop a comment if you’re interested~~**~~. I’d love your suggestions for new features and improvements.~~\n\nI already have many features on the roadmap, and you can help me make the app even better and shape its future.\n\nI’m looking forward to your suggestions!\n\nHave a great day, everyone!\n\n# Edit\n\nWow, I’m honestly blown away by your interest! Thank you so much for your support! I didn't expect that! I’ve been regenerating new codes, **but I’m currently out of lifetime codes for now.** I truly appreciate how many people are excited about the app!\n\nDon’t worry though! **The app is still free to download for anyone!** If I manage to get more lifetime codes or if any of the current ones go unredeemed, I’ll definitely share them with you and send you a DM. Thank you!",
        "created_utc": 1731850749.0,
        "subreddit_name": "apple",
        "comments": 255
    },
    {
        "title": "I made a clean minimalist sudoku app for iPhone and iPad pt. 3",
        "score": 44,
        "url": "https://www.reddit.com/r/apple/comments/1gthxpp/i_made_a_clean_minimalist_sudoku_app_for_iphone/",
        "content": "# Not Evil?\n\nI started working on Not Evil Sudoku around two years ago after struggling to find a clean minimalist sudoku app that wasn't bloated with ads and last month the app got some major updates with version 3.0, including: synced daily puzzles, multi-line view for statistics, speed demon, better iPad support and themes.\n\n[App Store Link](https://apps.apple.com/app/not-evil-sudoku/id1614071642)\n\nHere's a quick round up of what's new in the app since it was last here more than a year ago:\n\n# Daily Puzzles\n\nNew: Synced daily puzzles that are the same for all users of the app (one for each difficulty). Hopefully this makes things more fun when you're sharing scores with friends!\n\nThere's also a game center leaderboard (beta) that you can access through Settings → Game Center Bubble on the top right for daily scores. Note: For your score to be eligible for the leaderboard, move by move validation (Settings → Move by Move Validation) needs to be turned off to prevent people from brute forcing solutions.\n\nHere's how I did on today's medium daily:  \nNot Evil Sudoku - Daily #016  \n🧇 ⬜️⬜️⬜️ 4 ⬜️ 8 ⬜️⬜️ 3  \n🟠 MEDIUM: Solved in 03:35  \n🛟 Assists: 🪄 ✨ 😈\n\nYou can generate this summary from \"Share\" on the puzzle solved alert.\n\n# Puzzle Tools:\n\n\\[Some new features since the app was last here!\\]\n\n**Speed Demon**: If you prefer to select a number and then tap the tiles where you think they should go, that setting is now available! Settings → Advanced → Speed Demon.\n\n**Fixed Notes**: Notes can be fixed instead of being in the order that they were placed. A much requested feature that I finally got around to adding last year. Settings → Notes → Fixed Notes.\n\n**Clear All Notes**: Long press on clear to clear the board of all notes.\n\n# Landscape iPad Support:\n\nWhen the app was last posted here, it only worked in portrait on iPad but it now works in landscape mode too! A major goal was [having the puzzle tools and numpad draggable](https://imgur.com/a/landscape-mode-not-evil-sudoku-aLZFUJ8) and I think it turned out quite decent. Makes the experience on iPad a bit more ergonomic. I will need to look into adding support for Apple pencil...\n\n# Pro Feature Updates\n\nCharts have been revamped to show a multiline view of your best times across difficulties and re-written in Apple's Charts library. Unfortunately the new charts are iOS 16+ because of library limitations. [Pretty snazzy, eh?](https://imgur.com/a/not-evil-sudoku-statistics-page-revamped-u4Os8af)\n\nAlso Board backgrounds! If you don't like the color of the background (black in dark mode, white in light mode) you can now change that in Settings!\n\nNot Evil Sudoku is free to play with a puzzle daily and has a single one-time purchase of 4.99 US for unlimited games, charts, themes and more. Pro also supports Apple family sharing with up to five family members.\n\n# [App Store Link](https://apps.apple.com/app/not-evil-sudoku/id1614071642)",
        "created_utc": 1731862566.0,
        "subreddit_name": "apple",
        "comments": 27
    },
    {
        "title": "I just released MC Status 2.0 - Rewritten in SwiftUI/Swift data with support for Apple Watch, CloudKit, Tinted Widgets, Shortcuts, Siri, and more!",
        "score": 22,
        "url": "https://www.reddit.com/r/apple/comments/1gti23d/i_just_released_mc_status_20_rewritten_in/",
        "content": "Hey Everyone,\n\nJust wanted to announce the latest update to my Free and Open Source “MC Status” iOS App. The fastest way to check the status of a Minecraft server from your phone/mac/watch.\n\nhttps://apps.apple.com/us/app/mc-status-widget-for-minecraft/id1408215245\n\nThis 2.0 update has been over a year in the making, and is a total rewrite of the app from scratch. This update brings a suite of highly requested new features and enhancements, including:\n\n\t•\tBrand-new UI rewritten using SwiftUI and Swift Data\n\t•\tNew Apple Watch app for checking your servers right from your watch\n\t•\tApple Watch complications support for seeing the status of your server from your watch face\n\t•\tSupport for CloudKit to keep all your devices in sync\n\t•\tSupport for Shortcut Automations\n\t•\tSupport for Voice Requests via Siri\n\t•\tSupport for dark/tinted home screen icon\n\t•\tSupport for domain SRV records\n\t•\tSupport for formatted MOTD\n\t•\tAdditional inline widget options\n\t•\tAdds a refresh button to widget for manual refreshing\n\nThe app is free, adless, and open source, for anyone who wants to see the source code or contribute: https://github.com/eclair4151/MC-Status-Widget-for-Minecraft/\n\nI hope you all enjoy, let me know if you see any issues or have any additional feature requests!",
        "created_utc": 1731862879.0,
        "subreddit_name": "apple",
        "comments": 4
    },
    {
        "title": "🪄 I made Protego - a Reddit content filter Safari extension for macOS (RES alternative)",
        "score": 11,
        "url": "https://www.reddit.com/r/apple/comments/1gt9lak/i_made_protego_a_reddit_content_filter_safari/",
        "content": "# UPDATE: Protego for Reddit now works on iPhone, iPad, and Mac!\n\nI've edited the text below to reflect that it's now multi platform.\n\n\\-------\n\n**I'm doing an early Black Friday sale for 25% off through Dec 3rd ($1.49 instead of $1.99).**\n\n[**App Website**](https://getprotego.app) **|** [**Mac App Store**](https://apps.apple.com/us/app/protego-for-reddit/id6737959724?mt=12)\n\nHey Reddit! I'm excited to share a Safari extension I've been working on. The idea came during the recent US presidential election when my social media feeds were completely overwhelmed with political content. The constant stream of political posts was really taking a toll on my mental health, and I'm sure I'm not alone in feeling this way.\n\nI ended up uninstalling most social media apps, but I still wanted to use Reddit on Safari (my browser of choice). I was frustrated that RES (Reddit Enhancement Suite) wasn't available for Safari. I needed a way to filter out political content and other topics I wanted to take breaks from, but couldn't find exactly what I wanted. So, I decided to learn Swift and build it myself!\n\nAfter learning Safari extension development and with help from AI tools, I managed to create my first Mac app AND get it accepted into the App Store! While it's not a full RES replacement (yet!), I focused on building the feature I personally needed the most - content filtering.\n\nIt's called Protego (yes, like the Harry Potter shield charm 🪄), and it's a Safari extension that lets you filter out Reddit content you'd rather not see. Think of it as a shield for your mental health - letting you enjoy Reddit while avoiding topics you need a break from.\n\nWhat it does:\n\n* Lets you add keywords and wildcards to filter out posts you don't want to see\n* Works on both old and new Reddit\n* Includes dark mode because we all love dark mode\n* Super simple import/export of filter lists\n\n[**App Website**](https://getprotego.app) **|** [**App Store**](https://apps.apple.com/us/app/protego-for-reddit/id6737959724?mt=12)\n\nThis is literally my first app ever, so I'd really appreciate any feedback or suggestions. It's been quite a journey - from knowing nothing about Safari extensions to finally having something in the App Store. I'm already planning more features, and your feedback will help guide what comes next!\n\nFuture update will include: RegEx filtering, filtering AutoMod comments, filtering in search results, a dedicated settings UI, and my goal is to have an iOS version of the app as well.\n\n**I think I'll set up a Subreddit for the app or some way to submit bugs and discuss changes soon.**",
        "created_utc": 1731833984.0,
        "subreddit_name": "apple",
        "comments": 20
    },
    {
        "title": "Daily Advice Thread - November 17, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/apple/comments/1gtb7fa/daily_advice_thread_november_17_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1731841230.0,
        "subreddit_name": "apple",
        "comments": 29
    }
]