[
    {
        "title": "New Nvidia AI chips overheating in servers, the Information reports",
        "score": 310,
        "url": "https://www.reddit.com/r/stocks/comments/1gtlzww/new_nvidia_ai_chips_overheating_in_servers_the/",
        "content": "Nov 17 (Reuters) - Nvidia's new Blackwell AI Chips, which have already faced delays, have encountered problems with accompanying servers that overheat, causing some customers to worry they will not have enough time to get new data centers up and running, the Information reported on Sunday.The Blackwell graphics processing units overheat when connected together in server racks designed to hold up to 72 chips, the report said, citing sources familiar with the issue.\n\n  \nThe chipmaker has asked its suppliers to change the design of the racks several times to resolve overheating problems, according to Nvidia employees who have been working on the issue, as well as customers and suppliers with knowledge of the issue, the report said without naming the suppliers.\"Nvidia is working with leading cloud service providers as an integral part of our engineering team and process. The engineering iterations are normal and expected,\" a company spokesperson said in a statement to Reuters.\n\n  \nIn March, Nvidia unveiled Blackwell chips and had earlier said they would ship in the second quarter before encountering delays, potentially affecting customers such as Meta Platforms , Alphabet's Google and Microsoft .Nvidia's Blackwell chip takes two squares of silicon the size of the company's previous offering and binds them into a single component that is 30 times speedier at tasks like providing responses from chatbots.",
        "created_utc": 1731873142.0,
        "subreddit_name": "stocks",
        "comments": 140
    },
    {
        "title": "Is PLTR in bubble territory?",
        "score": 286,
        "url": "https://www.reddit.com/r/stocks/comments/1gtdoq4/is_pltr_in_bubble_territory/",
        "content": "I don’t own any so this question just stems from curiosity. \n\nIts market cap was ~$15bn two years ago and is $150bn today. There’s nothing inherently concerning about that (NVDA was similar, as we all know), but its P/E ratio is 329 - is the rise unsustainable?\n\nI understand Palantir has a lot of positive momentum from AI hype, expected defense spending under Trump, and general recovery of growth stocks as interest rates fall from their highs. These are all valid reasons to expect continued success from Palantir, but are investors irrationally exuberant?\n\nDo you see a pullback on the horizon?",
        "created_utc": 1731850525.0,
        "subreddit_name": "stocks",
        "comments": 347
    },
    {
        "title": "New Nvidia AI chips face issue with overheating servers",
        "score": 383,
        "url": "https://www.reuters.com/technology/artificial-intelligence/new-nvidia-ai-chips-face-issue-with-overheating-servers-information-reports-2024-11-17/",
        "content": "Doesn’t sound the best considering they already had delays. Rip Monday and Tuesday ",
        "created_utc": 1731853979.0,
        "subreddit_name": "wallstreetbets",
        "comments": 147
    },
    {
        "title": "I’ve got around $200k in an Inherited IRA (account must be closed and taxes paid within 10 years) Looking to put about half in a Trump-Friendly portfolio. Companies that will likely do very well under his administration. Is anybody doing the same?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gtiief/ive_got_around_200k_in_an_inherited_ira_account/",
        "content": "More context:  $100k is currently in S&P , the other $100k I would like to invest very aggressively with companies ran by trumps friends/ businesses that align with his economic policies.\n\nI’m 31 years old and inherited this money 6 months ago. It had been earning 5% up until the election, now I’m looking to ride the Trump train and with an aggressive portfolio I believe a fair expectation/hope is to get this 200k to 500k by the end of trumps 4 years.\n\nThese are some companies I’m thinking so far, I appreciate any insight or suggestions for other sectors/stocks \n\n-Tesla and other Battery/mining related companies Tesla uses?\n-UFC/Endeavor/WWE/ZUFA (Dana white companies) (don’t remember the exact parent company ticker) \n-US Automotive (Stellantis for expample I think could make a nice comeback) \n-US Oil / Fracking companies?\n-Nvidia \n-AI\n-Netflix, Spotify\n\nThese are just some off the top of my head, I appreciate any and all constructive criticism and recommendations.\n\nI am by no means an expert, but I do have a well paying salary (about 6 figures)   BTC, 100k in S&P ,  so I’m not putting all my eggs in one basket here. \n\nThanks in advance. ",
        "created_utc": 1731864000.0,
        "subreddit_name": "investing",
        "comments": 34
    },
    {
        "title": "Putin's Phone Call With Germany Sparks NATO Anger",
        "score": 3369,
        "url": "https://www.newsweek.com/vladimir-putin-olaf-scholz-phone-call-germany-ukraine-nato-anger-backlash-1987054",
        "content": "",
        "created_utc": 1731860670.0,
        "subreddit_name": "worldnews",
        "comments": 249
    }
]