[
    {
        "title": "New Nvidia AI chips overheating in servers, the Information reports",
        "score": 310,
        "url": "https://www.reddit.com/r/stocks/comments/1gtlzww/new_nvidia_ai_chips_overheating_in_servers_the/",
        "content": "Nov 17 (Reuters) - Nvidia's new Blackwell AI Chips, which have already faced delays, have encountered problems with accompanying servers that overheat, causing some customers to worry they will not have enough time to get new data centers up and running, the Information reported on Sunday.The Blackwell graphics processing units overheat when connected together in server racks designed to hold up to 72 chips, the report said, citing sources familiar with the issue.\n\n  \nThe chipmaker has asked its suppliers to change the design of the racks several times to resolve overheating problems, according to Nvidia employees who have been working on the issue, as well as customers and suppliers with knowledge of the issue, the report said without naming the suppliers.\"Nvidia is working with leading cloud service providers as an integral part of our engineering team and process. The engineering iterations are normal and expected,\" a company spokesperson said in a statement to Reuters.\n\n  \nIn March, Nvidia unveiled Blackwell chips and had earlier said they would ship in the second quarter before encountering delays, potentially affecting customers such as Meta Platforms , Alphabet's Google and Microsoft .Nvidia's Blackwell chip takes two squares of silicon the size of the company's previous offering and binds them into a single component that is 30 times speedier at tasks like providing responses from chatbots.",
        "created_utc": 1731873142.0,
        "subreddit_name": "stocks",
        "comments": 140
    },
    {
        "title": "Is PLTR in bubble territory?",
        "score": 286,
        "url": "https://www.reddit.com/r/stocks/comments/1gtdoq4/is_pltr_in_bubble_territory/",
        "content": "I don’t own any so this question just stems from curiosity. \n\nIts market cap was ~$15bn two years ago and is $150bn today. There’s nothing inherently concerning about that (NVDA was similar, as we all know), but its P/E ratio is 329 - is the rise unsustainable?\n\nI understand Palantir has a lot of positive momentum from AI hype, expected defense spending under Trump, and general recovery of growth stocks as interest rates fall from their highs. These are all valid reasons to expect continued success from Palantir, but are investors irrationally exuberant?\n\nDo you see a pullback on the horizon?",
        "created_utc": 1731850525.0,
        "subreddit_name": "stocks",
        "comments": 347
    },
    {
        "title": "New Nvidia AI chips face issue with overheating servers",
        "score": 383,
        "url": "https://www.reuters.com/technology/artificial-intelligence/new-nvidia-ai-chips-face-issue-with-overheating-servers-information-reports-2024-11-17/",
        "content": "Doesn’t sound the best considering they already had delays. Rip Monday and Tuesday ",
        "created_utc": 1731853979.0,
        "subreddit_name": "wallstreetbets",
        "comments": 147
    },
    {
        "title": "I’ve got around $200k in an Inherited IRA (account must be closed and taxes paid within 10 years) Looking to put about half in a Trump-Friendly portfolio. Companies that will likely do very well under his administration. Is anybody doing the same?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gtiief/ive_got_around_200k_in_an_inherited_ira_account/",
        "content": "More context:  $100k is currently in S&P , the other $100k I would like to invest very aggressively with companies ran by trumps friends/ businesses that align with his economic policies.\n\nI’m 31 years old and inherited this money 6 months ago. It had been earning 5% up until the election, now I’m looking to ride the Trump train and with an aggressive portfolio I believe a fair expectation/hope is to get this 200k to 500k by the end of trumps 4 years.\n\nThese are some companies I’m thinking so far, I appreciate any insight or suggestions for other sectors/stocks \n\n-Tesla and other Battery/mining related companies Tesla uses?\n-UFC/Endeavor/WWE/ZUFA (Dana white companies) (don’t remember the exact parent company ticker) \n-US Automotive (Stellantis for expample I think could make a nice comeback) \n-US Oil / Fracking companies?\n-Nvidia \n-AI\n-Netflix, Spotify\n\nThese are just some off the top of my head, I appreciate any and all constructive criticism and recommendations.\n\nI am by no means an expert, but I do have a well paying salary (about 6 figures)   BTC, 100k in S&P ,  so I’m not putting all my eggs in one basket here. \n\nThanks in advance. ",
        "created_utc": 1731864000.0,
        "subreddit_name": "investing",
        "comments": 34
    },
    {
        "title": "Putin's Phone Call With Germany Sparks NATO Anger",
        "score": 3369,
        "url": "https://www.newsweek.com/vladimir-putin-olaf-scholz-phone-call-germany-ukraine-nato-anger-backlash-1987054",
        "content": "",
        "created_utc": 1731860670.0,
        "subreddit_name": "worldnews",
        "comments": 249
    },
    {
        "title": "Apple reportedly releasing AirTag 2 next year with these 3 improvements",
        "score": 1832,
        "url": "https://9to5mac.com/2024/11/17/airtag-2-next-year-three-improvements/",
        "content": "",
        "created_utc": 1731857271.0,
        "subreddit_name": "apple",
        "comments": 420
    },
    {
        "title": "Apple Seemingly Discontinuing Lightning to Headphone Jack Adapter Introduced Alongside iPhone 7",
        "score": 595,
        "url": "https://www.macrumors.com/2024/11/17/lightning-to-headphone-jack-adapter-sold-out/",
        "content": "",
        "created_utc": 1731875897.0,
        "subreddit_name": "apple",
        "comments": 87
    },
    {
        "title": "Gurman: Apple 'evaluating' idea of releasing a TV set again",
        "score": 564,
        "url": "https://9to5mac.com/2024/11/17/report-apple-branded-tv-set/",
        "content": "",
        "created_utc": 1731852518.0,
        "subreddit_name": "apple",
        "comments": 239
    },
    {
        "title": "I'm building Sink It, a free browser extension, to make Reddit more usable. I'm giving away 20 licenses of Sink It Max, a premium upgrade for old reddit.",
        "score": 210,
        "url": "https://www.reddit.com/r/apple/comments/1gte7n0/im_building_sink_it_a_free_browser_extension_to/",
        "content": "Hey /r/Apple,\n\nA little over a year ago, I launched Sink It [here] (https://www.reddit.com/r/apple/comments/14inaut/sink_it_for_reddit_a_totally_free_ios_safari/) on this subreddit as a free, minimal Safari extension to make reddit more usable. Over the months, it has grown into a lite client of sorts if you're just looking for a clean, usable, and nag free way to use reddit on your browser.\n\nYou can get it on the [App Store](https://apps.apple.com/us/app/sink-it-for-reddit/id6449873635) for iOS, iPadOS and MacOS. You can also find Chrome and Firefox versions on our [site](https://gosinkit.com/). \n\nAlong the way, it has gotten covered by Lifehacker, Wired, and Ars Technica.\n\n&nbsp;\n\n**What is Sink It?**\n\nSink It channels the spirits of RES (for users of yore) and is used in the same manner -- you simply load the reddit website on Safari after which the app jumps in, adding, yanking, and finessing elements and features to make it more usable. It also works with all of the different reddit UIs floating around. There are [four unique ones](https://gosinkit.com/reddit-designs) that I know of, all of which Sink It supports. \n\nSink It ships with a ton of features but my favorite has to be the extensive content muting. You can mute sensitive words, subs, websites, or users from your feed, which helps a ton specially during election periods. Another favorite is a built-in anti-procrastination tool which blocks your feeds but still allows access to individual posts you might stumble into from search results.\n\nThe app ships with (what I think are) sensible defaults but every single feature can be turned off completely. For example, if you want Sink It to only redirect every page to old reddit and collapse automod comments and all second level comments, that's easily doable. iCloud sync comes as standard too.\n\nThe app is being actively developed and updates are pushed out at least once a week, mostly twice. Because the app relies on the reddit website which changes all the time, it's been a challenging but fun process. Changes to reddit or new banners/nags get reported in our [sub](https://www.reddit.com/r/SinkIt/) or on discord, often within hours, so updates usually go out rapidly to handle these changes.\n\nSink It is free and has no subscriptions. If you're nostalgic and want the Sink It features for old reddit, I have a one-time $5 upgrade called Max which helps me maintain the app.\n\n&nbsp;\n\n**Giveaway**\n\nI'll freely admit that 90% of features originate from our users as feature requests which is why I'm here. If you use the web version of reddit and have any ideas of how to make it better, or annoy you less, leave a comment below. I'll be picking ten random ideas and sending them codes for Sink It Max, the premium upgrade. If you don't have any, post your favorite Apple launch event or photos of any pets you have to enter the giveaway.",
        "created_utc": 1731852212.0,
        "subreddit_name": "apple",
        "comments": 283
    },
    {
        "title": "We Built a Fast, Privacy Focused Photo Cleaner for iPhone users. No ads, no subscriptions, zero data collected. Onetime purchase $4.99 or $2.99, own forever. ",
        "score": 143,
        "url": "https://www.reddit.com/r/apple/comments/1gtbw0b/we_built_a_fast_privacy_focused_photo_cleaner_for/",
        "content": "Hey everyone,\n\n  \n[App Store Link](https://apps.apple.com/us/app/gallery-tap-clean-storage/id6737475869)\n\nSo 256 GB was enough for me since I first got the iPhone 7, before the iPhone 16 came out I knew the 512 GB is the next tier for me. \n\nI’ve apparently accumulated more than 30k Photos. Knowing that a lot of that is junk;  I wanted an app to help me clean the gallery. \n\nSearched for a photo cleaning app, was disappointed to find options filled with ads, absolutely bonkers and invasive data collection practices, expensive subscription fees—hundreds of dollars per year? \n\nFrustrated with the options we decided to build a minimal photo cleaning app that only focuses on what matters. \n\n* **Optimized for Speed**:  Delete unwanted photos blazing fast and go on about your day.\n* **Ergonomic Design**: We tested tens of ways and optimized for quick thumb taps. (Swiping through hundreds or thousands of photos is not all that practical, we left that for Tinder) \n* **Zero Ads & Zero Data Collection**: We don't collect **any** data, not even anonymized stats, you can use it offline.\n* **Storage Tracking**: Easily see how much space you're freeing up with each delete.\n* **One-Time Purchase**: We priced it just enough to maybe cover some dev costs, $4.99, and it's yours forever—if shared with someone it becomes $2.99. \n\nIt's not a revolutionary app, quite the contrary actually, but we felt compelled to create a straightforward tool without the bloat and downsides that seemed absurd. And since it’s a onetime purchase It should serve you on your next iPhones as well.\n\nTrying to acquire new customers with this pricing structure is nearly impossible, if someone else needs it share it with them, because I’m sure when they’ll search Photo cleaner the behemoths with millions of downloads fueled by the subscriptions and ads will pop up way before this.\n\nWe will integrate more features that users request rather than fill with bloat, for us cleaning the photos was the main goal.\n\n[App Store Link](https://apps.apple.com/us/app/gallery-tap-clean-storage/id6737475869)",
        "created_utc": 1731844084.0,
        "subreddit_name": "apple",
        "comments": 111
    },
    {
        "title": "Apple’s Tim Cook Has Ways to Cope With the Looming Trump Tariffs",
        "score": 97,
        "url": "https://www.bloomberg.com/news/newsletters/2024-11-17/how-will-president-donald-trump-s-new-tariffs-affect-apple-products-and-prices-m3lnfx64",
        "content": "",
        "created_utc": 1731859138.0,
        "subreddit_name": "apple",
        "comments": 1
    },
    {
        "title": "From Sugar-Free to iOS App Developer (Lifetime Promo Codes Giveaway!)",
        "score": 64,
        "url": "https://www.reddit.com/r/apple/comments/1gtdr5b/from_sugarfree_to_ios_app_developer_lifetime/",
        "content": "Hi Apple Community!\n\nI would love to share a personal journey that led me to create my own iOS/iPadOS app as a side project! I’d love to hear your thoughts and feedback.\n\n# My Story\n\nI’m a 29-year-old who was addicted to sugar, (sweets, candies, cakes, you name it). I couldn’t resist my cravings for sweet snacks and knew I needed to make a change. One day, I decided to try a week without sugar. Well, it wasn’t easy. The first three weeks were brutal. I felt angry, nervous, upset, and unfocused. I failed several times, lasting only 1, 2, 3, or 5 days before giving up.\n\nBut with each attempt, my streaks got longer. After several tries, I finally made it past one month and haven’t looked back. I’ve been sugar-free for over two years now! Cutting out sugar transformed my life. I lost over 16kg just by changing my diet. Fun fact: I even skipped desserts at my own wedding!\n\n# The App\n\nThis journey inspired me to create something to help others on their own paths. I’d always dreamed of building an iOS app ever since owning my first iPhone 3G. So, I embarked on a self-taught journey in iOS development during my free time.\n\nAfter three years of learning and coding, I created Quitly, a clean and simple app to track sober streaks and count days since any event. It’s not just for sugar, but for anything, like alcohol, vaping, or any event you'd like to track the days since.\n\nMy goal was to build something simple, customizable, and motivating, with a clean and smooth UI.\n\nQuitly helps you track streaks, log slip-ups, and see patterns over time, like how your streaks are improving. You can also reset your counter and calculate your average streak length.\n\n# App Details\n\n**My App - Quitly -  is free to download:** [https://apps.apple.com/app/quitly/id6615060703](https://apps.apple.com/app/quitly/id6615060703)\n\n* The app is **completely private**. All user data is **stored securely on the device**, using **iCloud for backup and syncing across devices**. There are no third-party servers or accounts involved. Everything is built natively for Apple.\n* The app is available on iPhone and iPad, with all your data accessible across both devices. I also have Apple Watch and Mac support on the roadmap!\n* I don’t track any data. The app is completely anonymous and private. However, you can see on the App Store that email information may be collected (but not linked to you). This is only required for email support, as you can contact me directly through the app, and I would see your email address. That's it. No email or account is necessary to use the app. it’s only for support purposes.\n* I developed the app entirely with Swift & SwiftUI, using CoreData and CloudKit\n* The app is free to download, with a single lifetime purchase option for creating unlimited amount of counters.\n\n# Lifetime Codes Giveaway\n\nAs a solo developer, your feedback means the world to me. To thank you, **~~I’m giving away free lifetime promo codes! Drop a comment if you’re interested~~**~~. I’d love your suggestions for new features and improvements.~~\n\nI already have many features on the roadmap, and you can help me make the app even better and shape its future.\n\nI’m looking forward to your suggestions!\n\nHave a great day, everyone!\n\n# Edit\n\nWow, I’m honestly blown away by your interest! Thank you so much for your support! I didn't expect that! I’ve been regenerating new codes, **but I’m currently out of lifetime codes for now.** I truly appreciate how many people are excited about the app!\n\nDon’t worry though! **The app is still free to download for anyone!** If I manage to get more lifetime codes or if any of the current ones go unredeemed, I’ll definitely share them with you and send you a DM. Thank you!",
        "created_utc": 1731850749.0,
        "subreddit_name": "apple",
        "comments": 255
    },
    {
        "title": "I made a clean minimalist sudoku app for iPhone and iPad pt. 3",
        "score": 44,
        "url": "https://www.reddit.com/r/apple/comments/1gthxpp/i_made_a_clean_minimalist_sudoku_app_for_iphone/",
        "content": "# Not Evil?\n\nI started working on Not Evil Sudoku around two years ago after struggling to find a clean minimalist sudoku app that wasn't bloated with ads and last month the app got some major updates with version 3.0, including: synced daily puzzles, multi-line view for statistics, speed demon, better iPad support and themes.\n\n[App Store Link](https://apps.apple.com/app/not-evil-sudoku/id1614071642)\n\nHere's a quick round up of what's new in the app since it was last here more than a year ago:\n\n# Daily Puzzles\n\nNew: Synced daily puzzles that are the same for all users of the app (one for each difficulty). Hopefully this makes things more fun when you're sharing scores with friends!\n\nThere's also a game center leaderboard (beta) that you can access through Settings → Game Center Bubble on the top right for daily scores. Note: For your score to be eligible for the leaderboard, move by move validation (Settings → Move by Move Validation) needs to be turned off to prevent people from brute forcing solutions.\n\nHere's how I did on today's medium daily:  \nNot Evil Sudoku - Daily #016  \n🧇 ⬜️⬜️⬜️ 4 ⬜️ 8 ⬜️⬜️ 3  \n🟠 MEDIUM: Solved in 03:35  \n🛟 Assists: 🪄 ✨ 😈\n\nYou can generate this summary from \"Share\" on the puzzle solved alert.\n\n# Puzzle Tools:\n\n\\[Some new features since the app was last here!\\]\n\n**Speed Demon**: If you prefer to select a number and then tap the tiles where you think they should go, that setting is now available! Settings → Advanced → Speed Demon.\n\n**Fixed Notes**: Notes can be fixed instead of being in the order that they were placed. A much requested feature that I finally got around to adding last year. Settings → Notes → Fixed Notes.\n\n**Clear All Notes**: Long press on clear to clear the board of all notes.\n\n# Landscape iPad Support:\n\nWhen the app was last posted here, it only worked in portrait on iPad but it now works in landscape mode too! A major goal was [having the puzzle tools and numpad draggable](https://imgur.com/a/landscape-mode-not-evil-sudoku-aLZFUJ8) and I think it turned out quite decent. Makes the experience on iPad a bit more ergonomic. I will need to look into adding support for Apple pencil...\n\n# Pro Feature Updates\n\nCharts have been revamped to show a multiline view of your best times across difficulties and re-written in Apple's Charts library. Unfortunately the new charts are iOS 16+ because of library limitations. [Pretty snazzy, eh?](https://imgur.com/a/not-evil-sudoku-statistics-page-revamped-u4Os8af)\n\nAlso Board backgrounds! If you don't like the color of the background (black in dark mode, white in light mode) you can now change that in Settings!\n\nNot Evil Sudoku is free to play with a puzzle daily and has a single one-time purchase of 4.99 US for unlimited games, charts, themes and more. Pro also supports Apple family sharing with up to five family members.\n\n# [App Store Link](https://apps.apple.com/app/not-evil-sudoku/id1614071642)",
        "created_utc": 1731862566.0,
        "subreddit_name": "apple",
        "comments": 27
    },
    {
        "title": "I just released MC Status 2.0 - Rewritten in SwiftUI/Swift data with support for Apple Watch, CloudKit, Tinted Widgets, Shortcuts, Siri, and more!",
        "score": 22,
        "url": "https://www.reddit.com/r/apple/comments/1gti23d/i_just_released_mc_status_20_rewritten_in/",
        "content": "Hey Everyone,\n\nJust wanted to announce the latest update to my Free and Open Source “MC Status” iOS App. The fastest way to check the status of a Minecraft server from your phone/mac/watch.\n\nhttps://apps.apple.com/us/app/mc-status-widget-for-minecraft/id1408215245\n\nThis 2.0 update has been over a year in the making, and is a total rewrite of the app from scratch. This update brings a suite of highly requested new features and enhancements, including:\n\n\t•\tBrand-new UI rewritten using SwiftUI and Swift Data\n\t•\tNew Apple Watch app for checking your servers right from your watch\n\t•\tApple Watch complications support for seeing the status of your server from your watch face\n\t•\tSupport for CloudKit to keep all your devices in sync\n\t•\tSupport for Shortcut Automations\n\t•\tSupport for Voice Requests via Siri\n\t•\tSupport for dark/tinted home screen icon\n\t•\tSupport for domain SRV records\n\t•\tSupport for formatted MOTD\n\t•\tAdditional inline widget options\n\t•\tAdds a refresh button to widget for manual refreshing\n\nThe app is free, adless, and open source, for anyone who wants to see the source code or contribute: https://github.com/eclair4151/MC-Status-Widget-for-Minecraft/\n\nI hope you all enjoy, let me know if you see any issues or have any additional feature requests!",
        "created_utc": 1731862879.0,
        "subreddit_name": "apple",
        "comments": 4
    },
    {
        "title": "🪄 I made Protego - a Reddit content filter Safari extension for macOS (RES alternative)",
        "score": 11,
        "url": "https://www.reddit.com/r/apple/comments/1gt9lak/i_made_protego_a_reddit_content_filter_safari/",
        "content": "# UPDATE: Protego for Reddit now works on iPhone, iPad, and Mac!\n\nI've edited the text below to reflect that it's now multi platform.\n\n\\-------\n\n**I'm doing an early Black Friday sale for 25% off through Dec 3rd ($1.49 instead of $1.99).**\n\n[**App Website**](https://getprotego.app) **|** [**Mac App Store**](https://apps.apple.com/us/app/protego-for-reddit/id6737959724?mt=12)\n\nHey Reddit! I'm excited to share a Safari extension I've been working on. The idea came during the recent US presidential election when my social media feeds were completely overwhelmed with political content. The constant stream of political posts was really taking a toll on my mental health, and I'm sure I'm not alone in feeling this way.\n\nI ended up uninstalling most social media apps, but I still wanted to use Reddit on Safari (my browser of choice). I was frustrated that RES (Reddit Enhancement Suite) wasn't available for Safari. I needed a way to filter out political content and other topics I wanted to take breaks from, but couldn't find exactly what I wanted. So, I decided to learn Swift and build it myself!\n\nAfter learning Safari extension development and with help from AI tools, I managed to create my first Mac app AND get it accepted into the App Store! While it's not a full RES replacement (yet!), I focused on building the feature I personally needed the most - content filtering.\n\nIt's called Protego (yes, like the Harry Potter shield charm 🪄), and it's a Safari extension that lets you filter out Reddit content you'd rather not see. Think of it as a shield for your mental health - letting you enjoy Reddit while avoiding topics you need a break from.\n\nWhat it does:\n\n* Lets you add keywords and wildcards to filter out posts you don't want to see\n* Works on both old and new Reddit\n* Includes dark mode because we all love dark mode\n* Super simple import/export of filter lists\n\n[**App Website**](https://getprotego.app) **|** [**App Store**](https://apps.apple.com/us/app/protego-for-reddit/id6737959724?mt=12)\n\nThis is literally my first app ever, so I'd really appreciate any feedback or suggestions. It's been quite a journey - from knowing nothing about Safari extensions to finally having something in the App Store. I'm already planning more features, and your feedback will help guide what comes next!\n\nFuture update will include: RegEx filtering, filtering AutoMod comments, filtering in search results, a dedicated settings UI, and my goal is to have an iOS version of the app as well.\n\n**I think I'll set up a Subreddit for the app or some way to submit bugs and discuss changes soon.**",
        "created_utc": 1731833984.0,
        "subreddit_name": "apple",
        "comments": 20
    },
    {
        "title": "Daily Advice Thread - November 17, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/apple/comments/1gtb7fa/daily_advice_thread_november_17_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1731841230.0,
        "subreddit_name": "apple",
        "comments": 29
    },
    {
        "title": "Lost your sense of direction? Turn off your phone and you’ll soon reconnect | Life and style",
        "score": 67,
        "url": "https://www.theguardian.com/lifeandstyle/2024/nov/17/lost-your-sense-of-direction-turn-off-your-phone-and-youll-soon-reconnect",
        "content": "",
        "created_utc": 1731871829.0,
        "subreddit_name": "technology",
        "comments": 20
    },
    {
        "title": "MacBook stolen in burglary",
        "score": 513,
        "url": "https://i.redd.it/g67aq18pbh1e1.jpeg",
        "content": "My flat in Paris was burgled yesterday and my MacBook seems to be located 3 kilometres from my address, along with my partner's. Unfortunately, despite the report of the break-in and what Find My says, I'm afraid I won't be able to get my work equipment back, and all of my precious work, part of which isn’t stored in iCloud.\n\nAny suggestions?",
        "created_utc": 1731856891.0,
        "subreddit_name": "mac",
        "comments": 85
    },
    {
        "title": "Two Mac Mini M4s - Universal Control - The ultimate upgrade? ",
        "score": 75,
        "url": "https://www.reddit.com/r/mac/comments/1gtnw7s/two_mac_mini_m4s_universal_control_the_ultimate/",
        "content": "https://preview.redd.it/4ar6677o1j1e1.png?width=1080&format=png&auto=webp&s=16729d512c16f13ebcad149ed2705beec0403516\n\nAs you might have seen before you can get two mac mini's for the price of 1 upgraded mac mini.  It's meant to highlight the insane prices for upgrades, but then I thought about it some more...\n\nWhat if you simply did buy two mac minis? Here's the setup I'm thinking about,\n\n\\- Two Monitor Setup  \n\\- Two Mac Mini M4 Base models (256gb SSD, 16GB RAM)  \n\\- Each Mac Mini is dedicated to one monitor  \n\\- Using Universal Control, control both with one mouse and keyboard.\n\nSo now instead of one upgraded mac mini, you have a distributed desktop setup to completely offload certain workloads to an entirely different computer.\n\nI haven't used universal control, but I'm curious if anyone has done this with two macs and if it's actually a smooth experience.  I saw some videos where there's a little bit of latency when doing drag and drop, between the two.   But this idea of the best upgrade for a mac mini is actually another mac mini is something I might actually consider doing.  I.e. start off with one and if I'm needing some power, buy another.\n\n  \nEDIT: \n\nThanks all for the input,  I ended up biting the bullet and just going for a single M4 with 512 SSD and 24GB RAM.  I think for me personally, I wouldn't want to deal with the finicky UC issues.  \n\n",
        "created_utc": 1731878154.0,
        "subreddit_name": "mac",
        "comments": 24
    },
    {
        "title": "How does one \"truly\" master MacOS?",
        "score": 63,
        "url": "https://www.reddit.com/r/mac/comments/1gtqju1/how_does_one_truly_master_macos/",
        "content": "I've used Mac for a couple years now and want to know the OS better. I'm starting to look into using/learning terminal, but I'm wondering if there are more important things other than cmd+space?",
        "created_utc": 1731885323.0,
        "subreddit_name": "mac",
        "comments": 65
    },
    {
        "title": "Panic Medic Boot ",
        "score": 30,
        "url": "https://i.redd.it/o2kqrbibsd1e1.jpeg",
        "content": "Hey, I got this Problem today with my 2020 Intel I-5 Macbook Pro, I have tried everything but so for to no prevail. In my last attempt, I went into recovery mode erased the hard drive and tried to install the Mac OS again but my laptop kept rebooting itself, I have tried doing it with the internet recovery option( strangely it doesn’t reboot during the internet recovery process but then afterwards when it goes into the to reinstall the OS it again shuts down. Does anyone how to fix it?",
        "created_utc": 1731814053.0,
        "subreddit_name": "mac",
        "comments": 7
    },
    {
        "title": "iMovie on MacMini A1103, difficulties exporting",
        "score": 29,
        "url": "https://www.reddit.com/gallery/1gtf84w",
        "content": "Got around to boot up an old MacMini A1103, which gave me the opportunity to import some MiniDV tapes I really want to digitize. Everything went smooth up until the point of copying/exporting the tape transfers to a flashdrive so I can use them on my modern laptop. Everytime I try to save the clips onto this flashdrive the process takes a long time just to be interrupted and cancelled. I've been trying simple drag and drop or compressing via the QuickTime option, to no end. Any tips on how to effectively get the DV tape clips I successfully imported into an external USB device ? Thank you ",
        "created_utc": 1731855272.0,
        "subreddit_name": "mac",
        "comments": 32
    },
    {
        "title": "I Need help ",
        "score": 17,
        "url": "https://www.reddit.com/gallery/1gtohhf",
        "content": "So this 2011 MacBook pro Is the ultimate laptop except for these Lines Is It a gpu or display issue since my HD 6750m still works when i opened It and touched the connector nothing happened and the Lines are not still they move",
        "created_utc": 1731879707.0,
        "subreddit_name": "mac",
        "comments": 30
    },
    {
        "title": "Apple MacBook Air M1 battery",
        "score": 14,
        "url": "https://i.redd.it/8d1rzpp32f1e1.jpeg",
        "content": "Is it possible that I have not original battery?",
        "created_utc": 1731829452.0,
        "subreddit_name": "mac",
        "comments": 19
    },
    {
        "title": "Turn off drag windows to menu bar to fill screen, again…",
        "score": 10,
        "url": "https://www.reddit.com/r/mac/comments/1gtfiog/turn_off_drag_windows_to_menu_bar_to_fill_screen/",
        "content": "The latest update turned this annoying trigger back on again.\n\nGo to Settings, Desktop & Dock to turn it off again. 🙄\n\nhttps://preview.redd.it/rdz5fob19h1e1.png?width=876&format=png&auto=webp&s=70936ff1076acaf1834984321a39d34a4a714521",
        "created_utc": 1731856085.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "M4 Mac Mini - Is the base 256GB storage enough if I have 1TB iCloud Drive?",
        "score": 10,
        "url": "https://www.reddit.com/r/mac/comments/1gtdq32/m4_mac_mini_is_the_base_256gb_storage_enough_if_i/",
        "content": "I never used a Mac and always used Windows and Linux. I am considering the new Mac Mini as it's pretty cheap for the performance it gives. I am alright with 16GB ram but unsure if 256GB of memory is enough. I pay for iCloud Drive (1TB) but only use around 250GB (iPhone).\n\nIf I get the 256GB, and use mainly iCloud drive to store the majority of the data (documents, pics, etcc..), is 256GB enough? Will be mostly for the apps and apps data. Maybe some documents here and there, but nothig heavy. I don't want to spend £200 exra just to get 256GB more memory, pretty expensive.",
        "created_utc": 1731850652.0,
        "subreddit_name": "mac",
        "comments": 41
    },
    {
        "title": "MacBook Pro 2018 15 won’t charge or turn on ",
        "score": 4,
        "url": "https://i.redd.it/r5yu8db69j1e1.jpeg",
        "content": "I woke up this morning and turned my mac on it was low on battery so I went to get the charger and plugged my iPhone in the mac before i charged the mac ,once i plugged the iPhone it went dead no sign of life , i tried SMC and reset nvram and all . it won’t show any sign of life ,my charger works fine I tried it in my friend mac and it works ,i also tried my friend charger and it wont work on my mac ,\nPs: before this , my mac used to go from 20-30% immediately to 1% and it would still work with 1% for more than 1 hour it only got 520 in battery cycles and the status shows normal ",
        "created_utc": 1731880288.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "Is this as good as it gets for $850?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gtlkv7/is_this_as_good_as_it_gets_for_850/",
        "content": "I know this is a mac subreddit but I'm asking for some non bias advice please.\n\nBefore I get comments from people from US and UK about how \"you can find one for $400 at bestbuy\" you need to know that in my country this is as good as it gets price wise. Black Friday is a scam in Europe.\n\nIf it had more storage and ram, I wouldn't even think about it, but those specs kinda worry me in 2024. I have a powerful PC for heavy use but I want a portable machine for emails, web browsing and maybe some light FL Studio. Never used mac too so I'm curious to try to learn the OS. It seems to me that an $850 windows laptop will be much worse than the m1 mac. \n\nMy question is remains, this the best deal for $850?\n\nhttps://preview.redd.it/ifp31j8oki1e1.png?width=1471&format=png&auto=webp&s=05699954c1f2e7a4937d1716e09252d90b3fb3bf\n\n\n\n",
        "created_utc": 1731872042.0,
        "subreddit_name": "mac",
        "comments": 20
    },
    {
        "title": "Performance difference between MacBook Pro M4 pro vs Mac mini M4 pro",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gtfbvj/performance_difference_between_macbook_pro_m4_pro/",
        "content": "I haven't been able to find reviews with relative performance between mac mini and macbook pros using the same chip. I would presume it is very similar given that Apple is touting \"full performance unplugged\" but I am still curious. Anyone aware of such reviews? ",
        "created_utc": 1731855579.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "What surprised you with mini 4 coming from old intel MacBook?",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gteknw/what_surprised_you_with_mini_4_coming_from_old/",
        "content": "Context:\nI use mba  13  inch early 2015 with 4k 28 in acer monitor, Logitech KB via usb receiver and a new pebble mouse via BT.\n\nI can see that I will need USB- C to HDMI adapter and usb c to usb a converters to plug above usb reciver and a powered USB hub.\n\nQ:\nIf you have made a similar switch what did suprise you? Did you  purchase more items? ",
        "created_utc": 1731853285.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Macmini vs Mackbook air when you own a work macbook pro",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gt5z4q/macmini_vs_mackbook_air_when_you_own_a_work/",
        "content": " I am a software developer who has been provided a macbook pro from my company. Recently i have been concerned with privacy and am planning to buy a personal system. I dont really have any crazy requirements in terms of performance but would like to have the option to pull off some heavy workloads (maybe video editing, building code, etc) if i want to in the future. I am into light gaming but have a ps5 for that so not a strong requirement. I am debating between buying a macbook air and a mac mini. \n\nMac mini provides the portability benefit but i would need a display every time i need to use it. While i could use some form of screenshare to use my work mac display to operate the mac mini, it would require providing permissions to my work laptop. I would save some money in this case though!!!\n\nOn the other hand, i could buy a macbook air or pro but i am not very keen on carrying around 2 laptops everytime i travel. \n\nSide note - the reason i am considering the apple ecosystem is since i already am inside their “garden” with an iphone, airpods, ipad, etc. i am open to suggestions though!\n\nThoughts???",
        "created_utc": 1731818935.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "ISO a monitor for a 2020 MacBook Air.",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gtolgq/iso_a_monitor_for_a_2020_macbook_air/",
        "content": "Sorry in advance if this is the wrong place for this question but it seems like the right subreddit. \n\nJust bought an old M1 MacBook Air. It will be 90% used for school (accounting so a lot of Microsoft office and the like nothing crazy) and the other 10% the occasional internet browsing and streaming but I realized after working on dual monitors for so long I can’t really get jiggy with a 13 inch screen. I’d like to add at least one monitor. Ideally two if I can but in looking around it seems like I’m limited to one extra screen.\n\nMy question is what makes a monitor compatible with this MacBook? I’ve looked around and I can only find recommendations for monitors but what I’d like to do is understand what the requirements are and search for options myself.\n\nThank you in advance. ",
        "created_utc": 1731880000.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "magic keyboard with or without Touch ID",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gtjqcr/magic_keyboard_with_or_without_touch_id/",
        "content": "hello everyone\n\nso I wanna get a Magic Keyboard for my desk to replace my Logitech k380 but I'm not sure if the $50 price increase is really worth it since I already have an Apple Watch that unlocks my Mac and does all the Apple Pay thing. I've been reading that Touch ID can be a great QoL improvement but is it really when you add the AW to the equation? thoughts would be appreciated \n\nthanks ",
        "created_utc": 1731867186.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "How does the student discount work?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gtfsch/how_does_the_student_discount_work/",
        "content": "I'm thinking about buying the M4 Mini and was wondering how the student discount works. I noticed they didn’t ask for any proof of student status at checkout, so I’m curious if there are any restrictions or limitations when using the discount. Also, do you get the full version of macOS with the purchase?\n I'm new to Mac so this might be a stupid question. \n\n",
        "created_utc": 1731856841.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Can nano-texture display be found at other retailers?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gteqi9/can_nanotexture_display_be_found_at_other/",
        "content": "I haven’t seen a MacBook Pro model at other retailers (Costco, Amazon, etc.) with the nano-texture display option. Is this only configurable on Apple’s website? ",
        "created_utc": 1731853787.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Mac air 2017 Ram issue",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gtbmzz/mac_air_2017_ram_issue/",
        "content": "Hello. I bought a 2017 Mac in 2019 nov. It has been 5 years now since I got this product. The past two months the after every 1-2 days of regular use, the laptop goes into the red zone on the activity monitor and slows down. From what I've seen online, this is a ram issue. How do I fix this? The chip is soldered into the body of the laptop is what I've found. Would getting an external ssd help? If so, what should I look at when selecting an ssd for this/any reccomendations? I have also come across info about how not all ssd devices are compatible with all laptops. \n\nI can't replace the laptop. I'm open to trying anything else. \n\nIf I keep restarting my laptop everyday to clear up the ram and start a fresh would it help? ",
        "created_utc": 1731843078.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Mac mini M4 + 4K 32 monitor: scaling impact and RAM recommendations?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gta7yq/mac_mini_m4_4k_32_monitor_scaling_impact_and_ram/",
        "content": "I’m planning to connect a 32-inch 4K monitor to a Mac mini with the M4 chip using a Thunderbolt 3 cable. I’ve heard that macOS scaling might use more system resources. Is it true that this would improve performance?\n\nIn this case, would it be worth choosing the model with 24GB of RAM to ensure smooth operation?",
        "created_utc": 1731836860.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "What is with Meta trader 5?",
        "score": 0,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gtn47w/what_is_with_meta_trader_5/",
        "content": "I’ve been doing a ton of research on different prop firms and funded accounts (I’m interested in forex and crypto mostly) and so many of them use Meta trader (I’m primarily interested in the fivers high stakes program). I downloaded the desktop app and the mobile app and I am literally shaken up by the interface. It looks like a fake stock screener from a movie or TV show. Come on. It’s 2024. We gotta have some better technology than this.\n\nAny advice on this issue?",
        "created_utc": 1731876117.0,
        "subreddit_name": "Daytrading",
        "comments": 5
    }
]