[
    {
        "title": "Morgan Stanley names Apple as a \"top pick\" for AI efforts, raises price target from $216 to $273 ($4.2T market cap)",
        "score": 355,
        "url": "https://www.reddit.com/r/stocks/comments/1e3vtow/morgan_stanley_names_apple_as_a_top_pick_for_ai/",
        "content": "(Reuters) -Apple's shares rose 2.5% to a record high on Monday after Morgan Stanley raised its price target on the iPhone maker's shares and designated the stock as a \"top pick,\" citing the company's AI efforts as a boost to device sales.\n\nIn what was seen as a move to catch up with Alphabet's Google and Microsoft-backed OpenAI, the iPad maker last month unveiled Apple Intelligence, luring customers to upgrade their devices to be able to use the new technology.\n\nApple's shares, which have jumped nearly 20% this year, rose to $236.30, giving the company a market value of $3.62 trillion, the highest in the world.\n\n\"Apple Intelligence is a clear catalyst to boost iPhone and iPad shipments,\" Morgan Stanley analysts said.\n\nThe new technology is compatible with only 8% of iPhone and iPad devices and Apple has 1.3 billion units of smartphones currently in use by customers, the analysts said, adding that the company could sell nearly 500 million iPhones over the next two years.\n\nMorgan Stanley, which previously expected Apple to sell between 230 million and 235 million iPhones annually over the next two years, raised its price target on the company's shares to $273 from $216.\n\nThe stock has an average rating of \"buy\" with a median price target of $217, and has outperformed the S&P 500 index this year, according to LSEG data.\n\nIndustry analysts expect Samsung and Apple to lead the charge in global smartphone market recovery this year given the buzz around GenAI-enabled smartphones.\n\nApple sold 45.2 million smartphones globally in the three months ending June, up from 44.5 million a year earlier, but its market share fell to 15.8% from 16.6% in the same period, according to IDC data.",
        "created_utc": 1721052838.0,
        "subreddit_name": "stocks",
        "comments": 133
    },
    {
        "title": "The FBI says it has ‘gained access’ to the Trump rally shooter’s phone / The agency didn’t disclose how it had broken into the phone.",
        "score": 33257,
        "url": "https://www.theverge.com/2024/7/15/24199239/fbi-encryption-phone-trump-shooter-pennsylvania-gained-access",
        "content": "",
        "created_utc": 1721074154.0,
        "subreddit_name": "technology",
        "comments": 4375
    },
    {
        "title": "FBI is working to break into the phone of the Trump rally shooter",
        "score": 18481,
        "url": "https://www.theverge.com/2024/7/15/24198946/fbi-encryption-phone-trump-attempted-assassination-shooter",
        "content": "",
        "created_utc": 1721066059.0,
        "subreddit_name": "technology",
        "comments": 2846
    },
    {
        "title": "Apple introduces HomePod mini in midnight",
        "score": 1139,
        "url": "https://www.apple.com/newsroom/2024/07/apple-introduces-homepod-mini-in-midnight/",
        "content": "",
        "created_utc": 1721048690.0,
        "subreddit_name": "apple",
        "comments": 280
    },
    {
        "title": "Trade Update AAPL 7/19 $235 calls  8:07am July 15",
        "score": 10,
        "url": "https://i.redd.it/9rt4ezup7pcd1.jpeg",
        "content": "Selling all options positions for a profit!!",
        "created_utc": 1721056206.0,
        "subreddit_name": "AAPL",
        "comments": 14
    },
    {
        "title": "Apple was good to us all.",
        "score": 4,
        "url": "https://i.redd.it/0gpc0iwyfpcd1.jpeg",
        "content": "Exited my Apple position this morning. No one could’ve predicted the events this weekend. Nor could they have predicted the huge pump Monday morning. I started feeling euphoric and decided to exit the position with my gains. I got in at .98 on Thursday last week. \n\nS/o to this sub for all the alpha. ",
        "created_utc": 1721058982.0,
        "subreddit_name": "AAPL",
        "comments": 3
    }
]