[
    {
        "title": "Parted with TSLA this week after holding for 5 years. Here's why.",
        "score": 1966,
        "url": "https://www.reddit.com/r/stocks/comments/ztzzhp/parted_with_tsla_this_week_after_holding_for_5/",
        "content": "Been a TSLA investor since 2017. This week I made the decision to pull out of the company (over 1,500 shares). After being up 800%+ at one point, I left after it came crashing back down to ~180%. I did not incur a loss, I am just not walking away with retirement levels of money that I could have possibly walked away with a mere year ago. Dumb? Maybe. Did I need to sell? No. Does it give me peace? Absolutely.\n\nBeing a TSLA investor was interesting. Elon has always been Elon and I believe the company is indeed positioned for long-term growth (even now). There were plenty of ups and downs, but I never 'doubted my vibe' and the Elon antics up until the latter half of 2022 I would have described almost as eccentric. The guy was an idiot from time to time, but was definitely doing something right. Tesla is competitive, innovative, and is a leader in the EV space. Long-term, the company has a ton of upward potential. Emphasis on the word 'potential.' \n\nHowever, there has been a change. Things with Elon have certainly become more radical and it seems that every single day there is a new headline that is slowly destroying the brand. Now, before we get into the whole \"but Elon isn't Tesla!\" let me tell you the incredible importance of consumer sentiment and branding. \n\nI do not imagine Tesla ever being divorced from Elon Musk. When you think \"Tesla\" you cannot escape thinking \"Elon Musk.\" It is like trying to think about Microsoft without thinking or mentioning Bill Gates or some other strong brand-to-noun association. Go ahead and do yourself a favor and search Tesla now and see what comes up. Headline after headline is about Musk. This is not good for the brand, especially considering their consumer segment is actively being isolated. \n\nNow, one must ask: why do people buy things? There's a wide array of reasons, but I believe fundamentally it boils down to the value and reputation of the product. The value has a mix of factors that range from price, functionality, importance, etc. and reputation can be understood as how the brand is perceived, how the consumer is perceived as a result of owning the product, and how the consumer feels owning the product. This is where I lose the belief in the growth potential despite the positioning. Simply put, I do not think consumers are going to feel good about buying a Tesla with the negativity surrounding Elon. \n\nA mere year ago, if a person bought a Tesla or owned a Tesla, what would this say about a person? How would that person feel about that purchase? Tesla was the cool, sophisticated brand that was essentially symbolic of changing the world. Just look at Tesla's mission statement: \"Tesla's mission is to accelerate the world's transition to sustainable energy through increasingly affordable electric vehicles in addition to renewable energy generation and storage. Tesla is accelerating the world's transition to sustainable energy.\" \n\nWhere is this brand now? How would a person feel now? Ask yourself, if someone pulled up in a Tesla what would you think about them? What feelings would it invoke?\n\nOften times, we want to distance ourselves from feelings and sentiment and put an enormous emphasis on reason, facts, and data. This is not necessarily wrong, but this is certainly also not unique to the financial realm and TSLA has a history of this as well. We had people putting in orders for vehicles that were not being produced, people YOLOing their life savings into the stock because they believed in the future growth of the company before the company was seriously competitive, an unprecedented cult-like following that boosted the stock and gave the company an incredible amount of capital, and so on. Yet, when we look at TSLA now and think about the projected growth, why think people will actually want to continue to buy this product? Who is going to spend the money of a luxury vehicle to suddenly be associated with a person that people are increasingly viewing in a negative way? Not me. Apparently not my friends or co-workers either who were previously considering a Tesla and now want nothing to do with it. And apparently not my friend who is a Tesla owner and is starting to feel embarrassed for driving one. We can talk about how \"dumb\" these people are, but we cannot escape these are legitimate and valid sentiments toward the brand that have real costs associated with them.  \n\nThe sentiment cannot be captured in a graph right now. You have no data points on the would-be consumers because they are now never-were consumers. This data is only going to show in their sales. If sales continue to go up, then it seems reasonable to say that consumer sentiment has not reached a level where people feel so negatively about the product that they stopped buying. What I am suggesting here is that it my belief that this will inevitably happen because of the intimate link between Tesla and Elon. Tesla could get a new CEO, change leadership, etc., but I do not see them escaping this link and I believe it will ultimately be the detriment to the brand. Sales will not completely stop, but the growth projections that the stock relied heavily on I believe will certainly slow a lot sooner than shareholders anticipated and if it ever does reach previous target prices of $250+, this will not be for a long time. \n\nI'm not bullish or bearish on the stock. I do not think the company is going to suddenly vanish and the stock will drop to <$50 (at least I hope not for many of the investors I know). However, I also do not think the growth will be as aggressive as it once could have been and this is going to limit the stock in many ways. If we factor in slowed growth from the recession, one must keep in mind that this is just more time for Elon to further damage the brand between now and when people are in better buying conditions. What's next? Apparently removing Twitter's suicide prevention feature. Maybe tomorrow it's denying climate change and next month will be another stock sell off after yet another promise of not doing so. Though, ultimately, this is no longer my problem. The integrity of my financial future is no longer jeopardized by a guy that is becoming increasingly unhinged without the board properly exercising their duty to act in the interest of shareholders.\n\nMy thoughts on being a TSLA investor is what my mother used to say: it's been real, it's been fun, but it hasn't been real fun.",
        "created_utc": 1671850615.0,
        "subreddit_name": "stocks",
        "comments": 381
    }
]