[
    {
        "title": "Amazon plans to launch discount store in bid to fend off Temu and Shein ",
        "score": 333,
        "url": "https://www.reddit.com/r/stocks/comments/1dpf11z/amazon_plans_to_launch_discount_store_in_bid_to/",
        "content": "Amazon plans to launch a new section on its site dedicated to low-priced fashion and lifestyle items that will allow Chinese sellers to ship directly to U.S. consumers, CNBC has learned.\n\nThe storefront, announced at an invite-only conference for Chinese sellers on Wednesday, would mark Amazon’s most aggressive attempt yet to fend off growing competition from e-commerce upstarts Temu and Shein, which both have ties to China, the world’s second-largest economy.\n\nTemu and Shein have expanded their presence in the U.S. in recent years, luring an increasing share of American shoppers with their rock-bottom prices on clothing, electronics, home goods and other products.\n\nAmazon’s storefront will feature a range of unbranded items, many priced under $20, according to a presentation to Amazon sellers viewed by CNBC. A mock-up of the storefront showed a gua sha facial massaging tool, arm weights and phone cases, among other items for sale.\n\nAmazon will ship the products directly from China to the U.S., with the goal of delivering them to shoppers within nine to 11 days, the presentation shows. In the past, Amazon sellers in China have relied on the company’s fulfillment services, called Fulfillment by Amazon, to send goods to warehouses in the U.S. before they are dispatched to customers.\n\nThe company pitched the arrangement as cost savings for Amazon sellers in China, and said merchants would be able to test new items through small-batch production. Shein uses a similar model, referred to as on-demand manufacturing, producing a limited quantity of goods and manufacturing more as demand increases.\n\nIn a statement to CNBC, Amazon spokesperson Maria Boschetti said, “We are always exploring new ways to work with our selling partners to delight our customers with more selection, lower prices, and greater convenience.”\n\nBoschetti declined to comment further on the company’s plans, which were first reported by The Information. It is unclear when Amazon intends to debut the storefront, but the presentation notes it will start accepting products this fall.\n\nChina-based merchants have made up a sizable contingent of Amazon’s marketplace for many years, but the company is making a renewed push to court sellers there as it faces growing competition. In December, Amazon announced a new “innovation center” in Shenzhen, a popular technology and manufacturing hub, and it also slashed the fees it charges merchants selling clothing priced below $20.\n\nAmazon said in 2023 the number of items sold by Chinese sellers on its site grew more than 20% year over year, while the number of Chinese merchants with sales upward of $10 million increased 30%.\n\nSource: https://www.cnbc.com/2024/06/26/amazon-plans-discount-store-in-bid-to-fend-off-temu-and-shein.html",
        "created_utc": 1719450964.0,
        "subreddit_name": "stocks",
        "comments": 84
    }
]