[
    {
        "title": "Apple calls 128GB 'lots of storage' in new iPhone 15 ad",
        "score": 3209,
        "url": "https://appleinsider.com/articles/24/03/18/apple-calls-128gb-lots-of-storage-in-new-iphone-15-ad",
        "content": "",
        "created_utc": 1710845383.0,
        "subreddit_name": "apple",
        "comments": 892
    },
    {
        "title": "Details of Apple's $490M Settlement Over Tim Cook's Comments On China Sales",
        "score": 5,
        "url": "https://11thestate.com/cases/apple-investor-settlement",
        "content": "",
        "created_utc": 1710879067.0,
        "subreddit_name": "AAPL",
        "comments": 8
    },
    {
        "title": "Apple (NASDAQ: $AAPL) Pays $490M Settlement as Potential Impact of TikTok Ban Looms – Stock Slides 7%+ YTD",
        "score": 0,
        "url": "https://dexwirenews.com/apple-nasdaq-aapl-pays-490m-settlement-as-potential-impact-of-tiktok-ban-looms-stock-slides-7-ytd/",
        "content": "",
        "created_utc": 1710810189.0,
        "subreddit_name": "AAPL",
        "comments": 2
    },
    {
        "title": "DD: I DD'd the nvidia run up last year ($250->$700) and was right. Now I have a new prediction",
        "score": 3663,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1biqt1k/dd_i_ddd_the_nvidia_run_up_last_year_250700_and/",
        "content": "Here's my nvidia DD from last year (NVDA was $250 and I predicted $700 within a year): [https://www.reddit.com/r/wallstreetbets/comments/13lb98n/dd\\_nvda\\_to\\_700\\_by\\_this\\_time\\_next\\_year/](https://www.reddit.com/r/wallstreetbets/comments/13lb98n/dd_nvda_to_700_by_this_time_next_year/)\n\nLast week I timed the exit on my BTC and QQQ holdings fairly well. **Now I'm setting my sights on a new horizon: AMD**\n\nAMD is sort of like the nice ugly step sister of hot bae nvidia. Everyone \"likes\" her, but she doesn't get invited to parties and no one takes her seriously. Right now reminds me of Ryzen 1. When AMD was $12, I predicted AMD's stock price would triple in the next two years due to how well the architecture fit with datacenter needs. I posted my DD here and was right. It took most people by surprise because at the time Intel had 99% of the datacenter CPU market. Now we look at $180+ AMD price. I think we are once again going to be surprised by su bae and co.\n\nI'll get to my evidence that AMD will exceed expectations yet again, but first I want to address some obvious points of skepticism.\n\n1. **Firstly AMD's seemingly absurd P/E ratio of 364:** I'm going to show that not only is AMD's revenue going to go up by an absurd amount in the next year, but also its net income margin. Nvidia operates at around 50% income right now and AMD is operating at around 20% right now. That gap is going to close considerably in the next year. I'm estimating AMD will reach around 35-40% net income. On top of that AMD will grow revenue by 50% in the next year (wishful thinking would say as high as 70% more revenue) exclusively due to AI accelerators. This will all lead to considerably more realistic P/E ratio.\n2. **Next Nvidia's control on the market:** The evidence points to this being a detriment to Nvidia. AI companies are looking to diversify from Nvidia because they don't want to be vendor-locked, Nvidia has a 1 year back order on its top AI accelerators, and Nvidia's massive profit margin makes it easy to undercut their price. Furthermore, CUDA dominance is highly exaggerated today. I use this stuff every day, and ROCm is absolutely production ready, especially for large companies who have the staff to optimize for it. The people who say ROCm sucks haven't used it in a while -- AMD is working on it at a break neck pace.\n\n# Now on to my DD\n\nThe debate about AMD's price largely boils down to its newest AI accelerator's value (the MI300X) versus Nvidia's current AI accelerator (the H100). AI accelerators are now most of the accelerator market (including GPUs), and also have the highest profit margins by far, so they are basically 80% of the valuation on these companies' stock prices. Yes the H200 and the new GB200 are coming out soon for Nvidia, but the MI300X has a timing lead on them which enables it to get some foothold. So for the moment, its MI300X vs H100 for companies deciding what to buy.\n\n**Accelerator Value:** Reviews for the MI300X are going to come out imminently (within a few weeks), and we will begin seeing hard evidence for its value proposition then. I have spent a lot of time on older AMD cards analyzing their performance versus big green. My findings are that generally AMD is capable of being as fast or faster than Nvidia, but most open source projects are optimized better for Nvidia so in the real world AMD has a performance disadvantage. However in the case of the MI300X, its raw performance is so large over an H100, it will likely produce slightly better real world performance. Also the MI300X is selling for around $25k per card (you can buy it right now [https://www.thinkmate.com/system/a+-server-8125gs-tnmr2](https://www.thinkmate.com/system/a+-server-8125gs-tnmr2)) where the H100 is around $40k, so companies will be looking at benchmarks in a couple weeks that point to the MI300X being slightly faster and considerably less expensive.\n\n**Nvidia supply constraint:** Nvidia has a back order of around a year for their latest AI accelerators. This means if a company needs to immediately purchase accelerators for a new project, they simply can't from Nvidia at scale. AMD's order books are currently open, but probably filling fast for this reason.\n\n**Announced customers:** Meta is going to be the largest customer for the MI300X. They have indirectly announced that they will purchase up to almost half of their 600k accelerators this year from AMD ([https://www.theregister.com/2024/02/02/meta\\_ai\\_chips/](https://www.theregister.com/2024/02/02/meta_ai_chips/)). This customer alone will add 25% to AMD's revenue and improve their profit margin from 20% to roughly 28%. MS has already started deploying the MI300X on Azure and Oracle has announced they will launch VMs with them, but neither has announced numbers. Who won't be using AMD? OpenAI has a multi-year contract with nvidia, and Google uses their own proprietary TPU.\n\n**AI accelerator headwind:** The AI accelerator market is expected to have a CAGR of over 20% for the next 5+ years. This means there will be continued supply constraints that incentivize diversifying hardware. New players inherently have an advantage because of this. It just happens that AMD is the next new player to be mature and scaled enough for widespread adoption. Yes Intel and startups will probably do fine also, but AMD is seeing ridiculous growth at this very moment that hasn't appeared on their earnings report yet (fulfillment for the MI300X did not ramp up until roughly January). There is such a ridiculous amount of demand in this ai accelerator market that everyone in it will grow.\n\n# My price target: $450 AMD\n\nAfter doing some napkin math on the market, I think it is reasonable for AMD to acquire 15-20% of the AI accelerator market by the end of the year, up from an inconsequential market share before. This includes speculation about AMD's product competitiveness, their ability to scale, the customers that will be interested in buying AMD, market growth, and new Nvidia product launches. Extrapolating that marketshare into net income by using a rough margin per card and using Nvidia's P/E ratio as a baseline model, translates to an AMD fair stock price of around $450 by the end of the year.\n\nAMD's price will start to go up after the MI300X reviews come out and rumors of their customer acquisitions come in. The May earnings report will be where it starts to appear on their books, but they are still ramping up right now and Q2 is where we will see the largest earnings growth.\n\n**My positions are: $190 6/21C and $200 10/18C**\n\nThat's all. See you later this year.",
        "created_utc": 1710871480.0,
        "subreddit_name": "wallstreetbets",
        "comments": 754
    }
]