[
    {
        "title": "The Long and Winding Road to Profitability in Day Trading - or, How to Day Trade from Beginning to End",
        "score": 269,
        "url": "https://www.reddit.com/r/Daytrading/comments/mxcyh0/the_long_and_winding_road_to_profitability_in_day/",
        "content": "Bored on a Friday night - wanted to share some ideas.\n\nWhat is the path to profitability as a trader?\n\n1. A goal. Ambition is okay. The path to reaching that goal is in small increments. Financial freedom? Technical interest? Extra income? A better understanding of the thing called the stock market?\n2. Dip your toes in research. Find out what sounds interesting to you. It probably won’t be what eventually becomes your profitable strategy or security, but it’s important to try and start somewhere.\n3. When we say try, try ON PAPER. Google paper trading. Figure yourself out. Get your bearings. Download ThinkorSwim. Start trading. Its okay if you don’t know what’s going on. Log in to ToS’ papertrading at 9:30, choose a stock, and click buy and try to sell it at a higher price. Nothing else will get that one of a kind feeling in your head easier.\n4. Now that you have a taste of the stock market, research research research. That security or trading strategy you’re interested in — dive into it more. Is it small cap pennystocks? Sure. Dive into the resources. Watch videos, read reddit posts, look up strategies on Investopedia. Learn about indicators, order types, brokerages, basic strategies, chart patterns, etc. Suck it all up. Most will inevitably NOT contribute to your eventual strategy, but they will all start to form a web of information that you will rely on to evaluate that one profitable strategy that you will find.\n5. Hopefully you have an subset area of the stock market that you think you will make money on. If not, choose something like blue chips, low float pennies, or futures. Everything can be scalped. Everything can be profitable. A great strategy works for every security, with slight variations. But if you find a strategy that literally only works for one stock, best double down on that stock and study it like mad. It only takes one profitable, successful strategy on one security to make money.\n6. You should still be papertrading. Papertrade every day at open from 9:30–10am and if you have time, from 3–4pm. The longer you watch each candlestick form, the better you will intuitively know the way the chart acts. Try to understand what is going on. What is causing the moves to happen? How can we understand the past movements, and how can we determine where the price might go based on these past movements? Nothing beats practice, even if you don’t know what you’re doing. Just try to buy low and sell high. If you have a basic strategy, try implementing this in your daily trading. For example, if you think that bounces off of the 9 ema on a strong uptrend day are a good place to go long, try doing EXACTLY this for a few days. Don’t break your rules. Choose an appropriate amount to buy and sell, and just try to implement your strategy. Eventually you will see what’s going right and wrong. Maybe you are making (paper) money off of it, but when you lose, you end up holding it for far too long. This is where you might research and find out about stop losses. If you’re always holding too long into the green and letting winners turn into losers, you might look into more profit and loss management strategies like take profit limits and trailing stops.\n7. Every day, make a mental or physical note about the trades you made. What went right, and what went wrong? Did you profit or loss? Did you follow your trading rules?\n8. Is the basic strategy you found not working? Try finding some other strategies online. Any strategy you find online will probably not work for you immediately. But do not think that they can’t be refined into a winning strategy. It’s just your role to learn the various strategies out there, and crafting a combination of the techniques you have learned with many, many tweaks and revisions until you find something that approaches breakeven, or even profitability. From there, more revision. Find out where you’re making the most money and losing the most. You’d be surprised. Maybe you’re taking profit too early. Maybe you’re selling too soon without letting the price breathe. Experiment with real paper trading practice. Nothing is better than live trading.\n9. After a long time of research, revisions, asking questions and finding answers, losing (paper) money, gaining (paper) money, you might have a strategy that is making money most of the time, and you have found a way to manage the trades so that you think you are making the most money you can and losing the least you can. Try to double your sim account with this strategy. Go from 10k to 20k in paper money.\n10. Now you might take this strategy live. Open up a brokerage account. Deposit $100 to $1000. Convert to a cash account unless you have $25,000. You can’t day trade more than 3 times a week unless you have a cash account or twenty five thousand dollars. Even if you do, you really probably shouldn’t put that in right now. Just wait.\n11. Do exactly the same thing you have been doing in your paper account, but with very small amounts of money or shares. Heck, trade with 1 share. It’s lame, but you’ll feel more alive than you ever did trading 5,000 shares of AAPL at a time in your paper account. The way you’ll feel when you’re 1 cent in the green or red is impossible to emulate unless you’re trading real money.\n12. Keep doing this until you’ve doubled your real money or lost 25% of it. If you’re losing money, go back to paper and keep researching and refining. You can be the judge of your strategy and if it’s worth refining, or if you’re better off just figuring out a new one.\n13. Stop taking risks you don’t need to take. The most important point to remember in the path to profitability is not to make money, but to keep your existing money. After a long and steady period of growth and success in your strategy, you can increase the amount of money you are trading with, but you should really view it this way: the more money you trade with, the lower your risk should be. A standard parameter of risk management is the % risk per trade. How much % of your account are you risking with each trade? You need to know the $ amount every time - always know your take profit and stop loss levels before you enter a trade. Risk no more than 2% of your current account equity per trade - follow this and you will survive the inevitable strings of losses that come even with the most profitable strategies.\n14. Celebrate your small wins. They seriously will add up with time and consistency. Do not take on too much risk. Do not deviate from your trading plan without testing in paper. As much as you want to chase huge gains, you don’t want to mourn the loss of your consistent gains with a huge loss when you took a risk far too large for your account.\n15. At a profitable, high success rate, this is where you scale. Figure out the salary you want, and have that goal in mind. Figure out what you will have to do to reach it, in increments. If you want to make $100,000 a year, you have to make about $400 a day for 250 trading days.\n16. You might stay very consistent with your gains, success rate, and refinement process, and yet one day the strategy stops working. Use the judgement you have then to understand if it truly has stopped being a viable strategy, and if so, use your web of information to develop a new one. New does not mean completely different. Sometimes a small variation in the entry or exit conditions or the indicator parameters can fix a losing strategy.\n17. Continue to scale until you have reached the upper calculated limit of your strategy. This is the point after which the strategy no longer plays out, for example due to liquidity.\n18. If you’ve reached this point, congratulations! Continue to trade the strategy, and find more complementary strategies if you want to make more money. Keep up the good work.",
        "created_utc": 1619240051.0,
        "subreddit_name": "Daytrading",
        "comments": 41
    },
    {
        "title": "New iMac doesn't have an apple logo on the front?!?!",
        "score": 0,
        "url": "https://www.reddit.com/r/AAPL/comments/mxc60h/new_imac_doesnt_have_an_apple_logo_on_the_front/",
        "content": "Whose dumb idea was this?  No logo on the front of my desk top?  Might as well have some cheap desktop from Wal Mart.  I want my Mac to have the apple logo for the world to see!!  They put the logo on the back side? Why?!!!",
        "created_utc": 1619236584.0,
        "subreddit_name": "AAPL",
        "comments": 8
    }
]