[
    {
        "title": "If someone finishes their DD with ‘this could be the next GME’, I am instantly put off.",
        "score": 12550,
        "url": "https://www.reddit.com/r/stocks/comments/lww0h7/if_someone_finishes_their_dd_with_this_could_be/",
        "content": "This meme stock explosion has made me even more tight and Scrooge-like with my money. I have most of money sitting in blue chip stocks like DIS & HSBC amongst many others with a small amount for playing, doing my own DD on and hoping for a 3x but settling for a small profit or loss in most cases. \n\nI love reading other people’s DD, always have, and it’s great to have a community that helps you cut down a bit of the work (even though you must follow up with your own reading) in potentially spotting something that could be big. However, there has been a massive spike recently of people that finish they DD with ‘this could be the next GME’ or something similar and as soon as I read that, I am instantly put off. \n\nEverything they have said up to that point gets a little tainted for me. \n\nI know this is completely irrational and actually a bit stupid on my part but I equate it to a restaurant that has ‘The Best (insert food item)‘ or ‘World Famous blah blah’ on their menu. It puts me off instantly. \n\nAnyone else feel like this? Or am I just being snooty?",
        "created_utc": 1614784042.0,
        "subreddit_name": "stocks",
        "comments": 809
    },
    {
        "title": "Apple confirms it does not hold your Apple ID hostage due to missed Apple Card payment",
        "score": 4462,
        "url": "https://9to5mac.com/2021/03/03/apple-card-apple-id-unrelated/",
        "content": "",
        "created_utc": 1614806418.0,
        "subreddit_name": "apple",
        "comments": 193
    },
    {
        "title": "Morning Update for Wednesday, 03/03/21",
        "score": 397,
        "url": "https://www.reddit.com/r/Daytrading/comments/lwue2t/morning_update_for_wednesday_030321/",
        "content": "Good morning everyone, it’s hump day!\n\n*These lists are geared towards day trading. With the small cap stocks especially, I am typically in and out very quickly, only occasionally longer than 5 minutes, usually faster scalps.* I am also constantly watching the candlestick charts and observing price action and volume, and you should be doing the same if you want to trade these stocks. Always have a plan when you enter a trade (for profit taking and for taking a loss), and use proper risk management.\n\n**Main Watchlist (*****over $10*****)**\n\n* Gapping UP: MARA, RIOT, CAN, KMPH, OCGN, HZON, UWMC, XL, DKNG, SPCE\n* Gapping DOWN: RKT, SSYS, FUBO, AFRM, CDLX\n\n**Small Cap Watchlist (*****under $10*****)**\n\n1. OVID: Leading gapper after another company purchased the rights to their epilepsy treatment. Seeing strong volume in premarket, but price action is currently getting a bit stale. Don't chase trades, make sure you have a reason and a plan for every trade you enter. \n2. TRXC: Gapping up on FDA approval of their Senhance surgical system. Seeing strong volume and price action at the moment in premarket. Possible support around 5.00. \n3. SLGG: Gapping up on price target upgrade. Seeing decent volume in premarket, but price action is currently looking a bit choppy. \n4. MFGP: Gapping up on news of a deal with Amazon Web Services. Seeing decent volume, but price action is currently showing weakness. \n5. TXMD: Gapping up after reporting earnings, as well as another minor news catalyst. Seeing good volume and price action in premarket. Possible premarket resistance around 1.83. \n6. SOS: Gapping up on momentum with other crypto-related stocks. Seeing decent volume and price action in premarket, with possible premarket resistance around 7.96. \n\nLooking like a mixed open for stocks today. SPY is currently sitting at around 386. We could see a bounce with some upwards momentum, but it's not looking great at the moment and we could see another red day. If we do see red, I'll be watching UVXY and SPXS to take advantage of that. Hopefully that isn't needed and we see a strong day in the market. Bitcoin is seeing a bit of a revival and is currently at over 51,500. Bitcoin-related stocks are up in premarket as well, and I'll be watching them closely throughout the day. Marijuana stocks were looking good in premarket, but are selling off a bit at the moment. Gold and silver also down at the moment. Some SPAC's are getting increased attention once again, so I'll be keeping an eye on some SPAC's I've been following. Stay disciplined in your trading, and I hope it's a good day. \n\nRemember to use proper risk management, make sure you size appropriately for your account, and have a plan for every trade you enter. Happy trading everyone :)",
        "created_utc": 1614779626.0,
        "subreddit_name": "Daytrading",
        "comments": 56
    },
    {
        "title": "$AAPL",
        "score": 23,
        "url": "https://www.reddit.com/r/AAPL/comments/lwuycs/aapl/",
        "content": "Vote for it when you get $1,400 from the fed\n\n1. Buy iPhone 12\n2. Buy MacBook \n3. 10 shares of AAPL\n\nLet’s share to your friends",
        "created_utc": 1614781169.0,
        "subreddit_name": "AAPL",
        "comments": 13
    },
    {
        "title": "counter strike strategy against price-pin from big players/hedge funds on $AAPL that fck up your Options plays.",
        "score": 9,
        "url": "https://www.reddit.com/r/AAPL/comments/lwia6x/counter_strike_strategy_against_pricepin_from_big/",
        "content": "IMO\n\nThis isn't 2020 where Options plays were so easy that middle school kids can be profitable month after month, too!\n\nYou already have seen price-pin move played out on last Friday Feb/26th.\n\nThe most effective counter strike strategy against price-pin is **buy shares and not Options** for a **more \"consistent\" profit$** forever as long as the company have strong fundamental that keep beating earnings and you buy low, smartly accumulating shares, sell high later or continue building up your shares. You can play Options Wheel, but I do not recommend it over build long shares with AAPL. And **time is your best friend** with this strategy while it's killing big players or any hedge funds pinning $AAPL price at lower prices!\n\nThere is a flaw in price pinning strategy on stock like $AAPL. At this low price range, Big Players/Hedge Funds have to short or willing to sell their shares at a low price or do both to pin the price at a certain range. When price pinning happened, **they let time kills Options players** with weekly expiration date. However, **there's limit to how long and how low they can keep $AAPL down.** They fear Apple buybacks power and bigger investor like Warren Buffett stepping in stealing their shares at the low price they have sold out or getting big losses on their shorting $AAPL. Thus this is the perfect time for Retail Players to strike, buying and accumulating shares during big players price pinning strategy. When they cover their shorts or buy back share combining with retail players accumulating shares, the price will shoot up quickly. When they repeat their price pin strategy, Retail Players counter strike it by buying their share for cheap and holding it without time limit. As this continue it creates a higher-low reversal pattern from the bottom in favor of those players that have been accumulating shares at the lows or bottoms. **Don't ever do bottom ticking to go all in!** Buy low, smartly accumulate shares, sell high later if you wanted! That is how you stay consistently profitable with $AAPL.\n\nGoes trade other high-flying stock like TSLA, AMZN, etc. Take the profits and build up long shares in high value growth stock like $AAPL.\n\n**Unless $AAPL fundamentals are changing for the worst, keeps on buying at these low range!**\n\nBuy Range: $127 - $137. Anything under $126 is a gift from APPL, given their previous Earning beat!",
        "created_utc": 1614736307.0,
        "subreddit_name": "AAPL",
        "comments": 6
    },
    {
        "title": "I bought 100 shares at almost ATH",
        "score": 5,
        "url": "https://www.reddit.com/r/AAPL/comments/lx54lw/i_bought_100_shares_at_almost_ath/",
        "content": "So I bought 100 shares of AAPL before earnings at $142.00. My question is should I sell a portion for a loss and rebuy to average down or let it ride? Being that this is an AAPL sub, Im pretty sure of the answer. However, in general does this EVER make sense? Thanks In advance.",
        "created_utc": 1614807745.0,
        "subreddit_name": "AAPL",
        "comments": 17
    },
    {
        "title": "What is going on with AAPL again?",
        "score": 2,
        "url": "https://www.reddit.com/r/AAPL/comments/lx1pdj/what_is_going_on_with_aapl_again/",
        "content": "Every move down has an explanation! Bonds yield are up today, GME fiasco, short sellers, expiring calls, Buffet sold, wait a min, Buffet benefitted... is AAPL done? Never to see a good day again? Are we done!",
        "created_utc": 1614798443.0,
        "subreddit_name": "AAPL",
        "comments": 15
    }
]