[
    {
        "title": "Meta employees are looking to leave jobs as their stock based compensation has plummeted more than 40 per cent over the past six months",
        "score": 4675,
        "url": "https://www.reddit.com/r/stocks/comments/tjc3ns/meta_employees_are_looking_to_leave_jobs_as_their/",
        "content": "Shares of Facebook and Instagram parent Meta have plummeted more than 40 per cent over the past six months – and some employees saddled with underwater stock options are eyeing the exits. “Joined Meta near [all time stock high], now feeling like shit,” one Meta employee said this week in a popular thread on Blind, a corporate message board with verified members. “What should I do?” “Leave this crap place,” another “Metamate” responded, according to the New York Post. “Same boat,” a third said, adding that they’re “already interviewing” at other companies. “Duh, you’re supposed to think Meta, Metamates, and me. Ask yourself if this train of thought is good for the company,” a fourth joked. “Just kidding … it super sucks.”\n\nMeta is facing a worker stampede as its stock price has fallen from an all-time high of more than $US380 ($A512) in September to $US216.49 ($A292) at the time of writing. The slide started last year as a damning series of leaks put massive political pressure on the company and kicked into overdrive as Meta started to feel the multibillion-dollar sting of privacy changes from Apple and Google that are pummelling its advertising business. “People are definitely paying attention and are concerned about the stock price,” Michael Solomon, who manages software engineers through his talent firm 10x Management, told The Post. “I think a lot of people have questions about if Meta is going to get out of this – if this could be the beginning of the end for them.” When software engineers join companies like Meta, Google or Amazon, their compensation typically consists of a roughly 50/50 mix of cash and stock options, with entry-level employees getting more cash and more experienced workers getting more stock, according to data from tech salary tracker levels.fyi. At Meta, new hires are typically given a set number of restricted stock units based on the company’s average stock price around the time they were hired. That means there can be huge upsides for employees who join before a company’s stock rockets – but it also leaves them vulnerable to downturns.\n\nFor example, a Meta employee who was given $US100,000 ($A134,000) worth of restricted stock units around the company’s September stock peak would now be left with roughly $US57,000 ($A76,000). It also means that opportunists from other companies – such as Microsoft, which is down 10.3 per cent so far this year – can theoretically “buy the dip” by taking a job at a beaten-down company like Meta, getting more stock options at a lower price. In response to a disgruntled “Metamate’s” post on Blind, one Microsoft employee wrote: “The only people would be doing well are those who are currently transferring companies right now. I’m doing exactly that and headed to Meta.” Laura Martin, a tech and media analyst with Needham & Company, said that while many tech workers may feel loyal to their companies, it makes financial sense for many to switch jobs when the value of their options tanks. “If you’re not going to be making any money in your equity options for three years, it is in your interest to leave,” Ms Martin told The Post. “I agree with the decision to leave your current firm and go to a company and get stock at their current price.”\n\nhttps://www.news.com.au/finance/work/at-work/meta-employees-look-to-ditch-jobs-amid-stock-crash-feeling-like-sht/news-story/b8123ee29fd8adee016f6866fa5c82a7",
        "created_utc": 1647870103.0,
        "subreddit_name": "stocks",
        "comments": 439
    }
]