[
    {
        "title": "Tesla faces a $7.5 billion ultimatum: Open up its charging network to rivals or be locked out...",
        "score": 5833,
        "url": "https://www.reddit.com/r/stocks/comments/1117dd2/tesla_faces_a_75_billion_ultimatum_open_up_its/",
        "content": "[Full Article](https://www.msn.com/en-us/autos/news/tesla-faces-a-7-5-billion-ultimatum-open-up-its-charging-network-to-rivals-or-be-locked-out-of-biden-s-ev-subsidies-report-says/ar-AA17qumN?cvid=ba9b99dea7ee4da08fe347d443676af9)\n\n New US requirements will put Tesla under pressure to open up its EV charging network to rivals, per Reuters.\n\n* If it doesn't, it could miss out on getting in on the $7.5 billion in charger subsidies planned by Biden.\n* Tesla's 40,000+ EV chargers can only be used by its cars, but officials told Reuters that could change.\n\n \n\nTesla could find itself locked out of $7.5 billion in Biden administration subsidies if it fails to open its EV charging network up to competitors, according to a Reuters report.\n\nThe automaker's SuperCharger network has more stations in the US than any other charging company, but they can connnect only to plugs used by Tesla cars.\n\n \"We do understand that Tesla is looking to tweak their system to be more open access. So, if they do reach that point and meet those eligibility requirements, they certainly will be eligible for funding,\" Stuart Anderson, head of Iowa's transportation development division, told Reuters.\n\nTesla has already had a boost from the Biden administration's EV push in February, when the DOT tweaked its $7,500 tax credit consumer incentive plan to include more eligible models by expanding the definition of an SUV. That increased the potential demand for some of Tesla's models. \n\nTesla CEO Elon Musk met with two White House officials last month to discuss ramping up EV production and the Bipartisan Infrastructure Law, which includes the legislation on charging equipment.\n\nMusk has spoken in the past about opening up the Supercharger network, but hasn't moved publicly to let others in. Tesla is dominant in chargers in the US, and it has a huge private network of more than 40,000 EV chargers globally.",
        "created_utc": 1676292293.0,
        "subreddit_name": "stocks",
        "comments": 938
    }
]