[
    {
        "title": "Elon Musk tells Twitter staff he sold Tesla stock to save the social network",
        "score": 3037,
        "url": "https://www.reddit.com/r/stocks/comments/yrzodf/elon_musk_tells_twitter_staff_he_sold_tesla_stock/",
        "content": " \n\nTwitter's new owner Elon Musk, who is also CEO of electric vehicle maker [Tesla](https://www.cnbc.com/quotes/TSLA/) and U.S. defense contractor SpaceX, told employees of the social media business on Thursday that he recently sold shares of Tesla to \"save Twitter.\"\n\nHe made the remarks during an all-hands meeting that he hosted in part to motivate Twitter employees who remain after sweeping layoffs to work hard. Musk let go of about half of Twitter employees following his acquisition of the company for $44 billion, or $54.20 per share.\n\n[As CNBC previously reported,](https://www.cnbc.com/elon-musk/) to finance his portion of that take-private deal, last week Musk sold at least another $3.95 billion worth of [Tesla](https://www.cnbc.com/quotes/TSLA/) stock. According to filings with the Securities and Exchange Commission published Tuesday, the batch of shares he just sold amounted to 19.5 million more shares of Tesla.\n\nEarlier this year, he also sold over $8 billion worth of Tesla stock in April and roughly $7 billion worth in August.\n\nMusk has [brought in employees from Tesla](https://www.cnbc.com/2022/10/31/elon-musk-has-pulled-more-than-50-tesla-engineers-into-twitter.html), including dozens of Autopilot engineers, to help with code review and other work at Twitter along with friends, financial backers and deputies from other companies that he has co-founded.\n\n \n\nAmong other things, [Musk wants Twitter to generate half of its revenue from Twitter Blue subscribers](https://www.cnbc.com/2022/11/10/read-elon-musks-first-email-to-all-twitter-employees.html), and to become less reliant on advertising revenue.\n\nMusk’s Twitter distraction has shaken some of Tesla’s most stalwart bulls. For example, [CNBC Pro reported](https://www.cnbc.com/2022/11/10/wedbush-removes-tesla-from-its-top-stocks-list-says-twitter-deal-an-albatross.html), Wedbush Securities has removed Tesla from its top stock list. The firm has called Musk’s Twitter deal a “train wreck disaster,” saying the celebrity CEO has “tarnished” the Tesla story and created an “agonizing cycle” for shareholders to navigate.",
        "created_utc": 1668136285.0,
        "subreddit_name": "stocks",
        "comments": 628
    }
]