[
    {
        "title": "Apple will likely have to change Apple Card to attract a new partner, report says",
        "score": 1887,
        "url": "https://9to5mac.com/2023/12/19/apple-card-changes-new-partner/",
        "content": "",
        "created_utc": 1703033459.0,
        "subreddit_name": "apple",
        "comments": 376
    },
    {
        "title": "Apple reminds devs to ‘Get ready’ for Vision Pro as launch nears",
        "score": 1259,
        "url": "https://9to5mac.com/2023/12/20/apple-reminds-devs-get-ready-for-vision-pro/",
        "content": "",
        "created_utc": 1703101439.0,
        "subreddit_name": "apple",
        "comments": 441
    },
    {
        "title": "Aston Martin, Porsche Preview Bespoke Apple CarPlay Interfaces",
        "score": 1043,
        "url": "https://www.caranddriver.com/news/a46188510/apple-carplay-next-gen-interface/",
        "content": "",
        "created_utc": 1703094699.0,
        "subreddit_name": "apple",
        "comments": 163
    },
    {
        "title": "Your Apple Watch Bands May Not Work With Next Year's Model",
        "score": 758,
        "url": "https://www.macrumors.com/2023/12/20/your-apple-watch-bands-may-not-work-with-new-model/",
        "content": "",
        "created_utc": 1703077523.0,
        "subreddit_name": "apple",
        "comments": 268
    },
    {
        "title": "20/12 I'm a professional trader and these are some of my notes from premarket.",
        "score": 204,
        "url": "https://www.reddit.com/r/Daytrading/comments/18mtiuo/2012_im_a_professional_trader_and_these_are_some/",
        "content": "**I want to start this post by clarifying some of my comments in yesterdays post, and responding to some of the user comments there.**\n\n* When I said the market looks like it can be topping out, I am in no way saying I am a bear, nor am I saying I am short on the market. This is the US stock market. Obviously, in the long run, it is ultimately going to go up, and break highs. To clarify, I am still long the market. What I was saying was that barring a catalyst, which it doesn’t appear there is in the near term, I do not see a sharp move higher. I am not saying the market cannot move 0.4% higher etc day to day. It can, especially when there is nothing on the economic calendar in way of headwinds. The market is moving on optimism and can continue to move in the direction it is, especially when VIX is so suppressed. What I am saying is that if you look at the economic calendar, there’s not much this side of the new year to help push it higher forcefully.Instead, when you look at certain factors which I will break down here, it seems likely there will be some short term correction, before it again moves higher.Firstly, Mag 7 trading near resistance, which it will have to break. E.g. NVDA rejected at 500. AAPL rejected at 200. Obviously a news story can break these resistances, but trading right against them, makes it more likely for them to come down than go up.Same can be said for indices, with SPX just below all time highs, which will probably act as a resistance.\n* Secondly, look at market breadth. More than 90% of stocks are trading above their 50 day Moving average. This makes sense to be honest, when you consider the rate cut optimism. But at the same time, if you look at the last 3 instances that this has happened, in each of them, the market has done short term corrections. The last time that it was able to reach a level where market breadth was at 90% and still move higher was in 2021. To be honest, I do not see enough similarities in the economic picture today to in 2021 to suggest this will happen again now. Interest rates are much higher, economic growth is slowing, consumer is holding up but there’s still uncertainty as to how long it can.\n* For this reason, I see it as more likely than not that there will be short term correction before it moves higher again.\n* I am still long the market. We operate a long only fund, so we never short. What we do do, is fluctuate our cash position to reflect the headwinds and tailwinds in the market, or you can say, the risk/reward in the market. Right now, I have trimmed my positions, and have closed my swing trades/active trades. I still have my passive positions all running. To this end, if the market moves higher for whatever reason, and I am proved wrong, I am happy, because my passive positions are doing well. If it price corrects, I am also happy as I can put my swing trades back in and utilise my cash position. This is what trading is all about in our strategy, using the cash position to hedge ourselves such that we benefit if the market goes up, or comes down.\n* *I will now continue with the normal posts:*\n\n**What happened yesterday, and some of my trades from yesterday:**\n\n* Was off the desk yesterday, due to family bereavement.\n* From what I can see, market continued to push higher from open. SPX is now 0.6% below all time high, whilst DJI and Nasdaq closed at all time high.Dollar was lower, whilst bond yields were flat.\n* Only order I placed was for a small day trade in ARRY, entering at 18, for 2.6% gain, after its rating was cut by analyst.\n* My sell order on short term trade in AVAV also executed at 130.\n\n&#x200B;\n\n* ***Because I was off the desk yesterday specifically, I will insert a section here on general market conditions, for those who want a bit of a summary, those who don’t can skip.***\n* Market breadth continues to increase. The QQQ Equal weight, which negates the heavy weighting of the Mag 7, has moved from 52 week low to 52 week high across last month and a half.40% of stocks on the S&P are now above 70 RSI\n* Goldman Sachs custom indices of unprofitable and heavily shorted stocks up 12% in last week, which tells you people are short covering and continuing to move into those stocks which have potential to run up with rate cuts.\n* Discretionary stocks now at their highest level of outperformance vs Staples since January 2022.\n* Put interest still very low, traders are chasing not hedging.\n\n**————— EARNINGS ————**\n\n* FEDEX earnings: Was trading at 52 week highs going into the print, up around 20% from last earnings, which puts pressure on the earnings being good.\n* EPS of 3.99 missed estimates by 5%Revenue of 22.2b was down 3% yoy, and missed estimates by 1%Express Revenue still not picked up in last 4 quarters.\n* Continues to see less shipments. Package volume down YOY. Perhaps less benefit from the UPS strikes than expected. Bit disappointing.Continuing on efficiency and cost reduction program (DRIVE). Cost reductions of $1.8bTo this end, cost per packaging declined 2%, due to lower line haul expense, and better last mile productivity.Demand remains uncertainBuybacks on stock of $1b in FY 2024\n* Guidance:Cut full year revenue guidance - to fall single digit %, vs previous outlook of flatEPS guidance fell short at 17.75 at midpoint, miss consensus by 3%\n* Conclusion:Yes margins expanded on lower revenues to help bottom line, but operating margin still fell short of expectations. Package volume decline showed limited benefit from UPS strikesNot enough has improved at all to justify how high it is trading.\n* Overall, 5/10. Not terrible, but not good enough vs where its trading. Actually cut full year guidance, vs last quarter, when stock price is 20% higher.\n\n**————— DATA LEDE —————**\n\n* **JAPANESE BALANCE OF TRADE DATA -** Imports fell more than expected, whilst exports were more or less flat.\n* This in theory should prop up the Yen as less imports means less selling of JPY. Seems to align with when Yen started going up last night, although the move is partly price correction from yesterday’s drop.\n* **UK CPI (Nov) -** As noted in my Sunday post, I expected it to come in soft in line with US, and other European peers. GBP to fall slightly.\n* This proved correct, as it came in well below expectations at 3.9% vs 4.4% expected.Core also fell to 5.1% vs 5.6% expected. Lowest core reading and headline reading in more than 2 years.\n* MOM move was deflationary.\n* This result is good for UK economy. Whilst Bailey at last meeting was signalling higher for longer, and UK and US situations are different, this datapoint shows that UK are starting to catch US up on inflation fighting front. May see rate cuts sooner than expected in UK.GBP falls on this, as it signals BOE can maybe move more dovish than before.\n* **US - Consumer Confidence (Dec)** \\- After market open, so hold early trading in anticipation of this.\n* **US - 20 year bond auction**. Can move bond yields which can influence markets. Likely will see decent demand which will keep bond yields lower.\n\n**———— FOREX ————**\n\n* GBP moves lower on soft inflation numbers, which suggests BOE may be able to be more dovish than first thought.\n* Yen doing some price correction after yesterday’s move lower. Also moving higher as Japan plans to issue more government bonds in 2024, increased demand for Yen.EUR lower slightly, in sentiment with GBP\n* Note: Am holding GBPUSD as I believe that the BOE will hold rates higher than the Fed. Today’s inflation surprise does bring that into question a bit, but still think BOE will be more hawkish than Fed. I had trimmed a tiny bit ahead of the inflation print, so will put that back in soon.\n\n**——— MARKETS —————**\n\n* DJI hit new all time highs in premarket again, near 37,600 then pared gain as European markets sold off after open.\n* SPX and NASDAQ similar story. Mostly flat in premarket. We expect this to continue, as barely any news catalysts around, VIX is suppressed, and GEX is very high which tells us volatility will be lower.\n* GERMAN market quite flat, rejected at 16,800 today.\n* UK at 3 month high following inflation data which fuelled rate cut bets.\n* NIKKEI higher again on dovish BOJ yesterday as they signal ultra easy monetary to continue\n* HKG50 opened higher, around 16,750 then sold off the gains, down 0.77%\n* Oil moving higher by 1% in premarket. Continues higher on Red Sea complications. According to the downtrend I have drawn, which I think it will eventually break to the upside, oil is now close to the top of the downtrend, and may on a technical analysis basis do some correction here. My near term price target for oil overall is 80 though.\n* Bond yields slightly lower in premarket today, which can support equities. But it’s only marginally lower so likely to have no impact.  10y lowest since July\n\n**————— OPTIONS ————**\n\n* GEX continues to grow - which lowers volatility4800 still sticky strike. 0dte tells us this is likely to be the max range today.HVL at 4645, 2.3% below spot.\n\n**————  INSTITUTIONAL RESEARCH ————**\n\n* Didn’t read too much as was off the desk yesterday. Here’s what I did read.\n* DataTrek review 30 day rolling correlations of Daily returns on SPX vs individual large cap sectors, to suggest that the current rally has around 1-2 weeks left to run. They suggested that past that, market optimism would have pushed too far too fast.\n* Bank of America’s fund manger survey yesterday showed equities saw largest inflow since October 2022. Tech saw the biggest inflows, industrials saw the biggest outflows. Dont; take too much notice of this inflows/outflows news. Ultimately, Dow Jones Industrial Average hit 9 straight days of gains.\n* Bank of America also put out a piece saying that although credit card delinquencies have risen sharply over the last year, households on average remain flush with liquid assets. This is something we knew as Black Friday sales showed increase in Buy now pay later.\n* Societe Generale: Market finds it easier to price monetary policy impact (rate cuts) than impact of inflation trends on margins. Last year, they misplaced hikes, vs impact of inflation on profits. For 2024, could be the other way around. AKA they are saying markets are probably pricing too much cuts.\n* Unicredit - “Current enthusiasm seems somewhat exaggerated from short term perspective, and setback is highly likely”. Positives are priced in.\n\n**——MAG 7 NEWS ( CAN MOVE MARKETS) ——**\n\n* Generally flat, so the headlines outlined below are not considered big enough to have a market moving impact.\n* **AAPL** \\- financial impact of the smartphone ban not likely to be as severe as some first thought. Dan Ives estimates it to be about a $400m impact to sales over Holiday period. Is a drop vs their revenue.\n* **GOOGL** \\- plans to reorganise a big part of its 30,000 person ad sales unit.\n* **TESLA** \\- Reuters report that Tesla blamed drivers for failure of parts it knew were defective.\n* **TSLA** \\- VW has signed an agreement with Tesla to adopt North American Charging standard from 2025.\n* **TESLA** \\- will skip yearly media based employee stock awards\n* **TESLA** \\- Analysts at JL Warren Capital say that Tesla cut their prices for their EV cars in China by more than BYD did for its flagship car. Potentially more margin risk for Tesla.\n* **META** \\- CEO Zuckerberg just sold another chunk of FB shares. Has sold $320m in shares in last few days\n\n**——— COMPANY SPECIFIC —————**\n\n* **BABA** \\- CEO Eddie Wu will lead Taaobao and T-Mall business in latest reshuffle\n* **LUV** \\- Southwest and Pilots union reach labour deal.\n* **XPEV** \\- BABA slashes their stake in Xpeng for 2nd time this month\n* **NIO** and **Li** moving in sentiment with Xpeng. Chinese stocks generally all lower.\n* **UPS** lower in sympathy with FEDEX earnings\n* **CHH** \\- pushing ahead on regulatory process for Wyndham takeover\n* **DOCU** \\- Wells Fargo downgrades to underweight\n* **Lowe’s** \\- cut to hold from buy by Stifel\n* **S** \\- Wells Fargo keeps hold rating on S\n* **ENS** moving higher on earnings after they raised their Q3 profit outlook (need to read this report in full later)\n* **TENB** \\- higher on Buy rating by Wells Fargo\n* **Oil** stocks generally higher on Oil prices being up 1%\n* THERE WILL BE MORE COMPANY SPECIFIC NEWS NEARER THE MARKET OPEN. THIS WAS WRITTEN A COUPLE OF HOURS BEFORE\n\n**————— OTHER HEADLINES ———**\n\n* AFTER CPI DATA, UK INTEREST RATE SWAPS NOW PRICE 140bps of easing vs 117bps before CPI. Now markets beginning to price a cut by March.\n* GOOLSBEE COMMENTS AFTER MARKET:Cautioned against euphoria in markets.Inflation will determine easing.What market is pricing won’t influence the Fed\n* BOSTIC yday reiterated that the Fed won’t wait till 2% inflation to start cuts. Said he expects 2 cuts in 2024.\n* MORE ECB OFFICIALS CAUTION ON INVESTORS BETTING ON RATE CUTS. This time it was ECB’s Nagel, who said “be careful, others have miscalculated before”\n* FRANCE SEE EASING INFLATION EXPECTATIONS, GOOD FOR EUROZONE.\n* GERMAN 10Y BONDS FALL BELOW 2% FIRST TIME SINCE MARCH. This on Rate cut hope for ECB. This has been supporting the GER40 to all time highs.\n* South Korea C BANK CHIEF SAYS MARKETS ARE OVERREACTING TO POWELL’s DOVISH COMMENTS.  Market will ignore this commentary anyway. His opinion is worth less than Fed officials who have been saying a similar thing and Markets have been happily ignoring them too.\n* COLORADO Supreme Court BAN TRUMP FROM APPEARING ON NEXT YEARS ELECTION STATE BALLOTS. Trump team will appeal. Vote was made by entirely democratically appointed Supreme Court.\n* MAERSK say Red Sea shipping disruptions can add 2-4 weeks of delays\n* LONDON HOUSE PRICES SEE BIGGEST FALL SINCE 2009 IN ONS DATA.\n\n&#x200B;",
        "created_utc": 1703075503.0,
        "subreddit_name": "DayTrading",
        "comments": 59
    },
    {
        "title": "Will $AAPL CLOSE ABOVE $200 before 2024?",
        "score": 2,
        "url": "https://www.reddit.com/r/AAPL/comments/18n3602/will_aapl_close_above_200_before_2024/",
        "content": "Title says it all …\n\n[View Poll](https://www.reddit.com/poll/18n3602)",
        "created_utc": 1703101035.0,
        "subreddit_name": "AAPL",
        "comments": 3
    }
]