[
    {
        "title": "Speculate on GOOG - what'd be the best countermove against DoJ slaps? ",
        "score": 20,
        "url": "https://www.reddit.com/r/stocks/comments/1gywuwe/speculate_on_goog_whatd_be_the_best_countermove/",
        "content": "For those who were sleeping/partying on the weekend, the following happened:\n\n* DoJ said, Google should divest off Chrome and may not reenter the browser market for five years\n* prohibited from \"acquiring any interests in search rivals, potential entrants, and rival search or search ads-related AI products\"\n* halt all \"anticompetitive payments to distributors, including Apple, Samsung\" so that Google isn't the default search engine on their devices\n* content creators can choose to opt-out of Google crawlers to train its AI\n\nMost obvious historical comparison is case against Microsoft Corp. in 2001; the DoJ tried to split Microsoft up due to its hold over the web browser market on Windows, though this case **ultimately resulted in a settlement**. With that in mind, it is possible, the DoJ will go this way, this time.\n\n* Search is close to 50% revenue of Google \\[Q3 results\\]\n* Browsers market shares: Chrome 60%, Safari 18%, Edge 8% \\[Source can be contested, because it's larger devices stats only\\]\n* Android - 70% market share in handheld devices\n\nGOOG has to fight hard to ensure a high search traffic. It may have a few options up its sleeves.\n\n\n\n||||\n|:-|:-|:-|\n|\"Chrome\" as a stand-alone listed company like Opera browser.|Possibly the worst move. Average user unlikely to install a browser-only app, than stick with factory default browser on the device. ||\n|Chrome+Gemini as a new company, to command an \"AI\" valuation.|Not likely to attract advertisers, until this new 'app' gets wild Chat-GPT like popularity. ||\n|Android+Chrome as a new company, provides operating system for device manufacturers|Won't make sense, because Samsung already has their prop. version of Android. And to gain search traffic, Google again needs to partner with this new company, which is prohibited.||\n|A company with \"personal suite\" of applications, Gmail, Calendar, Docs and Chrome bundled together|Chrome then gets 100's million users from Day-1. Still, above legal prohibition remains. ||\n|Settlement|Make it all go away!||\n\nAny other speculations? With so much uncertainty, the stock will remain under pressure with downward bias, until there's clarity on the case.\n\nBut at PE 22, even if total revenue of the demerged companies, takes a hit of 30%, it's still a great value.",
        "created_utc": 1732470542.0,
        "subreddit_name": "stocks",
        "comments": 40
    },
    {
        "title": "Apple may use Intel to Produce Chips in 2026",
        "score": 883,
        "url": "https://www.businessworld.in/article/apples-2026-a20-pro-chipset-may-shift-from-tsmc-to-intels-2nm-technology-540114",
        "content": "",
        "created_utc": 1732467138.0,
        "subreddit_name": "wallstreetbets",
        "comments": 189
    },
    {
        "title": "SPY 601+ Monday 🚀👀💥",
        "score": 230,
        "url": "https://i.redd.it/r7vdw6c7or2e1.jpeg",
        "content": "SPY at 601+ Monday! 🚀\nFutures are looking up +50 points, and SPY’s set to open at 601. Nvidia’s finally breaking out, and TSLA should be pushing 160+. If you’re holding puts, well… fuck your puts.\n\nAnd no, I’m not saying this because I have 483 x 600 calls that are about to go crazy on Monday. ",
        "created_utc": 1732418013.0,
        "subreddit_name": "wallstreetbets",
        "comments": 199
    },
    {
        "title": "Any hope for QCOM 🙃 ",
        "score": 39,
        "url": "https://i.redd.it/xqg6lew9ev2e1.jpeg",
        "content": "After putting out good market forecasts (most of which very realistic) if anything with automotive and pc likely conservative, and confirming that revenue & earnings will continue to grow even as apple divests from their cpu modems I don’t understand the friction with this stock.\n\nNVDA, AAPL, and QCOM r the three only chip giants that have seamlessly made the switch to arm SoCs which is where all the cash is. Apple only makes chips for themselves, NVDA for Blackwell/other Industrial grade applications, and to me that’s a large TAM where a chip specialist like QCOM could bridge the gap especially when they are way ahead of companies like AMD and INTC who really stand to lose the most. \n\nMost laptops & consumer electronics would stand to benefit greatly from the thermal and efficiency benefits of silicon SoC especially things with battery life. To me that means ryzen and x86 for anything sub large multicore performance tasks like gaming are out. And this is only the first gen it could get good enough where even multicore begins outperforming x86\n\nHowever QCom is the only one that gets priced as a boring phone company even tho they r really steppin \n\nCurious what yall think, the CEO of qcom seems very certain their arm licensing is fine and this is likely just opening the door to negotiations for proper royalty agreements since arm makes almost no cash off their own architecture 😂",
        "created_utc": 1732463101.0,
        "subreddit_name": "wallstreetbets",
        "comments": 9
    },
    {
        "title": "Jon Watts Explains Demise Of George Clooney & Brad Pitt ‘Wolfs’ Sequel After Streaming Pivot: “Apple Didn’t Cancel…I Did, Because I No Longer Trusted Them As A Creative Partner”",
        "score": 205,
        "url": "https://deadline.com/2024/11/wolfs-sequel-demise-jon-watts-george-clooney-brad-pitt-no-longer-trusted-apple-1236186227/",
        "content": "",
        "created_utc": 1732467397.0,
        "subreddit_name": "apple",
        "comments": 112
    },
    {
        "title": "Two free-to-play iOS games with no ads: “Disc Brick” and “melod”",
        "score": 81,
        "url": "https://www.reddit.com/r/apple/comments/1gyt6hh/two_freetoplay_ios_games_with_no_ads_disc_brick/",
        "content": "Disc Brick: https://apps.apple.com/us/app/disc-brick/id1476442754 (4.9 Stars over 446 ratings)\n\nmelod: https://apps.apple.com/us/app/melod/id1527297039 (4.6 stars over 410 ratings)\n\nBoth of my games are completely free-to-play, no time limits, and no ads. No internet required, and no data collected.\n\nAll in-app purchases are one-time and exist only to expand the scope of the game, if desired. No GACHA, randomized, or consumable purchases of any kind.\n\n**Disc Brick** is a simple but aesthetic and robust brick breaker. A great small time waster with detailed visuals and haptics. Published originally in 2019 to amazing response here on Reddit, the game was updated with improved graphics, additional power-ups, and more themes and game modes, all without compromising on the original promise of a game free of ads and unethical monetization practices. My goal was to make a version of this simple game mechanic that anyone or their kids could enjoy indefinitely.\n\n**melod** is a music/rhythm game, similar to Guitar Hero or Rock Band. The free setlist is fairly large (over an hour of music) and consists of music from a variety of very talented indie artists who collaborated with me. A series of additional songs of increasing difficulty can be purchased if desired. This game retains the classic feel of those older rhythm games by allowing you to play \"melody\" or \"rhythm\"—built with multi-track stems so when you miss notes, your instrument drops out. It even has some songs I wrote and produced myself! All music is high-quality and enjoyable. You'll probably find some new artists you like!\n\nHonestly, I have been super happy with the positive response I've gotten from on these games. I would love to continue making games with these ideals to resist the mobile gaming trend of aggressive consumable IAPs.",
        "created_utc": 1732461271.0,
        "subreddit_name": "apple",
        "comments": 26
    },
    {
        "title": "Got your Apple Pencil handy? Penbook Lifetime is free today, just in time for 2️⃣0️⃣2️⃣5️⃣",
        "score": 71,
        "url": "https://www.reddit.com/r/apple/comments/1gyvzrt/got_your_apple_pencil_handy_penbook_lifetime_is/",
        "content": "Hey everyone, I’m the creator of **Penbook**, a notebook app for iPad (and iPhone!) that’s perfect for anyone who loves writing, drawing, or organizing their thoughts with the Apple Pencil. And we just released an update with our **2025 Planner** book.\n\nUnlike most note-taking apps, Penbook has a unique superpower: among its 100+ page templates (including classics like grid and ruled), you'll also find **calendar pages** like daily, weekly, monthly and yearly. And these are not your tired PDF calendars:\n\n📆 The pages show your **ACTUAL** calendar events.  \n👫 If you have **shared calendars**, you'll see those too.  \n🤖 Your calendar pages **update automatically** when you add to your iOS calendar  \n💪 They're **super powerful**: portrait or landscape, iPhone or iPad sized, any date and date span.\n\nThere is no better way to plan and organize your time than with Penbook and Pencil. And the **2025 Planner** makes this super easy.\n\n**What else can it do?**\n\n📝 Create **unlimited notebooks**, each with customizable paper types (lined, grid, music sheets, chemistry papers, and more).  \n🔖 **Bookmark and annotate** your pages with notes and titles, making it super easy to jump between pages or books.  \n📖 **Organize** your ideas effortlessly with images, text notes, shapes, and more.  \n📄 And if you do want to share a **PDF** (or import one), we got that too.\n\nPenbook Lifetime is usually $49.99 on the App Store, but **today it’s completely free!** 🎉\n\nNo catches—just download it and see if it sparks joy for you. If you do grab it, I’d love to hear your feedback or see how you’re using it! ❤️\n\n→ **App Store**: [https://apps.apple.com/app/id1473064295?ct=red](https://apps.apple.com/app/id1473064295?ct=red)\n\n→ **Website**: [https://penbook.app/](https://penbook.app/)\n\nThis is a great chance to try it out, especially if you’re a student, artist, bullet journaler, or just love handwriting on your iPad.",
        "created_utc": 1732468424.0,
        "subreddit_name": "apple",
        "comments": 44
    },
    {
        "title": "I've just released Pestle 2.0, with support for saving recipes from TikTok, and saving recipe notes straight from the source!",
        "score": 12,
        "url": "https://www.reddit.com/r/apple/comments/1gytjvu/ive_just_released_pestle_20_with_support_for/",
        "content": "Hey r/Apple! I'm Will, I'm the developer of Pestle, a recipe app for iPhone & iPad.\n\nI dropped in [a couple months ago](https://www.reddit.com/r/apple/comments/1dxkyxm/ive_just_released_pestle_18_with_support_for/) to share a big update to Pestle, and 4 months on I've got another big one!\n\n# TikTok Support\n\n\nAfter launching support for Instagram in 1.8, I got lots of requests to support TikTok also. TikTok is a little different in how authors format recipes, so it took a bit of tweaking but I think I've got it right! \n\nThe process is exactly same:\n\n\n1. Find a TikTok you like\n2. Tap **Share**, tap **More**, then tap **Pestle**.\n3. If Pestle can't work out the name of a recipe, it'll just ask you to name it (you can always change it later!)\n4. Tap **Save**, and you're done!\n\n## How it works\n\n\nDespite using AI, **this is not just another OpenAI wrapper**, Pestle uses an in-house model that runs **entirely offline and on-device**. That means it's **private**, and ***fast***. Recipes are processed in seconds, and the longest part of the process is just the network request to get the recipe data from TikTok.\n\nIt only works if the recipe is written in the caption, or the author has provided a link to their website in the caption.\n\n# Recipe Notes\n\n\nPestle has had notes for a long time, but until now it has never saved notes directly from the source. \n\nNow when using sites like [RecipeTinEats](https://www.recipetineats.com) or Chef John's recipes on [AllRecipes](https://www.allrecipes.com), Pestle will save the author's notes too. So if an ingredient tells you to \"refer to note 3\", it'll be right there!\n\n# Pricing\n\n\nLike many apps today, Pestle is a subscription-based app, but **a one-time option is available**. \n\nAnd for r/Apple, I wanted to let you all in on Pestle's Black Friday sale a little early! \n\nYou can get Pestle for $10/year with a 14-day free trial [here](https://pestlechef.app/purchase?term=yearly&coupon=QkUdqLk5), or Pestle Pro Lifetime for just $19.99 [here](https://pestlechef.app/purchase?term=lifetime&coupon=QkUdqLk5).\n\nAnd just as an aside, I wanted to thank r/Apple for their continued support of my apps, going back 6 years! You all contribute so many great ideas and feedback, I really couldn't have built Pestle without you.",
        "created_utc": 1732462249.0,
        "subreddit_name": "apple",
        "comments": 5
    },
    {
        "title": "Multibrew: An App for Specialty Coffee ",
        "score": 14,
        "url": "https://www.reddit.com/r/apple/comments/1gyrx2q/multibrew_an_app_for_specialty_coffee/",
        "content": "Hello!\n\nI've been into specialty coffee for the past couple of years. In that time, I've noticed some inconveniences that could really be solved by a good app: thus, I built an app.\n\niOS link [here](https://apps.apple.com/us/app/multibrew/id6499178775)\n\nMultibrew is essentially a glorified calculator that removes the need to pull out either an actual calculator or a stopwatch to brew coffee. While it has functionality for a variety of brew types, the best is reserved for pour over since that's my favorite method :)\n\nIf you're a fan of specialty coffee, I'd love for you to give the app a shot. Thanks for reading, and happy brewing!",
        "created_utc": 1732457791.0,
        "subreddit_name": "apple",
        "comments": 11
    },
    {
        "title": "Apple’s Next Step in TV Should Be a Streaming Stick and Not a Full Set",
        "score": 25,
        "url": "https://www.bloomberg.com/news/newsletters/2024-11-24/apple-should-build-fire-tv-chromecast-rival-llm-siri-plans-oura-glucose-push-m3vnimbg",
        "content": "",
        "created_utc": 1732456153.0,
        "subreddit_name": "apple",
        "comments": 122
    },
    {
        "title": "Daily Advice Thread - November 24, 2024",
        "score": 0,
        "url": "https://www.reddit.com/r/apple/comments/1gyoi95/daily_advice_thread_november_24_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1732446026.0,
        "subreddit_name": "apple",
        "comments": 19
    },
    {
        "title": "I made a complete weather app | clean, quality, winter weather ready",
        "score": 0,
        "url": "https://www.reddit.com/r/apple/comments/1gyvyri/i_made_a_complete_weather_app_clean_quality/",
        "content": "Hello r/apple,\n\nI am honored to take this opportunity to introduce my weather app Digital Sky: world-class weather data elegantly organized for clear forecast communication, with special features found nowhere else. For free with zero ads.\n\n[Home](https://digitalsky.app/) | [Direct Store Link](https://apps.apple.com/us/app/digital-sky-weather-radar/id6526472949?platform=iphone)  \n^(\\*Note: The app name will be \"Sky Digital\" on your device. An update is in review, see below.)\n\nWhat sets Digital Sky apart?\n\n★ High quality data. National Weather Service with influence from the European ECMWF, American GFS and HRRR  \n★ Fantastic presentation. No clutter, no complex charts. Full screen maps.  \n★ Complete official weather alert package. Notifications, beautiful in-app display, interactive map layer.\n\nThat’s just the foundation. I built the following features to really hone clarity and completeness:\n\n► Search specifically for any ski resort, school or pro sport team. This gives you the weather at that exact location rather than the nearby town like most weather apps. (to access: tap search, then tap top right button)  \n► Super organized hourly view that lets you see all weather variables at once. (Note, 60 minute and hourly are layered. If its showing 60 minute, tap hourly button top right)  \n► Hourly snow, sleet, freezing rain and rain (USA). View potential rates and totals for every hour. This graphic will even show how snow and ice will melt in response to temperatures, sunlight, and rainfall. (to access: hourly screen, bottom left button)  \n► 10 day timeline graphic. View alerts, sun, and moon with the weather.   \n► School snow day forecasts (USA). When you search for a school, get the chance of a snow day tomorrow. View all school district chances on the map. (Note: not totally done. It over-does wintry areas and under-does warmer areas. Give me a week to finish.)  \n► Ski resort snow totals for the next 10 days and nights in one view.\n\nUltimately, my goal is to make this app truly all-in-one. I’ve got a whole list of ideas... \n\n✱ Ski resort forecast by elevation and live trail statistics  \n✱ Professional sports game time weather display  \n✱ Winter map layers, gardening package, lightning, air quality... \n\n... to name a few. I’ll continue to add features over the next few months and shout them out as they are made on X @ digitalskywx . \n\nThank you so much for checking out my app! It’s truly my pleasure to be able to offer a service I hold close to my heart as my very first app project. If you would like to support my work, consider dropping a rating. You can also support by subscribing to Premium which would additionally grant you features like radius notifications, 24 hour radar playback and map themes while supporting server costs.\n\nAny comments, questions, or improvement suggestions are more than welcome.\n\n\\---------------------------------------------  \n^(There’s an update processing. It will:)  \n^(➟ Fix the app name; right now it shows up as Sky Digital on your device.)  \n^(➟ Replace the app store listing description with much more info)  \n^(➟ Add more useful information to the hourly tutorial)  \n^(\\*Occasionally, the last \\~3 day temperatures are briefly erroneous. Fixing this.)",
        "created_utc": 1732468362.0,
        "subreddit_name": "apple",
        "comments": 2
    },
    {
        "title": "I created a blazingly fast emoji Mac app with the largest keywords database - Emoogle🐶",
        "score": 0,
        "url": "https://www.reddit.com/r/apple/comments/1gz0it0/i_created_a_blazingly_fast_emoji_mac_app_with_the/",
        "content": "👋Hi everyone,\n\nI regularly use emojis for my day to day, but run into issues with the native Mac emoji app where it has noticeable search delays and limited keywords, i.e. its search latency is 500+ms and it returns no emojis when searching for common day to day words, such as problem, solution, achievement, address, bummer, buy, etc.\n\nI have developed web apps before but not desktop app, so I took this as a great opportunity to learn and build a much better emoji desktop app with a core focus on search and speed. My primary goal is to help people find the emojis they want super quick and easy (as quick and easy as typing text).\n\nThis leads to the Emoogle app and it has the following key features:\n\n* 🔍Search\n   * World's largest emoji keywords database with 5,400+ unique keywords (I manually curated emojis for the top 1000 most frequently used English words to ensure day to day words are covered)\n   * Advanced emoji ranking algorithm with 10+ rules specifically tuned to sort most relevant results first (e.g. auto→🚗, bag→👜, file→📄)\n   * Adaptive and customizable search experience based on your usage, preference, and custom keywords\n* ⚡Speed\n   * Blazingly fast real time search-as-you-type experience that takes \\~5ms (100x faster than the native Mac emoji app with 500+ms latency)\n   * Intelligent autocomplete to save time and no need to type out full words\n   * Emojify a sentence or phrase as fast as pressing a keyboard shortcut\n\nYou can check out the app here: [https://www.emoogle.org](https://www.emoogle.org). It has a 14 days free trial (no sign up required). I’d love to get your feedback on it. Thank you so much and happy emoji-ing 🙌\n\n(If you are a developer, I open-sourced the search engine and emoji picker component in case it would be helpful for anyone looking to provide a better emoji experience in their apps or services [https://github.com/xitanggg/emoogle-emoji-search-engine](https://github.com/xitanggg/emoogle-emoji-search-engine))",
        "created_utc": 1732479801.0,
        "subreddit_name": "apple",
        "comments": 2
    },
    {
        "title": "No, 95% DON'T fail but if you are new you need to read this because it could change your LIFE like it did mine.",
        "score": 22,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gytz3z/no_95_dont_fail_but_if_you_are_new_you_need_to/",
        "content": "Hi all,\n\nIt appears I will be taking a payout in the next few weeks after starting from zero seven months ago.\n\nFor those of you just starting I wanted to share with you a few things that I have worked through.\n\n* I trade futures on a 2 minute chart. I started with ES and moved to NQ.\n* I use prop firms for leverage (TopStep)\n* I lost constantly until just a month ago then held a funded account and it is at a 70% daily win rate.\n\nI am not particularly special. I have no education and basically screwed my life up. You can read more at the very end, but if a high school dropout like me can do this, I feel you can to.\n\nAway we go.\n\n  \n**Why you see that \"95% of everyone fails\" and this isn't likely true.**\n\nOne of the primary goals of this post is to refute the claim that 95% of everybody that trades loses. \n\nThe idea that this is gambling and a fast way to lose everything. \n\nSo here is a little about where I am at after just seven months, and why I will take my first actual payout in a week or two.\n\n**My Journey so far to profitable in 7-8 months.**\n\nThere have been 155 weekdays (trading days) between April 21, 2024 to today. I traded ALL of them except for ONE holiday. I realized the NQ always seems to have enough volatility to get a move and ES not so much on holidays.\n\nPoint is that I traded every single one of them and when I would fail a combine I would get another one until I was passing them.\n\nI also studied around 2-3 hours every day outside of trading. \n\nSo even at 2.5 hours that is another 545 hours of studying one person who has a proven system, back testing, purchasing Tradovate market replay and running that, watching videos, making notes during the videos on my iPad with my apple pencil, and learning a system.\n\n**It isn't about technical analysis or special secret methods a youtube guru teaches you**\n\nTrading is to me 90% emotional and mental and 10% technical. You can teach a child how to look for things on a chart and click a button when those things happen.\n\nChildren do not have a lifetime of fear of loss and holding what they gained. They do not worry about the same things adults do.\n\nThe mental game in trading is a HUGE obstacle to overcome. \n\nWe learn in \"Trading in the Zone\" and \"Best Loser Wins\" how much of a mind game it is. \n\nWhen a trader learns more about the market they fool themselves into thinking that they will finally start winning, but the market is not predictable so there becomes a false sense of certainty (from Trading in the Zone)\n\nWe get out of winning trades to hold our profit and stay in losing trades because we hate losing and convince ourselves the trade will turn around (Best Loser Wins).\n\nWe come to the market because someone told us that they have a \"90% success rate with this ONE SPECIAL SYSTEM\" (every youtube guru ever).\n\nUntil we get over OURSELVES and realize our relationship with money, loss, and gain, we will repeat the same bad judgement over and over again. \n\nWe will incur losses and wonder why.\n\nWe will win and then lose it all because of things like negative self image or the inability to stay out after a win, or the urge to revenge trade and lose even more.\n\n**In short, trading is the ultimate humbling experience that you will either learn and grow from, or quit and cry about.**\n\nThis is the ONE THING that will either straighten your twisted mind out, or will eat you alive. \n\nSo traders, if you are new, you need to invest in a discovery program on yourself and need to start learning about these things, or be left in the dust.\n\nSo then, even if you have this all straight, why do so many lose?\n\n**People fail because they fail to properly have a system.**\n\nIf you have a proper system that is realistic, and have a proper trading plan daily where you are sticking to losing only a certain dollar amount then leaving the market, and hitting a profit target and leaving the market, you are already on a level above 99% of everyone who is starting their journey.\n\nPeople don't do this and they flounder. They think they can come in against people doing this for decades and a billion dollar hedge funds computer that can execute moves in a 10th of a second and win right off the bat. They can't\n\n**So what is a realistic success/fail rate?**\n\nI asked GPT about this. I consult ChatGPT all the time. There are trading AI's there if you pay a paltry $20 a month for the service.\n\nIn Taiwan a study showed that 19% if traders were profitable.\n\nIn the USA 10.3% profited year over year\n\nIn India 30% profited.\n\nInterestingly, the nations that seem to value education more than we do here in the USA, where there is more to lose and more to gain? They seem to succeed more.\n\nPoint is, it is not a 95% fail rate. \n\n**Funny stat about traders.**\n\nI read once that a major brokerage put out stats about how long an account on their platform stays active before the user no longer logs in.\n\nThey found that:\n\n* A new account typically stops being used by the 30 day period with 80% of people quitting.\n* Most everyone close to 85% are done by the 45-60 day mark.\n* The firm which released their financials being a public company spent 80% of their budget on marketing for new clients because they have only 30-60 days to profit from all new clients.\n\nSo that tells you a lot about the industry in general, but still doesn't explain why the 95% failure rate is brandied about.\n\n**Why the 95% failure rate myth exists**\n\nPeople have a funny tendency to complain. The internet has facilitated the largest public square ever known to man, and I feel it is simple.\n\nThe people that are winning are taking this very seriously. They study every day, they obsess over making themselves the best version they can be, and will never let up.\n\n**The successful people don't speak up. The unsuccessful people do.**\n\nThe people that fail invariably come to reddit, facebook, tiktok and other platforms.\n\nThey complain and get sympathy from others that also failed. \n\nThey failed not because trading is \"impossible\" or \"gambling\" but because they went into the markets without education and training, went up against a giant machine, and quickly lost their money due to many factors they were not aware existed.\n\n**At the end of the day, those that succeed don't talk much. Those that fail yell very loudly.**\n\nAnd that is why I think that with proper training, enough study, and an obsessive mindset that people can and will find success in the markets.\n\nIt is not that people are not smart, not that people are being \"scammed,\" but because people are not willing to put in the work to understand what has to be done.\n\nThey are not willing, or maybe not even aware that they need to straighten out their mental game in order to succeed, and that trading is the most rewarding thing they can do, if only they are committed to it.\n\nIf you made it this far, you should know that I am not particularly educated. I am a high school dropout that failed everything in his life because I had a TON of trauma as a kid that caused me to think I was not worthy of anything.\n\nI spent my 43 years consistently self sabotaging and blowing up every opportunity ever presented to me.\n\nSo if I can find success at this, the chances are that YOU can find success at this, but it won't work, unless you work.\n\nThanks, and have a great day.",
        "created_utc": 1732463388.0,
        "subreddit_name": "Daytrading",
        "comments": 5
    },
    {
        "title": "Can’t beat the S&P…?",
        "score": 6,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gz14jb/cant_beat_the_sp/",
        "content": "So many Wall Street pundits preach that nobody can beat the S&P 500 blah blah blah, so my question is, how many of you all have most if not all your brokerage account in $SPY, or similar and day trade with your margin balance?",
        "created_utc": 1732481295.0,
        "subreddit_name": "Daytrading",
        "comments": 7
    },
    {
        "title": "Your favorite TradingView Scripts/Strategies for Entries/Exits?",
        "score": 1,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gz19uh/your_favorite_tradingview_scriptsstrategies_for/",
        "content": "I’ve been day trading SPY options for a while and am really focusing on refining my approach. I’m currently trying out TradingView on a 30-day trial, and I’m looking for solid scripts or strategy tools that can give clear buy/sell signals for entries and exits.\n\nMy current setup includes VWAP, EMAs, MACD, RSI, and mapping key support/resistance levels. These have been working decently, but I’d like to explore some TradingView-specific strategies or custom scripts that might give me a stronger edge for pinpointing entries and exits. I find I have a difficult time timing my entries/exits and tend to second-guess the price action too much, causing me to lose strong moves or exit out of a move at a loss.\n\nIf you’ve found any great strategies or indicator scripts on TradingView that work well for day trading, I’d love to hear about them! Bonus points for anything backtestable or with clear logic behind the signals.",
        "created_utc": 1732481685.0,
        "subreddit_name": "Daytrading",
        "comments": 0
    },
    {
        "title": "Which stockbroker trading platform is fully integrated with TradingView?",
        "score": 1,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gypjfd/which_stockbroker_trading_platform_is_fully/",
        "content": "I’ve been using Webull’s desktop paired with TradingView as a day trader for months, and I’ve noticed that not all trading functions are seamlessly integrated. A few issues have popped up that are worth mentioning, like the Flatten, CXL All, and Reverse functions during regular trading hours, as well as problems submitting limit orders during extended hours (post-market and pre-market).\n\nOn Webull’s platform itself, I can use the Turbo Trader Flatten function with active suborders (TP & SL) without having to cancel everything using CXL All initially. But when my Webull account is linked to TradingView, Flatten straight-up won’t work unless I cancel all suborders first using CXL All. That’s super inefficient when time is of the essence for order execution.\n\nThe Reverse function is another headache—it only works half the time. TradingView just throws up a generic error: *“The order cannot be executed, please contact the broker for more information.”* If I switch over to Webull to try it there, it says: *“This security is not available for reversing positions.”* What makes no sense is that the stock has already been shorted, so why is reversing suddenly unavailable?\n\nOn top of that, the custom hotkeys for limit orders in Webull don’t work as expected because the quantity feature doesn’t update dynamically. It’s annoying, especially when speed and accuracy are critical.\n\nAnother major issue is with extended trading hours. Orders submitted through TradingView during post- or pre-market hours don’t execute, and even worse, you can’t cancel them while they’re stuck as pending/working orders in the queue. You’re forced to wait until the market opens, which is maddening. According to Webull support, this happens because TradingView doesn’t fully support extended hours trading, paper trading, or options trading when connected with a broker account.\n\nFrom what I’ve read, many people seem to have no issues with Webull’s platform esp. the mobile app version. Maybe I’m diving too deep into the nuances or specifics here, but I hope this doesn’t come across as nitpicking for those who love using Webull. I just wanted to share my experience and see if there’s a platform out there that’s fully integrated with TradingView without these limitations and discrepancies.",
        "created_utc": 1732450048.0,
        "subreddit_name": "Daytrading",
        "comments": 1
    },
    {
        "title": "Gurman: Apple has no ‘meaningful’ AirPods Max plans after USB-C refresh",
        "score": 857,
        "url": "https://9to5mac.com/2024/11/24/gurman-airpods-max-refresh/",
        "content": "",
        "created_utc": 1732491147.0,
        "subreddit_name": "apple",
        "comments": 261
    }
]