[
    {
        "title": "Workplace commuters were often customers of UBER. Many of these customers and their \"rideshare\" business won’t come back, as companies instituted forever WFH policy. As much as 25-30% of the workforce will be working from home by the end of 2021.",
        "score": 1414,
        "url": "https://www.reddit.com/r/investing/comments/gok1gt/workplace_commuters_were_often_customers_of_uber/",
        "content": "> https://seekingalpha.com/article/4349297-uber-announces-much-diminished-tam\n> \n> \n> UBER’s CEO Dara Khosrowshahi once sold UBER as the next Amazon, promising that “cars are to us what books are to Amazon.” Link here. Khosrowshahi, who was Barry Diller’s top salesman for a decade, pitched the taxi-hailing app, repackaged as “rideshare”, as simply the first step on a journey to global domination. UBER would enter and dominate “food delivery, freight, autonomous vehicles, and even buses and bikes”. Later, he added flying cars. By 2023, Khosrowshahi continued, UBER could run the entire transportation network for a city! As recently as UBER's latest 10-K, filed in February, UBER characterized its Freight business as \"revolutionizing\" the freight industry. And now they are simply going to shut it down? None of these promises have ever happened, of course, and with this week's forced retrenchment, likely never will.\n> \n> Severe and unsustainable cash losses have forced UBER to ratchet back its strategic ambitions; to raise another $1.0BN of junk bonds at a steep 7.5%, and reduce on-the-books headcount by at least 25%. UBER will likely cut its \"non-core\" businesses, including freight, autonomous vehicles, flying cars, artificial intelligence, and job matching. These businesses, together, were the secret sauce that was to turn a simple and old-fashioned taxi-hailing app into the next big thing, rivaling Amazon in the scope and reach of its operations. These promises were what drew investors as big as Texas Pacific Group and Softbank in at valuations north of $70BN and even promised to approach $100BN - for a business that, in the here and now, is only able to generate revenues of $14BN, with growth slowing sharply, while margins remain massively negative, and billions of cash losses pile up - and that best case was pre-COVID!\n> \n> Now, UBER faces a sharply diminished TAM, or total addressable market, as it gives up its ambitions to expand beyond taxi-hailing and food delivery, and major American and international corporations in various industries, including technology, media, real estate, airlines, hotels, and entertainment destinations all prepare us for a world of sharply diminished transportation needs. Where workers will shift to permanently working from home; where international travel will be diminished for years; where even domestic destination travel will face diminished capacity and utilization.\n> \n> None of this has yet sunk into the minds of equity market investors.\n> \n> THESIS\n> \n> Diminution of Total Addressable Market. Uber is likely abandoning its ambitions to be a leader and create a revenue generating business in nearly every area besides its core taxi-hail and food delivery business. These early-non-core businesses, while inchoate and pre-revenue, gave investors hope that UBER was not just an old-fashioned transportation company making use of the latest technology - smartphone apps - but an actual technology company, with the same opportunity for horizontal expansion as Amazon. This hope was among the reasons why a negative cash burn of several billion dollars for a seemingly mundane business could turn into a $59 BN valuation. That hope is gone.\n> \n> For its remaining core business, taxi-hail, the world has changed:\n> \n> Negative Secular Changes to UBER’s Core Business\n> \n> First, we start with the massive secular change we are witnessing in the American workplace. Then, we move on to the lengthy and even semi-permanent changes to restaurants and travel.\n> \n> We are witnessing a generational acceleration in work-from-home, in which commuting to and from work is facing the biggest and fastest change in its history. Companies such as Google, Square, and Twitter are preparing for a future in which employees may work remotely – forever. Others such as Facebook, JP Morgan, Citibank, American Express and Microsoft have taken steps in this direction. Employees who commuted to these workplace jobs were often customers of UBER. Many of these customers and their \"rideshare\" business won’t come back. Here is a sampling of recent headlines that will negatively impact UBER - for at least several quarters in some cases, permanently in others:\n> \n> First, Twitter. This one is permanent:\n> \n> \n> \n> Next, we have Square, also offering permanence:\n> \n> \n> \n> Now, we turn to Facebook, who for now, is only planning until the end of the year:\n> \n> \n> \n> Now we will shift to the banks, which are not only continuing work from home, but also seeking semi-permanent shifts away from urban centers, another hit to UBER's business:\n> \n> \n> \n> Citi is but one example; the list goes on and on, and is only growing by the day.\n> \n> Next, we have buy in to work from home from the media, who indicate that working from home is the right thing to do:\n> \n> \n> \n> And the NY Times weighs in on the nascent trend:\n> \n> \n> \n> \n> \n> \n> \n> We also have consultancies now adding their voices to the chorus of work from home:\n> \n> Surveys also indicate there is a new and growing movement for work-from-home accommodations. Global Workplace Analytics, a leading authority on integrated work at home strategies, recently published a report in which they forecast that as much as 25-30% of the workforce will be working from home by the end of 2021. See the full report here:\n> \n> Work-at-Home After Covid-19-Our Forecast - Global Workplace Analytics\n> \n> These are the thought leaders. We are witnessing a tsunami of potentially permanently lost taxi-hail business for these former commuters. While some of the headlines may say only through 2020, these arrangements are likely to be made permanent in many cases.\n> \n> And now, the rest of the ride-share customer universe: the restaurant, travel and leisure industry have been decimated, with full year 2020 volumes estimated to be down anywhere from nearly 20% (fast food) to 40% (hotels) to more than 50% (airlines and certain destination-based entertainment.)\n> \n> Obviously, none of these industries by themselves comprise UBER's exact customer base, but taken collectively, they are representative of what has happened to the total addressable market: it is severely impaired.\n> \n> Selected Peer Group Performance 2020\n> \n> Throughout the latest strategy retreat, 25% work force reduction, revenue collapse, junk debt capital raise, and multi-billion dollar cash burn, one thing stands out: UBER’s high flying stock, which has surged this week along with the NASDAQ market to a new high for the year of $59 billion, now up 16% on the year. Stated another way, stock buyers have treated COVID-19 and its catastrophic impact on UBER’s revenues and margins as a net positive catalyst. This stands in stark contrast to the many other companies operating in and round UBER’s universe, including hotels, airlines, lodging, office space, and even other “unicorns\".\n> \n> We highlight the 2020 changes in valuation of numerous companies that derive revenues from similar underlying strategic drivers as UBER: commuting to work, commuting to airports, commuting to leisure activities, commuting to restaurants and bars, and commuting to vacation. We lay out the year to date equity returns, followed by consensus changes to 2020 forecast revenues. Every data point indicates UBER’s valuation change is completely inconsistent with its related peer group.\n> \n> First, we frame UBER’s equity valuation change year to date, along with the consensus expectation for 2020 Revenues, and list how they have changed, showing the January 1, 2020 consensus estimate, followed by the current 2020 consensus estimate.\n> \n> As you can see, UBER is up 16% year to date, while its 2020E Revenue expectations have been reduced by 29%.\n> \n> \n> \n> Then, we turn to the various comparably impacted industries, as described above. We start with Airlines, as airports are a primary source and destination of UBER customers, and note the average hit to airline valuation has been 66%, while the average expected hit to revenues in 2020 has been 56%.\n> \n> \n> \n> Next, we look at Hotels, a common destination and origin for UBER customers, where you can see the average hotel has taken a 39% valuation hit, while the expected revenue decline is 40%.\n> \n> \n> \n> Office REITS, which we also use as a proxy of demand for commuting to work, have seen an average 42% decline in valuation, with only a 5% hit to revenues. Here, the financial forecasts are out of sync with the change in valuation. Even the out years look similar. Expect the numbers to come down, significantly.\n> \n> \n> \n> Restaurants are a large and fractured group, and we chose McDonalds as simply a directional indicator:\n> \n> \n> \n> And finally, the still-private “unicorns”, who bear much structural similarity to UBER, particularly AirBnB which also was forced to fire 25% of its work force, and to reduce its strategic scope to “core” operations while giving up on growth opportunities. Here, you will see that AirBnB recently took a 52.6% hit to its private market valuation since 2019, and WeWork took a 60% hit to its December 2019 valuation (which was itself an 84% hit to its January 2019 valuation). AirBnB’s CEO also wrote a letter that sounds nearly identical to UBER’s CEO “I’m-sorry-but-you’re-fired, our business is collapsing” letter.\n> \n> \n> \n> The overall context should be clear: UBER's entire ecosystem has experienced a volume and valuation collapse compared to UBER's year to date double digit stock price growth. This stock price growth is inconsistent with the underlying data.\n> \n> We specifically concede that none of these companies are perfect comparables, but all derive revenues from a similar ecosystem: the home-work-travel-leisure nexus, and their customers must be transported somehow to their offices, their hotels, their airports, and their leisure AirBnB vacations. Together, they paint a picture: UBER’s equity price has largely ignored the reality of a collapsed ecosystem, and is the only related equity that not only has not collapsed, but is actually UP double digits on the year.\n> \n> Will UBER’s business come back? Absolutely, some of it will come back. The travel/airline/hotel transport nexus actually has the highest probability of coming back, but the longest lead time. These won’t see even a near-full recovery for several years, in line with forecasts for hotel and airlines revenue. The most at risk revenue is actually related to work commuting: many employers are in the process of shifting to permanent work-from-home arrangements. UBER will never recover this revenue. Much of the work commute revenue IS NEVER COMING BACK. Thus, UBER's TAM has shrunk.\n> \n> UBER's Core, or The Remaining Businesses\n> \n> What do the taxi-hail, or Rides, and Eats businesses really look like on a stand-alone basis? What are they worth?\n> \n> UBER shows a separate revenue and \"adjusted\" EBITDA figure for each of its remaining core businesses.\n> \n> Here is a snapshot of historical revenue breakdown:\n> \n> As you can see, the Rides business represents 72% of total revenues, and its growth has flat-lined near zero. Now, this included 2 weeks post-COVID shutdown, so we can assume it may have been able to reach a positive low single digit growth number. Eats grew at a low double digit number, and represents around 19% of total revenue.\n> \n> EBITDA is not as straightforward, as many adjustments and exclusions are made. What we know with certainty is that the consolidated business produced negative $2.468 billion of EBITDA for the last 12 months. As for segments, UBER shows a positive $2.460 billion of Rides EBITDA, but that excludes more than $4.0 billion of stock-based compensation, and it also excludes more than $2.5 billion of un-allocated corporate overhead. See worksheet below:\n> \n> \n> \n> The exclusions are of such a magnitude as to render the supposed $2.46 billion of EBITDA to be nearly meaningless. Could they have generated this without paying out $4.0 billion in stock compensation? Did the $2.5 billion spent on general and administrative, and R&D have any impact on the Rides business? Of course it did. These numbers can no more be excluded than any business can disown its business expenses!\n> \n> So we have a 11-year old business whose top line growth has settled in around a low single digit number that currently loses $2.5 billion a year in consolidated EBITDA. Should they cut $1.0 billion of costs, that is helpful, but the enterprise would still be losing more than $1.0 billion on an adjusted-EBITDA basis. The Eats business loses money and remains hyper-competitive. It is likely to continue to lose money for the foreseeable future.\n> \n> So where could UBER's EBITDA number go? This is difficult to say. UBER is hoping to break even on an adjusted-EBITDA basis sometime next year. While I am doubtful that will happen, even it it did, we would have a low growth business in a highly competitive market that at some point in the future could grow that break-even EBITDA into a billion or a few billion of EBITDA. What is that worth? We can look at a range, but unless growth suddenly shoots back into the 20% range or higher, its hard to see a slow growing EBITDA in such a simple business with no barriers to entry commanding a double digit EBITDA valuation multiple. Let's call the midpoint 10x. So 10x 2022E or 2023E EBITDA of $1.0 or $2.0 billion is $10 - $20 billion of enterprise value. And remember, that while UBER can shut down much of its non-core growth/upside assets, it can not simply get rid of its $9BN debt pile, including the recently raised $1.0 billion of junk debt that pays a steep 7.5% coupon.\n> \n> If we generously ignore the Eats losses, assume net debt in 2 years will be maybe $4 - $6 billion, and the share count remains the same (which is overly conservative), then we are left with the following valuation, which indicates an equity value that ranges from $2 to $11:\n> \n> $ billions\t\t\n> Valuation\t2022E\t2023E\n> Adjusted Company EBITDA\t$1.0\t$2.0\n> Multiple\tEnterprise Value\n> 8.0x\t$8.0\t$16.0\n> 9.0x\t$9.0\t$18.0\n> 10.0x\t$10.0\t$20.0\n> 11.0x\t$11.0\t$22.0\n> 12.0x\t$12.0\t$24.0\n> Less:\t\t\n> Net Debt\t($4.0)\t($4.0)\n> Equity Value\t\t\n> 8.0x\t$4.0\t$12.0\n> 9.0x\t$5.0\t$14.0\n> 10.0x\t$6.0\t$16.0\n> 11.0x\t$7.0\t$18.0\n> 12.0x\t$8.0\t$20.0\n> Shares Outstanding (billions)\t1.734\t\n> Equity Value per Share\t\t\n> 8.0x\t$2.31\t$6.92\n> 9.0x\t$2.88\t$8.07\n> 10.0x\t$3.46\t$9.23\n> 11.0x\t$4.04\t$10.38\n> 12.0x\t$4.61\t$11.53\n> (Note, these multiples are very high for a time period that is at least 2 years into the future.)\n> \n> Conclusion\n> \n> The market is wrongly ascribing a $59 billion equity valuation for a Company that is collapsing its workforce, reigning in its growth ambitions, and signaling much diminished growth in the future, while it bleeds down cash to the tune of more than $5BN a year. It is faced with a nearly insurmountable $9 Billion junk debt pile.\n> \n> With this week's announcements of strategy retrenchment and narrowing of its business opportunity, UBER is potentially worth $2.31 to $11.63 per share, compared to its current $34.48 price.\n> \n> Disclosure: I am/we are short UBER. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\n>",
        "created_utc": 1590156629.0,
        "subreddit_name": "investing",
        "comments": 360
    }
]