[
    {
        "title": "These are the stocks on my watchlist (7/10) ",
        "score": 263,
        "url": "https://www.reddit.com/r/stocks/comments/1dzv8fh/these_are_the_stocks_on_my_watchlist_710/",
        "content": "Hi! I am an ex-prop trader who trades equities.\n\nThis is a daily watchlist for trading.\n\nI might trade all the stocks on here, or none of them, on any given day. I might trade stocks that do not appear on here! I hold no positions in any stocks long-term but Amazon/Mag7/general broad market indices. (unless otherwise noted in these tickers). If you are on old reddit, click “show images” at the top to see all the charts quickly.\n\nI usually make these watchlists premarket, but can be delayed if I am trading the open. These are not mean to be taken as gospel or any recommendation to buy/sell.\n\nMany stocks I post are <$500M market cap. These are potentially good candidates to day trade; I have no opinion on them as investments. PLEASE ask specific ones. Questions like “Thoughts on _____?” will be ignored unless you add detail to the question. “Is ___ a good investment?” will be ignored. I will block you if you are a troll.\n\nNews: [Powell Flags Rising Risks to Jobs While Avoiding Rate-Cut Timing](https://www.bloomberg.com/news/articles/2024-07-09/powell-says-more-good-inflation-data-would-boost-fed-confidence)\n\n- [LZ](https://finviz.com/quote.ashx?t=LZ&p=d) - Cut full year revenue guidance, new CEO change announced, and cut FCF revenue guidance.\n- [TXG](https://finviz.com/quote.ashx?t=TXG&p=d) - ILMN acquiring Fluent Biosciences, TXG down due to acquisition.\n- [TSLA](https://finviz.com/quote.ashx?t=TSLA&p=d) - Has been on a tear for the past few days- bearish bias. Trading out of line with Mag 7 (which is expected due to car sale numbers), but will be looking for appropriate places to short if they occur.\n- [TSM](https://finviz.com/quote.ashx?t=TSM&p=d) - Reported Q2 revenue last night in Taiwan, beating market forecasts due to AI boom. Strong growth in Q2. T$673.51B vs T$654.27B in revenue, (32% growth YoY). \n- [AAPL](https://finviz.com/quote.ashx?t=AAPL&p=d) - Still watching to see what we’ll do at the $230 level, but other than that not going to play this short.\n- [AMZN](https://finviz.com/quote.ashx?t=AMZN&p=d) - And again, watching AMZN. Another day of higher lows. Currently long.\n",
        "created_utc": 1720616543.0,
        "subreddit_name": "stocks",
        "comments": 50
    },
    {
        "title": "How far do you think we are in the AI stock market hype cycle?",
        "score": 82,
        "url": "https://www.reddit.com/r/investing/comments/1e0az9h/how_far_do_you_think_we_are_in_the_ai_stock/",
        "content": "Early stages? Mid stages? Late stages?\n\nTech valuations are getting very rich, to their second-highest levels ever, even during the current 15+ year secular bull market (March 2009-present) marked by tech sector outperformance.\n\n- Apple: $3.6 trillion, 36x earnings\n\n- Microsoft: $3.5 trillion, 41x earnings\n\n- NVIDIA: $3.3 trillion, 79x earnings\n\nRight now, we’re still in a stage of the mania where simply saying “AI” is enough to make a stock rocket higher. Since unveiling Apple Intelligence on June 10, Apple stock has risen by 21% ($700 billion) on analyst predictions of an “upgrade supercycle.” Moderna stock shot up 60% higher in May after announcing a partnership with Open AI.\n\nEventually, this will give way to a “show me the money” phase in which investors need to see actual profits to sustain these valuations. But clearly we’re not there yet. For the companies selling shovels in the current gold rush (NVIDIA, TSMC, etc.) they’re generating spectacular earnings right now, but the question is how sustainable they’ll be for the longer term. Wall Street has their earnings growth priced in as being permanent.\n\nPossible turning points:\n\nApple will release its AI-enhanced iPhone 16 this autumn. If sales are weak, it’ll be clear that consumers aren’t as jazzed up about AI as markets are predicting. But the last few years haven’t had any notable upgrades at all, so there could still be an upgrade cycle.\n\nOn the corporate side, it’s harder to predict. Corporations including financial services & other non-tech industries have been willing to pay Microsoft & Open AI hand over fist because it’s the latest hot technology; mentioning AI boosts their stock prices; and they’re always looking for ways to boost efficiency.\n\nFor Big Tech, there’s a widespread belief that this is a can’t-fail arms race, given the winner-takes-all nature of the industry. Therefore, it’s possible that even if consumers aren’t too hyped about AI, Big Tech corporations will gladly continue to pay NVIDIA billions every year. Especially since M&A has grinded to a halt due to regulatory scrutiny, they have to find something to do with all this money.\n\nCentral banks:\n\nOn top of all this, you have central banks around the world itching to ease and pump markets higher. Alan Greenspan’s 1995 rate cuts likely extended the life of the first Internet bubble by a few years. But at least he recognized it was a bubble and popped it in 2000 by raising rates, even as inflation was below-target & decelerating. Jerome Powell, who’s worth over $50 million and highly invested in stocks, has said he’d do no such thing, and only high inflation can lead to more rate hikes.\n\n—\n\nWhat are your thoughts? How high will the market & tech valuations go? Will this lead to a market crash or a new plateau?\n\n",
        "created_utc": 1720655859.0,
        "subreddit_name": "investing",
        "comments": 158
    }
]