[
    {
        "title": "According to a Morgan Stanley analyst, the Optimus robots at Tesla's cybercab event were tele-operated by humans.",
        "score": 4145,
        "url": "https://www.theverge.com/2024/10/13/24269131/tesla-optimus-robots-human-controlled-cybercab-we-robot-event",
        "content": "",
        "created_utc": 1728862330.0,
        "subreddit_name": "stocks",
        "comments": 271
    },
    {
        "title": "Intel CEO: Intel foundry business now have 12 active customer engagements",
        "score": 642,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1g2pkxs/intel_ceo_intel_foundry_business_now_have_12/",
        "content": "Intel CEO Pat Gelsinger recently did an in-depth interview with Goldman Sachs, in which he shared a lot of insight of Intel current and upcoming progress.\n\n( you can watch it full here:  [https://www.youtube.com/watch?v=PhWJ3CDt2-w](https://www.youtube.com/watch?v=PhWJ3CDt2-w) )\n\nI'll highlight some very interesting insights:\n\n* Intel 18A process, the fifth and final node in \"Five Nodes in Four Years\" promise, is now finalized, 1.0 Process Design Kit (PDK) sent to customers in July. And mass production starts before the end of the year.\n* First products will be Panther Lake (client) and Clearwater Forest (server) in 2025. The process yield is healthy (with Defect Density below 0.4).\n* In phase one they were aggressive in pushing the company to compete (with TSMC and others), he now announced they are moving to the second phase, becoming profitable. Intel is working on cost-efficiency and nimble operations (aka milking every cent out of all those multi-billion investments).\n* Pat also revealed that Intel Foundry (18A node) has 12 active customer engagements and 8 product tape-ins expected by 2025. We know that both [Microsoft ](https://www.reuters.com/technology/intel-expects-overtake-tsmc-making-fastest-chips-this-year-2024-02-21/)and [Amazon](https://www.reuters.com/technology/intel-aws-expand-strategic-collaboration-chip-manufacturing-2024-09-16/) have officially announced switching to using Intel 18A for their upcoming custom AI chips, that leaves 10 mysterious customers ( there has been rumors of [NVIDIA](https://www.pcgamer.com/hardware/processors/nvidias-suspected-2025-processor-is-now-rumoured-to-be-built-by-intel-using-off-the-peg-arm-cores-yes-an-nvidia-chip-built-by-intel/) & [Qualcomm ](https://www.reuters.com/technology/intel-build-qualcomm-chips-aims-catch-foundry-rivals-by-2025-2021-07-26/)so far).\n* Talked about cost reduction strategy (15,000 Layoffs and $10 Billion in savings).\n* There is strong demand on Intel advanced packaging products (EMIB & Foveros). And for those who don't know, just like TSMC's CoWoS, there is insane demand in packaging segment right now (and in many cases it's the bottleneck for AI chip production, along with HBM memory)\n* In phone call with SEC of Department of Commerce, said, they are lamenting that people aren't more concerned about the supply resilience after the COVID chip shortage shock, and there is a need to diversify their supply chains away from Asia.",
        "created_utc": 1728825861.0,
        "subreddit_name": "wallstreetbets",
        "comments": 131
    },
    {
        "title": "Strong AI and Semiconductor weeks ahead",
        "score": 75,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1g30ztz/strong_ai_and_semiconductor_weeks_ahead/",
        "content": "Hi all,\n\nI think that AI and esp. Semiconductor Stocks have a couple of strong weeks ahead. Starting on Tuesday, October 15th 2024, the [Open Compute Project (OCP) global summit](https://www.opencompute.org/summit/global-summit) takes place in San Jose, California. Between 9 AM and 11:30 AM there'll be short keynotes (each 12 mins) presented by Meta, NVidia, AI Clusters, Intel, AMD, Microsoft and Google (full schedule [here](https://2024ocpglobal.fnvirtual.app/a/schedule/#)). Now, I don't think that there'll be any big surprises. But the Summit still presents an opportunity for public remarks about how strong the demand is or what so ever. Also, there's an [article ](https://finance.yahoo.com/news/broadcom-inc-avgo-showcase-cutting-104612051.html?guce_referrer=aHR0cHM6Ly9maW5hbmNlLnlhaG9vLmNvbS9xdW90ZS9BVkdPLz9fZ3VjX2NvbnNlbnRfc2tpcD0xNzI4ODU0NDU2&guce_referrer_sig=AQAAAKqTmr_oqY7_RMid-YuYH-NWHYEacoobdBjWziLlvZPiA7iILBRd-lo7X9KXAZjgy5w-h3UleFvekLyyq8_xnp6qPaiSm_Zcbts2F5zfEtE-6faSgzbLuTu-_jZFaA5wXE26LZR81IYJnp9F3qqNZ_r7RkXaZ8GLTsvPT3HSz-1B&_guc_consent_skip=1728854471)that says that Broadcom (AVGO) is going to show case cutting-edge AI infrastructure.\n\nFurther it is expected that Taiwan Semiconductor Company (TSM) and ASML Holding (ASML) will publish their Q3 earnings next week. TSM will present its earnings on [October 17th 2024 at 14:00 Taiwan time / 02:00 Eastern Time](https://investor.tsmc.com/english/quarterly-results/2024/q3). So pre-market movements will most likely be wild on Thursday as a large part of the industry relies on TSM.\n\nIf TSM reports a great Q3 revenue, this could push Nvidia over the current all time high. Also according to Moore's law is dead, the first RTX 5000 series GPUs are ready to be sold, but are not released because of business reasons ([here ](https://www.youtube.com/watch?v=sZmki-4xaWE)at 22:22). So they could still change their mind and ship in Q4.\n\nNext, it is [rumored (by moore's law is dead) ](https://www.youtube.com/watch?v=EbEPwJvtA5M)that AMD will release a new CPU by the end of October or early November, the 9800X3D which is an 8 Core Gaming CPU with 3D cache and it is expected that it will be the fastest gaming CPU releasing this year. Although Client is not as important for AMD, it will still be beneficial to have this CPU released before the holiday season. Especially since Zen5 Rysen has so far been viewed as rather disappointing. Moore's law is dead also mentions an RX 7650 GRE GPU, which could launch alongside Ryzen 9800X3D. Releasing a slightly refreshed and cheap RDNA3 GPU could be a good move by AMD to get rid of RDNA3 stock ahead of the RDNA4 launch in 2025. Since the Ryzen 9800X3D has not yet been anounced, I don't think that it has been priced in and could give the stock a slight boost to recover from the -4% last Thursday.\n\nAlso, I although Investors were not excited about AMDs Advancing AI event, I think AMDs position in the market is still solid. According to the slides shown at the event, AMD Epic has increased its market share to 34%. And according to [tests ](https://www.techpowerup.com/327600/amd-epyc-turin-with-192-cores-and-384-threads-delivers-almost-40-higher-performance-than-intel-xeon-6)AMD Epyc Turin obliterates Xeon 6 Granite Rapids, while being cheaper. Because of this, I think AMD is in a good position to gain more server market share. Further, the news about [Nvidia Blackwell being sold out for the next 12 Months](https://www.datacenterdynamics.com/en/news/nvidias-blackwell-gpus-sold-out-for-12-months/) is not only good news for Nvidia but also for AMD. Sure, everyone wants blackwell. but if one can't get blackwell and if AMD Instinct MI325X is faster than Nvidia Hopper (H200), then they might be able to win over customers from nvidia, who would like to buy blackwell but can't in due time.\n\nAlso, AMDs earnings should be reported on October 29 2024. Due to Ryzen Zen5 being disappointing and there being apparently a large RDNA3 stock remaining.\n\nIf AMDs Instinct systems are selling well, this would also be good news for Micron Industries (MU), which produces high bandwith memory (HBM3e).\n\nAnd then there's Intel. Their newest releases seem to have been disappointing. But they claim to be making progress with their foundries.\n\nSo I'm going Calls on Semiconductor Stocks (NVDA, AMD, MU, AVGO, TSM, ARM)\n\nThoughts or objections?",
        "created_utc": 1728856816.0,
        "subreddit_name": "wallstreetbets",
        "comments": 42
    },
    {
        "title": "Part 3: Archer Aviation is Going to Pick Up Major News from Japanese Airlines (JAL) and Sumitomo Because of Volocopter's Insolvency",
        "score": 61,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1g2w8rw/part_3_archer_aviation_is_going_to_pick_up_major/",
        "content": "Insolvency is one hell of a word that nobody wants to hear but here we are. Volocopter is a German Advanced Air Mobility AAM company that has fallen on some bad times as of lately. Here's what we know. The silence is deafening and there is blood in the waters. \n\nVolocopter had a direct relationship with investors such as Mercedes Benz-Group, Geely (also backing EHang), and Japanese Airlines JAL specifically via Sumitomo Group. Sumitomo group has invested millions into Volocopter through multiple funding rounds and most recently a Series E funding round that concluded March 4, 2023. \n\nTo date, Volocopter is ahead and behind in so many ways regarding the eVTOL AAM business. Volocopter is positioned in the Asia markets nicely in collaboration with Geely in China and Singapore obtaining flight agreements with local aviation authorities to integrate eVTOL services within Singapore's urban transport network. Geely, gives them potential of market entry into China. All seem like good news and blue sky's ahead. Not so fast. \n\nThe other Asian entry point is from JAL and Japanese conglomerate Sumitomo. This is where things start to get real interesting because the background news for JAL, Sumitomo, Volocopter, Mercedes, Geely, and Archer Aviation has been decimenting at a dizzying pace. The news for Volocopter and VoloCity is not good news for Volocopter at all. \n\nThis information broke on a Japanese website and was alerted to me on another reddit sub. [https://xtech.nikkei.com/atcl/nxt/column/18/02892/100200027/?n\\_cid=nbpnxt\\_twbn](https://xtech.nikkei.com/atcl/nxt/column/18/02892/100200027/?n_cid=nbpnxt_twbn) The site is in Japanese but you can translate it. The funny thing is it was not picked up by any US news sites as of yet. The news is telling and potentially disastrous for Volocopter. \n\n**10.04.2024 Sumitomo changes aircraft from Volocopter to Archer Aviation...** \n\n>Figure 1: Status of each company's investigation published by the Japan Association for the 2025 World Exposition The big change is that JAL's flight operations have been taken over by **Soracle**, a company jointly established by JAL and Sumitomo Corporation, and **the aircraft used has been changed from Germany's Volocopter to the U.S. company Archer Aviation**. Incidentally, Marubeni is also considering using aircraft from the U.S. company Lift Aircraft (Source: Japan Association for the 2025 World Expo).\n\n>The major change from the status of consideration disclosed in August 2023 is that the flight operations that were previously planned to be carried out solely by Japan Airlines (JAL) will be taken over by Soracle, a new company jointly established by JAL and Sumitomo Corporation in June 2024. **In addition, the aircraft to be used has been changed from the Volocopter-type eVTOL (electric vertical take-off and landing) aircraft \"VoloCity\" from Germany's Volocopter to the fixed-wing aircraft \"Midnight (M001)\" from Archer Aviation of the United States** ( **Figure 2** ).\n\nArcher Aviation has not reported on this news yet. There has been nothing but silence. Why? \n\nBecause of this I did some digging. Let's start with Volocopter. Why the switch? Turns out that Volocopter is going through a lot of turbulence right now. Remember, Volocopter is a private company so getting a lot of details is difficult but one can read the tea leaves. \n\nThe first sign of real trouble is none other than the Paris Olympics where Volocopter was supposed to have its day in the sun. The setup couldn't have been more perfect for Volocopter eVTOL AAM entry point into the Asian and European air transportation markets. French President Emmanuel Macron was supposed to fly one from right inside central Paris as the first commercial eVTOL flying passenger. That never happened and in short, Dirk Hoke and Volocopter fumbled the ball or rather, pooched the kick. I don't know many european phrases for \"they fucked it up\". \n\nFor some reason, Dirk Hoke and Volocopter thought that their 2 seater eVTOL/AAM in which 1 seat is a pilot and the other is a passenger was going to make it through the European Aviation Safety Agency EASA in time for the Paris Olympics. It did not and the eVTOL demonstration was scaled back significantly leaving perhaps a death blow to the eVTOL maker. \n\nThe fallout has been severe whilst coming from multiple angles and corresponding investment groups related to Volocopter. Reports started flying (more flight puns) that dreams were dashed and Volcopter failed to deliver. \n\n[August 8, 2024 France 24:](https://www.france24.com/en/live-news/20240808-paris-flying-taxi-test-flights-scrapped-during-olympics)\n\n# Paris scraps plans for Olympic ‘flying taxis’\n\n>Despite initial promises, so-called 'flying taxis' will not be circling above Paris during the Olympic Games this summer. German manufacturer Volocopter Thursday said it has scrapped test flights of the 18-rotor drones that resemble small helicopters over delays in the certification for the vehicle’s engine.\n\n>Volocopter CEO Dirk Hoke said the delay was due to \"an American supplier who was not capable of providing what he had promised\".\n\n>He said the motors would be sent back to France next week but not in time for the test flights to be held in Paris before the Olympics close.\n\n[August 9, 2024 Axios:](https://www.axios.com/2024/08/09/air-taxis-olympic-moment-whats-next) \n\n>**Why it matters:** Air taxis were supposed to be [zipping over Paris](https://www.youtube.com/watch?v=HAJQ1t6ErMg) during the past two weeks, but the electric aircraft — which take off and land vertically — still need regulatory approval.\n\n>**Driving the news:** One such company, Archer Aviation, plans to launch a Los Angeles air mobility network as early as 2026, it announced yesterday.\n\n[August 11, 2024 AP News reported:](https://apnews.com/article/olympics-2024-paris-flying-taxis-82af3b21726dc6ebbc99da076b98d14b) \n\n# Air taxis failed to get certified for the Paris Olympics. There’s still hope for LA 2028 (ACHR, JOBY)\n\n[August 12, 2024 Flying Mag:](https://www.flyingmag.com/modern/air-taxis-missed-paris-olympics-goal-could-they-soar-in-la/)\n\n# Air Taxis Missed Paris Olympics Goal—Could They Soar in LA?\n\n>Hoke said the issue traces back to “an American supplier who was not capable of providing what he had promised.”\n\n[August 28th, 2024 Wired:](https://www.wired.com/story/the-dream-of-flying-taxis-in-paris-failed-to-take-off/)\n\n# The Paris Olympics Promised Flying Taxis—Here’s Why They Failed to Launch\n\n>Futuristic plans for tourists to fly over Paris stalled as critics derided flying taxis as an “absurd” invention that will “only benefit a few ultrarich people.”The Paris Olympics Promised Flying Taxis—Here’s Why They Failed to Launch\n\n>Publicly, Volocopter was careful not to credit the public backlash with the setback, instead [blaming](https://www.france24.com/en/live-news/20240808-paris-flying-taxi-test-flights-scrapped-during-olympics) an American supplier for “not \\[being\\] able to provide what it had promised,” as well as its failure to win approval from the EU Aviation Safety Authority to operate commercially.\n\n**Et tu, Brute**\n\nThis would not be the first time the Europeans have called out us Americans for being late (see WWII) but the onslaught of bad press here was too much to bare for CEO Dirk Hoke and Volocopter going forward. To put it nicely, they're fucked. \n\nI don't if you caught the repeated blaming by former, now transitioning, CEO Dirk Hoke of an anonymous \"American Supplier\" who seemingly did not deliver a part is the sole reason why they did not obtain EASA Type Certification. I get that this happens in hardware and hardware and manufacturing is well HARD. I understand that but the notion that your entire premises of existence is on a single American part is ridiculous and as my father used to tell me; I don't want to hear excuses. \n\nAgain, the fallout from here would prove to be severe for both Dirk Hoke and Volocopter. For Dirk Hoke's part [he is out as CEO of Volocopter](https://www.volocopter.com/en/newsroom/volocopter-to-undertake-leadership-changes). For Volocopter somewhere in the news cycle [via news publication The Air Current the words considering Insolvency and \"finding new funding\"](https://theaircurrent.com/feed/dispatches/volocopter-secures-new-funding-from-existing-investors/) has entered the chat; or rather the venture capital news corners. \n\nIt's so bad that [Dirk Hoke has already found another job as of September 18, 2024](https://www.waterpowermagazine.com/news/dirk-hoke-appointed-as-new-ceo-of-voith-group/). \n\n>Dirk Hoke has been appointed as the new President and Chief Executive Officer (CEO) of Voith GmbH & Co. KGaA. The Voith Management GmbH [Shareholders’ Committee](https://voith.com/corp-en/company/company-overview/supervisory-board.html) announced that Hoke will assume the role no later than April 1, 2025. \n\nTo this day, while there are new board members on Volocopter from Mercedes (former Daimler AG) and Geely China there has been no news on acquiring a new CEO for the role. \n\n>[Volocopter to Undertake Leadership Changes](https://www.volocopter.com/en/newsroom/volocopter-to-undertake-leadership-changes): September 2, 2024\n\n>Dr. Dieter Zetsche, former CEO Daimler AG, appointed as Chairman of the Advisory Board\n\n>Dr. Zhihao Xu, CEO of Geely Technology Group, joins the Advisory Board\n\n>CEO Dirk Hoke to step down from his role in February 2025 at his own request\n\n**The GREAT News for Archer**\n\nTo me, it is very telling that NO NEW CEO has been appointed to Volocopter. Where does all that Series Funding from A - E GO? Sumitomo in that news article as of 10/4/2024 seemingly backed out of Volocopter and  is now dealing with Archer Aviation. \n\nEven though Volocopter is private you can track their balance sheet roughly through [Crunchbase ](https://www.crunchbase.com/organization/volocopter/company_financials)and other sources. They roughly have $579 million of investment from investors, including Geely, WP Investment, Mercedes-Benz Group, Intel Capital, and BlackRock as[ reported in their initial Series E funding round for $170 million](https://www.volocopter.com/en/newsroom/series-e-financing-round). But you'll notice that they had a ridiculously long funding roundt that turned into a big Japanese pivot by the end - [Volocopter in Japan](https://www.volocopter.com/en/newsroom/japan-series-e-regulatory-pathway). So if we're tracking, the Series E funding round went from March 4, 2022 to March 4, 2023 concluding on the Japanese JAL Sumitomo news. \n\nTo put it in perspective, OpenAI's funding round started in October 2, 2024 and concluded in 2024. \n\nThe notion that Volocopter took an entire year to close a funding round can only mean one thing. Stipulations and milestones. And I mean stipulations and clauses like you've never imagined a contract could have. You don't deliver TYPE certification we're taking our money back. You don't do this, we're taking our money back. You don't do that, we're taking our investment back. Or, they never really got the investment in the first place through not reaching milestones. \n\nThe tea leaves are easy to follow here. You close Series E funding by the Japanese Osaka Asian corridor. You promise and underdeliver for the Paris Olympics and blame the Americans. You don't receive TYPE Certification from EASA on time. All of this has lead to Japan now pulling the rug and the seemingly that $579 million investment is no longer Volocopter's.\n\nThat's how I read these tea leaves. Moreover, Archer has not given any recognition to the news that was laid out by that Japanese news paper. One can only surmise that the deal(s) are still being worked out by Archer, JAL, and Sumitomo. Something is there obviously but we just don't know exactly what. \n\nNews on this, should be breaking soon if not immentily. \n\nIn the least, I would imagine Archer gets to take over any investment once promised to Volocopter from JAL/Sumitomo Group and is the reason Volocopter is in an absolute death spiral of solvency need. At the most, perhaps this is an opportunity for the first eVTOL AAM merger where Archer takes the entire investment, more investment, and portions of the Volocopter IP to obtain a larger Asian corridor presence in China and other premium Asian markets outside of just Japan. \n\nI hate to say it but for Volocopter this makes a lot of sense. The 2 seater aircraft is bland and uninspiring. It doesn't yield the future but rather some teenagers scaled up a DJI drone and tried to make it a company. I hate to give the brutal take there but that is what their passenger aircraft looks like. The other parts of their business seem much more promising and practical like the transport drones and object delivery eVTOL plans. Leading with a 2 seater eVTOL is DOA in my opinion but they do have interesting pieces for sure such as an already up and running smaller size manufacturing plant located in Bruchsal, Germany. \n\nThis DD is highly speculative and is based on assumptions and news articles that are leading but not anything definitive. After, Joby's Toyota announcement I believe Archer is cooking up their own major news announcement that coincides with their own regulatory approvals from the U.S. FAA, specifically the SFAR.\n\n The other news here worth noting is specifically what Japan Airlines has been doing in the eVTOL space. The company that I mentioned [Sumitomo Corporation and JAL jointly establish an eVTOL operating company as of June 3, 2024 named Soracle.](https://www.sumitomocorp.com/en/jp/news/topics/2024/group/20240603) \n\n>Sumitomo Corporation has been pursuing commercialization in air mobility services since 2018 as it seeks to diversify its longstanding aviation business. In 2020, as part of efforts to develop this new market in Japan, it invested in a company developing an air traffic control system for unmanned aircraft that will be critical when integrating these mobility services into society.\n\n>JAL aims to create relationships and social connections through the movement of people and goods by leveraging the technology, observations, and operational expertise it has accumulated in the air transportation business to operate air mobility services and further develop its business in Japan.\n\n>JAL and Sumitomo Corporation entered into a business alliance in the air mobility sector in 2020 (\\*2) and have been working toward the realization of eVTOL-based mobility services. In addition, the two companies are undertaking studies and making preparations (\\*3) for the development of a next-generation air mobility business, including participation in the \"Public-Private Committee for Advanced Air Mobility, Air Mobility Revolution and Social Implementation – The Osaka Roundtable (\\*4), which positions Expo 2025 Osaka, Kansai, Japan as a milestone toward the social implementation of air mobility services.\n\n>The establishment of Soracle will leverage the strengths of both companies. This includes Sumitomo Corporation’s airline industry network and the expertise it has built up through diversified business activities and JAL’s expertise in safe air transport operations. The new company will provide opportunities to further strengthen Sumitomo Corporation and JAL's cooperative relationship, and accelerate their respective air mobility initiatives through the operation of eVTOL services.\n\n>Both companies aim to realize the social implementation of safe and reliable eVTOLs, build a transportation network connecting the regions and create new value through mobility in the sky.\n\nSo all of this [once planned excitement for JAL and Volocopter](https://www.businesstraveller.com/business-travel/2021/10/26/japan-airlines-plans-evtol-operations-from-2025/) is now being shifted to Archer Aviation. What else may become shifted to Archer in the Asian Markets? \n\n**October 26, 2021**\n\n>JAL said that eVTOL “is expected to play an active role in a wide range of fields, such as Air Taxi services, emergency lifesaving and disaster response, taking advantage of its mobility similar to that of a helicopter”.\n\n>“JAL, as a professional aviation company, aims to create a prosperous and sustainable society through safe and secure comprehensive air mobility operations,” the carrier continued.\n\n>“Utilizing our expertise in air mobility operations, we will provide next-generation transportation and mobility infrastructure that meets the needs of local communities, and promote initiatives to achieve the SDGs while solving local issues in areas such as disaster response and medical care.”\n\n>Last year Japan Airlines signed a cooperation agreement with German aircraft manufacturer Volocopter (pictured) “to promote the development of the Urban Air Mobility industry for next generation air transportation options of passengers and goods”.\n\nWaiting for this news to break any day now. \n\nI am building shares at the current cost basis of $2.85 and \\~$3.10. I am also building calls in the 1/17/2025 and April time frame. I am no longer adding to my October 18th calls. ",
        "created_utc": 1728844026.0,
        "subreddit_name": "wallstreetbets",
        "comments": 111
    }
]