[
    {
        "title": "Apple admits that iMessage for Android was killed to keep its walled garden",
        "score": 7129,
        "url": "https://www.androidpolice.com/2021/04/08/apple-admits-that-imessage-for-android-was-killed-to-keep-its-walled-garden/",
        "content": "",
        "created_utc": 1617937266.0,
        "subreddit_name": "apple",
        "comments": 1137
    },
    {
        "title": "Morning Update for Friday, 04/09/21",
        "score": 243,
        "url": "https://www.reddit.com/r/Daytrading/comments/mngnlr/morning_update_for_friday_040921/",
        "content": "Good morning everyone.\n\n*This list is geared towards day trading. With the small cap stocks especially, I am typically in and out very quickly, only occasionally longer than 5 minutes, usually faster scalps.* I am also constantly watching the candlestick charts and observing price action and volume, and you should be doing the same if you want to trade these stocks. Always have a plan when you enter a trade (for profit taking and for taking a loss), and use proper risk management.\n\n**Main Watchlist**\n\n* Gapping UP: MARA, RIOT, CELC, GLSI, FUBO, ASO, LEVI, SOHU, UTME\n* Gapping DOWN: BA, PTON, NIO, JKS, UCTT, RICE, GSL\n\n**Momentum Watchlist**\n\n1. AFMD (+34%): Up after announcing positive initial clinical data. Good volume and decent price action in premarket, with possible support around the 10.00 level. \n2. TENX (+22%): Up after announcing publication of positive data from phase 2 help study. Seeing good volume and price action in premarket, I'll be watching to see if the momentum continues. \n3. LHDX (+15%): Up on news that their test kit can successfully identify COVID variants. I'll want to see volume pick up a bit more. I'll want to see it get back up to the 9.75 level before I consider trading it.\n4. GURE (+12%): Up after reporting earnings yesterday. Showing some weakness in price action at the moment, I'll want to see it get back to around the 6.00 level before I consider trading it. \n5. GOVX (+9%): Couldn't find a relevant catalyst. Seeing okay volume and price action, I'll want to see volume pick up a bit. Premarket high of 5.34. \n\nI'll be running my screener a few times after market open to see what's moving after market open. Make sure to stay disciplined and not chase trades. \n\n**Market Outlook**\n\nStocks are looking at a mixed open this morning. SPY is trading around 408, still hovering around ATH levels. Bitcoin is currently trading around 58,500, and I'll be watching for potential movement to the upside. Bitcoin-related stocks are up in premarket, and I'll be keeping an eye on them throughout the day. Tech stocks are down in premarket, which makes sense considering the run they have seen the past few days. Marijuana stocks are trading higher in premarket, and I'll be keeping an eye on them into next week. Gold and silver are trading lower this morning, with crude oil also down a bit. I'll be watching for some choppiness heading into the weekend, but business as usual until we actually see some weakness. Meme stocks have been quiet for a bit now, but I'll still be keeping an eye on them. \n\nRemember to use proper risk management, make sure you size appropriately for your account, and have a plan for every trade you enter (both for taking profits and cutting losses). Happy trading everyone :)",
        "created_utc": 1617973191.0,
        "subreddit_name": "Daytrading",
        "comments": 47
    },
    {
        "title": "AAPL hold",
        "score": 11,
        "url": "https://www.reddit.com/r/AAPL/comments/mn7wym/aapl_hold/",
        "content": "recently bought a bunch of apple stocks to hold for 5-7 years. Hopefully its not a bad move!\n\nim pretty retarded when it comes to stocks tho\n\nhttps://preview.redd.it/i1bjmgx7a2s61.png?width=1010&format=png&auto=webp&s=98937e11bbe0db2a3ad5126434e12b36a1201221",
        "created_utc": 1617936493.0,
        "subreddit_name": "AAPL",
        "comments": 14
    }
]