[
    {
        "title": "Google to buy nuclear power for AI datacentres in ‘world first’ deal",
        "score": 528,
        "url": "https://www.reddit.com/r/stocks/comments/1g47oik/google_to_buy_nuclear_power_for_ai_datacentres_in/",
        "content": "https://www.theguardian.com/technology/2024/oct/15/google-buy-nuclear-power-ai-datacentres-kairos-power\n\nGoogle has signed a “world first” deal to buy energy from a fleet of mini nuclear reactors to generate the power needed for the rise in use of artificial intelligence.\n\nThe US tech corporation has ordered six or seven small nuclear reactors (SMRs) from California’s Kairos Power, with the first due to be completed by 2030 and the remainder by 2035.\n\nGoogle hopes the deal will provide a low-carbon solution to power datacentres, which require huge volumes of electricity.\n\nThe US company, owned by Alphabet, said nuclear provided “a clean, round-the-clock power source that can help us reliably meet electricity demands”.\n\nThe explosive growth of generative AI, as well as cloud storage, has increased tech companies’ electricity demands.\n\nLast month, Microsoft struck a deal to take energy from Three Mile Island, activating the plant for the first time in five years. The site, in Pennsylvania, was the location of the most serious nuclear meltdown in US history, in March 1979. Amazon bought a datacentre powered by nuclear energy in March from Talen Energy.\n\nThe locations of the new plants and financial details of the agreement were not revealed. Google has agreed to buy a total of 500 megawatts of power from Kairos, which was founded in 2016 and is building a demonstration reactor in Tennessee, due to be completed in 2027.\n\nMichael Terrell, the senior director for energy and climate at Google, said: “The grid needs new electricity sources to support AI technologies that are powering major scientific advances, improving services for businesses and customers, and driving national competitiveness and economic growth.\n\n“This agreement helps accelerate a new technology to meet energy needs cleanly and reliably, and unlock the full potential of AI for everyone.”\n",
        "created_utc": 1728998805.0,
        "subreddit_name": "stocks",
        "comments": 76
    },
    {
        "title": "ASML plummets 11% after releasing disappointing earnings, lowering revenue and gross margin guidance for the full year",
        "score": 511,
        "url": "https://www.reddit.com/r/stocks/comments/1g49oyi/asml_plummets_11_after_releasing_disappointing/",
        "content": "ASML shares are falling -11% in a matter of minutes as it reported Q3 bookings of €2.63B, versus the estimate of €5.39B, while 2025 sales are seen at €30-35B, versus estimates of €35.94B.  Other Semiconductor companies are falling in sympathy. AMD -5%, NVDA -4%, AVGO -4%\n\n  \nPress Release:\n\n  \n**ASML reports €7.5 billion total net sales and €2.1 billion net income in Q3 2024**  \n**ASML expects total net sales for 2024 of around €28 billion**\n\nVELDHOVEN, the Netherlands, October 15, 2024 – Today, ASML Holding NV (ASML) has published its 2024 third-quarter results.\n\n* Q3 total net sales of €7.5 billion, gross margin of 50.8%, net income of €2.1 billion\n* Quarterly net bookings in Q3 of €2.6 billion^(2) of which €1.4 billion is EUV\n* ASML expects Q4 2024 total net sales between €8.8 billion and €9.2 billion, and a gross margin between 49% and 50%\n* ASML expects 2024 total net sales of around €28 billion\n* ASML expects 2025 total net sales to be between €30 billion and €35 billion, with a gross margin between 51% and 53%",
        "created_utc": 1729004278.0,
        "subreddit_name": "stocks",
        "comments": 281
    },
    {
        "title": "Semis take a hit after news on limiting exports ",
        "score": 128,
        "url": "https://www.reddit.com/r/stocks/comments/1g49o6s/semis_take_a_hit_after_news_on_limiting_exports/",
        "content": "The semi industry is taking a hit after news about possible limits to exports.  See the article for more information on what is going on.  I just found it and wanted to get thoughts from the community about the news. \n\n\nPlease share your thoughts about the article and possible implications over the next few months.  \n\nhttps://finance.yahoo.com/news/us-weighs-capping-exports-ai-004651596.html\n\n(Bloomberg) -- Biden administration officials have discussed capping sales of advanced AI chips from Nvidia Corp. and other American companies on a country-spe...",
        "created_utc": 1729004223.0,
        "subreddit_name": "stocks",
        "comments": 44
    }
]