[
    {
        "title": "To all of you who are red this year while the S&P500 is up 30%",
        "score": 5849,
        "url": "https://www.reddit.com/r/stocks/comments/rrhoka/to_all_of_you_who_are_red_this_year_while_the/",
        "content": "Lately I keep hearing the same old narrative from beat-down investors on r/stocks who are down YTD even when SPY is up 30%: \"everything is down this year, the indexes are just being propped up by mega-cap tech companies like AAPL, TSLA, MSFT, GOOGL, and NVDA\".  They go on to say that just because they are down this year and indexes are up, it's actually not that bad because the mega-caps are hiding the true state of the market.\n\nWell, let's look at the data shall we...\n\nHere are the YTD gains of a whole bunch of indexes from all the industries that I could think of, most of which don't have many of the aforementioned mega-caps in it:\n\nVGT: +32.99% (Technology)  \nXLF: +34.87% (Financial)  \nXLE: +47.15% (Energy)  \nXLI: +22.38& (Industrials)  \nXLV: +24.99% (Healthcare)  \nDBC: +43.37% (Commodities)  \nPAVE: +37.90% (Infrastructure)  \nAVUV: +42.18 (Small Cap Value)  \nSCHD: +27.87% (Dividends)  \nSMH: +43.21% (Semiconductors)  \nITA: +13.16% (Aerospace and Defense)  \nTRVL: +6.82% (Travel)\n\nAs can be seen, every major sector of the market is green for the year.  Even travel and aerospace, two of the hardest hit sectors, are up YTD.  Every single other sector is up at least 20%.  It would take an objectively bad investment plan to pick only losers out of this sea of green.\n\nSo can we please stop with the BS that a handful of companies are propping up a dying market.  If you are down this year, you really need to review your investing decisions because you are almost certainly investing in companies with poor fundamentals that have been driven entirely by hype and/or trading options in a way that is pure gambling.  I just hope that you are taking the right lessons away from this year.  Please consider putting the majority of your money into broad market index funds.\n\nWishing everyone a successful 2022!",
        "created_utc": 1640809337.0,
        "subreddit_name": "stocks",
        "comments": 1164
    },
    {
        "title": "AAPL 2022 Overview",
        "score": 6,
        "url": "https://www.reddit.com/r/AAPL/comments/rrk4b4/aapl_2022_overview/",
        "content": "Apple is a backbone to a successful portfolio with calls 6 months out and holding shares are the best play. Nothing can stop the company from future growth. Next year will be huge for the Mac, iPhone, and VR. Apple is a computer company at the core and will release it's most powerful chips and most powerful work stations ever. iPhone will get a redesign and iPad should see some updates. AAPL is the biggest stock in the market and will continue to grow to $10 trillion price target may take a couple years but eyes on the prize. Short term ascending wedge bullish. Good luck and make that apple cash $$$$\n\nhttps://preview.redd.it/qb7ec8ja1k881.jpg?width=1510&format=pjpg&auto=webp&s=6f88a674acf72cc69bb8aa4e9bf6584fdc3c64e3",
        "created_utc": 1640815453.0,
        "subreddit_name": "AAPL",
        "comments": 6
    }
]