[
    {
        "title": "Nvidia to join Dow Jones Industrial Average, replacing Intel",
        "score": 1175,
        "url": "https://www.reddit.com/r/stocks/comments/1ghghq5/nvidia_to_join_dow_jones_industrial_average/",
        "content": "Nvidia is replacing Intel on the Dow Jones Industrial Average, a shakeup to the blue-chip index that replaces a flagging semiconductor company with the primary vendor of GPUs for AI.\n\nThe switch will take place on Nov. 8. In a separate move, Sherwin Williams will replace Dow Inc in the average as well, S&P Global said in a statement.\n\nShares of Nvidia have climbed over 180% so far in 2024 as investors have seen the company as the primary beneficiary of the AI boom.\n\nOn the other hand, Intel shares have fallen 51% so far this year as the company struggles with manufacturing, new competition for its central processors, and the impression that it has missed out on the AI trend.\n\nThe Dow contains 30 components and is weighted by the share price of the individual stocks instead of the companies total market value.\n\nSource: https://www.cnbc.com/2024/11/01/nvidia-to-join-dow-jones-industrial-average-replacing-intel.html",
        "created_utc": 1730496690.0,
        "subreddit_name": "stocks",
        "comments": 137
    },
    {
        "title": "Amazon CEO pledges AI investments will pay off as capital expenditures surge 81%",
        "score": 403,
        "url": "https://www.reddit.com/r/stocks/comments/1ggtl3k/amazon_ceo_pledges_ai_investments_will_pay_off_as/",
        "content": "Amazon CEO Andy Jassy is trying to reassure investors who may be worried about the future payoff of the company’s massive investments in generative artificial intelligence.\n\nOn a conference call with analysts following the company’s third-quarter earnings report on Thursday, Jassy pointed to the success of Amazon’s cloud computing business, Amazon Web Services, which has become a crucial profit engine despite the extreme costs associated with building data centers.\n\n“I think we’ve proven over time that we can drive enough operating income and free cash flow to make this a very successful return on invested capital business,” Jassy said. “We expect the same thing will happen here with generative AI.”\n\nAmazon spent $22.6 billion on property and equipment during the quarter, up 81% from the year before. Jassy said Amazon plans to spend $75 billion on capex in 2024 and expects an even higher number in 2025.\n\nThe jump in spending is primarily being driven by generative AI investments, Jassy said. The company is rushing to invest in data centers, networking gear and hardware to meet vast demand for the technology, which has exploded in popularity since OpenAI released its ChatGPT assistant almost two years ago.\n\n“It is a really unusually large, maybe once-in-a-lifetime type of opportunity,” Jassy said. “And I think our customers, the business and our shareholders will feel good about this long term that we’re aggressively pursuing it.”\n\nAI spending was a big topic on tech earnings calls this week. Meta on Wednesday raised its capital expenditures guidance, and CEO Mark Zuckerberg said he was “quite happy” with the team’s execution. Meanwhile, Microsoft’s investment in OpenAI weighed on its fiscal first-quarter earnings released on Wednesday, and the company said capital spending would continue to rise. A day earlier, Alphabet CFO Anat Ashkenazi warned the company expects capital spending to grow in 2025.\n\nAmazon has said its cloud unit has picked up more business from companies that need infrastructure to deploy generative AI models. It’s also launched several AI products for enterprises, third-party sellers on its marketplace and advertisers in recent months. The company is expected to announce a souped-up version of its Alexa voice assistant that incorporates generative AI, something Jassy said will arrive “in the near future.”\n\nAmazon hasn’t disclosed its revenue from generative AI, but Jassy said Thursday it’s become a “multi-billion-dollar revenue run rate” business within AWS that “continues to grow at a triple-digit year-over-year percentage.”\n\n“It’s growing more than three times faster at this stage of its evolution as AWS itself grew, and we felt like AWS grew pretty quickly,” he added.\n\nSource: [https://www.cnbc.com/2024/10/31/amazon-ceo-pledges-ai-investments-will-pay-off-as-capex-surges-81percent.html](https://www.cnbc.com/2024/10/31/amazon-ceo-pledges-ai-investments-will-pay-off-as-capex-surges-81percent.html)",
        "created_utc": 1730421881.0,
        "subreddit_name": "stocks",
        "comments": 76
    },
    {
        "title": "BlackRock launches ETF that expands beyond the ‘Magnificent Seven’",
        "score": 145,
        "url": "https://www.reddit.com/r/stocks/comments/1gh4zwd/blackrock_launches_etf_that_expands_beyond_the/",
        "content": "https://www.cnbc.com/2024/10/31/megacap-tech-gets-new-blackrock-etf.html\n\n\n> BlackRock’s iShares is trying to appeal to investors who want to diversify beyond from the so-called Magnificent Seven. The firm launched the iShares Top 20 U.S. Stocks ETF (TOPT) this month. It doesn’t just hold the Magnificent Seven — Apple, Amazon, Meta, Alphabet, Microsoft, Nvidia and Tesla. It’s made up of the 20 largest U.S. stocks by market capitalization. “What the iShares build ETFs are designed to do is to deliver a tool kit of simple solutions for investors to be able to capture the growth of some of the largest companies within the U.S. equity market today, but to do so in a broader and more diversified manner,” BlackRock’s Rachel Aguirre told CNBC’s “ETF Edge” on Monday.\n\n> Aguirre, the firm’s head of U.S. iShares product, noted the ETF’s mission is to deliver an easy and accessible way to tap into the innovation of megacaps – “whether that be in the tech-heavy Nasdaq space or, more broadly, within the S&P [500].” The ETF, according to Aguirre, provides a way for investors worried about the concentration of the Magnificent Seven stocks in the S&P 500.\n\n> On Thursday, the Magnificent Seven slid more than 3.5% as a group — losing around $615 billion in market cap. That’s equivalent to the size of JPMorgan Chase. However, the Magnificent Seven is still up about 43% so far year while the S&P 500 is up around 20% “It’s important for clients and investors to remember that there are split views on this topic. There are many investors who believe that the big will get bigger [and] that the winners will continue to win,” Aguirre said. “There’s also another side to this argument. There are many investors who believe that it’s actually a very worrisome time to continue investing in… mega-cap companies because of just their high valuations.”",
        "created_utc": 1730466592.0,
        "subreddit_name": "stocks",
        "comments": 57
    },
    {
        "title": "r/Stocks Daily Discussion & Fundamentals Friday Nov 01, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/stocks/comments/1gh1fyy/rstocks_daily_discussion_fundamentals_friday_nov/",
        "content": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.\n\nExpect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nBut growth stocks don't rely so much on EPS or revenue as long as they beat some other metric like subscriber count:  Going from 1 million to 10 million subscribers means more revenue in the future.\n\nValue stocks do rely on earnings reports, investors look for wall street expectations to be beaten on both EPS & revenue.  You'll also find value stocks pay dividends, but never invest in a company solely for its dividend.\n\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia page](https://www.investopedia.com/fundamental-analysis-4689757/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp) and read [their PDF on the topic.](http://i.investopedia.com/inv/pdf/tutorials/fundamentalanalysis_intro.pdf)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1730453408.0,
        "subreddit_name": "stocks",
        "comments": 226
    },
    {
        "title": "spgi or VOO? how do i know what the best s&p or index fund is to invest in?",
        "score": 1,
        "url": "https://www.reddit.com/r/stocks/comments/1ghep0w/spgi_or_voo_how_do_i_know_what_the_best_sp_or/",
        "content": "hey! i'm new to investing and just wanted advice on what the best stocks to invest in are, i have a roth IRA through merrill. right now im invested in VOO SPGI, amazon, SOXX and a couple others. sold some of my google shares which was stupid. but just wanted to know what i should put my money in. i’m relatively young so i know i have time. but i really want to learn as much as possible. if you have any good advice on general stocks or on these 2 specific ones im referring to please share!!",
        "created_utc": 1730491904.0,
        "subreddit_name": "stocks",
        "comments": 24
    },
    {
        "title": "Why is META struggling after such strong earnings?",
        "score": 0,
        "url": "https://www.reddit.com/r/stocks/comments/1ghgp2x/why_is_meta_struggling_after_such_strong_earnings/",
        "content": "The company had really strong earnings and solid growth. Multiple price upgrades, yet it’s failing to catch any of the rebound across tech today. \n\nPerhaps it’s related to what might happen after the election if Trump wins? He’s always been a critic of Facebook with republicans attacking them for censorship. \n\nSo I’m curious why it’s reacted so poorly to solid earnings, big upside projections. What do you think?",
        "created_utc": 1730497216.0,
        "subreddit_name": "stocks",
        "comments": 43
    },
    {
        "title": "Microsoft's AI Business Grows Rapidly, On Its Way to Hitting $10 Billion",
        "score": 58,
        "url": "https://www.mechical.com/2024/11/microsofts-ai-business-grows-rapidly.html",
        "content": "",
        "created_utc": 1730472955.0,
        "subreddit_name": "wallstreetbets",
        "comments": 6
    },
    {
        "title": "Onto Innovation - good to invest?",
        "score": 1,
        "url": "https://www.reddit.com/r/investing/comments/1gh8txv/onto_innovation_good_to_invest/",
        "content": "Is this a good company to invest right now? Why is it 100% buy recommendation? Q3 earnings are out and it looks good but why does the price keeps declining?\n\nWhy is no one talking about this company? It went up this year up to $230+ but then suddenly drop again.\n\nExtracted from Investing.com\n\nCompany Outlook\nQ4 revenue forecast between $253 million and $267 million, with gross margins of 54% to 55%.\nOperating expenses projected to be between $66 million and $68 million.\nInventory expected to decrease by $8 million to $10 million, dropping below $300 million by end of Q4.\nStrong demand anticipated in the first half of 2025, particularly in AI packaging and logic markets\n\nKey Takeaways\nRecord Q3 revenue of $252 million, up 22% year-over-year.\nGross margin reported at 54.5%.\nRecord cash generation of $67 million from operations.\n$10 million delay in JetStep lithography revenue; however, inspection revenue is expected to nearly double this year.\nStrategic acquisitions to expand addressable market and revenue potential.\nPositive outlook for 2025, with strong demand in advanced packaging and process control.\n\nLet me know your thoughts on this.",
        "created_utc": 1730476848.0,
        "subreddit_name": "investing",
        "comments": 11
    },
    {
        "title": "Disney forms dedicated AI and XR group to coordinate company-wide use and adoption",
        "score": 1,
        "url": "https://www.reddit.com/r/investing/comments/1ghhpbl/disney_forms_dedicated_ai_and_xr_group_to/",
        "content": "https://www.engadget.com/entertainment/disney-forms-dedicated-ai-and-xr-group-to-coordinate-company-wide-use-and-adoption-205011787.html\n\n> It has tapped Jamie Voris, previously the CTO of its Studios Technology division, to oversee the effort. Before joining Disney in 2010, Voris was the chief technology officer at the National Football League. More recently, he led the development of the company’s Apple Vision Pro app. Voris will report to Alan Bergman, the co-chairman of Disney Entertainment. Reuters reports the company eventually plans to grow the group to about 100 employees",
        "created_utc": 1730500050.0,
        "subreddit_name": "investing",
        "comments": 0
    },
    {
        "title": "What are the best resources for research?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1gh2e47/what_are_the_best_resources_for_research/",
        "content": "I'm a few years into investing, and I've mainly invested in ETFs the entire time. I've made money, but would also like to start researching individual stocks. This is usually discouraged, but I would research stocks in industries I know, like tech, web, and pharma. For example, I made almost as much with my 10% of individual stocks as I did with all 90% of my ETFs. I know I got a bit lucky buying into NVDA relatively early, but I've built my own computers for two decades and always considered them a solid company. However, I didn't predict the need for Nvidia cards during the AI boom. \n\nMore recently, I have been watching RDDT since its IPO. When it sank to 40.00 shortly after the IPO, I felt it was undervalued and a bargain at that price. One significant predictor for me was that most of my google searches would autocomplete with “reddit” on the end of it. Those were my two huge winners out of nine stocks total. Now, I want to invest around 20-25% in individual stocks, but besides a company's financials, I'm unsure where to find the best independent research, free or paid. Any suggestions you might have would be greatly appreciated. ",
        "created_utc": 1730457580.0,
        "subreddit_name": "investing",
        "comments": 9
    },
    {
        "title": "Chinese researchers develop AI model for military use on back of Meta's Llama",
        "score": 114,
        "url": "https://www.reuters.com/technology/artificial-intelligence/chinese-researchers-develop-ai-model-military-use-back-metas-llama-2024-11-01/",
        "content": "",
        "created_utc": 1730490362.0,
        "subreddit_name": "news",
        "comments": 19
    },
    {
        "title": "Apple Shoots for the Stars: Expanded Globalstar Deal Signals Big Moves in Satellite Tech",
        "score": 68,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gh5xq1/apple_shoots_for_the_stars_expanded_globalstar/",
        "content": "Apple’s latest move in satellite services could be a game-changer, following an expanded partnership with Globalstar that sent Globalstar's stock surging by 64%. This update builds on their existing arrangement, now aimed at expanding the scope and scale of satellite services for Apple users. This strategic collaboration taps into Globalstar's satellite capabilities, potentially positioning Apple as a stronger player in emergency communication services and beyond. As demand grows for reliable, on-the-go connectivity, especially in remote areas, Apple’s foray into satellite tech signals its ongoing push to integrate groundbreaking communication tech directly into its products.\n\n[https://spacenews.com/apple-loans-globalstar-252-million-for-satellite-enabled-iphones/](https://spacenews.com/apple-loans-globalstar-252-million-for-satellite-enabled-iphones/)\n\n",
        "created_utc": 1730469233.0,
        "subreddit_name": "wallstreetbets",
        "comments": 37
    },
    {
        "title": "Small balls SBUX DD",
        "score": 27,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1ghcp1l/small_balls_sbux_dd/",
        "content": "My last few DDs were telling everyone to buy RDDT when it was in the 50s and 60s. Congrats to the minority of people that agreed with me and followed.\n\nHave a much lower reward but high confidence DD here for Starbucks.\n\nStarbucks has been shitting the bed lately, dropping in sales in the US and China. The stock gained back all of their losses when they hired the Chipotle CEO. Now SBUX is priced at 27 P/E which means the market is literally pricing in him not only stopping the bleeding but turning it back to growth. For the stock to go up, the turnaround would have to be fast and dramatic.\n\nBrian Niccol, the new CEO does have an amazing track record, but here's why he has no chance. The guy only has US experience, and even if he helped Starbucks do a 180 in the US, it won't be enough. Starbucks no longer has an \"aspirational\" factor in China, Chinese people in general are turning against US brands except where the product is clearly exceptional (Apple). Starbucks is basically selling worse tasting drinks for 3x the price of competitors in China and nothing any CEO can do will stop the brand from collapsing there. \n\nThe play -> sell a few Jan 2026 110 calls. It's basically free money.",
        "created_utc": 1730486643.0,
        "subreddit_name": "wallstreetbets",
        "comments": 30
    },
    {
        "title": "Lost 23k$",
        "score": 26,
        "url": "https://i.redd.it/gizjctfjmbyd1.jpeg",
        "content": "You can see the exact moment where I started options trading -\nNvidia crash\nEarnings crash\nMeta and apple calls earnings crash\nI no longer have anything left to do options\nBack to Wendy’s 🐒🥲\n(Gonna stop trading altogether). ",
        "created_utc": 1730480351.0,
        "subreddit_name": "wallstreetbets",
        "comments": 23
    },
    {
        "title": "Apple expands iPhone satellite services deal, commits $1.1bn to expand capacity ",
        "score": 2326,
        "url": "https://9to5mac.com/2024/11/01/apple-expands-iphone-satellite-services-deal/",
        "content": "",
        "created_utc": 1730467152.0,
        "subreddit_name": "apple",
        "comments": 201
    },
    {
        "title": "M4 Pro Mac Mini will be Apple’s fastest desktop Mac, eclipsing the M2 Ultra Studio and Mac Pro",
        "score": 1387,
        "url": "https://9to5mac.com/2024/11/01/new-mac-mini-m4-pro-geekbench/?fbclid=IwY2xjawGRgmJleHRuA2FlbQIxMQABHdB7WBL2a0ges_bYrnku5khZaNrCme5wWVEUly_qYfYs0XSpNaRFzN9Y9w_aem_Y1W7qgDRDxrgERZ4z5pNAQ",
        "content": "",
        "created_utc": 1730454395.0,
        "subreddit_name": "apple",
        "comments": 331
    },
    {
        "title": "iPhone 17 and 'iPhone 17 Air' Again Rumored to Feature 120Hz ProMotion Displays",
        "score": 1254,
        "url": "https://www.macrumors.com/2024/11/01/ltpo-for-all-iphone-17-models-report/",
        "content": "",
        "created_utc": 1730498616.0,
        "subreddit_name": "apple",
        "comments": 249
    },
    {
        "title": "A new home for Pixelmator | Today we have some important news to share: the Pixelmator Team plans to join Apple.",
        "score": 1157,
        "url": "https://www.pixelmator.com/blog/2024/11/01/a-new-home-for-pixelmator/",
        "content": "",
        "created_utc": 1730475311.0,
        "subreddit_name": "apple",
        "comments": 335
    },
    {
        "title": "iPhone sales are booming — with or without Apple Intelligence",
        "score": 1056,
        "url": "https://www.theverge.com/2024/10/31/24284854/apple-q4-2024-earnings-iphone-16-ai",
        "content": "",
        "created_utc": 1730448947.0,
        "subreddit_name": "apple",
        "comments": 267
    },
    {
        "title": "Apple vs Adobe at AI photo clean up: Apple is clearly better",
        "score": 766,
        "url": "https://petapixel.com/2024/10/31/apple-vs-adobe-one-is-clearly-better-at-ai-photo-clean-up/",
        "content": "",
        "created_utc": 1730469568.0,
        "subreddit_name": "apple",
        "comments": 113
    },
    {
        "title": "Apple launches new iPhone 14 service program for ‘Rear Camera Issue’ ",
        "score": 384,
        "url": "https://9to5mac.com/2024/11/01/apple-iphone-14-repair-program/",
        "content": "",
        "created_utc": 1730504101.0,
        "subreddit_name": "apple",
        "comments": 24
    },
    {
        "title": "Apple relies on GlobalStar satellites for places where there's no cell phone signal - The Verge",
        "score": 302,
        "url": "https://www.theverge.com/2024/11/1/24285347/apple-globalstar-investment-expansion-emergency-sos-satellite",
        "content": "",
        "created_utc": 1730487483.0,
        "subreddit_name": "apple",
        "comments": 39
    },
    {
        "title": "The 70w usb-c charger is listed as compatible to Mac mini (2024)",
        "score": 179,
        "url": "https://www.apple.com/shop/product/MXN53AM/A",
        "content": "Does this means it can be powered by usb-c or more of just typo? ",
        "created_utc": 1730419353.0,
        "subreddit_name": "apple",
        "comments": 62
    },
    {
        "title": "Daily Advice Thread - November 01, 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/apple/comments/1gh1ucr/daily_advice_thread_november_01_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1730455244.0,
        "subreddit_name": "apple",
        "comments": 39
    },
    {
        "title": "Apple commits $1.5 billion to Globalstar for expanded iPhone satellite services",
        "score": 299,
        "url": "https://www.cnbc.com/2024/11/01/apple-commits-1point5-billion-to-globalstar-for-iphone-satellite-services.html",
        "content": "",
        "created_utc": 1730474514.0,
        "subreddit_name": "technology",
        "comments": 15
    },
    {
        "title": "Indonesia blocks Google Pixel sales after ban on iPhone 16",
        "score": 237,
        "url": "https://techcrunch.com/2024/10/31/indonesia-bans-google-pixel-sales-after-iphone-16-block/",
        "content": "",
        "created_utc": 1730444169.0,
        "subreddit_name": "technology",
        "comments": 39
    },
    {
        "title": "Can we appreciate how Mac mini retains an internal PSU and ethernet port! (iMac does not)",
        "score": 2218,
        "url": "https://i.redd.it/fv8k0lh7dcyd1.png",
        "content": "",
        "created_utc": 1730489459.0,
        "subreddit_name": "mac",
        "comments": 212
    },
    {
        "title": "Got tired of cutting myself ",
        "score": 2047,
        "url": "https://www.reddit.com/gallery/1ggyhqa",
        "content": "…on the edge of my MacBook Air M2.",
        "created_utc": 1730439215.0,
        "subreddit_name": "mac",
        "comments": 368
    },
    {
        "title": "BIG ecosystem upgrade 😍",
        "score": 964,
        "url": "https://i.redd.it/ryv7n4harayd1.jpeg",
        "content": "\nMacBook Pro intel 2015 8GB 512GB —> MacBook Pro M3 Pro 36GB 1TB \n\nIPad Air 2014 —> iPad Air 2024 \n\niPhone 11 —> iPhone 16 Pro\n\n\nDid a big upgrade on almost my whole ecosystem! Only left alone Apple Watch SE, which I don’t even use, and AirPods Pro. \n\nThe Pro and the iPad served me for NINE years!! And they are still going strong if I only needed to take notes, watch videos, emails etc. \n\nBut I needed a new laptop purely because of my music production needs and 8GB were getting on my nerves. Couldn’t get anything done \n\nUpgraded the iPad because I needed more space for books and wanted to use Apple Pencil to take notes as I am about to study for 2 degrees at two different schools and don’t want to bring the Pro along. \n\niPhone… honestly upgraded because of the camera 😂 and because I needed more space and to use the 250$ gift cards I got from my other purchases ahah \n",
        "created_utc": 1730469844.0,
        "subreddit_name": "mac",
        "comments": 75
    },
    {
        "title": "First mac!",
        "score": 194,
        "url": "https://i.redd.it/rep4uk4ye7yd1.jpeg",
        "content": "I knew the MacBook M4 chip would be out this week so l waited to get this Apple Certified refurbished 15\" M3 16GB RAM 256GB SSD (I'm getting external ssd later, I know). Mostly will be using for college (accounting major). Their refurbished stuff is basically like a new one and I'm very happy with my purchase!",
        "created_utc": 1730429383.0,
        "subreddit_name": "mac",
        "comments": 11
    },
    {
        "title": "Sooo … we‘re getting Aperture back?",
        "score": 127,
        "url": "https://www.reddit.com/r/mac/comments/1ghahdu/sooo_were_getting_aperture_back/",
        "content": "https://www.theverge.com/2024/11/1/24285443/apple-pixelmator-acquisition-image-editing",
        "created_utc": 1730480984.0,
        "subreddit_name": "mac",
        "comments": 66
    },
    {
        "title": "How long did it take you to get used to Mac os coming from windows",
        "score": 16,
        "url": "https://www.reddit.com/r/mac/comments/1ghcir1/how_long_did_it_take_you_to_get_used_to_mac_os/",
        "content": "Basically as the title says. Im already in the apple eco system with phone and airpods and the new MacBook mini M4 has peaked my interest. I've never used Mac os and the YouTube videos I've watched I'm finding everything a bit confusing.\n\nEdit- thanks for your input, appreciate it",
        "created_utc": 1730486184.0,
        "subreddit_name": "mac",
        "comments": 98
    },
    {
        "title": "Any clue what could have damaged my MacBook Pro 14\" screen?",
        "score": 16,
        "url": "https://www.reddit.com/gallery/1gh5sec",
        "content": "",
        "created_utc": 1730468808.0,
        "subreddit_name": "mac",
        "comments": 18
    },
    {
        "title": "Mac Mini M4 - Beginner question (Lightroom)",
        "score": 7,
        "url": "https://www.reddit.com/r/mac/comments/1ghe8tj/mac_mini_m4_beginner_question_lightroom/",
        "content": "I’m pretty tech-savvy, but I’m totally out of my depth when it comes to Apple products. I’ve only ever used Linux or Windows. My wife’s a wedding photographer, though, and we agreed she’s going to switch to Apple for editing.\n\nI’ve been looking at the new Mac Mini M4 because of the price, and I’m thinking of getting the base model with 256GB storage and 16GB RAM. I know 256GB won’t be enough, but how hard is it to just use a 2TB external SSD for working with her photos? Would there be a big performance drop if it’s not on local storage? Also, I have no clue which SSDs work well with Apple and which are actually good.\n\nFor backups, we’re set up with a 16TB NAS, so that’s not an issue.",
        "created_utc": 1730490718.0,
        "subreddit_name": "mac",
        "comments": 21
    },
    {
        "title": "Is this yellow tint normal?",
        "score": 5,
        "url": "https://www.reddit.com/gallery/1gh5neg",
        "content": "Hi all I picked up 2 thunderbolt displays last year. I can’t really remember if they looked like this when I picked them up, as it’s been almost a year. I don’t use them as my desk doesn’t have the space, and I’m not sure how I’m going to place it. I bought it because they were a good price, and I wanted to pair it with my 2013 MP but currently I’m not using either. Today I picked up thunderbolt 3 to 2 dongle and thunderbolt 2 to 2 cable for a good price. I tested it with my MBP M1 Pro, and the screen seemed a little yellowed. Pic one and two are two different displays. So I’m not sure if it’s normal for these old displays to have a light yellow tint to them and on the chin or my eyes just so used to the MBP display iPhone oled where white is white. \n\nAlso, due to a little poor storage, both has a few molds on the lcd itself. Pic 1 aka display 1 always had a cardboard on it and display 2 aka pic 2 didn’t as the glass was already dirty. Any recommendations on cleaning it? I mean, like what cleaning solution or can I use my 99% Isopropyl alcohol on the lcd directly? Thanks for reading. ",
        "created_utc": 1730468413.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Mac reads dual monitors as one monitor?",
        "score": 5,
        "url": "https://www.reddit.com/r/mac/comments/1gh2pdu/mac_reads_dual_monitors_as_one_monitor/",
        "content": "I have a MacBook Pro connected to a Lenovo Hub that will only read my dual monitor setup as one monitor, so that they mirror each other. \n\nThe hub is a good quality and my OS is up to date, I can’t for the life of me figure out why I can’t extend my desktop on both monitors.  \n\nEdit:\nThe Mac is a 2020 MacBook Pro 13” with the intel core i5\nThe Hub is a Thinkpad Thunderbolt 3 Workstation Gen 2\n\nI know it supports dual monitors because it works fine for my work computer. Just wondering if it’s incompatible with MAC or I need to change something. ",
        "created_utc": 1730458863.0,
        "subreddit_name": "mac",
        "comments": 12
    },
    {
        "title": "Apple Server",
        "score": 5,
        "url": "https://www.reddit.com/r/mac/comments/1ggy4f9/apple_server/",
        "content": "Anyone think Apple will get into r&d’ing a silicone based multi cpu server? \n\nWould it be feasible, is the market wanting something like this, would Apple let you run user installed controller/bare metal installs. \n\nJust a shower thought.  ",
        "created_utc": 1730437655.0,
        "subreddit_name": "mac",
        "comments": 13
    },
    {
        "title": "Too many Macs. How to best consolidate.",
        "score": 5,
        "url": "https://www.reddit.com/r/mac/comments/1ghfekt/too_many_macs_how_to_best_consolidate/",
        "content": "In 2020 I bought my wife and I a 13\" M1 MPB and a 13\" M1 MacBook Air, both with 16GB RAM.\n\nIn 2022 I was hired by a startup that bought me a 16\" MBP M1 Max  with maxed specs, with 64GB or RAM. The startup failed. I got to keep this amazing machine. \n\nNow I'm about to start a new position. I'm going to get a new MPB that will be for work only. \n\nI really prefer the 13\" size for my personal machine. I don't know if I want to lug around the 16\" everywhere I go. \n\nIdeally I'd sell the 16\" MBP from my old job, but I can't imagine I'd actually get near what it's worth. Apple is offering ~$1,150 to trade it in. I have a hard time believing I could fetch more for it listing it myself.\n\nMy wife would like to upgrade her MacBook Air. I'm thinking about trading in the MBP 16\" and the 13\" MacBook Air and just getting my wife the best new MacBook Air with that credit. \n\nWhat would you do? Do you have any advice? \n\nTo summarize.\n\nWhat I have:\n\n- 13\" MacBook Air (wife wants to upgrade)\n- 13\" MacBook Pro (this is still perfect as my personal computer) \n- 16\" MacBook Pro: M1 Max, 64GB RAM (no use for this)\n- 16\" MacBook Pro: Work only.\n\nWhat I want:\n- Replacement for my wife's MacBook Air\n- I'd also be happy with cash if there's somewhere I could actually get ~$2,000 for the MacBook Pro",
        "created_utc": 1730493799.0,
        "subreddit_name": "mac",
        "comments": 11
    },
    {
        "title": "Monitor recs for new Mini m4",
        "score": 4,
        "url": "https://www.reddit.com/r/mac/comments/1gh4srb/monitor_recs_for_new_mini_m4/",
        "content": "Just ordered a mini and now need to figure out which monitor to pair with it. Helpfully, the 2 I was looking at from Costco just went on sale (I’d prefer to buy from Costco due to returnability). Costco has no 5k, but in 4k they have a 32” LG 32UN650K-W.AUS for $240, and a 32” Samsung LU32J59DUQNXZA is $220. Any preference between these 2?\n\nIt appears the input for both is HDMI: is that going to hobble the connection to the mini? Are there any non-“Apple studio display” options that have Thunderbolt inputs (or whatever the mini outputs from). \n\nAlso: I’m just using this for office/web, not gaming, video editing or even streaming Netflix. \n\nHere is the link to each:\n\nhttps://www.costco.com/LG%2032%22%20Class%20Ultrafine%20UHD%20IPS%20Monitor.product.4000287902.html?NATAPP=SEARCH&COSTID=iosapp_24.10.3&TRACKING=NO&sh=true&nf=true\n\nhttps://www.costco.com/Samsung%2032%22%20Class%20ViewFinity%20UJ59%204K%20UHD%20Monitor.product.4000296342.html?NATAPP=SEARCH&COSTID=iosapp_24.10.3&TRACKING=NO&sh=true&nf=true",
        "created_utc": 1730466046.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "14” vs 16” MacBook Pro M4: Best for Moderate Video Editing?",
        "score": 6,
        "url": "https://www.reddit.com/r/mac/comments/1gguurx/14_vs_16_macbook_pro_m4_best_for_moderate_video/",
        "content": "I'm debating whether to get the **14-inch** or **16-inch MacBook Pro** with the **M4** chip and could use some advice. I mainly do video editing, focusing on 1080p projects that run up to 30 minutes. I’m confident the M4 chip is powerful enough for my needs, but my main concern is the RAM. Would 24GB be sufficient, or should I consider upgrading to 32GB or even 48GB for moderate video editing?\n\nAdditionally, I'd love to hear your opinions on display size. Which size do you prefer for video editing, and how practical do you find it to use around the house (on the sofa, in bed, etc.)? I’m drawn to the idea of a larger screen but am curious about how it balances portability and comfort.\n\nThanks in advance for your insights!",
        "created_utc": 1730425922.0,
        "subreddit_name": "mac",
        "comments": 16
    },
    {
        "title": "M4 Macbook for Pro Tools (Pro vs Max)",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gh608i/m4_macbook_for_pro_tools_pro_vs_max/",
        "content": "Hey all,\n\nI currently have a Windows PC (but have used Macs a lot over the years) and need to downsize so am looking at the new Macbook Pros.\n\nI currently have a Ryzen 5950x, 32gb RAM, Nvidia 3070.\n\nMy main use and priority is Pro Tools which is a DAW.  I do minimal video editing in resolve, some editing in lightroom/photoshop and I play World Of Warcraft (no other games will be played on it).\n\nI've been looking at the difference between the M4 pro 14 core/20 core, 48gb RAM w/ 1tb SSD (£3099) and the m4 Max 16 core/40 core, 48gb RAM w/1tb SSD (£3999).\n\nI'm willing to pay the extra if it's worthwhile in my case so have a couple of questions.  Is there any difference at all between the 2 chips other than the 2 extra cpu cores and the graphics cores?  I assume there's no real reason I'd need the extra graphics cores.  Will it be at least on par with my Ryzen for multicore use?\n\nOn the face of it, it seems like the extra £900 is a waste if it's just the extra graphics cores which I won't be using?\n\nAny feedback would be greatly appreciated!",
        "created_utc": 1730469427.0,
        "subreddit_name": "mac",
        "comments": 7
    },
    {
        "title": "M2 8GB vs M3 16GB",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ghjojb/m2_8gb_vs_m3_16gb/",
        "content": "Hi guys\n\nI'm planning to buy macbooks Air for work.\nWe are a small company, and we will do some email, excel, web browsing, Teams, and normal work stuff, AI research (ChatGPT), mostly cloud based.\nI have offers of:\n\n- Macbook Air M2 8GB 256GB for 999,-\n- Macbook Air M3 16GB 256GB for 1249,-\n\nDo you think the M2 it's enough, or it's better the upgrade for the extra 259,- ?\n\nThanks",
        "created_utc": 1730505592.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "Can anyone explain what happened and my Macbook Air M2 stopped charging all of a sudden while docked?",
        "score": 2,
        "url": "https://i.redd.it/1cvg2a4ukdyd1.png",
        "content": "",
        "created_utc": 1730504446.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "Some Mac mini Hub Concepts",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ghguyq/some_mac_mini_hub_concepts/",
        "content": "I was thinking about how the new Mac mini can compete with my M1 Mac Studio (maybe not GPU, but maybe it does, we don't really know yet). However, I would need way more ports than the Mini would provide, and would want to also have a replacement for my external drive enclosures, so I decided to play around with some concepts, just to see what could fit in the new mini's for-factor, and what we may get one day soon. Having a Thunderbolt 5 option would allow for more than enough bandwidth as well.\n\nAll of these are relatively accurate, but don't take into account any possible engineering limitations, only a guess on my part. \n\nThe port configurations are just what I think most people would want, to what manufactures would give us. Some ports would be on the back, and the card readers would likely go on the front. I wasn't trying to get that in-depth into it. I just wanted to know what could fir.\n\nI do like how it looks appears that you could fit any standard M.2 drive in a 5x5 Mac mini hub. I think that would be one of the best things you could do, given Apple's excessive pricing for storage upgrades.\n\nAlso, I know the bigger hub defeats the purpose of going with a smaller mini, but it would be a good drop in for any current Mac mini or Mac Studio setups, as you'd get a lot more for the given footprint, and one could also stack it on top of any current Mac mini hubs.\n\nAnyway, this is more thought experiment, than anything. I have to assume we'll see new mini hubs over the next few month. \n\nhttps://preview.redd.it/i23ppctgzcyd1.png?width=2520&format=png&auto=webp&s=ab7b4d7f593ce6e6cd93dadc1fee5333918737d0\n\n",
        "created_utc": 1730497673.0,
        "subreddit_name": "mac",
        "comments": 10
    },
    {
        "title": "Why Does Music Sound Better on My MacBook Pro Than on My iPhone?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gh8aw4/why_does_music_sound_better_on_my_macbook_pro/",
        "content": "Hey all,\n\nI’m curious about why music sounds significantly better on my MacBook Pro (M1 Pro) than on my iPhone 13 mini when using the same Bose QC45 headphones, streaming Spotify or Apple Music. I don't think I'm crazy but the difference is really noticeable, especially in terms of clarity and depth. Even though it’s all Bluetooth, the MacBook just seems to give a fuller and richer sound.\n\nAny tips on getting similar quality from my phone? I don’t exactly want to carry a laptop to listen to music outside, lol.\n\nIf anyone has more technical insights or experience comparing the two for Bluetooth audio quality, I’d love to hear your thoughts! Thanks in advance!\n\nEdit: the reason was that Lossless audio was activated by default on my MacBook while I had to change the audio quality on my phone. Thanks for all you replies!",
        "created_utc": 1730475500.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "2024 Mac Mini: QD-OLED vs IPS Black Monitor for Photo/Video Editing",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gh77xn/2024_mac_mini_qdoled_vs_ips_black_monitor_for/",
        "content": "Hey everyone! I have a 2021 M1 iPad Pro that I use for editing all the time. My 2015 15-inch MacBook Pro is a bit on the fritz, so when I saw that the new 2024 Mac Mini starts with 16GB of memory and a 10-core CPU (6P4E) for the base model, I couldn’t resist pre-ordering it (it was a no-brainer for the price!).\n\nAfter pre-ordering the Mac Mini this week and spending every waking moment searching for the perfect display, I’ve narrowed it down to two options.\n\nThe first is the MSI MAG 271QPX E2 QD-OLED, and the second is the Dell UltraSharp U2724DE. Here are a few things I like about both displays:\n\n    * Both are 2K, QHD monitors with a resolution of around ~110 pixels per inch. This resolution is perfect for the Mac and also allows for great scaling without any performance issues.\n    * Both monitors have excellent color accuracy and cover a wide range of color spaces. Dell’s monitor covers around 98% of the DCI-P3 color space and 100% of the sRGB color space, while the MSI’s monitor covers around 99% of the DCI-P3 color space, 138% of the sRGB color space, and 98% of the Adobe RGB color space.\n    * Both monitors are currently selling for around the same price, which is a great budget option for me. The MSI is currently discounted for $529, while the Dell is priced at $519 (you can get it for $100 less with CB).\n\n\nHere’s where I’m stuck: QD-OLED vs IPS Black. \n\nBoth monitors have great color accuracy, but the QD-OLED monitor has a unique black level that can make it look even better in dark rooms and less strain on the eyes. The IPS Black monitor, on the other hand, has a wider viewing angle and is more consistent in color.\n\n    * I’m a sucker for a display with bold, contrasting colors. So, the QD-OLED would be my dream choice if everything went perfectly. But after reading a ton of articles and Reddit posts, only a few crazy folks have suggested using OLEDs for editing or work because of the risk of burn-ins. Most people say only use OLEDs for gaming.\n    * The Dell has an IPS Black panel with a 2000:1 contrast ratio, which is pretty good, but not as good as the OLEDs’ almost infinite contrast ratio. But I can live with that because the IPS panel will probably be brighter and last longer.\n\nSo, here’s my question: what’s the best monitor for me? Anyone who’s used one of these displays for editing and work, let me know which one would be a better choice.\n\nI see a lot of Mac users go with the Dell UltraSharp. Are the colors and contrast close to an iMac or Studio Display or any Apple LED display? \n\nThanks in advance. \n",
        "created_utc": 1730472708.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "Can a M2 Air do 1440x2560 2X scale at 120Hz?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gh62rt/can_a_m2_air_do_1440x2560_2x_scale_at_120hz/",
        "content": "I'm considering getting a 27\" 4K 120+Hz monitor for less burry text than my current 27\" 1440p monitor. From looking around I understand that an M2 Air can apparently do 1920x1080 2X scale at 120Hz just fine with the right cables, but AFAIK if I want a potentially smaller UI scale I may want the scaled 1440x2560 2X resolution. Can anyone attest whether an M2 Macbook Air can do that (so I guess 2880x5120 internal resolution) at 120 Hz? Maybe I need an M3? I have no idea.",
        "created_utc": 1730469623.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "MacBook Pro M4 vs MacBook Pro M4 Pro. Which one should I buy? ",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1gh5b20/macbook_pro_m4_vs_macbook_pro_m4_pro_which_one/",
        "content": "https://preview.redd.it/ry1d1458kayd1.jpg?width=1487&format=pjpg&auto=webp&s=07d13c0d964820dbbeb7ff439f2225de53a08bfc\n\nI am a PC user and I want to switch to mac, I would like to buy a macbook pro but I do not know which version to choose, the M4 or the M4 pro, I do graphic design for social networks in illustrator and photoshop, I am also a photographer and I usually use lightroom, I would not say that I use illustrator and photoshop in a basic way, but I would not say that I give an intensive use.\n\nWould the M4 version meet my needs or should I go for the pro version, if there is someone who had this experience with the M3 I would like to know.",
        "created_utc": 1730467477.0,
        "subreddit_name": "mac",
        "comments": 11
    },
    {
        "title": "Best 15” Air deal?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gh3ims/best_15_air_deal/",
        "content": "I bought a refurbished M1 MacBook Pro in April of this year, but my cat broke the screen so I need a new one. I’m thinking of going back to the 15” Air and will probably buy it from Apple, but figured I’d ask first. Just looking for 16gb RAM and 512gb SSD.",
        "created_utc": 1730461877.0,
        "subreddit_name": "mac",
        "comments": 4
    },
    {
        "title": "Mac Mini or MacBook Air?",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gh132w/mac_mini_or_macbook_air/",
        "content": "Mac Mini or Macbook Air?\n\nI would like to take advantage of Black Friday, and buy my first Mac.\n\nWhat are the differences between Mac Minis and Macbooks?\n\nThe Mac Mini, is not very expensive. Can I use the monitor that I already have? Is it compatible with normal mouse, and keyboards? Or do I have to buy everything \"Again\"?\n\nI would never take the MacBook out of the house.\n\nI am a writer, my world is that, of writing (writer, Final Draft etc., which I use on Windows), drawing (Procreate, etc. which I use on the iPad), and creating small videos (Davinci Resolve which I use on the iPad).\n\nThanks in advance, has anyone the patience to explain to me.",
        "created_utc": 1730451716.0,
        "subreddit_name": "mac",
        "comments": 8
    },
    {
        "title": "macbook air m2 or m1 pro macbook 14\"",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggxge4/macbook_air_m2_or_m1_pro_macbook_14/",
        "content": "Hello, i recently ordered a refurbished macbook air m2 with 10 core gpu, 16gb of ram and 256gb of storage for 1350$ (cad) but i came across a listing on best buy for a macbook pro with an m1 pro chip with 16gb of ram and 512gb of storage for 1550$. It is a refurbished device and it is listed in \"fair condition\" which means it could come with scuffs on the device, which would bother me and the battery health will most likely be in the mid 90s, unlike my m2 refurbished that i bought from apple which is practically brand new. It could also be in very good condition, but i honestly doubt it for that price. Now I am CS student in college and was wondering which device would be better for future proofing. I understand that for only 150$ i am getting much more,  but the fact that it isnt in excellent condition and that it also doesnt come in the color that i want does annoy me quite a bit. What would you guys get in my place?  For context the extra storage on the pro doesnt bother me becauee if i do run out of storage on my air, which i doubt i will, i can just buy an external ssd. I really just want to know if for the future an m2 air with 16gb is enough or just buying the m1 pro with 16gb is the smart decision. I dont do any video or photo editing.\n\nHere are the 2 devices : \n\n[best buy m1 pro](https://imgur.com/a/JEaOJL3)\n\n[apple m2 air](https://imgur.com/a/VAJB7zH)",
        "created_utc": 1730435006.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "YT detects adguard on wifi, but not on LAN",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1ggwl77/yt_detects_adguard_on_wifi_but_not_on_lan/",
        "content": "I have Imac connected to the network wit a LAN cable, and macbook connected to the same network through wifi. Both have the same extensions installed: Adguard, and lately Vinegar. Why do I get a pop-up from YT detecting adblock on my mac and NEVER on my Imac? is it not strange? Tried other browsers as well, Brave, Firefox with Uorigin and it always ends up with the same. I can see a slightly better behaviour with Vinegar installed, but yesterday, after a whole day of using YT it ended up with detetection anyway :( Any suggestion?",
        "created_utc": 1730431887.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "iPhone SE 4 First to Get Apple-Designed 5G Modem, iPhone 17 Pro to Add Custom Wi-Fi 7 Chip",
        "score": 811,
        "url": "https://www.macrumors.com/2024/11/01/iphone-se-4-5g-modem-jeff-pu/",
        "content": "",
        "created_utc": 1730463664.0,
        "subreddit_name": "gadgets",
        "comments": 109
    },
    {
        "title": "Samsung Teases Its Own Headset to Rival the Apple Vision Pro in 2025 / The headset will likely be priced between 1,000 and 1,500 Dollars, competing with both the Apple Vision Pro and the Meta Quest 3.",
        "score": 211,
        "url": "https://gizmodo.com/samsung-teases-its-own-headset-to-rival-the-apple-vision-pro-in-2025-2000519410",
        "content": "",
        "created_utc": 1730485985.0,
        "subreddit_name": "gadgets",
        "comments": 124
    },
    {
        "title": "Charger recall spells more bad news for Humane’s maligned AI Pin / Humane’s AI Pin was already struggling to take off, but the company's troubles deepened on Thursday as it recalled the product's portable charging case.",
        "score": 191,
        "url": "https://arstechnica.com/gadgets/2024/11/charger-recall-spells-more-bad-news-for-humanes-maligned-ai-pin/",
        "content": "",
        "created_utc": 1730486131.0,
        "subreddit_name": "gadgets",
        "comments": 15
    },
    {
        "title": "Apple is acquiring image editing firm Pixelmator | Will Apple keep one of the few single-fee alternatives to Photoshop available?",
        "score": 447,
        "url": "https://arstechnica.com/gadgets/2024/11/apple-is-acquiring-image-editing-firm-pixelmator/",
        "content": "",
        "created_utc": 1730483743.0,
        "subreddit_name": "technews",
        "comments": 71
    },
    {
        "title": "The iPhone 17 might use Apple’s own Wi-Fi chips | Apple will reportedly phase in house-made modems even earlier than that.",
        "score": 127,
        "url": "https://www.theverge.com/2024/10/31/24284959/iphone-17-wifi-bluetooth-chip-broadcom",
        "content": "",
        "created_utc": 1730459220.0,
        "subreddit_name": "technews",
        "comments": 22
    }
]