[
    {
        "title": "Apple Gaining China Market Share Amid iPhone Shipments Surge, Says Morgan Stanley",
        "score": 16,
        "url": "https://www.reddit.com/r/AAPL/comments/p8ddx2/apple_gaining_china_market_share_amid_iphone/",
        "content": "8/18/2021\n\nApple (AAPL) is winning market share in China, with iPhone shipments in the country up 79% year-over-year in July versus 27% for Chinese smartphone vendors, Morgan Stanley said Wednesday in a research note citing data from China's Academy for Information and Communications Technology.\n\nApple's July gain is a big improvement from Q2, when iPhone shipments in China declined 4% from a year earlier, said Morgan Stanley analysts including Katy Huberty.\n\nThe iPhone gained 90 basis points of installed base share in China year-over-year, ending July at a 27-month-high of nearly 21%, Morgan Stanley said, citing data from third-party vendor Jiguang.\n\nThe older iPhone 11 models make up more than 21% of Apple's installed base in China despite the popularity of the newer iPhone 12 models, Morgan Stanley noted. \"These data points support our view that the iPhone can see continued shipment strength after the launch of the new iPhone 13 model in September/October,\" the analysts said.",
        "created_utc": 1629491654.0,
        "subreddit_name": "AAPL",
        "comments": 14
    },
    {
        "title": "JPMorgan Adjusts Apple's Price Target to $180 From $175, Reiterates Overweight Rating",
        "score": 15,
        "url": "https://www.reddit.com/r/AAPL/comments/p8d7i4/jpmorgan_adjusts_apples_price_target_to_180_from/",
        "content": "Posted 8/19/2021 and I didn't see it noted here.  Personally, I could have lived with $175",
        "created_utc": 1629491090.0,
        "subreddit_name": "AAPL",
        "comments": 4
    },
    {
        "title": "Apple Pushes Back Return to Corporate Offices to January 2022",
        "score": 11,
        "url": "https://www.reddit.com/r/AAPL/comments/p8d9ke/apple_pushes_back_return_to_corporate_offices_to/",
        "content": "I don't feel this will have much of an impact on our share price:\n\n\n8/20/2021\n\nApple (AAPL) has pushed back the planned return to corporate offices to January 2022 from October amid a rise in COVID-19 cases and new variants, Bloomberg News reported Friday, citing an internal memo.\n\nThe iPhone maker said it will inform the staff about the reopening of offices a month in advance. Upon their return, the staffers would be required to work at least three days a week at the office, with remote work on the remaining two days.\n\nThe company had previously expected to reopen its corporate offices in September but then delayed the plan to October.",
        "created_utc": 1629491270.0,
        "subreddit_name": "AAPL",
        "comments": 5
    }
]