[
    {
        "title": "Microsoft wins U.S. Army contract for augmented reality headsets, worth up to $21.9 billion over 10 years",
        "score": 6052,
        "url": "https://www.reddit.com/r/stocks/comments/mk9aak/microsoft_wins_us_army_contract_for_augmented/",
        "content": "The U.S. Army said Wednesday that Microsoft has won a contract to build more than custom HoloLens augmented reality headsets. The contract for over 120,000 headsets could be worth up to $21.88 billion over 10 years, a Microsoft spokesperson told CNBC.\n\nThe deal shows Microsoft can generate meaningful revenue from a futuristic product resulting from years of research, beyond core areas such as operating systems and productivity software.\n\nIt follows a $480 million contract Microsoft received to give the Army prototypes of the Integrated Visual Augmented System, or IVAS, in 2018. The new deal will involve providing production versions.\n\nThe standard-issue HoloLens, which costs $3,500, enables people to see holograms overlaid over their actual environments and interact using hand and voice gestures. An IVAS prototype that a CNBC reporter tried out in 2019 displayed a map and a compass and had thermal imaging to reveal people in the dark. The system could also show the aim for a weapon.\n\n\"The IVAS headset, based on HoloLens and augmented by Microsoft Azure cloud services, delivers a platform that will keep soldiers safer and make them more effective,\" Alex Kipman, a technical fellow at Microsoft and the person who introduced the HoloLens in 2015, wrote in a blog post. \"The program delivers enhanced situational awareness, enabling information sharing and decision-making in a variety of scenarios.\"\n\nThe headset enables soldiers to fight, rehearse and train in one system, the Army said in a statement. The contract, which was awarded on Friday, has a five-year base period, with a five-year option after that, an Army spokesperson told CNBC an email. The Pentagon did not immediately respond to a request for comment.\n\nThe deal makes Microsoft a more prominent technology supplier to the U.S. military. In 2019, Microsoft secured a contract to provide cloud services to the Defense Department, beating out Amazon, the leader of the public-cloud market. Amazon has been challenging the contract, which could be worth up to $10 billion, in federal court.\n\n[Source](https://www.cnbc.com/2021/03/31/microsoft-wins-contract-to-make-modified-hololens-for-us-army.html)",
        "created_utc": 1617584936.0,
        "subreddit_name": "stocks",
        "comments": 495
    }
]