[
    {
        "title": "Caught some of the $COST move Friday 🤑",
        "score": 636,
        "url": "https://i.redd.it/up8nesxjbyzd1.jpeg",
        "content": "Beautiful breakout to ATH, could done something even crazier with the 940c but I’ll take this any day ",
        "created_utc": 1731190962.0,
        "created_date": "2024-11-09 22:22:42",
        "subreddit_name": "wallstreetbets",
        "comments": 55
    },
    {
        "title": "AppLovin To Join Nasdaq 100, Replacing Dollar Tree",
        "score": 353,
        "url": "https://finance.yahoo.com/m/6fb252a2-92b3-3c14-ac0a-5a40bdf2ee8e/applovin-to-join-nasdaq-100-.html",
        "content": "",
        "created_utc": 1731188715.0,
        "created_date": "2024-11-09 21:45:15",
        "subreddit_name": "wallstreetbets",
        "comments": 92
    },
    {
        "title": "AMSC: The Power Grid Play That Could 3x",
        "score": 91,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gnipp3/amsc_the_power_grid_play_that_could_3x/",
        "content": "TLDR: AMSC makes superconductor tech for power grids. With AI data centers consuming ungodly amounts of power and our grid being held together by duct tape, they're sitting on a gold mine.\n\n--\n\nalright degens and r words who need to make up their losses after not catching the trump trades.\n\nAMSC makes high-temperature superconductor tech for power grids. Think of it like upgrading from dial-up to fiber optic, but for electricity. Their superconductor cables can carry 5-200x more power than regular copper lines, and they're already proving it works (look up their AmpaCity project in Germany).\n\nWhy it matters now: Every time Nvidia announces another AI data center, someone has to figure out how to get enough power to these energy-hungry beasts. The current grid can't handle it. AMSC's tech isn't just a \"nice to have\" - it's becoming a \"must have.\" They're also selling to the Navy (because their tech makes ships' power systems smaller and more reliable) and have a booming wind turbine business in India.\n\nThe kicker? The market is pricing this like a boring utility equipment company, but they're sitting at the intersection of AI infrastructure, grid modernization, and clean energy. Orders are up 4x in 4 years, they're finally FCF positive, and analyst estimates are hilariously low (they think 15% growth when the wind business alone will add 50%).\n\nNot financial advice, but when you find a company that's essential to a massive trend (AI power needs) and the market hasn't caught on yet... well, those are the setups that make careers.\n\nThe Bull Case\n\nOrders up 4x in 4 years (40-60% growth, not some BS projection)\nFinally FCF positive: $11M last quarter\n$70M cash, virtually no debt\nCurrently at 5% FCF yield with massive growth ahead\nKey Growth Drivers:\n\nAI data centers need reliable power (duh)\nGrid modernization is inevitable\nWind business about to pop off ($250M backlog, major contract is based in india and not driven off current US politics)\nNaval contracts providing steady revenue\nWhy Market Is Wrong:\n\nAnalysts modeling 15% growth when wind segment ALONE adds 50%\nTrading at 65% discount to electrical equipment peers\nFound solid support at $20\nClear path to 3x in 18-24 months\nT/A\n\nhttps://preview.redd.it/96835fnpmxzd1.png?width=1668&format=png&auto=webp&s=cdd48a5dcd18704463f8590bde9c3f33116d5d75\n\nThat previous spike in P/A was off the superconducter news that was all over the place a year ago, whereas now it's based off an actual recognition of the goldmine AMSC is to become. clear PEG candle, establishing new ATH's since 2012. stop buying stocks with no momentum and follow where the money is going.\n\nPosition: was long calls into earnings and sold a majority on the pop. hoping to scale up more on a pull back. I will likely sell the rest of these calls into more strength next week and maybe excersize one or two for a long term hold.\n\nhttps://preview.redd.it/90mp2xe5mxzd1.png?width=542&format=png&auto=webp&s=cbe6310f9810f747f5acd56ffc01c5c7322f3882\n\nRisk/Reward:\n\nDownside looks protected at $20 (proven support)\nUpside to $60+ based on peer multiples\nRisk/reward = lose 20% or make 200%... I'll take those odds\nThis is a \"bet the farm\" play to me, especially if you're going strictly shares. If you're looking for asymmetric bets in the AI infrastructure space, this is about as good as it gets. Do your own DD, but the numbers speak for themselves.",
        "created_utc": 1731182898.0,
        "created_date": "2024-11-09 20:08:18",
        "subreddit_name": "wallstreetbets",
        "comments": 55
    }
]