[
    {
        "title": "The CLOUD Act would let cops get our data directly from big tech companies like Facebook without needing a warrant. Congress just snuck it into the must-pass omnibus package.",
        "score": 68080,
        "url": "https://www.reddit.com/r/technology/comments/867jo1/the_cloud_act_would_let_cops_get_our_data/",
        "content": "Congress just attached the CLOUD Act to the 2,232 page, must-pass [omnibus package](http://docs.house.gov/billsthisweek/20180319/BILLS-115SAHR1625-RCP115-66.pdf). It's on page 2,201.\n\nThe so-called CLOUD Act would hand police departments in the U.S. and other countries new powers to directly collect data from tech companies instead of requiring them to first get a warrant. It would even let foreign governments wiretap inside the U.S. without having to comply with U.S. Wiretap Act restrictions.\n\nMajor tech companies like Apple, Facebook, Google, Microsoft and Oath are [supporting](https://blogs.microsoft.com/datalaw/wp-content/uploads/sites/149/2018/02/Tech-Companies-Letter-of-Support-for-Senate-CLOUD-Act-020618.pdf) the bill because it makes their lives easier by relinquishing their responsibility to protect their users’ data from cops. And they’ve been throwing their lobby power behind getting the CLOUD Act attached to the omnibus government spending bill. \n\nRead more about the CLOUD Act from EFF [here](https://www.eff.org/deeplinks/2018/03/new-backdoor-around-fourth-amendment-cloud-act) and [here](https://www.eff.org/deeplinks/2018/02/cloud-act-dangerous-expansion-police-snooping-cross-border-data), and the ACLU [here](https://www.aclu.org/blog/privacy-technology/internet-privacy/cloud-act-dangerous-piece-legislation) and [here](https://www.aclu.org/letter/coalition-letter-cloud-act).\n\nThere's certainly MANY other bad things in this omnibus package. But don't lose sight of this one. Passing the CLOUD Act would impact all of our privacy and would have serious implications. \n\n",
        "created_utc": 1521679913.0,
        "subreddit_name": "technology",
        "comments": 2560
    }
]