[
    {
        "title": "Why would breaking up google increase shareholder value?",
        "score": 96,
        "url": "https://www.reddit.com/r/stocks/comments/1glxnvw/why_would_breaking_up_google_increase_shareholder/",
        "content": "I’m seeing people comment that breaking up alphabet would increase shareholder value, and don’t understand why that’s the case. Doesn’t the business benefit from its massive scale, and synergies between its departments? Wouldn’t those go away to some extent if it’s split up? How can something that seems bad for the business lead to an increase in shareholder value?",
        "created_utc": 1731004822.0,
        "subreddit_name": "stocks",
        "comments": 69
    },
    {
        "title": "Pinterest stock plunges following weak Q4 revenue guidance",
        "score": 69,
        "url": "https://www.reddit.com/r/stocks/comments/1gm1jo6/pinterest_stock_plunges_following_weak_q4_revenue/",
        "content": "Pinterest shares plunged 15% Thursday after the social media company provided soft guidance for its fourth-quarter revenue despite it beating the top and bottom lines with its third-quarter earnings.\n\nHere’s how the company performed, according to LSEG:\n\n* **Revenue**: $898 million vs. $896 million expected\n* **Earnings per share:** 40 cents adjusted vs. 34 cents expected\n\nThe company said that fourth-quarter revenue will be between the range of $1.125 million to $1.145 million. The midpoint of the fourth-quarter guidance, $1.135 million, trailed analyst estimates of $1.143 million.\n\nSales in Pinterest’s third-quarter rose 18% from $763.2 million a year ago.\n\nPinterest said it had 537 million global monthly active users in the third quarter, topping analyst estimates of 532.6 million.  \n\nThe company’s net income grew a whopping 354% year over year to $30.56 million. Its total cost and expenses for the quarter were $904 million, up 17% compared with $768 million the previous year.\n\nPinterest’s latest quarterly earnings follows the recent U.S. presidential election earlier in the week in addition to multiple earnings reports from other tech companies with online advertising businesses.\n\nLast week, Amazon said its ads business grew 19% year over year to $14.3 billion in the third quarter, and Meta said its third-quarter sales rose 19% year over year to $40.59 billion. However, Meta shares dropped slightly on weaker-than-expected user numbers and warned of a significant acceleration in its infrastructure expenses in 2025.\n\nAlphabet said during its third-quarter earnings last week that advertising sales in the period grew 10% year over year to $65.85 billion while its YouTube video unit reported ad revenue of $8.92 billion, up 12% from the previous year.\n\nMicrosoft said last week that its search and news advertising revenue jumped 18% year over year as part of its latest earnings report, but the company does not reveal that unit’s specific quarterly sales numbers.\n\nReddit and Snap also reported their most recent quarterly earnings last week. Reddit said that sales in its third quarter soared 68% to $348.4 million from the prior year while Snap’s third-quarter revenue grew 15% year over year to $1.37 billion.\n\nSource: [https://www.cnbc.com/2024/11/07/pinterest-pins-q3-earnings-report-2024.html](https://www.cnbc.com/2024/11/07/pinterest-pins-q3-earnings-report-2024.html)",
        "created_utc": 1731014579.0,
        "subreddit_name": "stocks",
        "comments": 16
    },
    {
        "title": "Two questions about GOOG *vis a vis* GOOGL",
        "score": 13,
        "url": "https://www.reddit.com/r/stocks/comments/1gm2ov1/two_questions_about_goog_vis_a_vis_googl/",
        "content": "First, is there a legal/technical/business reason why the shares are split this way (voting and non-voting) in the first place?  This feels ridiculous, but I am often profoundly ignorant when it comes to stocks, so someone will probably point out why it's a good idea/required/a sacrifice to the gods/etc.\n\nSecondly, I am at a loss as to why there is *ever* a significant gap between the two ... let alone one in favor of the non-voting shares.  The only two reasons I can think of is laziness and/or confusion.  It's like having two gas stations right next to each other sharing the same driveway, they should either be exactly the same price-per-gallon or so close that by the time you finish driving up to the cheaper option, the more expensive one has already moved its price downwards.",
        "created_utc": 1731017513.0,
        "subreddit_name": "stocks",
        "comments": 10
    },
    {
        "title": "YOLO $35k into 1.1MM to save the family farm. ",
        "score": 11938,
        "url": "https://i.redd.it/hqt0lf2xdkzd1.jpeg",
        "content": "Fellow regards, longtime lurker breaking the silence to YOLO $32K to save the family farm.\n\nGrandaddy died in April this year leaving a 3 generation farm, (fully paid, no debt) to my parents. Mom never worked and my dad’s income has never been much (minister at small church). Unsurprisingly, mom and dad want to cash in on that sweet sweet inheritance $$$ by selling the farm and upgrading their lifestyle with the proceeds.\n\nI would give my right kidney to keep that farm if I knew how to sell it. It’s where I grew up, convinced my girlfriend (now wife) to marry me, and want our two small children to make their own memories there. \n\nI’ve traded positions in $NVDA, $ASTS, $RKLB and $RDDT (thanks to this community) hoping to somehow make enough to buy the farm but have only managed roughly to double my money ($15K to $32K). I completely realize it’s an idiot move but it’s the only chance I have at this point and I’m 100% willing to go to $0 if there is a chance I can make it to $1.1MM. \n\nThe farm is going to be listed next week and I want to go full regard with my portfolio to buy it. If I sell my house I still need $1.1MM to make up the difference and I’m willing to bet everything I have in the market for the chance to make it happen. \n\nWould happily go all-in on anything that might print before February since the farm will probably be sold around that time. \n\nBefore anyone asks, there is no other way. My folks want the $$$ now and won’t sell the farm for any less than market value to me or anyone else. Renting the tillable acres to a local farmer would only cover 1.5 months of the mortgage payment. Maybe the best offer is $800K, maybe the real estate market crashes tomorrow, but bottom line is I have to close the gap between $35K and $1.1MM to have any shot at keeping it. \n\nTLDR: regard wants to yolo his 100% gains on a moonshot to save his sentimentality important childhood home knowing full well he should blow it on strippers stead because it would be more fun. \n\nThanks in advance! ",
        "created_utc": 1731022261.0,
        "subreddit_name": "wallstreetbets",
        "comments": 1576
    },
    {
        "title": "Thanks to the TSLA gain of 1937%",
        "score": 2778,
        "url": "https://i.redd.it/n6wexxkb4izd1.jpeg",
        "content": "I made a bold decision 3 days ago. Every price jump has tugged at the nerves, making one fearful of both missing out on more upside and pulling back on profits. My heart is beating like crazy and I feel an overwhelming sense of excitement and accomplishment",
        "created_utc": 1730994824.0,
        "subreddit_name": "wallstreetbets",
        "comments": 245
    },
    {
        "title": "Tesla shares soar more than 14% as Trump win is seen boosting Elon Musk’s electric vehicle company",
        "score": 1073,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1glj8vf/tesla_shares_soar_more_than_14_as_trump_win_is/",
        "content": "“Shares of Tesla soared Wednesday as investors bet that the electric vehicle maker and its CEO Elon Musk will benefit from Donald Trump’s return to the White House.\n\nTesla stands to make significant gains under a Trump administration with the threat of diminished subsidies for alternative energy and electric vehicles doing the most harm to smaller competitors. Trump’s plans for extensive tariffs on Chinese imports make it less likely that Chinese EVs will be sold in bulk in the U.S. anytime soon.”\n\nSource: https://apnews.com/article/tesla-stock-trump-election-b54454aaabd4cbe1e1e1c9754649b869",
        "created_utc": 1730957026.0,
        "subreddit_name": "wallstreetbets",
        "comments": 539
    },
    {
        "title": "Guh, there goes another grandma. No lessons learned.",
        "score": 270,
        "url": "https://i.redd.it/ate6a6j26kzd1.png",
        "content": "Expected a run up, but not this bad or quick... Meanwhile Musk invests 150 mill into Trump's campaign for 15+bill personal return on Tesla alone. Y'all are full of shit with this run up. Fk me and fk u.",
        "created_utc": 1731019622.0,
        "subreddit_name": "wallstreetbets",
        "comments": 59
    },
    {
        "title": "Jim Cramer Says Microsoft (MSFT) Will Have ‘Total Dominance’ in AI Enterprise Market",
        "score": 245,
        "url": "https://finance.yahoo.com/news/jim-cramer-says-microsoft-msft-203054187.html?.tsrc=rss",
        "content": "",
        "created_utc": 1731013530.0,
        "subreddit_name": "wallstreetbets",
        "comments": 159
    },
    {
        "title": "TSLA analysis",
        "score": 83,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gm2irq/tsla_analysis/",
        "content": "Reading through earlier comments I know you all must be thinking I'm nuts to try to do an analysis of a meme stock, but I already did it so ...\n\n\n\nWhat I found is that Tesla tends to trade at about 50% above my fair value calculation, but it can become unstable if it goes 60% over. An example of this was just before the Robotaxi event, which was followed by a large drop.\n\n\n\nMy current fair value estimate for tesla is $170 and at $297.5 it has reached 75% over.\n\n\n\nSo I decided YOLO and bought 50 Nov29 $250 puts and 50 Dec 20 $250 puts.\n\nhttps://preview.redd.it/0tsft2wbyjzd1.png?width=1188&format=png&auto=webp&s=e97dcab45540b5e50a66c60619ae64a1b2798130",
        "created_utc": 1731017078.0,
        "subreddit_name": "wallstreetbets",
        "comments": 89
    },
    {
        "title": "Globalstar Smashes Earnings with a 19.5% Revenue Beat! $GSAT 🚀",
        "score": 82,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gm1t2c/globalstar_smashes_earnings_with_a_195_revenue/",
        "content": "  \n**Globalstar Q3 Earnings Highlights:**\n\n* **Revenue Beat**: Globalstar exceeded expectations with $72.3M in Q3 revenue, 19.5% above the $60.5M estimate, driven primarily by high-margin wholesale capacity services.\n* **Record EBITDA**: Adjusted EBITDA rose 34% year-over-year, reaching a record high and signaling improved operational efficiency.\n* **FCC Approval**: The FCC granted a 15-year extension, allowing Globalstar to operate up to 26 additional satellites, supporting long-term service capabilities and growth potential.\n* **Emergency Service Resilience**: Maintained reliable service during Hurricanes Helene and Milton, demonstrating the robustness of their satellite network in critical conditions.\n* **Apple Partnership**: On November 1, Globalstar announced an expanded $1.1 billion partnership with Apple to support satellite-to-cellular connectivity for iPhone 14 and newer models. This service, known as Emergency SOS via satellite, allows iPhone users to send text messages to emergency services when outside of cellular and Wi-Fi coverage by connecting directly to Globalstar's low Earth orbit satellites. This crucial feature provides users access to emergency help even in remote areas. The expanded agreement includes an equity stake for Globalstar and is set to enhance the capacity and reliability of the Emergency SOS service, strengthening Globalstar's presence in the consumer tech and satellite communications space.\n\n**Summary**: With strong financials, strategic partnerships, and regulatory approvals, Globalstar is well-positioned for sustained growth. The expanded Apple partnership and FCC approvals further reinforce their standing in satellite communications and emergency services[.](https://imgur.com/a/E79HX5U)\n\n**Source** \\- [https://investors.globalstar.com/news-releases/news-release-details/globalstar-announces-third-quarter-2024-financial-results](https://investors.globalstar.com/news-releases/news-release-details/globalstar-announces-third-quarter-2024-financial-results)",
        "created_utc": 1731015233.0,
        "subreddit_name": "wallstreetbets",
        "comments": 50
    },
    {
        "title": "Intel sued over Raptor Lake voltage instability 🪦 intel guy",
        "score": 77,
        "url": "https://www.theregister.com/AMP/2024/11/06/intel_sued_over_raptor_lake_chips/",
        "content": "",
        "created_utc": 1731020429.0,
        "subreddit_name": "wallstreetbets",
        "comments": 32
    },
    {
        "title": "Anthropic teams up with Palantir and AWS to sell AI to defense customers",
        "score": 34,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gltlvx/anthropic_teams_up_with_palantir_and_aws_to_sell/",
        "content": "\"Anthropic on Thursday said it is teaming up with data analytics firm Palantir and Amazon Web Services (AWS) to provide U.S. intelligence and defense agencies access to Anthropic’s Claude family of AI models.\n\n“We’re proud to be at the forefront of bringing responsible AI solutions to U.S. classified environments, enhancing analytical capabilities and operational efficiencies in vital government operations,” Jensen said. “Access to Claude within Palantir on AWS will equip U.S. defense and intelligence organizations with powerful AI tools that can rapidly process and analyze vast amounts of complex data. This will dramatically improve intelligence analysis and enable officials in their decision-making processes, streamline resource intensive tasks and boost operational efficiency across departments.”\n\nSource: https://techcrunch.com/2024/11/07/anthropic-teams-up-with-palantir-and-aws-to-sell-its-ai-to-defense-customers/",
        "created_utc": 1730994740.0,
        "subreddit_name": "wallstreetbets",
        "comments": 14
    },
    {
        "title": "\nAI Giants Poised for Unprecedented Growth: Palantir and NVIDIA Set to Soar 2025, As education systems worldwide grapple with funding",
        "score": 34,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1glrdiu/ai_giants_poised_for_unprecedented_growth/",
        "content": "from the article - However, the implications of AI extend far beyond corporate growth. As education systems worldwide grapple with funding challenges, AI emerges as a powerful tool to bridge gaps and enhance learning experiences. AI-driven educational tools, such as virtual tutoring and adaptive learning platforms, can help mitigate the effects of under funding by providing personalized assistance and adjusting to individual learning styles.\n\n[https://www.newsreport47.com/home/ai-giants-poised-for-unprecedented-growth-palantir-and-nvidia-set-to-soar-2025](https://www.newsreport47.com/home/ai-giants-poised-for-unprecedented-growth-palantir-and-nvidia-set-to-soar-2025)\n\n  \nMy question is, is there money to be made by robots teaching our kids?",
        "created_utc": 1730988841.0,
        "subreddit_name": "wallstreetbets",
        "comments": 14
    },
    {
        "title": "Tesla YOLO. Still hodling with 400%+",
        "score": 26,
        "url": "https://i.redd.it/ph4cqvxlefzd1.jpeg",
        "content": "Got 7x 300c 11/15 day before the elections. Sold some and got 4x 350c 12/20. \n\nLet’s see 400 😤",
        "created_utc": 1730961962.0,
        "subreddit_name": "wallstreetbets",
        "comments": 17
    },
    {
        "title": "ASML: Why I am giving up on the stock (for the short term)",
        "score": 14,
        "url": "https://i.redd.it/e1dm93dtqfzd1.jpeg",
        "content": "ASML is a Netherlands based manufacturer of advanced semiconductor equipment systems. The company enjoys a wide moat as currently this is only company which can manufacture equipments to produce latest 3 NM AI chips.\n\nASML counts TSM, Samsung, SK Hynix, Intel and others as its customers.\n\nHowever, demand for non AI semiconductor equipment systems has dropped significantly which prompted ASML to give lower guidance for the next quarter.\n\nThe stock was savagely beateb down and fell from 800+€ to 610€ at yesterday's closing.\n\nWhy I have given him on hope of revival of ASML fortunes in the short term?\n\nExcept for high end AI chips, rest of the chip industry is struggling to increase sales revenue and profits. In absence of increase in sales, the demand for new non-AI chip producing equipments will be very slow.\n\nOnly a sliver of the semi conductor industry [that includes NVDA] has order book full for next rwo quarters. But that demand may also taper in by mid 2025 as likes of Meta, Microsoft, Apple, Amazon, Tesla etc have their data centers and LLMs ready by then.\n\nIn absense of new demand for non-AI chips and expected slow down in AI chips, it is unlikely any foundary will place new orders for the ASML equipment [each machine is said to cost between 100 M$-300M$].\n\nRevival in the fortunes of ASML depends on breakthrough in new chip designs which will make it neccessary to spend on new equipments. But that breakthrough may take a year or more [yes, it takes time to discover/invent new technologies & designs with sufficient advantage that merits an upgrade].\n\nASML stock fell below important psychological resistance of 618 € yesterday, while US tech sector roared to new heights. This weakness is fortunes of ASML is telling and may lead to further drop in price in coming days.\n\nWhile ASML remains a strong company with a wide moat, but in the current cycle of the semi conductor industry it is unlikely to post strong results.\n\nHow to trade?\n\nBuy 580 € PUTs with December 20th expiry.\n\nHappy Trading! \n\n",
        "created_utc": 1730966065.0,
        "subreddit_name": "wallstreetbets",
        "comments": 34
    },
    {
        "title": "$QXO: The Brad Jacobs Freight Train You’re All Sleeping On",
        "score": 11,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1glf4c3/qxo_the_brad_jacobs_freight_train_youre_all/",
        "content": "Regards,\n\nListen up - here’s the deal on QXO. I’m not here to give you some penny stock pitch that’s gonna end with you crying to your bank. I’m talking Brad Jacobs—a name that actually commands respect in business. He took XPO from being small fry to a $15 billion freight monster, and now he’s back for another round. But let’s be real, if you’re looking for some pump-and-dump garbage, this ain’t for you.\n\nThe Big Picture: Owning a $1 Trillion Industry\nJacobs doesn’t mess around. He’s here to take over the building products distribution market, which is a trillion-dollar industry begging for a savior to come in and shake it up. When he took on XPO, the logistics industry was a hot mess of inefficiency and disarray. Fast-forward a decade, and XPO is a name every freight guy knows. Now he’s got his sights set on QXO, and this isn’t for some pocket change. This is a takeover.\n\n$5 Billion Cash Stash and No Debt—No Chains Holding QXO Back\nUnlike all those broke startups praying for investor mercy, QXO has $5 billion in cold, hard cash with zero debt. That’s right—no loans, no strings, no BS holding them back. They’re not out here begging for quarters; they’re ready to buy, expand, and roll out a carpet of domination.\n\nWhy does that matter? Because QXO doesn’t need to play games. They’re stacked with cash, ready to make moves that’ll put smaller players in the rearview. Jacobs isn’t here to gamble; he’s here to grab the industry by the throat, and he’s got the war chest to do it.\n\nThe Kushner Factor – Like It or Not\nHere’s something juicy for the conspiracy theorists: Jared Kushner is on the board. Yeah, some of you might hate him, but this guy’s got connections up to his eyeballs. And those connections come with cash. His firm, Affinity Partners, dropped a fat $150 million into QXO. Don’t like it? Too bad. Kushner’s network isn’t here to make friends; it’s here to get things done, open doors, and give QXO a reach into corners you don’t even know exist.\n\nWhen you’re trying to flip a trillion-dollar market on its head, having someone with global influence doesn’t hurt. Kushner might not be your buddy, but trust me, he’s good for business.\n\nJacobs’ Legacy: The Guy Knows How to Print Money\nListen up, because this isn’t some snake oil show. Jacobs’ track record is rock solid. This guy has pulled off business miracles before, and he doesn’t deal in hype—he deals in results. When he took on XPO, he didn’t just win; he redefined the game. XPO is now a giant, and Jacobs is ready to do the same with QXO.\n\nSo, if you’re waiting for him to stumble, keep waiting. Jacobs’ whole career has been about taking scrappy underdogs and turning them into business beasts. Now he’s taking everything he knows and throwing it into QXO. If you can’t see the potential, maybe stick to meme stocks.\n\nThe Stock Split Debacle – Here’s What Actually Happened\nAh, the infamous 1-for-8 reverse split. Yeah, that was a bit of a ride, but let me break it down for you: this wasn’t some sneaky “oh no, we’re failing” move. This was QXO setting itself up to be taken seriously by institutional investors. The split pushed the price up, making QXO look less like a penny stock and more like a heavyweight. But some of you lost your minds when it hit $235 on June 10th and the market cap skyrocketed to $90 billion. Did QXO magically become worth as much as Amazon overnight? No, don’t be dumb.\n\nHere’s what went down: because of the share structure change, there were way fewer shares out there for the taking. The supply got tighter than a drum, so naturally, the price shot up, and platforms didn’t adjust fast enough. It was a hiccup. The market cap was basically a mirage, not a problem with the company. If you panicked, that’s on you, not QXO.\n\nSince then, it’s settled down to a more reasonable $15.25 as of today. This isn’t volatility due to bad business. It’s due to mechanics. QXO still has the same cash pile, no debt, and Jacobs at the helm. If you got weak knees over a glitch in the system, you’re not cut out for this play.\n\nQXO’s Under the Radar – and Underpriced\nHere’s the deal: the market’s napping on QXO. Despite the players on board, this stock is still low-key. People are too busy betting on whatever’s hyped that day. But if you can look past the nonsense, this is one of the most undervalued plays you’ll find. Don’t believe me? Look at Trump’s election. QXO didn’t budge. No hype, no pump—it’s steady because it’s built for the long haul.\n\nThis isn’t a meme stock. It’s not chasing clout. It’s positioning for a colossal win that takes years, not days. If you don’t have the patience, keep walking.\n\nFor the Diamond Hands Only\nIf you’re here for a 3-day flip, leave now. QXO isn’t for the paper-handed. This is a stock for people who see the big picture, who understand that building value takes time. Brad Jacobs has done it before, and he’s doing it again. You want in? Then you’re here for the ride, no whining allowed. In a few years, QXO will be leading in building products, and the weak hands will be nowhere to be found.\n\nSo keep chasing those meme plays if that’s your thing, but for the real players—the ones who see Jacobs’ vision—QXO is one of the few long-term buys that could actually make you rich.\n\nPos - 2200 shares at $13.59 DCA \n\n*Disclaimer: Not financial advice. Do your own research.",
        "created_utc": 1730943401.0,
        "subreddit_name": "wallstreetbets",
        "comments": 17
    },
    {
        "title": "Why this NVDA call 3/21/25 pricing?",
        "score": 0,
        "url": "https://i.redd.it/0zpk5497qdzd1.jpeg",
        "content": "Why are $214-216 NVDA calls significantly cheaper than $217-218?",
        "created_utc": 1730941644.0,
        "subreddit_name": "wallstreetbets",
        "comments": 14
    },
    {
        "title": "Please stop sleeping on this company earnings tm it made me rich asf this year and 10k just today ",
        "score": 0,
        "url": "https://i.redd.it/tvzbpr1mhdzd1.jpeg",
        "content": "I was roughly 50/50 split between Nvidia and Nova but at market open today I dumped everything into nova. It’s a tiny company but all leading semiconductor designers and producers buy their metrology (micro measuring) machines from them. This company has a 5 billion cap and its customers include Nvidia, tsmc, amd, Broadcom, Qualcomm, and literally everyone else. Stop sleeping!!!! 5 billion cap with all leading industry customers!!! Insane growth potential!!!! This is what got me loaded. Easy 10-20% tomorrow after earnings. And rate cuts benefit small caps more. ",
        "created_utc": 1730938755.0,
        "subreddit_name": "wallstreetbets",
        "comments": 51
    },
    {
        "title": "What's the take on AAPL's future given Trump victory, Tariffs and Elon gaining more power",
        "score": 61,
        "url": "https://www.reddit.com/r/investing/comments/1gm1yta/whats_the_take_on_aapls_future_given_trump/",
        "content": "What do you think will happen to AAPL?  \nI have a high exposure to AAPL and it has served me well. With Apple Intelligence and general trend in tech stocks with AI boost, I still saw some upside and was thinking of holding for longer. But now what Trump won and tariffs are coming, I see Apple products becoming more expensive and taking a hit in sales in the US. \n\nAlso, I feel Elon has had a tiff with Apple in the past with them pulling ads from Twitter/X, Elon trying to launch Tesla Phone and some history with Apple refusing to buy Tesla since Elon had put some shitty condition like he wants to be CEO of Apple as part of the deal.\n\nDo you think Apple will likely see more downside with this Administration or will it likely be more or less the same fate as rest of the Tech stocks? Is Trump Victory ultimately agnostic to Apple's future?",
        "created_utc": 1731015652.0,
        "subreddit_name": "investing",
        "comments": 247
    },
    {
        "title": "Wendy’s Bets on Palantir AI to Keep Up With $1 Frosty Demand",
        "score": 490,
        "url": "https://www.bloomberg.com/news/articles/2024-11-07/wendy-s-wen-1-frosty-deal-made-easier-with-ai-from-palantir-pltr",
        "content": "",
        "created_utc": 1730994405.0,
        "subreddit_name": "wallstreetbets",
        "comments": 103
    },
    {
        "title": "Department of Navy Set to Award $920M Sole-Source Contract to Palantir for Advanced Defense Software Solutions 🚨 $PLTR",
        "score": 242,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1glsa24/department_of_navy_set_to_award_920m_solesource/",
        "content": "The Department of the Navy, Naval Information Warfare Center, Pacific (NIWC Pacific), has issued a Notice of Intent to award a sole-source contract to Palantir Technologies for commercial off-the-shelf software products and services. Here are the key details:\n\n* **Contract Number**: N66001-25-R-0009\n* **Contract Type**: Indefinite Delivery/Indefinite Quantity (IDIQ) with firm-fixed pricing\n* **Contract Duration**: Five-year base period with a five-year option, totaling up to 10 years\n* **Estimated Value**: $919.78 million, including options\n* **Scope**: Covers software licenses (perpetual and subscription), software maintenance and support, professional services, hardware, and hardware support\n* **Primary Justification**: Only one responsible source as per FAR 6.302-1(a)(1) (10 U.S.C. 2304(c)(1))\n* **Estimated Award Date**: January 2025\n[.](https://imgur.com/a/6qDBsT4)\n\nSource: - [https://sam.gov/opp/462a1d9ed13244e2a7089b4308216aa7/view#description](https://sam.gov/opp/462a1d9ed13244e2a7089b4308216aa7/view#description)",
        "created_utc": 1730991286.0,
        "subreddit_name": "wallstreetbets",
        "comments": 58
    },
    {
        "title": "Which is better: Bloomberg or MarketWatch orrrr something else?",
        "score": 7,
        "url": "https://www.reddit.com/r/investing/comments/1glf2ce/which_is_better_bloomberg_or_marketwatch_orrrr/",
        "content": "I've been inactive in my stock market investing for about 5 years as I focused on real estate investments and left my money in a smart portfolio, but want to turn back to actively managing my money a bit more.  I might be described as \"investor lite\" - I'm not doing anything too complex. \n\nI've always been a MarketWatch person - used to read it every morning with breakfast from about 2000 to 2018, so I'm used to the format and layout.  Should I subscribe to MarketWatch, which is currently coupled with a Barron's subscription, or subscribe to Bloomberg, or is there a good alternative option these days for general market news, looking up tickers, and reviewing analyst research, etc.?  Thanks.    ",
        "created_utc": 1730943234.0,
        "subreddit_name": "investing",
        "comments": 18
    },
    {
        "title": "Can I do my own trading with a rollover IRA?",
        "score": 1,
        "url": "https://www.reddit.com/r/investing/comments/1glji0b/can_i_do_my_own_trading_with_a_rollover_ira/",
        "content": "I have a 401(k) from a previous employer, and I’ve always been unhappy with its performance. Since I need to roll it over into a new account anyway, I’m curious about doing so in a way where I could do my own trading. If I rolled it over into a Roth IRA, would be able to trade on the stock market with it so long as I didn’t withdraw any before retirement age?\n\nI was looking at Fidelity to do just this, but at first glance it looks like I have to choose one of their plans rather than do the investing myself.\n\nI’m also sure that I could get all this answered with a phone call, but it’s late and  I’m curious right now so I thought I’d see if Reddit could help me.",
        "created_utc": 1730957982.0,
        "subreddit_name": "investing",
        "comments": 7
    },
    {
        "title": "Apple has allegedly approached Foxconn and Lenovo to build AI servers based on Apple Silicon",
        "score": 1229,
        "url": "https://www.tomshardware.com/tech-industry/artificial-intelligence/apple-has-allegedly-approached-foxconn-and-lenovo-to-build-ai-servers-based-on-apple-silicon",
        "content": "",
        "created_utc": 1730991145.0,
        "subreddit_name": "apple",
        "comments": 104
    },
    {
        "title": "Apple is finally letting green bubbles send message reactions",
        "score": 1080,
        "url": "https://www.theverge.com/2024/11/7/24290703/apple-green-bubble-message-reaction-rcs-android",
        "content": "",
        "created_utc": 1731019748.0,
        "subreddit_name": "apple",
        "comments": 250
    },
    {
        "title": "M4 Mac Mini Review - Apple NAILED It.",
        "score": 984,
        "url": "https://youtu.be/qExcc92zHfo?si=OIW06aRwj9LWHVeY",
        "content": "",
        "created_utc": 1730989936.0,
        "subreddit_name": "apple",
        "comments": 404
    },
    {
        "title": "macOS High Power Mode comes to MacBook Pro and Mac mini with M4 Pro",
        "score": 663,
        "url": "https://9to5mac.com/2024/11/07/macos-high-power-mode-m4-pro/",
        "content": "",
        "created_utc": 1731014462.0,
        "subreddit_name": "apple",
        "comments": 32
    },
    {
        "title": "macOS Sequoia 15.2 Beta Adds New AirPlay Options",
        "score": 505,
        "url": "https://www.macrumors.com/2024/11/06/macos-sequoia-15-2-airplay/",
        "content": "",
        "created_utc": 1730957345.0,
        "subreddit_name": "apple",
        "comments": 31
    },
    {
        "title": "Google, Apple Drive 'Black Box' IP Policing with App Store Rules",
        "score": 146,
        "url": "https://news.bloomberglaw.com/ip-law/google-apple-drive-black-box-ip-policing-with-app-store-rules",
        "content": "",
        "created_utc": 1731014233.0,
        "subreddit_name": "apple",
        "comments": 15
    },
    {
        "title": "M4 MacBook Pro Review - Things to Know",
        "score": 121,
        "url": "https://youtu.be/b4x8boB2KdI?si=q01p6CJXHUMmADqv",
        "content": "",
        "created_utc": 1730994196.0,
        "subreddit_name": "apple",
        "comments": 70
    },
    {
        "title": "M4 iMac Review, Test and Comparisons",
        "score": 34,
        "url": "https://www.youtube.com/watch?v=jgX2rK7ZRA8",
        "content": "",
        "created_utc": 1731011393.0,
        "subreddit_name": "apple",
        "comments": 9
    },
    {
        "title": "Daily Advice Thread - November 07, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/apple/comments/1glnvfe/daily_advice_thread_november_07_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1730977228.0,
        "subreddit_name": "apple",
        "comments": 55
    },
    {
        "title": "MacBook Pro 16 M4 Max - Real World Review! (Fastest Laptop on Earth!?)",
        "score": 0,
        "url": "https://youtu.be/1X9Vo43qx_c?si=AUUV5xjHpDIzF-1x",
        "content": "",
        "created_utc": 1730995091.0,
        "subreddit_name": "apple",
        "comments": 13
    },
    {
        "title": "How much would this cost to fix?",
        "score": 24,
        "url": "https://i.redd.it/0net2w2f1jzd1.jpeg",
        "content": "I closed it without realizing the charger was unplugged and sitting on the right corner of the keyboard and I guess it pressed too hard on the screen 🙃 It's a 2020 macbook air \nThe lines keep moving and changing colors whenever I open and close it, Im just worried it'll get worse over time so I'd rather get it fixed before then lol ",
        "created_utc": 1731005952.0,
        "subreddit_name": "mac",
        "comments": 46
    },
    {
        "title": "What to do with a Late 2015 5K iMac?",
        "score": 13,
        "url": "https://www.reddit.com/r/mac/comments/1glh3gy/what_to_do_with_a_late_2015_5k_imac/",
        "content": "I've got a Late 2015 5K iMac that can only be updated to Monterey. As Monterey will no longer receive updates, I am trying to figure out what to do with this perfectly functioning computer.\n\nI understand I am always putting my trust in someone, so far it has been Apple. \n\nThis is my main computer for all purposes (banking, taxes, photos, shopping, etc.). Every time I find a possible path forward, I read about the risks. I am not savvy enough to know if any of these options are actually viable for a main computer.\n\n**If security/privacy is my main concern is my only choice to recycle this and buy something new?**\n\nI've read a lot of posts. These seem to be the options. Any others?\n\n* Keep using with Firefox and risk it -- no idea how big of a risk this actually is\n* OCLP - seems like [it still opens the door to risk ](https://forums.macrumors.com/threads/security-for-oclp-opencore-legacy-patcher.2406586/)\n* I could use BootCamp -- would the lack of MacOS security updates expose that side of the partition?\n* I could gut the computer and turn it into a monitor -- but then I'm buying parts off eBay and trusting they're safe?\n* Install Linux -- [doesn't seem safe either haha ](https://www.reddit.com/r/pop_os/comments/ulpecp/desktop_linux_is_much_less_secure_than_other/)\n\nAny advice would be helpful as my head is spinning.",
        "created_utc": 1730949580.0,
        "subreddit_name": "mac",
        "comments": 34
    },
    {
        "title": "In honour of the new M4 series devices being released...",
        "score": 13,
        "url": "https://www.reddit.com/r/mac/comments/1gm4fxt/in_honour_of_the_new_m4_series_devices_being/",
        "content": "I just want to give a huge shoutout to my M1Pro MacBook Pro that is still running as well as it did day one, still with 92% battery health after 222 cycles (Been using Aldente for quite a while). This is by far the best laptop I have ever owned. As nice as the new devices are, particularly the new Mac Mini, I still don't see me upgrading for another couple of years... \n\nCheers to everyone still holding on to their older devices!",
        "created_utc": 1731022186.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "I don’t know who needs to hear this but..",
        "score": 11,
        "url": "https://www.reddit.com/r/mac/comments/1glvtat/i_dont_know_who_needs_to_hear_this_but/",
        "content": "You can just buy a base model 2015+ 4K 21.5” or 5K 27” iMac and update it to the latest supported OS it can handle for the best Screen Sharing compatibility, and then disconnect wifi to avoid future issues.\n\nBuy an Apple Silicon Mac, connect that to wifi, then plug Ethernet in from the iMac to the Mac mini directly or MacBook Pro using an Ethernet adapter or a dock with Ethernet that can also charge at the same time.\n\nNow you can use essentially zero latency screen sharing with Apple Silicon performance on the cheapest form of 4K or 5K colour calibrated display that money can buy in one of the nicest looking displays ever made.\n\nReasons:\n\nTarget Display Mode doesn’t exist anymore.\n\n21.5” 4K models can be found for around $200 CAD. 27” 5K models can be found for around $300 CAD and the cheapest possible DCI-P3 4K display I could find was $750 CAD, $1450 for 5K.\n\nIf Screen Sharing on future macOS won’t connect, these iMacs are fully supported with OCLP to run macOS 15.1 with zero issues for better future compatibility.\n\nAll of the heavy lifting is done by the remote Mac so you can save tons of money by only buying a base model 4K or 5k iMac, as it’s essentially just streaming a remote connection.\n\nIf you hook up a network switch you can also connect multiple other devices like more Mac’s or the Windows App with Windows PC’s, making it an all in one monitor for any device on your network\n\nYou can use Moonlight and do remote gaming on it if you don’t mind 60FPS.\n\nIf latency isn’t mission critical, you can do this wirelessly on a MacBook Pro in clamshell mode without even needing to plug it in but the iMac will need wifi turned on and connected for this to work.",
        "created_utc": 1731000249.0,
        "subreddit_name": "mac",
        "comments": 24
    },
    {
        "title": "what the F is happening in MacOS indexing",
        "score": 6,
        "url": "https://www.reddit.com/r/mac/comments/1glfl7e/what_the_f_is_happening_in_macos_indexing/",
        "content": "When I search for any application (VScode, Brave, Firefox, Safari, Telegram...) it won't find it, I have to go to application folder in Finder and find it manually,\n\nEven when I search for documents/folder I can't find them through the spotlight search  I have to go manually search for them in folders.\n\nI am on the latest Software version MacOS Sequoia 15.1 (24B83).\n\nMachine: Mac M1 Pro 2022",
        "created_utc": 1730944821.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "macbook with m4 pro cpu 12 core vs cpu 14 core",
        "score": 4,
        "url": "https://www.reddit.com/r/mac/comments/1glo18k/macbook_with_m4_pro_cpu_12_core_vs_cpu_14_core/",
        "content": "hi guys! i'm undecided between the macbook m4 pro with the 12-core or the 14-core.\n\nfor the 12 core one i will probably choose 48gb of ram and 512 ssd\n\nfor the 14 core one i will probably choose 24 gb of ram and 1 tb ssd.\n\n i'd mainly use it for video editing (max. 4k), music production and photo editing. I premise that I will never use two of those programmes at the same time. do you have any advice?",
        "created_utc": 1730977873.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Desktop Icons",
        "score": 3,
        "url": "https://www.reddit.com/r/mac/comments/1glf64l/desktop_icons/",
        "content": "Mac OS Monterey 12.6. Is there any way to hide desktop icons? The clutter drives me up the wall. used to be as easy as just right click. Is the only way to do it through some third-party application? So stupid if so. ",
        "created_utc": 1730943558.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "Can't transfer files to Flash Drive",
        "score": 1,
        "url": "https://i.redd.it/91uye5hqahzd1.png",
        "content": "I found an old Mac Powerbook G4 and there are a bunch of old files i want to transfer to a flash drive before wiping the harddrive. Every time i try to move files (or even a single file, however small) this message pops up.  The flash drive is completely empty, it works like it should on my new MacBook Air and i have also reformatted it to MS-DOS. What is wrong here?\n\nI just want some way i can transfer the files from the computer, i bought blank dvds and wanted to burn the data to them but that didn't work either. Is the any other method to transfer files if this method with the flash drive won't work?",
        "created_utc": 1730984872.0,
        "subreddit_name": "mac",
        "comments": 18
    },
    {
        "title": "Switching from Intel to Apple Silicon",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1glpp24/switching_from_intel_to_apple_silicon/",
        "content": "Hello everyone,\n\nI recently purchased an M1 mac. I’m planning to move from my Intel mac to the new one. \n\nShould I go ahead and use the migration assistant? Would that work seamlessly?\n\nI have seen softwares providing two different versions based on the chip. Hence, the confusion. ",
        "created_utc": 1730983895.0,
        "subreddit_name": "mac",
        "comments": 9
    },
    {
        "title": "Monitor ",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gljopn/monitor/",
        "content": "I’m considering buying a Mac mini instead of my iMac (M1). \nBut I can’t afford a 5K monitor. Is 4K good enough? Thinking of a Samsung ViewFinity S8. \n",
        "created_utc": 1730958693.0,
        "subreddit_name": "mac",
        "comments": 7
    },
    {
        "title": "Minisforum launches V3 SE \"3-in-1 tablet\", equipped with Ryzen 7 7735U procesor -",
        "score": 143,
        "url": "https://videocardz.com/newz/minisforum-launches-v3-se-3-in-1-tablet-equipped-with-ryzen-7-7735u-procesor",
        "content": "",
        "created_utc": 1730972426.0,
        "subreddit_name": "gadgets",
        "comments": 3
    }
]