[
    {
        "title": "Berkshire Hathaway dumps $2.3 billion worth of Bank of America shares  ",
        "score": 721,
        "url": "https://www.reddit.com/r/stocks/comments/1ebwo2i/berkshire_hathaway_dumps_23_billion_worth_of_bank/",
        "content": "Berkshire Hathaway dumped more Bank of America shares this week, making it six straight trading days that Warren Buffett’s conglomerate has reduced its stake in the bank.\n\nThe Omaha, Nebraska-based holding company sold another 18.9 million shares via transactions on Monday, Tuesday and Wednesday at an average price of $42.46, raising $802.5 million, a new regulatory filing showed.\n\nOver the last six trading sessions, Berkshire has unloaded 52.8 million Bank of America shares worth $2.3 billion, reducing the stake to 12.5%. Berkshire still owns 980.1 million Bank of America shares with a market value of $41.3 billion, a distant second to its $172.5 billion holding in Apple.\n\nBerkshire is required to disclose its stock moves within two business days after they are made, when the stake in any company exceeds 10%.\n\nBuffett could be trimming the bet on valuation concerns after Charlotte-based Bank of America outperformed the broader market this year. The bank stock is up more than 25% in 2024, compared to almost 14% for the S&P 500.\n\nIt marked the first time since the fourth quarter of 2019 that Berkshire cut its Bank of America stake. In 2011, the Oracle of Omaha bought $5 billion worth of the bank’s preferred stock and warrants to shore up confidence in the lender as it grappled with losses related to subprime mortgages in the aftermath of the financial crisis.\n\nJust last year, Buffett spoke highly of the leadership at Bank of America, even as he offloaded other financial names. In 2022, Berkshire exited a handful of longtime bank positions, including JPMorgan, Goldman Sachs, Wells Fargo and U.S. Bancorp. \n\n“I invited myself in, many years earlier, and they made a very decent deal for us. And I like Brian Moynihan enormously, and I just don’t want to, I don’t want to sell it,” Buffett said in 2023 of holding Bank of America.\n\nSource: https://www.cnbc.com/2024/07/25/berkshire-dumps-2point3-billion-of-bank-of-america-in-a-6-day-sale-.html",
        "created_utc": 1721918692.0,
        "subreddit_name": "stocks",
        "comments": 72
    },
    {
        "title": "Don't lose your iPhone in South Korea, because Find My doesn't work there.",
        "score": 1573,
        "url": "https://appleinsider.com/articles/24/07/25/dont-lose-your-iphone-in-south-korea-because-find-my-doesnt-work-there",
        "content": "",
        "created_utc": 1721914711.0,
        "subreddit_name": "apple",
        "comments": 232
    },
    {
        "title": "Kuo: iPhone SE 4 and Ultra-Thin iPhone 17 to Use Apple's Own 5G Chip",
        "score": 665,
        "url": "https://www.macrumors.com/2024/07/24/kuo-iphone-se-4-thin-iphone-17-apple-5g-chip/",
        "content": "",
        "created_utc": 1721896650.0,
        "subreddit_name": "apple",
        "comments": 162
    }
]