[
    {
        "title": "Elon Musk says Tesla (TSLA) is worth $3,000 a share ‘if they execute really well’",
        "score": 2318,
        "url": "https://www.reddit.com/r/stocks/comments/pjng0j/elon_musk_says_tesla_tsla_is_worth_3000_a_share/",
        "content": "Elon Musk told employees that he agrees with Ark Invest that Tesla (TSLA) is worth $3,000 a share “if they execute really well.” The CEO has often commented on Tesla’s stock price, but surprisingly, it was often to say that the price was too high. \n\nIn 2020, when Tesla’s stock was reaching new high, Musk told his millions of followers on Twitters that he believed the stock was “too high”. It sent Tesla’s stock crashing, but now it is even higher than when Musk made the comment.\n\nTesla is currently trading at $733 a share and the automaker is the most valuable automotive company in the world at over $730 billion.\n\nWall Street firms are divided on whether or not the company is overvalued, but a few of them believe that Tesla could be worth a lot more. Ark Invest is one of them. Though to be fair, the company is also a large Tesla shareholders through its investment funds.\n\nThis week, they released a new note claiming a $3,000 base stock price target by 2025 for Tesla. Cathie Wood said about the price target during an interview with Yahoo Finance: “Our estimate for Tesla’s success has gone up. The main reason for that is their market share. Instead of going down from year-end 2017 to today, it has actually gone up fairly dramatically,” In its valuation models, Ark Invest believes that Tesla is going to deliver between 5 and 10 million vehicles as soon as 2025. That’s a significant ramp considering Tesla likely will deliver less than 1 million vehicles this year. The firm is also betting on Tesla delivering a completely autonomous ride-hailing network, known as Tesla Network, that is going to bring in a lot of money with high margin.\n\nIn an email to Tesla employee obtained by Electrek, Elon Musk shared with employees Ark’s new $3,000 price target and that he agrees with Ark: “If we execute really well, I agree with Ark Invest.” A $3,000 share price would put Tesla’s valuation at $3 trillion and make it the most valuable company in the world. \n\nElectrek’s Take\n\nSince Ark’s new note was an update on their valuation model and price target, it is fair to say that Musk’s email is basically a direct comment on Tesla’s stock price. He believes that “if executed really well”, Tesla should be worth $3 trillion within the next 4 years.\n\n[https://electrek.co/2021/09/04/elon-musk-tesla-tsla-worth-3000-share/](https://electrek.co/2021/09/04/elon-musk-tesla-tsla-worth-3000-share/)",
        "created_utc": 1631022626.0,
        "subreddit_name": "stocks",
        "comments": 785
    },
    {
        "title": "Apple Car executive defects to Ford in blow to automotive ambitions",
        "score": 4,
        "url": "https://www.ft.com/content/45dc9e63-733a-430b-9e3f-926294f93901",
        "content": "",
        "created_utc": 1631058618.0,
        "subreddit_name": "AAPL",
        "comments": 0
    }
]