[
    {
        "title": "Apple reaches $490mn settlement over Tim Cook’s China demand comments",
        "score": 468,
        "url": "https://www.reddit.com/r/stocks/comments/1bfx68c/apple_reaches_490mn_settlement_over_tim_cooks/",
        "content": "Apple has agreed to pay $490mn to settle a class action accusing chief executive Tim Cook of misleading investors in 2018 by exaggerating demand for the iPhone in China.  \nInvestors claimed Cook overstated demand for Apple’s products in the country on a November 2018 earnings call, only for the company’s stock to fall almost 10 per cent in January 2019 when it said it would miss its revenue guidance by as much as $9bn.  \nApple declined to comment on Friday. It has denied violating US securities law.  \nThe settlement still requires approval from the California federal judge overseeing the case. According to data from Deutsche Börse-owned Institutional Shareholder Services, it would mark Apple’s largest US securities fraud class action settlement.  \nThe years-long securities litigation, led by the UK’s Norfolk County Council, came after a rare and unexpected warning Apple issued on Chinese sales in January 2019. It was the first cut to Apple’s revenue forecast in 16 years and sent its shares sliding.  \nAt the time, China’s overall economic growth was slowing amid a trade war with the US administration of Donald Trump. The investors suing Apple claimed that Cook had downplayed concerns about China, citing a “strong” recent quarter in the region.\n\n&#x200B;\n\nArticle without paywall here: [https://www.archivebuttons.com/articles?article=https://www.ft.com/content/e41ce6f5-84d1-48b6-a81f-53cb7cdbb6a3](https://www.archivebuttons.com/articles?article=https://www.ft.com/content/e41ce6f5-84d1-48b6-a81f-53cb7cdbb6a3)\n\nSource: [https://www.ft.com/content/e41ce6f5-84d1-48b6-a81f-53cb7cdbb6a3](https://www.ft.com/content/e41ce6f5-84d1-48b6-a81f-53cb7cdbb6a3)\n\n   \n",
        "created_utc": 1710561087.0,
        "subreddit_name": "stocks",
        "comments": 162
    }
]