[
    {
        "title": "~$500>$15k ",
        "score": 4513,
        "url": "https://www.reddit.com/gallery/1gsubxh",
        "content": "3 months ago I put $500 into my account with the goal of seeing if I could take that and “make the small number bigger”. It’s not some massive million dollar gain or anything but I’m proud of it!\n\nMy rules were \n\n1. Try to double the money each of the first few plays\n2. Once I had around $2k, don’t risk it all in one place\n3. Make enough to actually create a long term position. \n4. Even if you lose, do not deposit any money into the account outside of “Invest with Rewards” from a Schwab American Express. \n\nI didn’t know much about options, and am still learning but I’ve lurked here a bit and have a few shares in AI & semiconductor companies in a Roth IRA that I’ve had for years (mainly TSM at around $50/share). Most of my gain has come from RKLB, TSM, and GRMN with the GRMN and TSM funding the RKLB calls that gave me the largest jump. \n\nMy work schedule can be hectic and I needed something that I wouldn’t have to check for a few days if I was working during market hours so these fit the bill. I had tried the QQQ thing and sort of either lost or was neutral with it. My balls aren’t big enough for that yet. \n\nI have a lot to learn, but I’m thinking my best course of action is going to be to take the gains I’ve made, and use them to execute the remaining 8 RKLB calls I have to give myself a nice long term base.\n\nOr I can go full regard, we’ll see!",
        "created_utc": 1731783716.0,
        "subreddit_name": "wallstreetbets",
        "comments": 346
    },
    {
        "title": "Google AI chatbot responds with a threatening message: \"Human … Please die.\"",
        "score": 1850,
        "url": "https://www.cbsnews.com/news/google-ai-chatbot-threatening-message-human-please-die/",
        "content": "Bullish",
        "created_utc": 1731726959.0,
        "subreddit_name": "wallstreetbets",
        "comments": 214
    },
    {
        "title": "AI Effect Elon Musk’s xAI raising up to $6 billion to purchase 100,000 Nvidia chips",
        "score": 1316,
        "url": "https://www.cnbc.com/2024/11/15/elon-musks-xai-raising-up-to-6-billion-to-purchase-100000-nvidia-chips-for-memphis-data-center.html",
        "content": "",
        "created_utc": 1731796364.0,
        "subreddit_name": "wallstreetbets",
        "comments": 183
    },
    {
        "title": "$BABA - The Azure of Asia-Pacific: Cloud Growth Could Send This Rocket to the Moon 🚀",
        "score": 206,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gsu40h/baba_the_azure_of_asiapacific_cloud_growth_could/",
        "content": "TL;DR\n\nAlibaba ($BABA) is more than just an e-commerce behemoth; its cloud computing division, Alibaba Cloud, is leading the charge in Asia’s explosive cloud growth. With Asia’s cloud market expected to grow at a CAGR of 17.4% by 2028, this sleeping dragon might be your ticket to big gains. Let me break it down.\n\n\n\n1. **Alibaba Cloud: The Azure of Asia-Pacific**\n\nIf Amazon has AWS and Microsoft has Azure, then Asia has Alibaba Cloud. It’s already the #1 cloud provider in Asia-Pacific, with close to 40% market share. The division isn’t just following Western models—it’s adapting to local markets and dominating. Countries like China, Indonesia, Malaysia, and Thailand are leveraging Alibaba Cloud as their backbone for digital transformation. **A key differentiator is that unlike Amazon and Microsoft, Alibaba has proprietary GenAI in QWEN that rivals OpenAIs GPT offerings.**\n\nRecent milestones:\n\n• +7% YoY growth in cloud revenue last quarter, and triple-digit growth in AI\n\n• Launched Tongyi Qianwen, their ChatGPT competitor, tailored for enterprise solutions, giving them an AI edge. QWEN is ahead of GPT/OpenAI in several categories ([https://venturebeat.com/ai/alibaba-claims-no-1-spot-in-ai-math-models-with-qwen2-math/](https://venturebeat.com/ai/alibaba-claims-no-1-spot-in-ai-math-models-with-qwen2-math/))  ([https://www.nytimes.com/2024/07/25/technology/china-open-source-ai.html](https://www.nytimes.com/2024/07/25/technology/china-open-source-ai.html))\n\n• Collaboration with ByteDance, NIO, and other Asian giants.\n\nBy aligning with governments and enterprises, **Alibaba Cloud is becoming indispensable in Asia’s growing digital economy.**\n\n\n\n2. **Asia’s Cloud Market Is on Fire 🔥**\n\nAsia-Pacific’s cloud market is expected to grow from $120 billion in 2023 to $264 billion by 2028 (CAGR: 17.4%; this is greater than the US market at \\~12%). Alibaba’s dominance in the region positions it to capture a lion’s share of this pie. Here’s why this is huge:\n\n• Cloud penetration is still low in Asia compared to the West. With increasing internet adoption, 5G expansion, and government incentives, the growth runway is long.\n\n• Alibaba’s infrastructure covers 28 global regions and 90+ availability zones, but its home-field advantage in Asia gives it an edge Western competitors can’t match.\n\n\n\n3. **The Cloud Is Becoming Alibaba’s Profit Engine**\n\nE-commerce might have built Alibaba, but cloud computing will carry it into the future. This is exactly what happened with Amazon and AWS. Let’s connect the dots:\n\n• AWS accounts for 70%+ of Amazon’s operating income.\n\nAlibaba Cloud isn’t there yet, but it’s trending in the same direction. Margins are improving as it scales, and with increased AI adoption, demand for compute resources will only grow.\n\n• China’s e-commerce regulation hit BABA hard, but cloud revenue is regulation-light and critical for economic growth. The Chinese government even promotes Alibaba’s cloud adoption for its national digital strategy and helps develop new contracts abroad ([https://www.asiafinancial.com/china-indonesia-sign-10bn-in-deals-on-evs-batteries-solar](https://www.asiafinancial.com/china-indonesia-sign-10bn-in-deals-on-evs-batteries-solar)).\n\n\n\n4. **Dirt Cheap Valuation Compared to Western Cloud Giants**\n\nBABA is severely undervalued compared to its US counterparts. Look at this:\n\n|Metric|Alibaba ($BABA)|Microsoft ($MSFT)|Amazon ($AMZN)|\n|:-|:-|:-|:-|\n|P/E|10x|34x|62x|\n|Cloud Revenue CAGR|\\~30% in Asia|\\~20% globally|\\~25% globally|\n\nWhy? China FUD. But if you believe in the secular growth trend of cloud computing in Asia, this valuation gap screams opportunity. Also, aside from Asia, Alibaba is constructing a new data center in Mexico ([https://www.theregister.com/2024/05/24/alibaba\\_cloud\\_mexico\\_asia\\_expansion/](https://www.theregister.com/2024/05/24/alibaba_cloud_mexico_asia_expansion/))\n\n\n\n5. **The Macro Tailwinds Are Strong**\n\nLet’s not ignore the China reopening play and China’s commitment to stimulate the economy. Add in Beijing’s recent pro-business rhetoric, and $BABA could see significant upside. Plus:\n\n• Alibaba’s $25 billion buyback program means it’s returning value to shareholders at an aggressive pace.\n\n• Spin-offs on the horizon: The cloud division could IPO in the future, unlocking massive shareholder value. Think AWS spin-off rumors but real. Let’s not forget that ANT 🐜 is back!! ([https://finance.yahoo.com/news/jack-ma-backed-ant-profit-121522222.html](https://finance.yahoo.com/news/jack-ma-backed-ant-profit-121522222.html)); ([https://www.scmp.com/tech/big-tech/article/3286177/ant-backed-credit-rating-firm-gets-central-bank-approval-china-after-3-year-wait](https://www.scmp.com/tech/big-tech/article/3286177/ant-backed-credit-rating-firm-gets-central-bank-approval-china-after-3-year-wait))\n\n\n\n6. **Price Targets and Risks**\n\n• Base case: $150 in 12 months (30% upside).\n\n• Bull case: $200+ if cloud growth accelerates (70%+ upside).\n\n• Bear case: Regulatory crackdowns re-emerge, though unlikely given current trends. \n\n\n\n**Final Thoughts:**\n\nAlibaba is a rare mix of value and growth with a transformative cloud business that’s only scratching the surface of its potential. The Asian cloud market is exploding, and BABA’s position as the “Azure of Asia” gives it an unbeatable edge. Don’t sleep on this one—when the market realizes the true potential of Alibaba Cloud, $BABA will soar.\n\nOne more thing, it’s chairman Joe Tsai is on a winning-streak. He invested $150M of his family fund into more shares of $BABA, and let’s not forget that the NY Liberty just won the WNBA title. The Brooklyn Nets aren’t there yet, but that doesn’t change that Joe Tsai is one very smart China bull! His strategic vision as chairman is up there with the top CEOs we look-up to today ([https://www.youtube.com/watch?v=8znIj2ML\\_Vo&t=11s](https://www.youtube.com/watch?v=8znIj2ML_Vo&t=11s))\n\n\n\n**P.S. for Key Concerns:**\n\n1. Many of you Apes 🦍 fear Chinese investments because of regulatory concerns and the Republic overstepping. We saw what happened after Jack Ma criticized the financial infrastructure and compared it to a pawn shop. Over the years, China realized that they would benefit from leveraging Alibaba’s technology and have shifted their tone and relationship. Here is a recent article from Summer 2024 in China shared that Alibaba is in harmony with the republic ([https://asia.nikkei.com/Business/Companies/Alibaba-s-3-year-antitrust-rectification-is-over-Beijing-says](https://asia.nikkei.com/Business/Companies/Alibaba-s-3-year-antitrust-rectification-is-over-Beijing-says))\n\n1. Another key China concern since the election are US tariffs moving to 60%. Aside from this being a negotiation tactic that will likely not come to fruition, international e-Commerce is growing for Alibaba and it is not attributed to the US (\\~9% of Alibaba’s international ecommerce is attributed to the US). With news of the Chinese megaport in Peru, South America is going to become a huge importer of Chinese goods TAX-FREE [https://www.wsj.com/world/china-xi-jinping-latin-america-acf6dbc1](https://www.wsj.com/world/china-xi-jinping-latin-america-acf6dbc1)\n\n\n\n  \n**Positions:**\n\nAfter earnings on Friday, I loaded 420 shares of $BABA and 120 $100 calls for 12/6. Across all accounts, I have about 700 shares and am considering leaps into late 2025.",
        "created_utc": 1731783145.0,
        "subreddit_name": "wallstreetbets",
        "comments": 171
    },
    {
        "title": "Micro powerplant or utilities play",
        "score": 2,
        "url": "https://www.reddit.com/r/investing/comments/1gsoi6j/micro_powerplant_or_utilities_play/",
        "content": "Hi everyone,\n\nIt’s been somewhat priced in already but with the demand in energy from AI, these “micro powerplant” companies building plants for data centers is still poised to grow.\n\nAlso with Trump in charge, renewables will suffer and traditional utility companies will rise. Given the energy demand, they will also benefit from this.\n\nAny particular companies you have in mind that fits?",
        "created_utc": 1731767608.0,
        "subreddit_name": "investing",
        "comments": 7
    },
    {
        "title": "PSA: iPhone users receiving AppleCare+ refunds multiple years after Apple trade-in ",
        "score": 1031,
        "url": "https://9to5mac.com/2024/11/16/iphone-applecare-refunds-years-late/",
        "content": "",
        "created_utc": 1731778508.0,
        "subreddit_name": "apple",
        "comments": 82
    },
    {
        "title": "Hide iPhone Find My Location Without Raising Suspicion",
        "score": 671,
        "url": "https://www.macrumors.com/how-to/hide-your-iphone-find-my-location/",
        "content": "",
        "created_utc": 1731728555.0,
        "subreddit_name": "apple",
        "comments": 132
    },
    {
        "title": "Apple Intelligence Image Wand: All the New Features in iOS 18.2",
        "score": 497,
        "url": "https://www.macrumors.com/guide/image-wand/",
        "content": "",
        "created_utc": 1731724357.0,
        "subreddit_name": "apple",
        "comments": 71
    },
    {
        "title": "Apple Acknowledges iCloud Notes Disappearing and Explains How to Fix",
        "score": 459,
        "url": "https://www.macrumors.com/2024/11/16/apple-icloud-notes-support-document/",
        "content": "",
        "created_utc": 1731781956.0,
        "subreddit_name": "apple",
        "comments": 56
    },
    {
        "title": "Macworld interview with Apple's CEO, John Sculley, November 1987",
        "score": 240,
        "url": "https://computeradsfromthepast.substack.com/p/macworld-interviews-apple-ceo-john",
        "content": "",
        "created_utc": 1731759301.0,
        "subreddit_name": "apple",
        "comments": 54
    },
    {
        "title": "Daily Advice Thread - November 16, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/apple/comments/1gskzar/daily_advice_thread_november_16_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1731754826.0,
        "subreddit_name": "apple",
        "comments": 33
    },
    {
        "title": "3D-printed Mac Pro case now available for Studio and M1/M2 mini",
        "score": 889,
        "url": "https://www.reddit.com/gallery/1gsijn1",
        "content": "Howdy y’all! I had a fairly popular post here last week for my 3D-printed case for the new M4 Mac mini in the style of the 2019 Mac Pro.\n\nOne of the biggest requests I heard was that folks wanted a mid-size version that works for the Mac Studio and M1/M2 Mac mini. Well, it’s here!\n\nhttps://makerworld.com/en/models/791767\n\nAlso new is a modern homage to the G4 Cube for the M4 Mac mini — using translucent PETG material — and an iPhone stand for MagSafe and StandBy mode that looks like a Pro Display XDR.\n\nEnjoy y’all! I’ve had a blast and appreciate all the great comments, shares, boosts, videos, articles, etc. It’s been a fun distraction. 🤪",
        "created_utc": 1731743699.0,
        "subreddit_name": "mac",
        "comments": 41
    },
    {
        "title": "What cable and mounting thing do y'all recommend if I wanted to but my SanDisk SSD on my MacBook's case like this?",
        "score": 203,
        "url": "https://i.redd.it/35fvo5bvoa1e1.jpeg",
        "content": "",
        "created_utc": 1731776628.0,
        "subreddit_name": "mac",
        "comments": 148
    },
    {
        "title": "Switched to Mac",
        "score": 40,
        "url": "https://www.reddit.com/r/mac/comments/1gsj0oc/switched_to_mac/",
        "content": "After 20 years of computing finally decided to bite the bullet and try switching to Mac full time. For test bought a brand new M1 Air with great discount.\n\nAfter  three days I can see that I missed out a lot and regret not making the switch faster.\n\nAll I am going to say. I actually enjoy using computer again. I look forward doing something on the device. + I have had I phone for a decade now and integration is awesome. Probably going to get sucked in ecosystem too.",
        "created_utc": 1731745795.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "I need a new machine, not sure if I should go iMac or Mac Mini",
        "score": 23,
        "url": "https://www.reddit.com/r/mac/comments/1gsurjd/i_need_a_new_machine_not_sure_if_i_should_go_imac/",
        "content": "I’ve been a Mac user for 30 years \n\nI’ve tended to use iMacs, my current machine is almost unusable. It’s a 2017 intel iMac with a Fusion Drive\n\nIt’s just too slow and running Photoshop or GarageBand is unbearable.\n\nI’m a designer and illustrator and I really only use my machines for Photoshop. No gaming no real video editing. Nothing that should tax a system. \n\nI’m a closet musical as well — but it’s only manifested itself as recording with GarageBand — again nothing taxing. \n\nIt’s going to be used for creating graphics, recording some music.\n\nAt first I was going to go with a refurbished iMac, I can get 16GB or ram and enough store for like 1400 \n\nBut now I’ve been reading up on new Mac Mini. Already has enough ram ( 16GB ) and enough storage. Downside is no monitor—but I’m guessing I can get one for 2-300 that will work for me —I’ve looked up a new LG one \n\nWould love some input…\n\nToday I’m leaning Mac Mini, it’s cheaper and just as powerful \n\nThoughts? ",
        "created_utc": 1731784881.0,
        "subreddit_name": "mac",
        "comments": 86
    },
    {
        "title": "What should I do with my super slow beautiful 27 inch iMac from 2015?",
        "score": 9,
        "url": "https://www.reddit.com/r/mac/comments/1gsqk2u/what_should_i_do_with_my_super_slow_beautiful_27/",
        "content": "I have a 2015 iMac, 27 inch, with 1TB Fusion Drive and 8GB of ram. \n\nIt’s the Fusion Drive that slows down the overall system. But the 27 inch retina screen is beautiful and a joy to watch movies with. \n\nI also have an older 2013 non retina iMac with 8GB of ram and an upgraded it to 512GB SSD and this thing is a beast. \n\nI don’t wanna get rid of the 27” 2015 retina iMac but that Fusion Drive really cripples the overall experience. ",
        "created_utc": 1731773473.0,
        "subreddit_name": "mac",
        "comments": 48
    },
    {
        "title": "Tech Help. Can I set up a Mac mini and MB Pro to transfer files via Wifi?",
        "score": 6,
        "url": "https://www.reddit.com/r/mac/comments/1gsnkcy/tech_help_can_i_set_up_a_mac_mini_and_mb_pro_to/",
        "content": "I'm considering buying the new Mac Mini M4Pro to put in my computer room so I can keep my external hard drives and printers always connected. Currently, I process all my photographic images on a MacBook Pro M3 Max in the living room and then disconnect all the wiring, except for the small USB external hard drive I use, and carry it to the computer room to connect to my backup hard drives and peripherals. The process is a pain. Ideally, I'd like to be able to connect to and transfer/file the completed files to the Mac mini via wifi in the other room. Is this possible via settings or do I need to have the computers connected via hard LAN cabling? I realize there would be a speed penalty, but I'm rarely in the need of getting to my files quickly.\n\nI used to build PCs like 20 years ago and I hardwired everything together with LAN cables and I was once very versed in the process. I've been using Macs/other Apple products now exclusively for \\~12 years and I've never had more than one Mac at a time. Just searching for options/techincal assistance. Thanks in advance for any help you can provide.",
        "created_utc": 1731764688.0,
        "subreddit_name": "mac",
        "comments": 11
    },
    {
        "title": "Stuck on white, then flashing amber lights on boot up.",
        "score": 5,
        "url": "https://www.reddit.com/r/mac/comments/1gsqilg/stuck_on_white_then_flashing_amber_lights_on_boot/",
        "content": "I have a 2020 Mac mini M1 that I hosed when we had a power outage while the Mac was in recovery mode and downloading macOS.  Obviously Recovery won't work; I need to use DFU.\n\nI have a MacBook from 2017 that is limited to Venturi, so I can't use DFU Blaster.  I don't have an Apple keyboard, so the four-key combination doesn't work, since the Windows keyboard I use doesn't have a \"power\" key.  I've tried other function keys in nearby approximate positions, but no dice so far.  The four keys I have tried after pressing the power button are: alt; ctrl; right shift; various function keys.\n\nI've made an appointment with the Genius Bar, but I'm hoping I can fix this myself, but I'm stuck so far.  Maybe I need to buy an Apple keyboard, especially if the visit to the GB will be more than $100?",
        "created_utc": 1731773360.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "I did something stupid in open firmware, no my iMac G5's display stays off",
        "score": 4,
        "url": "/r/oldmacs/comments/1gs3pz7/i_did_something_stupid_in_open_firmware_no_my/",
        "content": "",
        "created_utc": 1731769182.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "M4 MacBook won't connect to any usb-c powered portable monitors",
        "score": 4,
        "url": "https://www.reddit.com/r/mac/comments/1gsm82u/m4_macbook_wont_connect_to_any_usbc_powered/",
        "content": "I'm in the portable monitor business. I have several monitors here all usb-c powered, the M1 MacBook connects just fine but the M4 won't send any signal?\n\n\n\nAnyone else seeing the same issue?",
        "created_utc": 1731760006.0,
        "subreddit_name": "mac",
        "comments": 5
    },
    {
        "title": "MacBook display glitches out of nowhere",
        "score": 3,
        "url": "https://www.reddit.com/gallery/1gsht1c",
        "content": "So I was just using my MacBook Air (M1, 2020) as usual. Out of nowhere, while I was logging in, the screen started glitching. I thought it was Arc using too much RAM so I closed it. However, it wasn't the case. It still glitched out. I tilted it a little inward and it seems to fix the issue, but when I tilt it back the gltiching comes back. It's not as major compared to the other posts here on this subreddit, but it just happened out of nowhere. Thought it was a software issue so I restarted my MacBook, but it didn't solve the problem. What should I do? It could possibly be the hinge since it's sticking out a little bit probably because I've been using a case since I got it. ",
        "created_utc": 1731740528.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "MacBook Pro M3/M4 external display via HDMI at 4k@60Hz",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gspfoc/macbook_pro_m3m4_external_display_via_hdmi_at/",
        "content": "Hi all, apologies for the niche question.\n\nI have a 2021 14-inch M1 MacBook Pro  that at the time I had issues connecting to a second 4K display using a refresh rate higher than 30Hz via HDMI. The solution was to use a USBC to Displayport cable, and it worked.\n\nThis sums it up nicely: [https://discussions.apple.com/thread/255506051?sortBy=rank](https://discussions.apple.com/thread/255506051?sortBy=rank)\n\nI'm now going to get a 14-inch M3/M4 MacBook Pro, and wanted to alternate between the two laptops on the same display. The thing is that the monitor only has a single Displayport input, and 2 HDMI ones.\n\nI have an Apple USBC to USB-A and HDMI adapter, just like this one: [https://www.apple.com/ca/shop/product/MW5M3AM/A/usb-c-digital-av-multiport-adapter](https://www.apple.com/ca/shop/product/MW5M3AM/A/usb-c-digital-av-multiport-adapter)\n\nI read the Product Overview and it's slightly unclear (just because of the broad \"and later\" labels in the description) but it ~~seems to suggest that other than a very specific 2020 model (MacBook Pro (13‑inch, four Thunderbolt 3 ports, 2020)), all other 13-inch MacBook Pro devices are stuck to \"1080p at 60Hz or UHD (3840x2160) at 30Hz\", which is weird, and unfortunate if true~~ EDIT: doesn't mention anything about the 14-inch MacBook Pros.\n\nHas anyone used a more recent 13-inch MacBook Pro with an HDMI adapter and was able to have it display 4k at 60Hz on the secondary display?\n\nThank you.",
        "created_utc": 1731770343.0,
        "subreddit_name": "mac",
        "comments": 6
    },
    {
        "title": "How to get rid of this icon? ",
        "score": 2,
        "url": "https://i.redd.it/jhhodyaw0a1e1.jpeg",
        "content": "When I click “OK” nothing happens, and it also won’t allow me to shut down or restart the computer. Device is a macbook air M2 2023. ",
        "created_utc": 1731768510.0,
        "subreddit_name": "mac",
        "comments": 2
    },
    {
        "title": "Tough time choosing color",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gslnjh/tough_time_choosing_color/",
        "content": "Hey guys, i will be purchasing a brand new m3 pro macbook pro 14” next week. And of course im struggling with color choice.\n\nWhilst i prefer space black, this is a longevity purchase and i know the paint comes off and damages the overall look so im leaning to silver. \n\nLet me know what u guys think thanks so much. ",
        "created_utc": 1731757745.0,
        "subreddit_name": "mac",
        "comments": 1
    },
    {
        "title": "Keyboard and mouse not working in recovery mode",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gshb6n/keyboard_and_mouse_not_working_in_recovery_mode/",
        "content": "I have a 27” iMac and I use Logitech MX Master 3S mouse and Kychron K10 keyboard.\n\nFor some reason when I started my iMac the keyboard and mouse wouldn’t work. I restarted the iMac and it booted up in recovery mode but the keyboard and mouse still do not work. I tried plugging the mouse in, still nothing. I plugged the keyboard in and switched to cable mode. I even tried every usb port on the iMac and nothing worked. I borrowed a random wired hp brand keyboard from my job and it didn’t register as well. \n\nDoes anyone have any suggestions? ",
        "created_utc": 1731738542.0,
        "subreddit_name": "mac",
        "comments": 0
    },
    {
        "title": "Time Machine Backup Help",
        "score": 2,
        "url": "https://www.reddit.com/r/mac/comments/1gsc89o/time_machine_backup_help/",
        "content": "I need to bring my Mac in for service soon, so I'm trying to back up my laptop onto an external hard drive. When I try to configure my external disk with Time Machine, I get a message that says \"Erasing will destroy all information on “Seagate Backup Plus Drive” and can’t be undone. The volume must be erased because it has an incompatible file system.\"\n\nAfter some googling, I think this is because of the way the drive is configured. People suggest moving the items on my external drive somewhere else, letting Time Machine erase it/reconfigure it, and then moving everything back. However, I did see one post that said these items would no longer be readable by a Windows computer. This is an issue for me because I am sharing the drive with family members who use Windows devices. Can anyone confirm if this is true or not? Is there a way to back up my laptop onto this drive without erasing/moving things around, or do I need to get another hard drive?\n\nThank you!",
        "created_utc": 1731720459.0,
        "subreddit_name": "mac",
        "comments": 3
    },
    {
        "title": "/r/Stocks Weekend Discussion Saturday - Nov 16, 2024",
        "score": 7,
        "url": "https://www.reddit.com/r/stocks/comments/1gskkw5/rstocks_weekend_discussion_saturday_nov_16_2024/",
        "content": "This is the weekend edition of our stickied discussion thread.  Discuss your trades / moves from last week and what you're planning on doing for the week ahead.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "created_utc": 1731753017.0,
        "subreddit_name": "stocks",
        "comments": 69
    },
    {
        "title": "PLTR Calls and SPY Puts both hit!",
        "score": 369,
        "url": "https://www.reddit.com/gallery/1gsqeoa",
        "content": "Bought 10 PLTR 60$ calls and SPY puts for 11/15. SPY puts were “insurance” for PLTR. Well the both were bangers…",
        "created_utc": 1731773066.0,
        "subreddit_name": "wallstreetbets",
        "comments": 54
    },
    {
        "title": "Advice for young investor",
        "score": 3,
        "url": "https://www.reddit.com/r/investing/comments/1gsvozz/advice_for_young_investor/",
        "content": "Hey all, I’m 25yo and have been investing for the last 2 and 1/2 years. I’m trying to find more ways to invest my money, here’s what I have so far:\n\n-Employer 401k: 38k (investing 8% of my income; employer matches 8%)\n\n-Roth IRA: $750 (Just opened recently in October; only VOO and QQQ in there)\n\n-HYSA: 36k (4% w/ Citibank)\n\n-Individual brokerage: 3.2k (I found out about what a Roth IRA is and started investing in that account instead of this one)\n\n-HSA: 3.1k\n\nI feel like there’s other stuff I could be doing for a steady stream of income. I recently found out about T-Bills and CDs but not sure if they’re any better than my HYSA. It beats it by like 0.7% but not sure if it’s worth it.\n\nThoughts on this?\n\nUpdate: Would also like to add that I don’t own property yet. I am saving until I settle on how much i want to put down on a home and how much I should have in savings after closing the deal.",
        "created_utc": 1731787463.0,
        "subreddit_name": "investing",
        "comments": 3
    },
    {
        "title": "Stock Market Today: Netflix’s Heavyweight Gamble: Tyson vs. Paul + Meta To Face Us Antitrust Trial Over Acquisitions Of Instagram and Whatsapp",
        "score": 6,
        "url": "https://www.reddit.com/r/Daytrading/comments/1gsczr0/stock_market_today_netflixs_heavyweight_gamble/",
        "content": "* Stocks hit a rough patch Friday, with the post-election rally losing steam. The Dow dipped 305 points (-0.7%), the S&P dropped 1.3%, and the Nasdaq led the slide with a 2.2% drop, as tech stocks took a heavy hit.\n* Jerome Powell’s steady-handed comments on rate cuts and surprisingly strong retail sales data left investors rethinking the odds of a December cut. The week wrapped with all major indexes firmly in the red, putting a damper on the market’s recent momentum.\n\n# \n\n# Winners & Losers\n\n# What’s up 📈\n\n* **Bloom Energy** surged 59.19% after announcing an agreement to provide 1 gigawatt of fuel cells to utility company American Electric Power. ($BE)\n* **Palantir** jumped 11.14% following news that it will move its listing from the NYSE to the Nasdaq, with eligibility for the Nasdaq-100 Index likely upon completion. ($PLTR)\n* **Rocket Lab** rose 9.45% as space stocks rallied, driven by the so-called “Trump-Elon trade” due to the connection between President-elect Trump and SpaceX CEO Elon Musk. ($RKLB)\n* **Disney** gained 5.46%. ($DIS)\n* **Super Micro Computer** rose 3.16% ahead of its Monday deadline to file year-end reports or face Nasdaq delisting. ($SMCI)\n\n# What’s down 📉\n\n* **AST SpaceMobile** fell 9.59% after reporting a larger-than-expected Q3 loss of $1.10 per share on revenue of $1.1 million, missing analyst estimates. ($ASTS)\n* **Unity Software** declined 7.96%. ($U)\n* **Applied Materials** dropped 9.20% despite beating top and bottom-line expectations, as weaker revenue guidance for the current quarter worried investors. ($AMAT)\n* **Adobe** slid 5.00%. ($ADBE)\n* **Amazon** declined 4.19%. ($AMZN)\n* **Ulta Beauty** slipped 4.60% after Berkshire Hathaway revealed it sold nearly all its shares in the beauty retailer. ($ULTA)\n* **Moderna** declined 7.34%, Pfizer dropped 4.7%, and BioNTech shed 3.7%, following the announcement that vaccine skeptic Robert F. Kennedy Jr. would be appointed as health secretary. ($MRNA, $PFE, $BNTX)\n\n# \n\n# Netflix’s Heavyweight Gamble: Tyson vs. Paul\n\n**A Punch at Streaming’s Future**  \n  \nNetflix is stepping into uncharted territory ~~tonight~~ right now as it streams a high-profile boxing match between 58-year-old Mike Tyson and 27-year-old influencer Jake Paul. \n\nWhile the spectacle promises millions of viewers, it’s also a trial run for Netflix’s live-streaming chops ahead of broadcasting two NFL games on Christmas Day. For a platform that once dismissed live sports, this is a pivotal moment to prove it can handle the pressure—or risk being knocked out of the game.\n\n**Betting Big on Live Events**  \n  \nThis fight isn’t just about punches—it’s about ad dollars.\n\nOf Netflix’s 283 million subscribers, 70 million are on the ad-supported tier, offering prime real estate for advertisers during live events. If the Tyson-Paul bout performs well, Netflix could command premium ad rates, mirroring the cable TV playbook.   \n  \nWith live NFL broadcasts already sold out, Netflix is betting on its ability to leverage sports content for future growth.\n\n**Streaming vs. Traditional Sports Networks**  \n  \nThe event also marks a shift in boxing’s media landscape. Once dominated by HBO and Showtime, the sport is now migrating to streaming platforms like Netflix, DAZN, and Amazon Prime. \n\nTyson and Paul’s fight is Netflix’s way of signaling its intent to compete in live sports broadcasting, even as it diversifies with long-term deals like the WWE’s *Raw*and the NFL’s holiday matchups.\n\n**The Real Test:** While the buzz around the fight is undeniable, the real winner tonight could be Netflix—or not. If the platform falters under the strain of millions of viewers, it could undermine confidence in its ability to handle future live events. \n\nBut if Netflix pulls off a seamless broadcast, it will solidify its place as a new heavyweight in the live sports arena, setting up a much larger bout: its battle against traditional sports networks.\n\n# S\n\n# Market Movements\n\n* 📈 **Palantir Jumps 11% to Record High:** Palantir shares surged 11% on news that the company will transfer its stock listing to the Nasdaq from the NYSE. This continues a strong run for the company, with shares up 45% since its recent earnings beat. ($PLTR)\n* 🚀 **Space Stocks Soar Amid Post-Election Rally:** Space-focused companies saw major gains this week, with Rocket Lab climbing 41%, Intuitive Machines up 28%, and Spire Global gaining 26%. Analysts attribute the rally partly to optimism surrounding a Trump administration expected to prioritize space initiatives. ($RKLB) ($SPIR)\n* 🌌 **Musk’s SpaceX Plans $135/Share Tender Offer:** SpaceX is preparing a tender offer in December at $135 per share, valuing the company at over $250 billion. With Trump’s election, Musk’s influence could shift national priorities to focus more on Mars and space exploration.\n* 🇪🇺 **Meta's E.U. Troubles Deepen:** The European Union fined Meta $840 million for integrating its Marketplace into Facebook, allegedly disadvantaging rival classified services. Meta plans to appeal the fine and has also cut European ad-free subscription prices for Facebook and Instagram by 40% to comply with regulations. ($META)\n* ⚖️ **Musk Adds Microsoft to AI Lawsuit:** Elon Musk expanded his lawsuit against OpenAI to include Microsoft and venture capitalist Reid Hoffman, alleging that their partnership unfairly stifled competition and harmed Musk’s xAI. ($MSFT)\n* 🇺🇸 **TSMC Completes $6.6B Grant:** The Biden Administration finalized a $6.6 billion grant for Taiwan Semiconductor to build three factories in Arizona, part of a $39 billion effort to boost U.S. chip production. ($TSM)\n* ✈️ **Boeing Hires Northrop Exec for Defense Unit:** Boeing has tapped Colin Miller from Northrop Grummanto lead its Phantom Works division, tasked with revamping its military unit following significant losses on Pentagon contracts. ($BA) ($NOC)\n* 🎲 **Billionaire Tilman Fertitta Ups Wynn Stake:** Landry's CEO Tilman Fertitta increased his stake in Wynn Resorts to 9.9%, surpassing co-founder Elaine Wynn as the largest individual shareholder. Shares climbed 9% following the announcement. ($WYNN)\n* 🏨 **Hilton Expands Stock Buyback:** Hilton Worldwide authorized an additional $3.5 billion stock buyback, raising its total repurchase capacity to $4.8 billion. Its stock has gained 38% year-to-date. ($HLT)\n\n# \n\n# Meta To Face Us Antitrust Trial Over Acquisitions Of Instagram and Whatsapp\n\nMeta’s decade-old acquisitions of Instagram and WhatsApp are finally getting their day in court. \n\nA federal judge ruled that the FTC’s antitrust lawsuit against Meta will go to trial, alleging that the company overpaid for these platforms to eliminate competition. If the FTC wins, Meta could be forced to part ways with its prized assets, reshaping the social media landscape. \n\nHowever, Meta scored a minor victory with one claim—relating to access for third-party developers—dismissed.\n\n**Regulators Everywhere, All at Once**  \n  \nThe hits don’t stop there for Meta. The European Union just slapped the company with an €798 million ($840 million) fine, claiming Facebook Marketplace unfairly leveraged its dominance in social networking to outmuscle rivals. \n\nMeta says it’ll appeal, but the penalty adds to a growing list of regulatory headaches that have investors questioning Big Tech’s resilience.\n\n**What’s at Stake?**  \n  \nMeta’s empire is under siege. A breakup of Instagram and WhatsApp would mean a significant shift in its revenue streams and market power. Meanwhile, fines and lawsuits across the globe are hitting the balance sheet. \n\nFor a company already navigating fierce competition from TikTok and others, the uncertainty around regulatory outcomes could stymie its future growth.\n\n**A Global Reckoning for Big Tech**  \n  \nMeta isn’t alone in the hot seat. Antitrust cases against Amazon, Google, and Apple are ramping up, marking a bipartisan push to rein in tech monopolies. \n\nThe stakes are high: these trials will set the tone for how governments worldwide handle Big Tech, creating ripple effects across the sector. Investors, brace yourselves—this is just the beginning.\n\n# \n\n# On The Horizon\n\n# Next Week\n\nNext week’s shaping up to be all about housing, with the home builder confidence index kicking things off Monday, housing starts dropping Tuesday, and existing home sales wrapping it up Thursday. Toss in initial jobless claims that same day and Friday’s PMI reports for services and manufacturing, and you’ve got a full economic plate.\n\nWith over 91% of the S&P 500 companies reporting earnings, the season is just about over. But there are still a few late-game players set to announce, so don’t tune out just yet.\n\n# Earnings:\n\n* **Monday**: Bit Digital ($BTBT), Trip. com ($TCOM), and, ironically, a company called Mondee ($MOND).\n* **Tuesday**: Walmart ($WMT), Lowe’s ($LOW), Medtronic ($MDT), and Valvoline ($VVV).\n* **Wednesday**: Nvidia ($NVDA), Snowflake ($SNOW), Palo Alto Networks ($PANW), Target ($TGT), TJX Companies ($TJX), NIO ($NIO), Williams Sonoma ($WSM), and Wix. com ($WIX).\n* **Thursday**: Baidu ($BIDU), Deere & Co. ($DE), BJ’s Wholesale Club ($BJ), Intuit ($INTU), Ross Stores ($ROST), and The Gap ($GPS).\n* **Friday**: Nothing Notable.",
        "created_utc": 1731722908.0,
        "subreddit_name": "DayTrading",
        "comments": 0
    },
    {
        "title": "Will Apple Make Another Surprise Free Offer To All iPhone 14 Users?",
        "score": 0,
        "url": "https://www.forbes.com/sites/davidphelan/2024/11/16/will-apple-make-another-surprise-free-offer-to-all-iphone-14-users-best-free-feature-for-all-users/",
        "content": "",
        "created_utc": 1731799749.0,
        "subreddit_name": "technology",
        "comments": 3
    }
]