[
    {
        "title": "~$500>$15k ",
        "score": 4513,
        "url": "https://www.reddit.com/gallery/1gsubxh",
        "content": "3 months ago I put $500 into my account with the goal of seeing if I could take that and “make the small number bigger”. It’s not some massive million dollar gain or anything but I’m proud of it!\n\nMy rules were \n\n1. Try to double the money each of the first few plays\n2. Once I had around $2k, don’t risk it all in one place\n3. Make enough to actually create a long term position. \n4. Even if you lose, do not deposit any money into the account outside of “Invest with Rewards” from a Schwab American Express. \n\nI didn’t know much about options, and am still learning but I’ve lurked here a bit and have a few shares in AI & semiconductor companies in a Roth IRA that I’ve had for years (mainly TSM at around $50/share). Most of my gain has come from RKLB, TSM, and GRMN with the GRMN and TSM funding the RKLB calls that gave me the largest jump. \n\nMy work schedule can be hectic and I needed something that I wouldn’t have to check for a few days if I was working during market hours so these fit the bill. I had tried the QQQ thing and sort of either lost or was neutral with it. My balls aren’t big enough for that yet. \n\nI have a lot to learn, but I’m thinking my best course of action is going to be to take the gains I’ve made, and use them to execute the remaining 8 RKLB calls I have to give myself a nice long term base.\n\nOr I can go full regard, we’ll see!",
        "created_utc": 1731783716.0,
        "subreddit_name": "wallstreetbets",
        "comments": 346
    },
    {
        "title": "Google AI chatbot responds with a threatening message: \"Human … Please die.\"",
        "score": 1850,
        "url": "https://www.cbsnews.com/news/google-ai-chatbot-threatening-message-human-please-die/",
        "content": "Bullish",
        "created_utc": 1731726959.0,
        "subreddit_name": "wallstreetbets",
        "comments": 214
    },
    {
        "title": "AI Effect Elon Musk’s xAI raising up to $6 billion to purchase 100,000 Nvidia chips",
        "score": 1316,
        "url": "https://www.cnbc.com/2024/11/15/elon-musks-xai-raising-up-to-6-billion-to-purchase-100000-nvidia-chips-for-memphis-data-center.html",
        "content": "",
        "created_utc": 1731796364.0,
        "subreddit_name": "wallstreetbets",
        "comments": 183
    },
    {
        "title": "$BABA - The Azure of Asia-Pacific: Cloud Growth Could Send This Rocket to the Moon 🚀",
        "score": 206,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1gsu40h/baba_the_azure_of_asiapacific_cloud_growth_could/",
        "content": "TL;DR\n\nAlibaba ($BABA) is more than just an e-commerce behemoth; its cloud computing division, Alibaba Cloud, is leading the charge in Asia’s explosive cloud growth. With Asia’s cloud market expected to grow at a CAGR of 17.4% by 2028, this sleeping dragon might be your ticket to big gains. Let me break it down.\n\n\n\n1. **Alibaba Cloud: The Azure of Asia-Pacific**\n\nIf Amazon has AWS and Microsoft has Azure, then Asia has Alibaba Cloud. It’s already the #1 cloud provider in Asia-Pacific, with close to 40% market share. The division isn’t just following Western models—it’s adapting to local markets and dominating. Countries like China, Indonesia, Malaysia, and Thailand are leveraging Alibaba Cloud as their backbone for digital transformation. **A key differentiator is that unlike Amazon and Microsoft, Alibaba has proprietary GenAI in QWEN that rivals OpenAIs GPT offerings.**\n\nRecent milestones:\n\n• +7% YoY growth in cloud revenue last quarter, and triple-digit growth in AI\n\n• Launched Tongyi Qianwen, their ChatGPT competitor, tailored for enterprise solutions, giving them an AI edge. QWEN is ahead of GPT/OpenAI in several categories ([https://venturebeat.com/ai/alibaba-claims-no-1-spot-in-ai-math-models-with-qwen2-math/](https://venturebeat.com/ai/alibaba-claims-no-1-spot-in-ai-math-models-with-qwen2-math/))  ([https://www.nytimes.com/2024/07/25/technology/china-open-source-ai.html](https://www.nytimes.com/2024/07/25/technology/china-open-source-ai.html))\n\n• Collaboration with ByteDance, NIO, and other Asian giants.\n\nBy aligning with governments and enterprises, **Alibaba Cloud is becoming indispensable in Asia’s growing digital economy.**\n\n\n\n2. **Asia’s Cloud Market Is on Fire 🔥**\n\nAsia-Pacific’s cloud market is expected to grow from $120 billion in 2023 to $264 billion by 2028 (CAGR: 17.4%; this is greater than the US market at \\~12%). Alibaba’s dominance in the region positions it to capture a lion’s share of this pie. Here’s why this is huge:\n\n• Cloud penetration is still low in Asia compared to the West. With increasing internet adoption, 5G expansion, and government incentives, the growth runway is long.\n\n• Alibaba’s infrastructure covers 28 global regions and 90+ availability zones, but its home-field advantage in Asia gives it an edge Western competitors can’t match.\n\n\n\n3. **The Cloud Is Becoming Alibaba’s Profit Engine**\n\nE-commerce might have built Alibaba, but cloud computing will carry it into the future. This is exactly what happened with Amazon and AWS. Let’s connect the dots:\n\n• AWS accounts for 70%+ of Amazon’s operating income.\n\nAlibaba Cloud isn’t there yet, but it’s trending in the same direction. Margins are improving as it scales, and with increased AI adoption, demand for compute resources will only grow.\n\n• China’s e-commerce regulation hit BABA hard, but cloud revenue is regulation-light and critical for economic growth. The Chinese government even promotes Alibaba’s cloud adoption for its national digital strategy and helps develop new contracts abroad ([https://www.asiafinancial.com/china-indonesia-sign-10bn-in-deals-on-evs-batteries-solar](https://www.asiafinancial.com/china-indonesia-sign-10bn-in-deals-on-evs-batteries-solar)).\n\n\n\n4. **Dirt Cheap Valuation Compared to Western Cloud Giants**\n\nBABA is severely undervalued compared to its US counterparts. Look at this:\n\n|Metric|Alibaba ($BABA)|Microsoft ($MSFT)|Amazon ($AMZN)|\n|:-|:-|:-|:-|\n|P/E|10x|34x|62x|\n|Cloud Revenue CAGR|\\~30% in Asia|\\~20% globally|\\~25% globally|\n\nWhy? China FUD. But if you believe in the secular growth trend of cloud computing in Asia, this valuation gap screams opportunity. Also, aside from Asia, Alibaba is constructing a new data center in Mexico ([https://www.theregister.com/2024/05/24/alibaba\\_cloud\\_mexico\\_asia\\_expansion/](https://www.theregister.com/2024/05/24/alibaba_cloud_mexico_asia_expansion/))\n\n\n\n5. **The Macro Tailwinds Are Strong**\n\nLet’s not ignore the China reopening play and China’s commitment to stimulate the economy. Add in Beijing’s recent pro-business rhetoric, and $BABA could see significant upside. Plus:\n\n• Alibaba’s $25 billion buyback program means it’s returning value to shareholders at an aggressive pace.\n\n• Spin-offs on the horizon: The cloud division could IPO in the future, unlocking massive shareholder value. Think AWS spin-off rumors but real. Let’s not forget that ANT 🐜 is back!! ([https://finance.yahoo.com/news/jack-ma-backed-ant-profit-121522222.html](https://finance.yahoo.com/news/jack-ma-backed-ant-profit-121522222.html)); ([https://www.scmp.com/tech/big-tech/article/3286177/ant-backed-credit-rating-firm-gets-central-bank-approval-china-after-3-year-wait](https://www.scmp.com/tech/big-tech/article/3286177/ant-backed-credit-rating-firm-gets-central-bank-approval-china-after-3-year-wait))\n\n\n\n6. **Price Targets and Risks**\n\n• Base case: $150 in 12 months (30% upside).\n\n• Bull case: $200+ if cloud growth accelerates (70%+ upside).\n\n• Bear case: Regulatory crackdowns re-emerge, though unlikely given current trends. \n\n\n\n**Final Thoughts:**\n\nAlibaba is a rare mix of value and growth with a transformative cloud business that’s only scratching the surface of its potential. The Asian cloud market is exploding, and BABA’s position as the “Azure of Asia” gives it an unbeatable edge. Don’t sleep on this one—when the market realizes the true potential of Alibaba Cloud, $BABA will soar.\n\nOne more thing, it’s chairman Joe Tsai is on a winning-streak. He invested $150M of his family fund into more shares of $BABA, and let’s not forget that the NY Liberty just won the WNBA title. The Brooklyn Nets aren’t there yet, but that doesn’t change that Joe Tsai is one very smart China bull! His strategic vision as chairman is up there with the top CEOs we look-up to today ([https://www.youtube.com/watch?v=8znIj2ML\\_Vo&t=11s](https://www.youtube.com/watch?v=8znIj2ML_Vo&t=11s))\n\n\n\n**P.S. for Key Concerns:**\n\n1. Many of you Apes 🦍 fear Chinese investments because of regulatory concerns and the Republic overstepping. We saw what happened after Jack Ma criticized the financial infrastructure and compared it to a pawn shop. Over the years, China realized that they would benefit from leveraging Alibaba’s technology and have shifted their tone and relationship. Here is a recent article from Summer 2024 in China shared that Alibaba is in harmony with the republic ([https://asia.nikkei.com/Business/Companies/Alibaba-s-3-year-antitrust-rectification-is-over-Beijing-says](https://asia.nikkei.com/Business/Companies/Alibaba-s-3-year-antitrust-rectification-is-over-Beijing-says))\n\n1. Another key China concern since the election are US tariffs moving to 60%. Aside from this being a negotiation tactic that will likely not come to fruition, international e-Commerce is growing for Alibaba and it is not attributed to the US (\\~9% of Alibaba’s international ecommerce is attributed to the US). With news of the Chinese megaport in Peru, South America is going to become a huge importer of Chinese goods TAX-FREE [https://www.wsj.com/world/china-xi-jinping-latin-america-acf6dbc1](https://www.wsj.com/world/china-xi-jinping-latin-america-acf6dbc1)\n\n\n\n  \n**Positions:**\n\nAfter earnings on Friday, I loaded 420 shares of $BABA and 120 $100 calls for 12/6. Across all accounts, I have about 700 shares and am considering leaps into late 2025.",
        "created_utc": 1731783145.0,
        "subreddit_name": "wallstreetbets",
        "comments": 171
    },
    {
        "title": "Micro powerplant or utilities play",
        "score": 2,
        "url": "https://www.reddit.com/r/investing/comments/1gsoi6j/micro_powerplant_or_utilities_play/",
        "content": "Hi everyone,\n\nIt’s been somewhat priced in already but with the demand in energy from AI, these “micro powerplant” companies building plants for data centers is still poised to grow.\n\nAlso with Trump in charge, renewables will suffer and traditional utility companies will rise. Given the energy demand, they will also benefit from this.\n\nAny particular companies you have in mind that fits?",
        "created_utc": 1731767608.0,
        "subreddit_name": "investing",
        "comments": 7
    },
    {
        "title": "PSA: iPhone users receiving AppleCare+ refunds multiple years after Apple trade-in ",
        "score": 1031,
        "url": "https://9to5mac.com/2024/11/16/iphone-applecare-refunds-years-late/",
        "content": "",
        "created_utc": 1731778508.0,
        "subreddit_name": "apple",
        "comments": 82
    },
    {
        "title": "Hide iPhone Find My Location Without Raising Suspicion",
        "score": 671,
        "url": "https://www.macrumors.com/how-to/hide-your-iphone-find-my-location/",
        "content": "",
        "created_utc": 1731728555.0,
        "subreddit_name": "apple",
        "comments": 132
    },
    {
        "title": "Apple Intelligence Image Wand: All the New Features in iOS 18.2",
        "score": 497,
        "url": "https://www.macrumors.com/guide/image-wand/",
        "content": "",
        "created_utc": 1731724357.0,
        "subreddit_name": "apple",
        "comments": 71
    },
    {
        "title": "Apple Acknowledges iCloud Notes Disappearing and Explains How to Fix",
        "score": 459,
        "url": "https://www.macrumors.com/2024/11/16/apple-icloud-notes-support-document/",
        "content": "",
        "created_utc": 1731781956.0,
        "subreddit_name": "apple",
        "comments": 56
    },
    {
        "title": "Macworld interview with Apple's CEO, John Sculley, November 1987",
        "score": 240,
        "url": "https://computeradsfromthepast.substack.com/p/macworld-interviews-apple-ceo-john",
        "content": "",
        "created_utc": 1731759301.0,
        "subreddit_name": "apple",
        "comments": 54
    },
    {
        "title": "Daily Advice Thread - November 16, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/apple/comments/1gskzar/daily_advice_thread_november_16_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "created_utc": 1731754826.0,
        "subreddit_name": "apple",
        "comments": 33
    }
]