[
    {
        "title": "(Bloomberg) Apple Vision Pro deliveries are delayed to March",
        "score": 263,
        "url": "https://www.reddit.com/r/stocks/comments/19c5iic/bloomberg_apple_vision_pro_deliveries_are_delayed/",
        "content": "\"*Apple Inc. began taking preorders for its long-awaited Vision Pro mixed-reality headset on Friday, and early indications suggest that buyers are snapping up initial supplies of the $3,499 device.* \r  \n\r  \n*The product went on sale at 8 a.m. Eastern time on Apple’s website and mobile app, ahead of its rollout on Feb. 2. Delivery dates for all three models quickly slipped to March 8-15 for online orders, and the device was sold out for in-store pickup on day one at many locations. The delay signals that either demand is strong or supplies are limited — or something in between.*\n\n*Apple shares gained as much as 1.8% to $191.95 Friday in New York, erasing most of its 2% decline for January.* \r  \n\r  \n*With the launch, the company disclosed two additional configurations: a version with 512 gigabytes of storage for $3,699, and a top-end model with 1 terabyte of space for $3,899. The base model includes 256 gigabytes of storage. The company also said it would sell a carrying case for $199 and additional batteries for $199, while extra bands will cost $99 a piece.* \r  \n\r  \n*The purchasing process for the Vision Pro is unique. Customers need to use a recent iPhone or iPad to scan their head and, if necessary, provide a vision prescription. Apple typically doesn’t comment on the sales performance of new products.*\r  \n*Wall Street analysts are predicting a slow start for the device. UBS Group AG analyst David Vogt expects Apple to ship 300,000 to 400,000 units this year, generating as much as $1.4 billion. For a company that had sales of $383 billion last year, that’s “immaterial.”*\n\n*Still, the idea is to set the stage for something bigger. Apple is entering its first major new product category since the company began selling smartwatches in 2015, and the Vision Pro may take years to catch on. Apple will continue to refine the headset — making it cheaper and more comfortable — and find compelling applications for the device.*\r  \n\r  \n*In the longer run, Apple could use a fresh moneymaker. The smartphone market has matured, and it’s under particular pressure in China. The company’s revenue has fallen for four straight quarters — its longest streak of declines in more than two decades.*\n\n*Initially, the Cupertino, California-based company only plans to sell the Vision Pro in the US, with launches in other markets coming in the months ahead. The company is eyeing the UK, Canada and China as some of the first other countries, Bloomberg News has reported.*\r  \n\r  \n*It’s a complex product to manufacture, which could limit early supplies. The dual 4K resolution displays in the headset, which melds virtual and augmented reality, have suffered production snags. But the fact that Apple has been ramping up manufacturing for months suggests that it will be able to satisfy initial demand. The company is also offering a 25% discount on the device for employees, signaling that supplies aren’t too tight.*\n\n*Inside Apple, executives are anticipating a strong opening weekend, with sales tapering off later. At $3,499, the Vision Pro is one of the priciest consumer headsets ever — about seven times more expensive than the latest device from VR market leader Meta Platforms Inc.*\r  \n\r  \n*The Vision Pro also will be a hard product to share with family and friends. It requires a precise fitting process to ensure a good experience. The face scan is designed to determine the best light seal and strap size for users. The company has prepared 25 different light seals — a cushion that prevents light from seeping into the wearer’s field of view — in addition to two straps. There also are prescription lens inserts, at an additional cost.* \r  \n\r  \n*And the headset may be hard for some people to wear for extended periods. In early testing, some users have found it to be too heavy.*\r  \n\r  \n*Another concern that’s cropped up in recent days is a lack of support from top streaming apps. Netflix Inc., Spotify Technology SA and Google’s YouTube are opting not to release software for the device, at least at launch.*\r  \n\r  \n*But Apple has carefully refined its sales pitch for the headset. When consumers try it out at Apple retail stores, they’ll get a 25-minute demo, letting them get comfortable with the 3D experience that the company calls “spatial computing.”*\r  \n\r  \n*To commemorate the launch, Apple executives Mike Rockwell and Alan Dye discussed the device in a Q&A shared with employees this week.*\r  \n\r  \n*A key focus, said Dye, was ensuring that the Vision Pro didn’t have a closed-in feel — a complaint with VR headsets.*\r  \n\r  \n*“From the onset, we all had concerns about people sitting with their eyes covered and disconnected from the world,” he said. “It really became central to how we thought about the core principles of the product.”*\r  \n\r  \n*That led to the EyeSight system, which can show a wearer’s eyes through a screen on the front of the Vision Pro. “It was a huge technical challenge to do this in a way that looks and feels natural,” Rockwell said.*\r  \n\r  \n*Apple also developed an interface that doesn’t require handheld accessories. Instead, it tracks eye movement and hand gestures. Users control the device by looking at an on-screen item and pinching their fingers together to select it.*\r  \n\r  \n*One of the biggest selling points may be how easy it makes collaboration, Rockwell said. Users in far-flung locations can feel like they’re in the same place.*\r  \n\r  \n*“It’s the closest thing to being there in person that you can possibly have,” Rockwell said. “It changes the way you collaborate and is very different from videoconferencing as we know it.”*\n\n.................................\n\n*https://www.msn.com/en-us/money/other/apple-to-get-first-taste-of-consumer-demand-for-3499-vision-pro/ar-BB1gVwvZ*\n\n&#x200B;",
        "created_utc": 1705850131.0,
        "subreddit_name": "stocks",
        "comments": 135
    },
    {
        "title": "Computer RAM gets biggest upgrade in 25 years but it may be too little, too late — LPCAMM2 won't stop Apple, Intel and AMD from integrating memory directly on the CPU",
        "score": 5472,
        "url": "https://www.techradar.com/pro/computer-ram-gets-biggest-upgrade-in-25-years-but-it-may-be-too-little-too-late-lpcamm2-wont-stop-apple-intel-and-amd-from-integrating-memory-directly-on-the-cpu",
        "content": "",
        "created_utc": 1705828033.0,
        "subreddit_name": "technology",
        "comments": 1100
    },
    {
        "title": "Apple’s Testy Developer Relationships Threaten to Hamper Vision Pro",
        "score": 809,
        "url": "https://www.bloomberg.com/news/newsletters/2024-01-21/apple-vision-pro-lack-of-netflix-youtube-app-store-tensions-threaten-device-lrnjwjb3",
        "content": "",
        "created_utc": 1705844801.0,
        "subreddit_name": "apple",
        "comments": 387
    },
    {
        "title": "New iPad Air, iPad Pro, and MacBook Air Models Likely to Launch in March or April",
        "score": 720,
        "url": "https://www.macrumors.com/2024/01/21/new-ipads-and-macbook-airs-spring-2024-rumor/",
        "content": "",
        "created_utc": 1705872872.0,
        "subreddit_name": "apple",
        "comments": 252
    },
    {
        "title": "This Isn’t Your Father’s S&P 500. Don’t Worry About Valuations.",
        "score": 547,
        "url": "https://www.reddit.com/r/stocks/comments/19c5sv2/this_isnt_your_fathers_sp_500_dont_worry_about/",
        "content": "https://www.bloomberg.com/opinion/articles/2024-01-19/s-p-500-don-t-let-valuations-new-record-worry-you\n\nInteresting Bloomberg opinion piece speculating that reversion to mean/pullback may not be in the cards for the Mag 7.\n\nAlthough SPY is now heavily skewed to M7, the article argues that these companies are very well positioned to deliver on the high expectations priced onto their valuations \n\nDisclosure: I own all M7 stocks.",
        "created_utc": 1705850938.0,
        "subreddit_name": "stocks",
        "comments": 350
    }
]