[
    {
        "title": "Apple changes App Store rules to allow retro game emulators globally",
        "score": 3602,
        "url": "https://techcrunch.com/2024/04/05/apple-changes-app-store-rules-to-allow-retro-game-emulators-globally/",
        "content": "",
        "created_utc": 1712409994.0,
        "subreddit_name": "apple",
        "comments": 490
    },
    {
        "title": "\"PPSSPP\" Sony PSP emulator: \"About the Apple announcement\"",
        "score": 850,
        "url": "https://www.ppsspp.org/news/apple-announcement-comment/",
        "content": "",
        "created_utc": 1712424073.0,
        "subreddit_name": "apple",
        "comments": 189
    },
    {
        "title": "Everyone doubts me, and I’m starting to think they’re right.",
        "score": 127,
        "url": "https://www.reddit.com/r/Daytrading/comments/1bxp2r4/everyone_doubts_me_and_im_starting_to_think/",
        "content": "So I’ve been in the game for almost a year and I’ve blown my account twice. The first time, I was literally just playing with options before I understood ANYTHING about them and lost everything on an Apple fakeout. Hard pill to swallow but hey it happens. Started with $1400 and got it up a little over 2k before this happened.\n\nSpent some time rebuilding my account and putting some money in and playing with cheap options until thing a just clicked in my head and I started making profits. A solid three months ( with only a few red days) off a $500 (roughly) deposit turned into $1500 and got a little cocky and went for a big one. I lost $800, made it back, thought that the swing was in my favor and doubled down to lose the $800 again and followed it up with several days of revenge trading to lose it again.\n\nMy wife thinks I’m stupid, she won’t tell me that but when I tell her I lost the money she was just in disbelief and wouldn’t talk about it even though I didn’t involve the money in our finances. everyone I try to explain it to thinks I just have a gambling problem and should cut my losses, my boss at work literally asks me “how’s your gambling going” and it just annoys the shit out of me. \n\nHas anyone else been through this or have any pointers to try and maintain confidence when others doubt you and your performance has been lackluster at the same time? I’m at the point where I don’t want to tell others about this but this is pretty much my passion and all I have to talk about lol",
        "created_utc": 1712444927.0,
        "subreddit_name": "DayTrading",
        "comments": 223
    }
]