[
    {
        "title": "Antitrust lawsuit against Apple",
        "score": 213,
        "url": "https://www.reddit.com/r/stocks/comments/18zgs0a/antitrust_lawsuit_against_apple/",
        "content": "\"Apple shares slid less than 1% during trading on Friday after The New York Times reported that the U.S. Department of Justice is preparing an antitrust lawsuit against the iPhone maker, which could be filed as soon as this year.\n\nThe agency’s lawsuit could target how the Apple Watch works exclusively with the iPhone, as well as the company’s iMessage service, which is also solely available on Apple devices. It could also focus on Apple Pay, the company’s payments system, according to the report.\"\n\nI understand the possible antitrust issues when they went after Apple for the App store but why is iMessage or Apple pay being apple exclusive features considered antitrust?\n\nFull article for reference: https://www.cnbc.com/2024/01/05/apple-shares-slip-on-report-us-government-preparing-antitrust-lawsuit.html",
        "created_utc": 1704486738.0,
        "subreddit_name": "stocks",
        "comments": 157
    },
    {
        "title": "I bonds withdrawal gone wrong",
        "score": 249,
        "url": "https://www.reddit.com/r/investing/comments/18zisiq/i_bonds_withdrawal_gone_wrong/",
        "content": "Like many others I utilized I bonds back in 2022 to protect some cash I was saving for a down payment. This week was my turn to cash them in with a plan to convert them into a 12 month CD before using the money in 2025 for what it has been earmarked.\n\nI withdrew all 10820 dollars and three days later only about 7000 showed up in my bank account. No notice, no explanation. 10k left and only 7k arrived. I was confused and annoyed. So I started digging - the first clue was the transaction was initiated by the treasury offset program - an entity that I was unaware of until two days ago, and where state and federal debt gets reported, and which has the power to service those debts with funds that you have with the government (such as I bonds, apparently). \n\nSo I called them and they informed me that I had debt in a state that I have not lived in for nearly a decade. I followed the trail with my next call being to that state’s treasury, which referred me to the motor vehicle department where this debt had been initially reported. It turns out that the DMV in this state has falsely assessed that from 2016-2017 I did not have insurance on a car that I have long since sold. The car was not even being driven in that state in 2016 anymore, but that didn’t keep them from slapping me with a $3k fine, 7 years later, and collect said fine from my iBond transfer.\n\nI couldn’t remember which insurance company I used for this car back then, so I’ve been on endless hold/phone loops with all previous insurance companies who have to go digging in their archives for my old policies. \n\nUltimately, I think I can get my money back, but I will certainly loose out on some interest, and a whole lot of time. \n\nI don’t know if there is a lesson here for others - the State DMV told me that they tried to reach me but can’t provide proof of that. I got no answer to why this debt was assessed now and didn’t come up when I filed for taxes the last 7 years (which they can do, too, apparently). I’ve never had a worse customer service experience than with the US government.\n\nI guess make sure you don’t have state or federal debts that might get your iBonds garnished when you try to withdraw them. 🤷‍♂️🤣\n\nTL:DR - my I bond withdrawal was sabotaged by the US Treasury Offset Program.",
        "created_utc": 1704491797.0,
        "subreddit_name": "investing",
        "comments": 67
    }
]