[
    {
        "title": "Antitrust lawsuit against Apple",
        "score": 213,
        "url": "https://www.reddit.com/r/stocks/comments/18zgs0a/antitrust_lawsuit_against_apple/",
        "content": "\"Apple shares slid less than 1% during trading on Friday after The New York Times reported that the U.S. Department of Justice is preparing an antitrust lawsuit against the iPhone maker, which could be filed as soon as this year.\n\nThe agency’s lawsuit could target how the Apple Watch works exclusively with the iPhone, as well as the company’s iMessage service, which is also solely available on Apple devices. It could also focus on Apple Pay, the company’s payments system, according to the report.\"\n\nI understand the possible antitrust issues when they went after Apple for the App store but why is iMessage or Apple pay being apple exclusive features considered antitrust?\n\nFull article for reference: https://www.cnbc.com/2024/01/05/apple-shares-slip-on-report-us-government-preparing-antitrust-lawsuit.html",
        "created_utc": 1704486738.0,
        "subreddit_name": "stocks",
        "comments": 157
    },
    {
        "title": "I bonds withdrawal gone wrong",
        "score": 249,
        "url": "https://www.reddit.com/r/investing/comments/18zisiq/i_bonds_withdrawal_gone_wrong/",
        "content": "Like many others I utilized I bonds back in 2022 to protect some cash I was saving for a down payment. This week was my turn to cash them in with a plan to convert them into a 12 month CD before using the money in 2025 for what it has been earmarked.\n\nI withdrew all 10820 dollars and three days later only about 7000 showed up in my bank account. No notice, no explanation. 10k left and only 7k arrived. I was confused and annoyed. So I started digging - the first clue was the transaction was initiated by the treasury offset program - an entity that I was unaware of until two days ago, and where state and federal debt gets reported, and which has the power to service those debts with funds that you have with the government (such as I bonds, apparently). \n\nSo I called them and they informed me that I had debt in a state that I have not lived in for nearly a decade. I followed the trail with my next call being to that state’s treasury, which referred me to the motor vehicle department where this debt had been initially reported. It turns out that the DMV in this state has falsely assessed that from 2016-2017 I did not have insurance on a car that I have long since sold. The car was not even being driven in that state in 2016 anymore, but that didn’t keep them from slapping me with a $3k fine, 7 years later, and collect said fine from my iBond transfer.\n\nI couldn’t remember which insurance company I used for this car back then, so I’ve been on endless hold/phone loops with all previous insurance companies who have to go digging in their archives for my old policies. \n\nUltimately, I think I can get my money back, but I will certainly loose out on some interest, and a whole lot of time. \n\nI don’t know if there is a lesson here for others - the State DMV told me that they tried to reach me but can’t provide proof of that. I got no answer to why this debt was assessed now and didn’t come up when I filed for taxes the last 7 years (which they can do, too, apparently). I’ve never had a worse customer service experience than with the US government.\n\nI guess make sure you don’t have state or federal debts that might get your iBonds garnished when you try to withdraw them. 🤷‍♂️🤣\n\nTL:DR - my I bond withdrawal was sabotaged by the US Treasury Offset Program.",
        "created_utc": 1704491797.0,
        "subreddit_name": "investing",
        "comments": 67
    },
    {
        "title": "U.S. Moves Closer to Filing Sweeping Antitrust Case Against Apple",
        "score": 2962,
        "url": "https://www.nytimes.com/2024/01/05/technology/antitrust-apple-lawsuit-us.html?smid=nytcore-ios-share&referringSource=articleShare",
        "content": "",
        "created_utc": 1704482583.0,
        "subreddit_name": "apple",
        "comments": 1042
    },
    {
        "title": "Apple Card Savings Account Receives Another Rate Increase",
        "score": 896,
        "url": "https://www.macrumors.com/2024/01/04/apple-card-savings-account-apr-increase/",
        "content": "",
        "created_utc": 1704458310.0,
        "subreddit_name": "apple",
        "comments": 128
    },
    {
        "title": "When you wake up owing your brokerage $65M because someone exercised your naked SPY calls early",
        "score": 12380,
        "url": "https://i.redd.it/y6k34fnc2nac1.png",
        "content": "",
        "created_utc": 1704468263.0,
        "subreddit_name": "wallstreetbets",
        "comments": 1917
    },
    {
        "title": "Tim Apple needs to make some changes.... [small rant]",
        "score": 5,
        "url": "https://www.reddit.com/r/AAPL/comments/18ze4rt/tim_apple_needs_to_make_some_changes_small_rant/",
        "content": "I'm not super worried about this dip,  we've seen this shit before.  Many times before.\n\n\n*However*, I think they've been playing catch up in too many areas.   The iPhone has been\nbarely incremental over the past few years.    If you're about to buy a new phone,  go take a \nlook at your options - You'll save a ton of cash with a 13 or 14 with minimal FOMO. \nI get that it's a staple,  it's their Coca-cola and you don't want to fuck too much with the formula.\nThat being said,  they at least need to push enough for people to upgrade.  One of\nthe more substantial changes (USBC),  wasn't due to any innovative drive, but because\nthe fucking EU told them to.   \n\nFurthermore,  we need some products that may actually drive revenue in the not too distant future.   The phone market has peaked and it's a lot like the Apple IIe from many moons ago.\nA profitable cash cow that will slowly but eventually dry up down the road.  What could that new product be? No idea.\n\nAs for the Vision Pro...   It's not going to make any measurable dent in revenue for years and years.  As an owner of the Quest3,  I def see a lot of possibilities,  but the tech is still wildly immature.   In Tim Apple's defense,  he's never really pumped it as anything more than a tech demo (for now).  In 5-10 years who knows,  I could def see it in many homes across the land.\n\nI think it's a mistake to rely too heavily on services.  It's been a solid performer no doubt,  but we've seen how quickly service centric business can get their nuts punched in...  \n\nHaving said all of that,  I have no doubt Tim has some surprises for us this year.  Not selling,  but a tad frustrated ....",
        "created_utc": 1704480158.0,
        "subreddit_name": "AAPL",
        "comments": 13
    },
    {
        "title": "My thoughts on the recent stock price drop in Apple",
        "score": 0,
        "url": "https://www.reddit.com/r/AAPL/comments/18zkq0o/my_thoughts_on_the_recent_stock_price_drop_in/",
        "content": "Hi everyone! This piece makes up a small portion of this weeks newsletter. If you enjoy, please consider subscribing! \n\nApple WTD -6.6%): Has been hammered in the past week, amid several negative catalysts. (1) Received a downgrade at Barclays, which cited concerns that demand for its devices (iPhone & Mac) will remain weak in 2024. (2) The following day, received another downgrade at Piper Sandler for the aforementioned reasons. (3) The US aims to file an antitrust case against Apple’s strategies to protect the dominance of the iPhone.\r  \nMy Opinion? Price action following broker downgrades are more-so a “rotation“ out of Tech in the new year, rather than Apple investors “jumping ship“ (Nasdaq WTD -3.3%). Going ahead, the main catalyst will be government’s anti-trust trial against Google, which may have a significant impact on Apple’s revenue. I will cover this closer to the closing arguments in May\n\n&#x200B;\n\nSubscribe here: https://reallyknowthenews-newsletter.beehiiv.com/subscribe",
        "created_utc": 1704496634.0,
        "subreddit_name": "AAPL",
        "comments": 4
    }
]