[
    {
        "title": "Tesla video promoting self driving was staged, engineer testifies",
        "score": 2700,
        "url": "https://www.reddit.com/r/stocks/comments/10f6z7f/tesla_video_promoting_self_driving_was_staged/",
        "content": "Jan 17 [Reuters](https://www.reuters.com/technology/tesla-video-promoting-self-driving-was-staged-engineer-testifies-2023-01-17/?utm_source=reddit.com) - \"A 2016 video that Tesla (TSLA.O) used to promote its self-driving technology was staged to show capabilities like stopping at a red light and accelerating at a green light that the system did not have, according to testimony by a senior engineer.\n\nThe video, which remains archived on Tesla’s website, was released in October 2016 and promoted on Twitter by Chief Executive Elon Musk as evidence that “Tesla drives itself.”\n\nTo create the video, the Tesla used 3D mapping on a predetermined route from a house in Menlo Park, California, to Tesla’s then-headquarters in Palo Alto, he said.\n\nDrivers intervened to take control in test runs, he said. When trying to show the Model X could park itself with no driver, a test car crashed into a fence in Tesla’s parking lot, he said.\n\n“The intent of the video was not to accurately portray what was available for customers in 2016. It was to portray what was possible to build into the system,” Tesla's lawyer said, according to a transcript of his testimony seen by Reuters.\n\nWhen Tesla released the video, Musk tweeted, “Tesla drives itself (no human input at all) thru urban streets to highway to streets, then finds a parking spot.”\n\nTesla faces lawsuits and regulatory scrutiny over its driver assistance systems.\n\nThe U.S. Department of Justice began a criminal investigation into Tesla’s claims that its electric vehicles can drive themselves in 2021, after a number of crashes, some of them fatal, involving Autopilot, Reuters has reported.\n\nThe New York Times reported in 2021 that Tesla engineers had created the 2016 video to promote Autopilot without disclosing that the route had been mapped in advance or that a car had crashed in trying to complete the shoot, citing anonymous sources.\n\nWhen asked if the 2016 video showed the performance of the Tesla Autopilot system available in a production car at the time, Elluswamy said, \"It does not.\"\n\nElluswamy was deposed in a lawsuit against Tesla over a 2018 crash in Mountain View, California, that killed Apple engineer Walter Huang. \"\n\n\nWhat do you guys make of all this? Is everyone still permabullsih on Tesla or are the tides turning against them? Of course Elon is no longer chairman so doesnt have as much control as previously, however he does still have significant control of the company and bad PR for him often means bad PR for Tesla. The two are almost inextricably linked given his holdings.\n\nPersonally I don't want to touch anything this man is involved with and haven't done so for a good year now, and that seems to be working pretty well. Kudos to anyone who's been making bank swing trading Tesla though and good luck to those who believe in the company long term. I wish I could, but I just don't trust them.",
        "created_utc": 1674047229.0,
        "subreddit_name": "stocks",
        "comments": 608
    },
    {
        "title": "Apple introduces the new HomePod with breakthrough sound and intelligence",
        "score": 5326,
        "url": "https://www.apple.com/newsroom/2023/01/apple-introduces-the-new-homepod-with-breakthrough-sound-and-intelligence/",
        "content": "",
        "created_utc": 1674050599.0,
        "subreddit_name": "apple",
        "comments": 1792
    }
]