[
    {
        "title": "Charlie Munger died today at age 99 - Berkshire",
        "score": 1385,
        "url": "https://www.reddit.com/r/investing/comments/1866vkt/charlie_munger_died_today_at_age_99_berkshire/",
        "content": "Omaha, NE (BRK.A; BRK.B) – November 28, 2023\n\nBerkshire Hathaway a few minutes ago was advised by members of Charlie Munger’s family that he peacefully died this morning at a California hospital.\n\nWarren Buffett, CEO of Berkshire Hathaway, wishes to say: “Berkshire Hathaway could not have been built to its present status without Charlie’s inspiration, wisdom and participation.”\n\nThe family will handle all affairs pursuant to Charlie’s instructions.\n\nhttps://www.berkshirehathaway.com/news/nov2823.pdf",
        "created_utc": 1701205951.0,
        "subreddit_name": "investing",
        "comments": 207
    },
    {
        "title": "Charlie Munger, investing genius and Warren Buffett’s right-hand man, dies at age 99",
        "score": 5135,
        "url": "https://www.reddit.com/r/stocks/comments/1866nwx/charlie_munger_investing_genius_and_warren/",
        "content": "Billionaire Charlie Munger, the investing sage who made a fortune even before he became Warren Buffett’s right-hand man at Berkshire Hathaway, has died at age 99.\r  \n\r  \nMunger died Tuesday, according to a press release from Berkshire Hathaway.\r  \n\r  \nIn addition to being Berkshire \rvice chairman, Munger was a real estate attorney, chairman and publisher of the Daily Journal Corp., a member of the Costco board, a philanthropist and an architect.\r  \n\r  \nIn early 2023, his fortune was estimated at $2.3 billion — a jaw-dropping amount for many people but vastly smaller than Buffett’s unfathomable fortune, which is estimated at more than $100 billion.\r  \n\r  \nDuring Berkshire’s 2021 annual shareholder meeting, the then-97-year-old Munger apparently inadvertently revealed a well-guarded secret: that Vice Chairman Greg Abel “will keep the culture” after the Buffett era.\r  \n\r  \nMunger, who wore thick glasses, had lost his left eye after complications from cataract surgery in 1980.\r  \n\r  \nMunger was chairman and CEO of Wesco Financial from 1984 to 2011, when Buffett’s Berkshire purchased the remaining shares of the Pasadena, California-based insurance and investment company it did not own.\r  \n\r  \nBuffett credited Munger with broadening his investment strategy from favoring troubled companies at low prices in hopes of getting a profit to focusing on higher-quality but underpriced companies.\r  \n\r  \nAn early example of the shift was illustrated in 1972 by Munger’s ability to persuade Buffett to sign off on Berkshire’s purchase of See’s Candies for $25 million even though the California candy maker had annual pretax earnings of only about $4 million. It has since produced more than $2 billion in sales for Berkshire.\r  \n\r  \n“He weaned me away from the idea of buying very so-so companies at very cheap prices, knowing that there was some small profit in it, and looking for some really wonderful businesses that we could buy in fair prices,” Buffett told CNBC in May 2016.\r  \n\r  \nOr as Munger put it at the 1998 Berkshire shareholder meeting: “It’s not that much fun to buy a business where you really hope this sucker liquidates before it goes broke.”\r  \n\r  \nMunger was often the straight man to Buffett’s jovial commentaries. “I have nothing to add,” he would say after one of Buffett’s loquacious responses to questions at Berkshire annual meetings in Omaha, Nebraska. But like his friend and colleague, Munger was a font of wisdom in investing, and in life. And like one of his heroes, Benjamin Franklin, Munger’s insight didn’t lack humor.\r  \n\r  \n“I have a friend who says the first rule of fishing is to fish where the fish are. The second rule of fishing is to never forget the first rule. We’ve gotten good at fishing where the fish are,” the then-93-year-old Munger told the thousands of people at Berkshire’s 2017 meeting.\r  \n\r  \nHe believed in what he called the “lollapalooza effect,” in which a confluence of factors merged to drive investment psychology.\n\nRead More Here:\n\n[https://www.cnbc.com/2023/11/28/charlie-munger-investing-sage-and-warren-buffetts-confidant-dies.html](https://www.cnbc.com/2023/11/28/charlie-munger-investing-sage-and-warren-buffetts-confidant-dies.html)\n\n&#x200B;\n\n&#x200B;",
        "created_utc": 1701205453.0,
        "subreddit_name": "stocks",
        "comments": 295
    },
    {
        "title": "Apple Pulls Plug on Goldman Credit-Card Partnership",
        "score": 3074,
        "url": "https://www.wsj.com/finance/banking/apple-pulls-plug-on-goldman-credit-card-partnership-ca1dfb45",
        "content": "",
        "created_utc": 1701212153.0,
        "subreddit_name": "apple",
        "comments": 725
    },
    {
        "title": "Apple Music’s Replay is Out",
        "score": 669,
        "url": "https://replay.music.apple.com/",
        "content": "I wasn’t really that impressed with mine to be honest..",
        "created_utc": 1701198758.0,
        "subreddit_name": "apple",
        "comments": 230
    }
]