[
    {
        "title": "Costco misses holiday-quarter revenue expectations despite online growth",
        "score": 358,
        "url": "https://www.reddit.com/r/stocks/comments/1b9c9ta/costco_misses_holidayquarter_revenue_expectations/",
        "content": "Costco on Thursday missed Wall Street’s revenue expectations for its holiday quarter, despite reporting year-over-year sales growth and strong e-commerce gains.\n\nShares of the retailer fell about 4% in aftermarket trading. The retailer’s stock had hit a 52-week high earlier in the day.\n\nHere’s what the retailer reported for its fiscal second quarter of 2024 compared with what Wall Street was expecting, based on a survey of analysts by LSEG, formerly known as Refinitiv:\n\nEarnings per share: $3.92 vs. $3.62 expected\n\nRevenue: $58.44 billion vs. $59.16 billion expected\n\nIn the three-month period that ended Feb. 18, Costco’s net income rose to $1.74 billion, or $3.92 per share, compared to $1.47 billion, or $3.30 per share, a year earlier.\n\nCostco’s revenue for the quarter increased from $55.27 billion in the year-ago period.\n\nComparable sales for the company increased 5.6% year over year and 4.3% in the U.S. Excluding changes in gas prices and foreign currency, the metric increased 5.8% overall and 4.8% in the U.S.\n\nSales of food and sundries, a category that includes snack foods and beverages, were up by mid single-digits in the quarter, CFO Richard Galanti said on the company’s earnings call. Fresh foods were up high single-digits and non-foods were up mid single-digits.\n\nAncillary businesses, which includes more service-related purchases like travel, were up by low single-digits, he said. Costco’s food court, pharmacy and optical centers were top performers in the quarter and gas was down low single-digits as the price per gallon fell.\n\nMore shoppers came to Costco, and they spent more on their shopping trips during the quarter. Traffic increased 5.3% across the globe and 4.3% in the U.S., Galanti said on the earnings call. Average ticket increased in the U.S. and worldwide, he said.\n\nInflation was roughly flat year over year in the quarter, which allowed the retailer to reduce prices for some items, Galanti said. For example, he said, it’s been able to cut the price of reading glasses from $18.99 to $16.99 and slash the price of a 48-count of Kirkland Signature batteries from $17.99 to $15.99. In the prior quarter, he said inflation was as much as 1% year over year.\n\nGalanti said many new items in categories like sporting goods and lawn and garden will also have lower prices compared with a year ago because of falling freight and commodity costs.\n\nCostco has 875 warehouses, including 603 in the U.S. and Puerto Rico. It also has clubs in about a dozen other countries, including Canada, Mexico, Japan and China.\n\nIn the second quarter, Costco opened four new clubs, including three in the U.S. and one in Shenzhen, China. That marked its sixth club to open in China, Galanti said. Two of the three new U.S. locations were Costco Business Centers, which are specifically geared toward small business owners like restaurant operators.\n\nAs of Thursday’s close, Costco shares have risen nearly 19% since the start of the year. The stock touched a 52-week high of $787.08 earlier in the day and closed at $785.59, bringing the company’s market value to nearly $350 billion.\n\nDigital growth\n\nCostco has made changes to its website to improve the experience for online shoppers, Galanti said Thursday. It’s also tweaked its business to be more digitally savvy.\n\nE-commerce sales grew 18.4% in the quarter compared with the year earlier.\n\nFor example, Costco rolled out a new mobile app homepage in February, which loads in less than two seconds compared with eight seconds previously — a move he said was crucial since about 60% of its e-commerce business is done through its mobile app and mobile browser.\n\nIt rolled out Apple Pay last week to all members online. And it’s adding more merchandise to Costco Next, a seller platform that allows members to buy directly from some of the retailer’s suppliers at a discounted price. The marketplace carries a wide variety of items, including electronics, bicycles and apparel, he said.\n\nE-commerce sales have also gained momentum as Costco has gotten better in recent months at touting the value of its online merchandise, particularly for big-ticket items like appliances, mattresses and tires, he said.\n\nApp downloads were up 2.8 million in the quarter and and currently total about 33 million, Galanti said.\n\nMembership fees\n\nCostco has seen more membership sign-ups as the company has cracked down on membership sharing, Galanti said. During the pandemic, he said the warehouse club noticed more people using their mom or dad’s membership card and let it slide. Then, he said, the membership sharing grew because self-checkout became more common at clubs.\n\nNow, he said, Costco is requiring more checking of membership cards to make sure it matches the shopper.\n\n“Are we getting some new you signups from it? Absolutely,” he said. “Relative to the 60 or 70 million members it’s not terribly meaningful, but it’s more fair and the right thing to do.”\n\nYet he said member sharing at Costco wasn’t as large of a problem as Netflix, another company that cracked down. Compared with Netflix, he said, it was harder for Costco members to share because they still needed to have a person’s physical card when they walked in.\n\nInvestors have been waiting for Costco to raise its membership fees for more than a year. The company has typically increased its annual fee roughly every five and a half years. It last hiked fees in June 2017.\n\nBut Galanti said the company is not hiking the fee yet. Though he added, “It’s when, not if.”\n\nThe longtime CFO, who is retiring, has hosted all but one earnings call since Costco went public in 1985. He joked on Thursday’s call that the fee hike will be a task for his successor, Gary Millerchip, the former CFO of Kroger, after he takes over in mid-March.\n\n“I’ve been joking with Gary, it will be on his watch, not mine,” Galanti said.\n\nSource: https://www.cnbc.com/2024/03/07/costco-cost-q2-2024-earnings.html",
        "created_utc": 1709863974.0,
        "subreddit_name": "stocks",
        "comments": 117
    },
    {
        "title": "NVIDIA is now a $2.3 trillion company. On pace to pass APPLE within days",
        "score": 4491,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1b9cicu/nvidia_is_now_a_23_trillion_company_on_pace_to/",
        "content": "NVDA is $290B away from passing AAPL\n\nNVDA added $700B in \\~2 weeks\n\nThat's TSLA and BOEING's valuation COMBINED\n\nNVDA's $2.3 trillion market cap is now larger than the \\~30 other names in SOXX COMBINED (AMD + AVGO + QCOM + INTC + TSM, et al)\n\nIf NVDA continues to trade at 40 p/s, it will reach $3000+ by 2026\n\nNVDA has still not announced a stock split\n\nNVDA's biggest event of the year GTC 2024 is 10 days away\n\nDON'T BE A DUMBASS AND TRY TO SHORT NVDA BEFORE GTC AND STOCK SPLIT ANNOUNCEMENT",
        "created_utc": 1709864621.0,
        "subreddit_name": "wallstreetbets",
        "comments": 772
    }
]