[
    {
        "title": "Nvidia easily beats earnings expectations on strong gaming and data center sales",
        "score": 1775,
        "url": "https://www.reddit.com/r/stocks/comments/qw9gzs/nvidia_easily_beats_earnings_expectations_on/",
        "content": "**Revenue**: $7.1 billion versus $6.81 billion expected.\n\n**Earnings per share**: $1.17 versus $1.11 expected.\n\n**Gaming revenue**: $3.22 billion versus $3.18 billion expected.\n\n**Data Center revenue**: $2.94 billion versus $2.69 billion expected.\n\nThe company's stock was up more than 3% following the report.\n\n\"The third quarter was outstanding, with record revenue,” Nvidia CEO Jensen Huang said in a statement. “Demand for NVIDIA AI is surging, driven by hyperscale and cloud scale-out, and broadening adoption by more than 25,000 companies. NVIDIA RTX has reinvented computer graphics with ray tracing and AI, and is the ideal upgrade for the large, growing market of gamers and creators, as well as designers and professionals building home workstations.\"\n\nThe company also issued a bullish forecast for revenue in the current quarter ending in January.\n\nNvidia said it expects to report around $7.4 billion in the current quarter, ending in January, higher than analyst expectations of $6.86 billion.\n\nhttps://finance.yahoo.com/news/nvidia-q-3-earnings-2022-203256956.html\n\nhttps://www.cnbc.com/2021/11/17/nvidia-nvda-earnings-q3-2022.html (I took the guidance from here)",
        "created_utc": 1637184616.0,
        "subreddit_name": "stocks",
        "comments": 324
    },
    {
        "title": "Amazon to stop accepting Visa Credit Cards Issued in UK",
        "score": 1727,
        "url": "https://www.reddit.com/r/stocks/comments/qvyppt/amazon_to_stop_accepting_visa_credit_cards_issued/",
        "content": "Amazon (AMZN) is to cease accepting payments made by UK-issued Visa (V) credit cards from next year, it has been revealed.\n\nThe online retail giant blamed the decision on high fees charged by Visa to process transactions.\n\nThe changes will come into effect as early as 19 January 2022, Bloomberg first reported, citing information that Amazon had shared with its customers this week, after they had purchased items.\n\n$V down approx 3.25% in the pre-market.\n\nThoughts?",
        "created_utc": 1637153880.0,
        "subreddit_name": "stocks",
        "comments": 544
    },
    {
        "title": "Apple announces Self Service Repair",
        "score": 24653,
        "url": "https://www.apple.com/newsroom/2021/11/apple-announces-self-service-repair/",
        "content": "",
        "created_utc": 1637157753.0,
        "subreddit_name": "apple",
        "comments": 2206
    }
]