[
    {
        "title": "Apple wants me to pay $100 to continue publishing my (free) Safari extension (Reddit Enhancement Suite)",
        "score": 10096,
        "url": "https://www.reddit.com/r/apple/comments/397bn6/apple_wants_me_to_pay_100_to_continue_publishing/",
        "content": "**MEGA EDIT:** Please read before asking questions, as most things people asking me are repeats:\n\n**Q:** Can't you just distribute the extension yourself?\n\n**A:** I already do. However, it seems from Apple's email to all Safari extension developers that we must pay to continue supporting our extensions and providing updates. A couple of users have linked to articles that give confusing information about whether or not this is really the case. [here is one of them](http://www.cio.com/article/2933693/apple-now-charges-safari-extension-developers-for-distribution.html), which confusingly states that the developer of a popular extension will pay the fee \"to ensure that his extension will still be available for El Capitan users.\"\n\nFrom [another article](http://www.pcworld.com/article/2933692/apple-now-charges-safari-extension-developers-for-distribution.html), it seems that perhaps I could still \"release\" RES on my own without paying apple - but auto update functionality would go away. This is pretty much a dealbreaker for any browser extension that interacts with a website, as websites change somewhat often, and a developer definitely can't count on people to update their extensions manually.\n\nIf in fact this is all a result of a poorly worded email, then I will be thrilled that all Apple is \"guilty of\" here is doing a crappy job with the email they sent me. Here's the relevant text of Apple's email to me which leads me to believe I must pay the fee to continue giving people updates to RES:\n\n> You can continue building Safari extensions and bring your creativity to other Apple platforms by joining the Apple Developer Program. Join today to provide updates to your current extensions, build new extensions, and submit your extensions to the new Safari Extensions Gallery for OS X El Capitan.\n\n(joining the program is what costs $100 per year)\n\n---\n\n**Q:** It's to keep spammers out, idiot.\n\n**A:** That's not really a question. Also, there's no real evidence that that's why they're doing this. Furthermore, it's worth way more than $100 to get malware/spam installed into many users' browsers. $100 isn't much of a deterrent. I don't think that's really the reason. It seems the real reason is just that they've consolidated their 3 separate developer programs (iOS / OSX / Safari Extensions) for simplicity's sake, but not properly thought about how that might upset / affect people who were only interested in building Safari Extensions (which was previously free) and not the other two.\n\n---\n\n**Q:** You can't come up with $100? What are you poor or something?\n\n**A:** I'm far less concerned about my own ability to come up with $100 than I am about developers in general being shut out from the system over this. Not everyone has the user base that RES has.  \n\n---\n\n**Q:** But you get a lot of stuff for that $100 per year. What are you complaining about?\n\n**A:** Safari (on Desktop) is a browser with just 5% market share, and paying $100 just to build extensions for it doesn't seem wise, especially when people expect extensions to be free.  Apple announced Swift was open source, and then makes this move that I feel hurts open source developers.  Sure, the iOS SDK and Xcode are great, and probably worth $100 -- but only to people who are going to develop iOS or OSX applications. I'm not, so those have no value to me.\n\n---\n\n**Q:** Why do you think Apple is doing this? Do you really think they're trying to hurt extension devs?\n\n**A:** I honestly think they just didn't think about it too much. I think they made a business decision to consolidate their developer programs - one that generally makes sense - and it didn't occur to them that people who are *only* developing extensions might be upset about this.  That, or the articles above are correct and the email I got was just misleading / poorly written.\n\n---\n\n**Q:** If I give you $100 does this problem go away?\n\n**A:** My goal here, although I very much appreciate people's generous offers to help pay for it, is to raise awareness and hopefully get more open source developers to [**politely** provide feedback to Apple](https://developer.apple.com/contact/) that this policy is not OK.  Sure I could pay for it with donations you guys give me - but then other open source developers who haven't yet gained a following that will help pay are still walled out by this $100 fee.\n\nIf you're not a developer but still want to give *polite* feedback from the perspective of a user, [here's the general safari feedback page](https://www.apple.com/feedback/safari.html) \n\n\nThe original post:\n\n-----\n\nSo it used to be free to be a part of the Safari developer program. That's being folded into Apple's dev program now, and I'm required to pay $100 to join if I want to continue publishing Reddit Enhancement Suite - which is free.\n\n$100 would be several months worth of donations, on many/most months, and only to support less than 1% of RES users (as in, Safari makes somewhere around 1%).\n\nNot only is the cost an annoyance, I also don't feel Apple deserves $100 from me just so I can have the privilege of continuing to publish *free* software that enhances its browsers.  They're not providing a value add here (e.g. the iOS SDK, etc) that justifies charging us money.  \n\nTo be clear: RES isn't published on their extension gallery, so the $100 being allocated to their \"review process\" isn't really valid either. In addition, spammers / malicious extension developers have a lot more than $100 to gain from publishing scammy apps.  My Safari developer certificate is already linked / provided through my iTunes account ID (and therefore credit card etc), so it's not like the $100 gets them \"more confirmation\" that I am who I say I am.\n\nI don't know what I'm going to do yet, but worst case scenario I will try my best to get one more release out before the deadline screws me (and therefore you, if you use Safari/RES) over.",
        "created_utc": 1433879413.0,
        "subreddit_name": "apple",
        "comments": 1211
    }
]