[
    {
        "title": "Subjective views",
        "score": 6,
        "url": "https://www.reddit.com/r/AAPL/comments/n1fetf/subjective_views/",
        "content": "I’m bullish on Apple because eventually I’m hoping for new product categories that will be like the iPhone again (AR, car etc). Earnings are always great but expectations are so high now that they’re not even moving the needle. \n\nI like reading the optimism from the bulls but can anyone give me any counter arguments? I’d like to get both sides...\n\nI think it’s still a hold but I’m always interested in what others think...",
        "created_utc": 1619733656.0,
        "subreddit_name": "AAPL",
        "comments": 6
    },
    {
        "title": "Stop posting and sharing info for about ~60 days and this sub stop growing, still under 2k members...and WTF are some of these noobs talking about...",
        "score": 2,
        "url": "https://www.reddit.com/r/AAPL/comments/n0xjn4/stop_posting_and_sharing_info_for_about_60_days/",
        "content": "The bottom line is those players from 60-70 days ago who averaged down and accumulated up as much as they can with long shares are up from Ave.to six figure $. So what the fuck are some of these noob talking shit about aapl being weak. The only weak shit is your game strategy plays!",
        "created_utc": 1619673809.0,
        "subreddit_name": "AAPL",
        "comments": 3
    },
    {
        "title": "Do you think the global chip shortage will damage AAPL next quarter?",
        "score": 2,
        "url": "https://www.reddit.com/r/AAPL/comments/n0umub/do_you_think_the_global_chip_shortage_will_damage/",
        "content": "",
        "created_utc": 1619662537.0,
        "subreddit_name": "AAPL",
        "comments": 2
    },
    {
        "title": "If I had a load of cash I’d of been buying AAPL yesterday in quantity and selling at open today.....",
        "score": 1,
        "url": "https://www.reddit.com/r/AAPL/comments/n14moz/if_i_had_a_load_of_cash_id_of_been_buying_aapl/",
        "content": "......however I don’t and I’m long on all I can afford with Apple 🍏 Hopefully once the selling calms down a bit it should settle to a new and and slightly higher price! Think us longs deserve it 🤞",
        "created_utc": 1619703782.0,
        "subreddit_name": "AAPL",
        "comments": 14
    }
]