[
    {
        "title": "Reuters Exclusive: US ordered TSMC to halt shipments to China of chips used in AI applications",
        "score": 475,
        "url": "https://www.reddit.com/r/stocks/comments/1gnos5a/reuters_exclusive_us_ordered_tsmc_to_halt/",
        "content": "https://www.reuters.com/technology/us-ordered-tsmc-halt-shipments-china-chips-used-ai-applications-source-says-2024-11-10/\n\nNEW YORK/SINGAPORE, Nov 9 (Reuters) - The U.S. ordered Taiwan Semiconductor Manufacturing Co (2330.TW), to halt shipments of advanced chips to Chinese customers that are often used in artificial intelligence applications starting Monday, according to a person familiar with the matter.\n\nThe Department of Commerce sent a letter to TSMC imposing export restrictions on certain sophisticated chips, of 7 nanometer or more advanced designs, destined for China that power AI accelerator and graphics processing units (GPU), the person said.\n\nThe U.S. order, which is being reported for the first time, comes just weeks after TSMC notified the Commerce Department that one of its chips had been found in a Huawei AI processor, as Reuters reported last month. Tech research firm Tech Insights had taken apart the product, revealing the TSMC chip and apparent violation of export controls.\n\nHuawei, at the center of the U.S. action, is on a restricted trade list, which requires suppliers to obtain licenses to ship any goods or technology to the company. Any license that could aid Huawei's AI efforts would likely be denied.\n\nTSMC suspended shipments to China-based chip designer Sophgo after its chip matched the one found on the Huawei AI processor, sources told Reuters last month.\n\nReuters could not determine how the chip ended up on Huawei's Ascend 910B, released in 2022, viewed as the most advanced AI chip available from a Chinese company.\n\nThe latest clampdown hits many more companies and will allow the U.S. to assess whether other companies are diverting chips to Huawei for its AI processor.\n\nAs a result of the letter, TSMC notified affected clients that it was suspending shipments of chips starting Monday, the person said.\nThe Commerce Department declined comment.\n\nA spokesperson for TSMC also declined to comment beyond saying it was a \"law-abiding company...committed to complying with all applicable rules and regulations, including applicable export controls.\"\n\nThe Commerce Department communication -- known as an \"is informed\" letter -- allows the U.S. to bypass lengthy rule-writing processes to quickly impose new licensing requirements on specific companies.\n\nIjiwei, a Chinese media site covering the semiconductor industry, reported on Friday that TSMC notified Chinese chip design companies it would suspend 7 nanometer or below chips for AI and GPU customers beginning Nov. 11.\n\nThe action comes as both Republican and Democratic lawmakers have raised concerns about the inadequacy of export controls on China and the Commerce Department's enforcement of them.\n\nIn 2022, the Commerce Department sent is-informed letters to Nvidia and AMD restricting their ability to export top AI-related chips to China, and to chip equipment makers like Lam Research, Applied Materials and KLA to restrict tools to make advanced chips to China.\n\nThe restrictions in those letters were later turned into rules that apply to companies beyond them.\n\nThe U.S. has been delayed in updating rules on tech exports to China. As Reuters reported in July, the Biden administration drafted new rules on some foreign exports of chipmaking equipment and planned to add about 120 Chinese companies to the Commerce Department's restricted entity list, including chipmaking factories, toolmakers, and related companies.\n\nBut despite plans for an August release, and later tentative target dates for publication, the rules still have not been issued.",
        "created_utc": 1731200267.0,
        "subreddit_name": "stocks",
        "comments": 144
    },
    {
        "title": "Archer Aviation (ACHR) is going to explode this November!",
        "score": 1225,
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1go72sm/archer_aviation_achr_is_going_to_explode_this/",
        "content": "https://preview.redd.it/nn2l0w44940e1.png?width=491&format=png&auto=webp&s=c6f311d231e1d77d46013f0c2ad4f01bf105e70a\n\n[Source ](https://s202.q4cdn.com/174276461/files/doc_financials/2024/q3/Archer-Shareholder-Letter-Q324-FINAL.pdf)(p. 9)\n\nArcher is going to participate in different events in USA, Ireland and the UK during this November.\n\nSome additional catalysts I am waiting for:\n\n\\- [Palantir agreement](https://www.linkedin.com/posts/adam-goldstein-7b662121_had-an-inspiring-conversation-this-morning-activity-7191483218053718016-qOmP/?utm_source=share&utm_medium=member_android) (still unofficial, but they may announce something considering this picture).\n\nhttps://preview.redd.it/8r1pb6j7940e1.png?width=1536&format=png&auto=webp&s=1ff85bb000cf2f0002a33b66a08378e9e46dacad\n\n\\- Georgia facilities ready to start production in december.\n\nGreat opportunity to buy imo\n\nMy position:\n\nhttps://preview.redd.it/hdl9jpp5b40e1.png?width=1437&format=png&auto=webp&s=e941aca865f522f4cdfe5d2b4bcf40800be395a6\n\nBTW you really gonna like this Donald Trump words:\n\n>Another big opportunity is in transportation: dozens of major companies in the USA and China are racing to develop EVTOL vehicles for families and individuals. Just as the USA led the automotive revolution in the last century, I want to ensure that America, not China, leads this revolution in air movility.\n\n[Source ](https://www.youtube.com/watch?v=dJA_GBhCGgE)(min 01:38; video uploaded in 2023).",
        "created_utc": 1731262869.0,
        "subreddit_name": "wallstreetbets",
        "comments": 323
    },
    {
        "title": "Work has been slow so I jumped back into trading this week. Up 28k",
        "score": 791,
        "url": "https://www.reddit.com/gallery/1go7w2c",
        "content": "I gravitate towards momentum trading and scalping in the 20-50% range on trades. Nearly all my trades are with options 1 month to 6 months out, as i find that the added “breathing room” allows for better psychology when committing to a trade. Majority of gains came from SPY calls, RDDT Calls and shares, UPST Earnings Calls and Shares, and TSLA scalps. Completed 65 trades this week, 42 profitable, 23 losing money. ",
        "created_utc": 1731264956.0,
        "subreddit_name": "wallstreetbets",
        "comments": 173
    }
]