[
    {
        "title": "Apple hit with more than $1.95 billion EU antitrust fine over music streaming",
        "score": 1691,
        "url": "https://www.reddit.com/r/stocks/comments/1b6agqo/apple_hit_with_more_than_195_billion_eu_antitrust/",
        "content": "The European Commission, the European Union’s executive arm, on Monday hit Apple with a 1.8 billion euro ($1.95 billion) antitrust fine for abusing its dominant position on the market for the distribution of music streaming apps.\n\nThe Commission said it found that Apple had applied restrictions on app developers that prevented them from informing iOS users about alternative and cheaper music subscription services available outside of the app.\n\nApple also banned developers of music streaming apps from providing any instructions about how users could subscribe to these cheaper offers, the Commission alleged.\n\nThis is Apple’s first antitrust fine from Brussels and is among one of the biggest dished out to a technology company by the EU.\n\nThe European Commission opened an investigation into Apple after a complaint from Spotify in 2019. The probe was narrowed down to focus on contractual restrictions that Apple imposed on app developers which prevent them from informing iPhone and iPad users of alternative music subscription services at lower prices outside of the App Store.\n\nApple’s conduct lasted almost 10 years, according to the Commission, and “may have led many iOS users to pay significantly higher prices for music streaming subscriptions because of the high commission fee imposed by Apple on developers and passed on to consumers in the form of higher subscription prices for the same service on the Apple App Store.”\n\nApple response:\n\nIn a fiery response to the fine, Apple said Spotify would stand to gain the most from the EU pronouncement.\n\n“The primary advocate for this decision — and the biggest beneficiary — is Spotify, a company based in Stockholm, Sweden. Spotify has the largest music streaming app in the world, and has met with the European Commission more than 65 times during this investigation,” Apple said in a statement.\n\n“Today, Spotify has a 56 percent share of Europe’s music streaming market — more than double their closest competitor’s — and pays Apple nothing for the services that have helped make them one of the most recognisable brands in the world.”\n\nApple said that a “large part” of Spotify’s success is thanks to the Cupertino giant’s App Store, “along with all the tools and technology that Spotify uses to build, update, and share their app with Apple users around the world.”\n\nApple said that Spotify pays it nothing. That’s because instead of selling subscriptions in their iOS app, Spotify sell them via their own website stead. Apple does not collect a commission on those purchases.\n\nDevelopers over the years have spoken out against the 30% fee Apple charges on in-app purchases.\n\nSpotify did not immediately respond to a CNBC request for comment.\n\nThe fine will ramp up tensions between Big Tech and Brussels at a time when the EU is increasing scrutiny of these firms.\n\nLast year, the Commission designated Apple among other tech firms like Microsoft and Meta as “gatekeepers” under a landmark regulation called the Digital Markets Act, which broadly came into effect last year.\n\nThe term gatekeepers refers to massive internet platforms which the EU believes are restricting access to core platform services, such as online search, advertising, and messaging and communications.\n\nThe Digital Markets Act aims to clamp down on anti-competitive practices from tech players, and force them to open out some of their services to other competitors. Smaller internet firms and other businesses have complained about being hurt by these companies’ business practices.\n\nThese laws have already had an impact on Apple. The Cupertino, California-based giant announced plans this year to open up its iPhone and iPad to alternative app stores other than its own. Developers have long-complained about the 30% fee Apple charges on in-app purchases.\n\nSource: https://www.cnbc.com/2024/03/04/apple-hit-with-more-than-1point95-billion-eu-antitrust-fine-over-music-streaming.html",
        "created_utc": 1709557613.0,
        "subreddit_name": "stocks",
        "comments": 411
    },
    {
        "title": "Speculative Crap I'm Investing In So You Don't Have to",
        "score": 542,
        "url": "https://www.reddit.com/r/stocks/comments/1b6k1qh/speculative_crap_im_investing_in_so_you_dont_have/",
        "content": "Alright folks, mega caps and AI are all the rave but there's plenty of rather unknown companies which are growing their earning's at a tremendous rate. My portfolio in 2022 was Costco, Nvidia, Apple, Google and MSFT. They all did beautifully but they're too big for my liking now. Here's the speculative crap I'm investing in now\n\n**1. GigaCloud Technology** \\- Is like an Amazon or Alibaba but removes the consumer and does B2B ecommerce, no debt, strong cash flow, P/E ratio still reasonable for massive YoY growth. Already up a lot on this company and earning's coming up Q4 which expecting big beat.\n\n**2.** **Vita-Coco** \\- Everyone's all about Celsius or Monster, Coconut Water imo is the next best thing with a growing market, COCO, is the market leader. Summer's here, coming off winter lows and just had big beat in Q4 which normally worst quarter when its cold. Summer they partner with alcoholic brands and all the weight loss craze leads me to believe ppl are choosing healthy drink alternatives.\n\n**3. Braze** \\- Companies need a way to stay in touch with their customers, Braze creates a subscription model which handles all types of communication with customers and automates the process. This company is working its way towards becoming profitable. I was watching YT channel who interviews entrepreneurs, saw freelancer making $150k+ a year using the software to help companies so to me that's huge to see in the real world without even having looked for the company.\n\n**4. Draft Kings** \\- California and Texas still have not legalized online gambling which those two states alone are absolutely massive. Texas won't vote on it again until 2025, casino's in Oklahoma donate to Texan politicians to help influence keeping gambling out of the state but 2025 imo we see big changes. There's a huge catalyst here and earning's are growing with combat sports massively growing.\n\n**5.** **Sofi -** The numbers don't lie. When rate cuts were plausibly announced we saw a massive jump. This company wants to run when rate cuts come but until then ppl really weary even though the numbers and guidance are phenomenal.\n\n**6. Palantir** \\- S&P500 inclusion didn't come after 5 quarters now of GAAP profitability, so in June imo we'll see it happen which is a huge catalyst. The earning's are growing as a we all know. I don't like the P/E ratio but this is a company I'd buy and immediately sell CC's on and keep selling CC\"s until reaching my assigned price and repeating while holding long term.\n\nEveryone of these companies imo has strong growing earning's, relatively unknown still compared to what everyone's piling into, and most have major catalysts coming up. COCO has summer, DK has legalization of massive states, Sofi has pending rate cuts, Palantir has sp500 inclusion, at least Braze and Giga about to report and beat as they do Q4 which should act as minor catalysts imo.",
        "created_utc": 1709581223.0,
        "subreddit_name": "stocks",
        "comments": 127
    },
    {
        "title": "EU fines Apple €1.8bn over App Store restrictions on music streaming",
        "score": 13780,
        "url": "https://www.theguardian.com/business/2024/mar/04/eu-fines-apple-18bn-over-app-store-restrictions-on-music-streaming",
        "content": "",
        "created_utc": 1709554446.0,
        "subreddit_name": "worldnews",
        "comments": 939
    },
    {
        "title": "Apple unveils the new 13- and 15-inch MacBook Air with the powerful M3 chip",
        "score": 3124,
        "url": "https://www.apple.com/newsroom/2024/03/apple-unveils-the-new-13-and-15-inch-macbook-air-with-the-powerful-m3-chip/",
        "content": "",
        "created_utc": 1709557293.0,
        "subreddit_name": "apple",
        "comments": 1183
    },
    {
        "title": "EU hits Apple with €1.8 million antitrust fine",
        "score": 861,
        "url": "https://www.dw.com/en/just-in-eu-hits-apple-with-18-billion-antitrust-fine-over-handling-of-music-streaming-rivals/a-68433801?",
        "content": "",
        "created_utc": 1709554910.0,
        "subreddit_name": "apple",
        "comments": 719
    },
    {
        "title": "M3 MacBook Pro will gain multi-display support in software update",
        "score": 856,
        "url": "https://9to5mac.com/2024/03/04/14-inch-m3-macbook-pro-multi-display-support/",
        "content": "",
        "created_utc": 1709575983.0,
        "subreddit_name": "apple",
        "comments": 205
    },
    {
        "title": "Apple unveils the new 13- and 15-inch MacBook Air with the powerful M3 chip",
        "score": 9,
        "url": "https://www.stocktitan.net/news/AAPL/apple-unveils-the-new-13-and-15-inch-mac-book-air-with-the-powerful-c46j8u915b6f.html",
        "content": "",
        "created_utc": 1709557216.0,
        "subreddit_name": "AAPL",
        "comments": 0
    }
]