[
    {
        "title": "I build the Apollo Reddit app and I'm donating 100% of today's proceeds to our local SPCA animal shelter. It's kitten season and the hardest time of the year for shelters for food and supplies, so your help would be absolutely AMAZING in helping the kitties and puppies out there! 🐶🐱",
        "score": 8841,
        "url": "https://www.reddit.com/r/apple/comments/cfmlca/i_build_the_apollo_reddit_app_and_im_donating_100/",
        "content": "Hey! My name's Christian, I build that [Apollo Reddit app](https://itunes.apple.com/app/id979274575) that y'all have been so kind toward. Long story short I used to work at Apple and wanted to build a free alternative to the official app with a focus on really feeling like an iOS-first app (more details further down if you're curious).\n\nA lot of people aren't aware but these warm months are ROUGH for shelters. They're when cats give birth in the greatest numbers, and it puts a massive strain on animal shelters to keep up with the influx of kitties, it's even named [kitten season](https://spca.bc.ca/news/kitten-season/). Shelters become flooded with abandoned, injured, or orphaned kitties, and their resources are really really strained.\n\nOur local shelter here in Nova Scotia is a no-kill shelter and seriously does amazing work with our local cats and dogs, I adopted my two cats Hugo and Ruby from them ([who sleep on my desk while I code haha](https://i.imgur.com/pSNPOGU.jpg)) and it's seriously run by the nicest people who care so much about the animals.\n\nSo yeah, **to try to help some today 100% of Apollo's proceeds (every penny I make) will be donated to the local SPCA animal shelter**. Apollo's free to download with a Pro version that adds some extra features, as well as an Ultra version that adds a few more, so if you unlock those today it'll be completely going to the animals and you get a little treat as a thank you for being awesome!\n\nYou might remember we did the same thing a year ago [and raised $5,000 for the SPCA](https://www.reddit.com/r/apple/comments/95ezsl/so_apollo_made_508723_yesterday_yeah_no_joke_just/). I really want to try to hit $10,000 this time, I really think we can do it! They were so stoked last year to find out of the blue and are working closer with me this year now, and even sent me a very cute bunch of photos of [some of the animals that were adopted this year](https://imgur.com/a/hwF5TmE).\n\nToday's my birthday so I couldn't think of a better time. :P\n\n### So I just buy one of the in-app purchases and it goes right to the charity?\n\nYep! Simple. :P\n\n### What if I already bought Apollo in the past?\n\nYou're awesome! There's a \"Tip Jar\" in the Settings tab of the app you can add to, 100% of that will go to the shelter as well. :D Or check out the next section…\n\n### Can I donate to the cause outside of the app or if I don't have an iOS device?\n\nAbsolutely! You can send money directly to the PayPal address tipjar@apolloapp.io and 100% will also go to the shelter and it'll add to the tally. You can also donate [directly to the shelter too](https://46189.thankyou4caring.org/sslpage.aspx?pid=298)! \n\nThat crypto wizard currency stuff works too! You can send Bitcoin to 1LamDwEtMYzeMF8F4evLVshgL6UaM1mU7e, or Ethereum to 0x53FDee21dCA9555Cd6d28089c8eA7E118d7189B6, or Nano xrb_1j7ppgbx47bbyk1ohbuy9nqghreo8pct8z1gcghyqj7kz7tmz9xnugjntx9k or Litecoin LQgNag4cmGTbedXQvahpi6eQydpSjgBWv6 and Monero 44vXYmhwn87MHQBa5hEiM3gP5gyCEk2dt2ciM7fGKoGFQRFyBt4oXWUNWSGMv7tDnQM4WbjALu54JR6oz7jrE5Qd4bymUNo. If there's any other kind of wizard money you want to donate just say so and I'll figure it out!\n\n### Why? What's the point of Apollo when there's the official app?\n\nI worked at Apple for a little while and was using Alien Blue, and really wanted to build a Reddit app that felt like if Apple themselves decided to build a Reddit app, something that felt perfectly at home on iOS. No knock on the official app (it's well done by talented people), but it doesn't follow a lot of the iOS design guidelines and feels a little Android-y to me at times. It's kinda like a car, you might be perfectly happy with yours and wonder what's the point of another car, but you might drive in another car and just find it more fun and comfortable to use. On top of this Apollo has some really slick custom gestures, a Jump Bar for quickly bouncing between subreddits, color-coded comments for easy navigation, a really powerful media viewer and it was voted the best Reddit app for iOS by [The Sweet Setup](https://thesweetsetup.com/apps/the-best-reddit-app-for-ios/).\n\nPlus it's a great cause so check it out even if you're not interested. :P\n\n#### When will we know the total money we raised?\n\nTomorrow I'll post the total we raised as well as a proof of it being sent [just like last year](https://www.reddit.com/r/apple/comments/95ezsl/so_apollo_made_508723_yesterday_yeah_no_joke_just/) and we can rejoice in how much of a difference we made. Apple sends out the previous day's report the following morning. \n\n### Anything else?\n\nuhhhh… I'll donate an extra $0.10 for every comment on this thread by tomorrow. no spam tho plz\n\n### I have other questions! \n\nHappy to answer them!! I'll be sticking around all day today so ask away! Thank you so much in advance! 🐶🐱🐰\n\nIf you have fuzzy friends of your own please post em\n\n\\- Christian",
        "created_utc": 1563634070.0,
        "subreddit_name": "apple",
        "comments": 849
    }
]