[
    {
        "title": "Apple brand loyalty hits all-time high as Samsung loyalty dives",
        "score": 13118,
        "url": "https://9to5mac.com/2021/03/16/apple-brand-loyalty/",
        "content": "",
        "created_utc": 1615906201.0,
        "subreddit_name": "apple",
        "comments": 2443
    },
    {
        "title": "Morning Update for Tuesday, 03/16/21",
        "score": 383,
        "url": "https://www.reddit.com/r/Daytrading/comments/m68b26/morning_update_for_tuesday_031621/",
        "content": "Good morning everyone, happy Tuesday :)\n\n*This list is geared towards day trading. With the small cap stocks especially, I am typically in and out very quickly, only occasionally longer than 5 minutes, usually faster scalps.* I am also constantly watching the candlestick charts and observing price action and volume, and you should be doing the same if you want to trade these stocks. Always have a plan when you enter a trade (for profit taking and for taking a loss), and use proper risk management.\n\n**Stocks Over $10**\n\n* Gapping UP: ANVS, KMPH, FTCV, FUTU, BEKE, GRWG, CCIV\n* Gapping DOWN: MARA, RIOT, CAN, GME, AMC, CLSK, FCEL\n\n**Stocks Under $10**\n\n1. CANF: Leading gapper this morning but couldn't find a catalyst for today. Seeing strong volume and price action in the premarket. Just be cautious and don't chase trades, as this could get a bit extended. \n2. SVRA: Gapping up after closing public offering yesterday, as well as a price target upgrade. Seeing decent volume and okay price action in the premarket. Seems to have found premarket support at 2.14.\n3. WIMI: Gapping up on a couple different news catalysts. I'll want to see volume pick up a bit more. \n4. AZRX: Gapping up on momentum from yesterday, as well as a news catalyst. Seeing decent volume in premarket, but I'll want to see it pick up a bit.\n5. ENZ: Gapping up after earnings/guidance. Price action showing some weakness at the moment, I'll want it to show some strength. \n6. XNET: Gapping up after reporting earnings. Seeing some weakness in price action at the moment, so I'll want to see this trend reverse.\n\nStocks are looking at a mixed open, but green overall. SPY is trading just below 397, and we could see a further push to new ATH. I'll be watching UVXY to play any volatility we may see. After seeing a bigger pullback yesterday, Bitcoin is currently trading at 54,900. Bitcoin-related stocks are down in premarket, and I'll be following them throughout the day. Tech stocks are doing well in premarket, and should see strength during the day if the market doesn't roll over. There weren't a whole lot of opportunities on the small caps watchlist yesterday. **Don't feel the need to force trades**. There will always be another opportunity. There is nothing wrong with sitting back and watching, and maybe running your stock screener again in 10 minutes or so. We need to be disciplined in our trading, and trading off your emotions is not disciplined.\n\nRemember to use proper risk management, make sure you size appropriately for your account, and have a plan for every trade you enter. Happy trading everyone :)",
        "created_utc": 1615898962.0,
        "subreddit_name": "Daytrading",
        "comments": 71
    },
    {
        "title": "Finally, we're mooning. $AAPL showing it's POWER (as always). Get rdy",
        "score": 40,
        "url": "https://i.redd.it/0d98cmgf0en61.jpg",
        "content": "",
        "created_utc": 1615899270.0,
        "subreddit_name": "AAPL",
        "comments": 17
    }
]