[
    {
        "title": "The case for Intel from a former bear",
        "score": 246,
        "url": "https://www.reddit.com/r/stocks/comments/1e1w8a8/the_case_for_intel_from_a_former_bear/",
        "content": "Disclaimer: I am long from $35 a share; this is my view on $INTC.\n\nI know r/stocks sees a lot of Intel posts, but none of the ones I've seen really describe the Intel story or, frankly, misunderstand the semiconductor industry entirely.\n\nA little background: I was an Intel bear from 2018 to 2024. The reason to have been bearish on the worst semiconductor stock over the past 10 years has been pretty obvious. Intel messed up their manufacturing; they had a 2-3 year lead over TSMC on node technology for over 20 years. But a series of mistakes, 10nm (now Intel 7), and messed-up 7nm (now Intel 4) led to a huge gap with their fabless competition. This allowed Nvidia and AMD, who design chips using software (Cadence and Synopsys) that follow design IP rules set by TSMC, to produce and package the chips.\n\nIntel turned a lead into a 2-year gap. The previous CEO, in 2020, bought TSMC capacity at 3nm to hedge the possibility that Intel would fail again and to allow their products to be more competitive until the foundry side caught up.\n\nThis has led to where we are today. Intel Foundry has low utilization due to outsourcing for next year and is producing uneconomic products, leading to a cash burn. While Intel products for the past 4 years have sold uncompetitive chips.\n\nBut investing is about the future; you are buying today and not the past. So what is coming that will change the story?\n\nLet's deal with the product side of the business first. Right now, the vast majority of Intel products are uncompetitive, which leads to lower volume and lower ASPs. That is changing come the end of this year. Intel products will have Lunar Lake (TSMC 3nm) ultra-low power mobile CPU, and Arrow Lake (TSMC 3nm) desktop and mobile CPU. By all accounts, these products will be extremely competitive and are actually on a superior node to AMD (TSMC 4nm). As the volume of these products ramps up in Q4, Intel ASPs and volume will slowly rise.\n\nIntel also has data center CPUs coming into volume this year: Sierra Forest and Granite Rapids using the Intel 3 node. These products close the gap with AMD in the data center but do not surpass them.\nNext year, Intel products will have Panther Lake (Intel 18A) low-power mobile CPU and Clearwater Forest (Intel 18A) Data Center CPU, which should jump ahead of AMD. There's also a data center GPU, Falcon Shores, but there’s little information on it, so I'm not going to speculate.\n\nSome of you might be asking how I compare TSMC 3nm, Intel 3, Intel 18A, etc. To keep it simple, Intel uses PPA (power, performance, and area) to name its nodes in comparison to TSMC. In general, you should think of nodes as having two factors: density and PPA. TSMC has a comfortable density lead, which helps generally in lower power, and higher PPA is generally better for HPC chips (CPUs). Intel 3 has been documented to have a lower density than TSMC 3nm but a similar PPA. Intel intends to catch up with density on Intel 18A next year to TSMC 3nm and have a lead with PPA vs TSMC 2nm/3nm node.\n\nNow to Intel Foundry's business. Intel Foundry is losing money due to the vast majority of their production being uncompetitive nodes and having much lower volume than in the past since Intel is outsourcing some production to TSMC. Sometime next year, Intel Foundry will begin to see a shift to Intel 18A. This comes with a 3x higher selling price per wafer vs. current nodes. Incremental volume will return to Intel Foundry as Intel shifts back to Intel Foundry from TSMC. Just as Intel products will slowly start to see rising ASPs at the end of this year, you can expect Intel Foundry to slowly climb out of the hole. Each quarter next year, as Intel 18A ramps up will lead to lower losses. Intel also wants external customers and has some booked, with Microsoft being the largest single customer. Intel Foundry is competing against TSMC, whose similar node to 18A is their 2nm. TSMC 2nm will ramp up at the end of 2025 and won’t have real products until sometime in 2026. This gives Intel a nice window to demonstrate to potential customers that 18A is competitive and has good yields. For a follow-on node of 14A using ASML High NA. Intel does not expect to be #1 Foundry by volume, nor do they have to be with its current valuation.\n\nUltimately the biggest downside is Intel messes up 18A. Then I would sell, and buy $AMD. I think over the next 3 years. Intel can be north of $100 a share. The semiconductor industry operates with a large lag, Intel's current results are being driven by decisions made in early 2021. There is a lot more I could write about, but I don't want this to be too long. Let me know in comments, if you are interested.",
        "created_utc": 1720827934.0,
        "subreddit_name": "stocks",
        "comments": 149
    },
    {
        "title": "Apple beats lawsuit over forcing developers to use its closed ecosystem",
        "score": 960,
        "url": "https://appleinsider.com/articles/24/07/12/apple-beats-lawsuit-over-forcing-developers-to-use-its-closed-ecosystem",
        "content": "",
        "created_utc": 1720802442.0,
        "subreddit_name": "apple",
        "comments": 661
    }
]